{
  "id": "aa-2020",
  "type": "statute",
  "title": "Apostille Act 2020",
  "title_en": "Apostille Act 2020",
  "short_name": "AA2020",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/AA2020",
  "description": "An Act to give effect to the Hague Convention Abolishing the Requirement of Legalisation for Foreign Public Documents, done at the Hague on 5 October 1961, and for connected purposes.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Apostille Act 2020."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Convention” means the Hague Convention Abolishing the Requirement of Legalisation for Foreign Public Documents, done at the Hague on 5 October 1961, the English text of which is set out in the First Schedule; “Convention State” means a State Party to the Convention other than Singapore, but does not include — ( a ) any State Party that objected to Singapore’s accession to the Convention; and ( b ) any State Party whose accession to the Convention Singapore objected to; “Model Certificate” means the model certificate set out in the Annex to the Convention."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Purpose",
      "content": "3. —(1) The purpose of this Act is to give effect to the Convention. (2) Part 2 — ( a ) exempts foreign public documents (as defined in that Part) from any requirement of legalisation; and ( b ) provides for the effect of certificates issued under the Convention and facilitates (but does not require) their use. (3) Part 3 provides for certificates to be issued under the Convention for Singapore public documents (as defined in that Part)."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "4",
      "title": "Act binds Government",
      "content": "4. This Act binds the Government."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "5",
      "title": "Application of this Part",
      "content": "5. This Part applies to a foreign public document sought to be produced in Singapore for any purpose, including — ( a ) the purposes of proceedings in any court or tribunal; and ( b ) the purposes of exercising any power or right, or performing any function, duty or obligation, under or pursuant to any written law or rule of law."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "6",
      "title": "What is a foreign public document",
      "content": "6. In this Part, “foreign public document” — ( a ) means — (i) a document executed in the territory of a Convention State and falling within any of the following categories: (A) a document emanating from an authority or official connected with the courts or tribunals of that State, including a document emanating from a public prosecutor, a clerk of a court or a process‑server; (B) an administrative document; (C) a notarial act; (D) an official certificate that is placed on a document signed by a person in his or her private capacity (for example, an official certificate recording the registration of a document or the fact that the document was in existence on a certain date, or an official or a notarial authentication of a signature); or (ii) a document (including a document that is not signed, sealed or stamped) that — (A) emanates from a Convention State; and (B) is treated as a public document by the law of that State; but ( b ) does not include a document executed by a diplomatic or consular agent."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "7",
      "title": "What is meant by the origin of a foreign public document",
      "content": "7. In this Part, a reference to the origin of a foreign public document, or of a document purporting to be a foreign public document, is a reference to the following aspects of the document: ( a ) the authenticity of the signature on the document; ( b ) the capacity in which the person signing the document has acted; ( c ) where appropriate, the identity of the seal or stamp that the document bears."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "8",
      "title": "What is legalisation of a foreign public document",
      "content": "8. In this Part, “legalisation”, in relation to a foreign public document, means the formality by which the diplomatic or consular agents of Singapore certify the origin of a foreign public document."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "9",
      "title": "Legalisation not required for foreign public documents",
      "content": "9. —(1) Legalisation is not required, and may not be performed, in relation to a foreign public document. (2) This section applies despite any written law or rule of law to the contrary."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "10",
      "title": "What is a Convention certificate (also known as an apostille)",
      "content": "10. In this Part, “Convention certificate”, in relation to a foreign public document or a document purporting to be a foreign public document, means a certificate issued — ( a ) to certify the document for the purposes of the Convention; and ( b ) by an authority that, at the time of issuing the certificate, is designated by the State in which territory the document was executed, or from which the document emanates, as competent to issue the certificate in respect of the document."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "11",
      "title": "Effect of Convention certificate if used",
      "content": "11. —(1) This section applies if a document purporting to be a Convention certificate (called in this section the purported certificate) is placed on or attached to a document purporting to be a foreign public document (called in this section the certified document). (2) Subject to subsection (3), the origin of the certified document is presumed to be sufficiently proven. (3) Subsection (2) does not apply — ( a ) if the contrary is proven; ( b ) if it is proven that the certified document is not in fact a foreign public document; ( c ) if it is proven that the purported certificate is not in fact a Convention certificate in relation to the certified document; or ( d ) if, and to the extent that, it is proven that — (i) the purported certificate suffers from any of the following defects: (A) the certificate is not in, or substantially in, the form of the Model Certificate; (B) any information required by the Model Certificate is omitted (unless the omitted information is not applicable to the certified document); (C) the purported certificate has been damaged, tampered with or modified; (D) the purported certificate is no longer placed on or attached to the certified document; and (ii) the defect affects the authenticity or reliability of the purported certificate in relation to the certified document."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "12",
      "title": "Use of Convention certificate generally not mandatory",
      "content": "12. —(1) Subject to subsection (2), a person seeking to prove the origin of a foreign public document — ( a ) is not required to do so by means of a Convention certificate; and ( b ) is not required to comply with any more rigorous formality. (2) A person seeking to prove the origin of a specified foreign public document — ( a ) may be required to do so by means of a Convention certificate; but ( b ) is not required to comply with any more rigorous formality. (3) This section applies despite any written law or rule of law to the contrary. (4) In this section — “more rigorous formality” means a formality that is more rigorous than placing a Convention certificate on, or attaching a Convention certificate to, a foreign public document; “specified foreign public document” means a foreign public document falling within any of the following classes: ( a ) any class of documents for which legalisation is or may be required by or under any written law or any practice before the date of Singapore’s accession to the Convention; ( b ) any class of documents that did not exist before the date of Singapore’s accession to the Convention."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 2 - PROOF OF ORIGIN OF",
      "section": "13",
      "title": "Other modes of proof, etc., not affected",
      "content": "13. Nothing in this Part prevents a foreign public document (or any aspect thereof) from being proven, produced, certified or accepted in any manner permitted by any other law."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - CERTIFICATION OF",
      "section": "14",
      "title": "What is a Singapore public document",
      "content": "14. In this Part, “Singapore public document” — ( a ) means — (i) a document executed in Singapore and falling within any of the following categories: (A) a document emanating from an authority or official connected with the courts or tribunals of Singapore, including a document emanating from a public prosecutor, a clerk of a court or a process‑server; (B) an administrative document; (C) a notarial act; (D) an official certificate that is placed on a document signed by a person in his or her private capacity (for example, an official certificate recording the registration of a document or the fact that the document was in existence on a certain date, or an official or a notarial authentication of a signature); or (ii) a document (including a document that is not signed, sealed or stamped) that is prescribed to be a Singapore public document; but ( b ) does not include any of the following documents: (i) a document executed by a diplomatic or consular agent; (ii) a prescribed private document."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - CERTIFICATION OF",
      "section": "15",
      "title": "What is a competent authority",
      "content": "15. In this Part, an authority specified in the first column of the Second Schedule is a competent authority in relation to the Singapore public documents specified opposite the authority in the second column of that Schedule."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - CERTIFICATION OF",
      "section": "16",
      "title": "Certification of public document executed in Singapore",
      "content": "16. —(1) Subject to section 17, a competent authority must issue a certificate for a Singapore public document on the request of — ( a ) the person who signed the document; or ( b ) any bearer of the document. (2) The certificate must be — ( a ) numbered and dated in the prescribed manner; ( b ) in the form of the Model Certificate, subject to any prescribed modifications; and ( c ) placed on, or attached to, the Singapore public document or a copy thereof in the prescribed manner. (3) Regulations may provide for a certificate to be issued in electronic form, whether or not the underlying public document is also in electronic form."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - CERTIFICATION OF",
      "section": "17",
      "title": "Grounds for refusing to issue certificate",
      "content": "17. —(1) An authority must refuse to issue a certificate for a document under section 16 if any of the following grounds apply: ( a ) the document is not a Singapore public document; ( b ) there are reasonable grounds for the authority to believe that the document is forged or falsified; ( c ) the authority is not competent to issue the certificate; ( d ) the person requesting for the certificate fails to provide any prescribed information or any other information required by the authority; ( e ) the prescribed fee is not paid; ( f ) any prescribed ground. (2) A competent authority may refuse to issue a certificate for a public document if any of the following grounds apply: ( a ) the authority is unable to verify the authenticity of the signature, seal or stamp on the document; ( b ) any prescribed ground."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - CERTIFICATION OF",
      "section": "18",
      "title": "Register of certificates",
      "content": "18. —(1) A competent authority must keep a register of every certificate it issues. (2) The register must be kept in the prescribed manner and must record, in respect of each certificate — ( a ) the number and date of the certificate; ( b ) the name of the person who signed the certified Singapore public document and the capacity in which he or she acted; ( c ) if applicable, the name of the authority that affixed the seal or stamp on the certified Singapore public document; and ( d ) any other information that may be prescribed. (3) Regulations must provide for the means by which a person may verify the authenticity of a document purporting to be a certificate issued by a competent authority. (4) Regulations may provide for a joint register to be kept by 2 or more competent authorities."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "19",
      "title": "Amendment of Second Schedule",
      "content": "19. —(1) The Minister may, by order in the Gazette , amend the Second Schedule. (2) Without limiting subsection (1), an order under that subsection may specify, in the second column of the Second Schedule — ( a ) all or a specified class of Singapore public documents opposite an authority in the first column; and ( b ) the same class of Singapore public documents opposite 2 or more authorities in the first column."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "20",
      "title": "Regulations",
      "content": "20. The Minister may make regulations — ( a ) to prescribe any matter required or permitted to be prescribed under Part 3; ( b ) to prescribe any fees for the purposes of Part 3; and ( c ) generally for the purposes of this Act."
    }
  ],
  "definitions": [
    {
      "term": "Convention",
      "definition": "“Convention” means the Hague Convention Abolishing the Requirement of Legalisation for Foreign Public Documents, done at the Hague on 5 October 1961, the English text of which is set out in the First Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Convention State",
      "definition": "“Convention State” means a State Party to the Convention other than Singapore, but does not include — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Model Certificate",
      "definition": "“Model Certificate” means the model certificate set out in the Annex to the Convention.",
      "source_provision": "s2"
    },
    {
      "term": "more rigorous formality",
      "definition": "“more rigorous formality” means a formality that is more rigorous than placing a Convention certificate on, or attaching a Convention certificate to, a foreign public document;",
      "source_provision": "s12"
    },
    {
      "term": "specified foreign public document",
      "definition": "“specified foreign public document” means a foreign public document falling within any of the following classes: ( a )",
      "source_provision": "s12"
    }
  ]
}