{
  "id": "aoa-1973",
  "type": "statute",
  "title": "Arms Offences Act 1973",
  "title_en": "Arms Offences Act 1973",
  "short_name": "AOA1973",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/AOA1973",
  "description": "An Act relating to the unlawful possession of guns and ammunition and the carrying and using of guns. [Act 3 of 2021 wef 01/07/2025]",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Arms Offences Act 1973."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — [ Deleted by Act 3 of 2021 wef 01/07/2025 ] [ Deleted by Act 3 of 2021 wef 01/07/2025 ] “carry”, in relation to a gun, includes to have on or about an individual’s person; [Act 3 of 2021 wef 01/07/2025] “gun” has the meaning given by section 3 of the Guns, Explosives and Weapons Control Act 2021, and excludes an imitation gun; [Act 3 of 2021 wef 01/072025] “imitation gun” means an object that, regardless of its colour, weight or composition or the presence or absence of any moveable part, substantially duplicates in appearance a gun but that is not a gun, or any such object that is produced and identified as a toy; [Act 3 of 2021 wef 01/07/2025] “import” means to bring or cause to be brought into Singapore by any means from any place; “scheduled offence” means any offence specified in the Schedule; [ Deleted by Act 3 of 2021 wef 01/07/2025 ] “trafficking in guns” means to import, supply or transfer 2 or more guns (whether or not of the same kind) in contravention of the Guns, Explosives and Weapons Control Act 2021, or any Act, repealed by that Act intending to — ( a ) injure, or endanger the safety of, another person; ( b ) cause reasonable fear of the infliction of injury to another person; or ( c ) destroy or damage any property; [Act 3 of 2021 wef 01/07/2025] “unlawful possession”, in relation to a gun, means possession of a gun when — ( a ) not authorised by a licence or a class licence under the Guns, Explosives and Weapons Control Act 2021; ( b ) not in accordance with the conditions of a licence or a class licence mentioned in paragraph ( a ); and ( c ) not exempt from the Guns, Explosives and Weapons Control Act 2021 with respect to possession of that gun; [Act 3 of 2021 wef 01/07/2025] “use”, means — ( a ) to fire the gun; or [Act 3 of 2021 wef 01/07/2025] ( b ) to hold the gun so as to cause a reasonable belief that it will be fired, whether or not it is capable of being fired. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Unlawful possession of gun with criminal intent",
      "content": "3. —(1) A person commits an offence if — ( a ) the person carries a gun intending to — (i) injure, or endanger the safety of, another person; (ii) cause reasonable fear of the infliction of injury to another person; (iii) destroy or damage any property; or (iv) facilitate another person to injure, or endanger the safety of, another person, cause reasonable fear of the infliction of injury to another person, or destroy or damage any property, using the gun; and ( b ) the person is then in unlawful possession of the gun. (2) A person who is guilty of an offence under subsection (1) shall on conviction be punished with imprisonment for a term of not less than 5 years and not more than 10 years and shall also be punished with caning with not less than 6 strokes. (3) However, where a person who is convicted of an offence under subsection (1) is proved to have been previously convicted of a scheduled offence, the person shall on conviction be punished with imprisonment for a term of not less than 5 years and not more than 20 years and shall also be punished with caning with not less than 6 strokes. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s3A",
      "section": "3A",
      "title": "Aggravating circumstances for scheduled offence",
      "content": "3A. Where a person is convicted of a scheduled offence, the person shall be punished with imprisonment for life and shall also be punished with caning with not less than 6 strokes if the person, at the time of his committing or at the time of his apprehension for the scheduled offence — ( a ) is carrying any gun; and ( b ) is in unlawful possession of the gun. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Using or attempting to use guns",
      "content": "4. —(1) Subject to any exception mentioned in Chapter 4 of the Penal Code 1871 which may be applicable (other than section 95), any person who uses or attempts to use any gun intending to injure, or endanger the safety of, another person, to cause reasonable fear of the infliction of injury or to destroy or damage any property shall be guilty of an offence and shall on conviction be punished with death. [Act 3 of 2021 wef 01/07/2025] (2) In any proceedings for an offence under this section, any person who uses or attempts to use any gun shall, until the contrary is proved, be presumed to have used or attempted to use the gun intending to injure, or endanger the safety of, another person, to cause reasonable fear of the infliction of injury or to destroy or damage any property. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s4A",
      "section": "4A",
      "title": "Using or attempting to use guns to commit scheduled offence",
      "content": "4A. Subject to any exception mentioned in Chapter 4 of the Penal Code 1871 which may be applicable (other than section 95), any person who uses or attempts to use any gun at the time of his or her committing or attempting to commit any scheduled offence shall, whether or not the person has any intention to cause physical injury to any individual or property, be guilty of an offence and shall on conviction be punished with death. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Punishment for accomplices",
      "content": "5. Where any gun is used by any person in committing or in attempting to commit any offence or where an offence under section 4A has been committed by any person, each of the person’s accomplices present at the scene of the offence who may reasonably be presumed to have known that the person was carrying or had in the person’s possession or under the person’s control the gun, shall, unless the accomplice proves that he or she had taken all reasonable steps to prevent the use of the gun, be guilty of an offence and shall on conviction be punished with death. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Trafficking in guns",
      "content": "6. —(1) Any person trafficking in guns shall be guilty of an offence and shall on conviction be punished with — ( a ) death; or ( b ) imprisonment for life and with caning with not less than 6 strokes. [Act 3 of 2021 wef 01/07/2025] (2) [ Deleted by Act 3 of 2021 wef 01/07/2025 ] [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Consorting with person carrying guns",
      "content": "7. Any person who consorts with, or is found in the company of, another person who is unlawfully carrying or is in unlawful possession of any gun in circumstances which raise a reasonable presumption that he or she knew that that other person was carrying or had in his or her possession or under his or her control any such gun shall, unless he or she proves that he or she had reasonable grounds for believing that that other person was not unlawfully carrying or was not in unlawful possession of the gun, be guilty of an offence and shall be liable on conviction to the like punishment as that other person with whom he or she was consorting or in whose company he or she was found. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Penalty for exhibiting imitation gun when committing scheduled offence",
      "content": "8. Any person who at the time of committing or attempting to commit or abetting the commission of any scheduled offence exhibits any imitation gun in a manner likely to put any other person in fear of death or hurt shall be guilty of an offence and shall be liable on conviction to imprisonment for a term which may extend to 10 years and shall also be punished with caning with not less than 3 strokes. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Presumption",
      "content": "9. Where any gun is found in or on any premises, the occupier of the premises is deemed to be in possession of the gun unless the occupier proves that some other person was in possession thereof, or the occupier had no knowledge or reasonable means of knowing that the gun was in or on the premises and that the occupier had taken all reasonable precautions against the gun being kept in or on the premises. [Act 3 of 2021 wef 01/07/2025] 10. [ Repealed by Act 3 of 2021 wef 01/07/2025 ]"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Saving of other written law",
      "content": "11. The provisions of this Act have effect without affecting the provisions of the Guns, Explosives and Weapons Control Act 2021 or of any other written law for the time being in force in Singapore relating to unlawful possession of guns or ammunition. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Power to amend Schedule",
      "content": "12. The Minister may at any time by order add to, amend or vary the Schedule."
    }
  ],
  "definitions": [
    {
      "term": "carry",
      "definition": "“carry” , in relation to a gun, includes to have on or about an individual’s person; [Act 3 of 2021 wef 01/07/2025]",
      "source_provision": "s2"
    },
    {
      "term": "gun",
      "definition": "“gun” has the meaning given by section 3 of the Guns, Explosives and Weapons Control Act 2021, and excludes an imitation gun; [Act 3 of 2021 wef 01/072025]",
      "source_provision": "s2"
    },
    {
      "term": "imitation gun",
      "definition": "“imitation gun” means an object that, regardless of its colour, weight or composition or the presence or absence of any moveable part, substantially duplicates in appearance a gun but that is not a gun, or any such object that is produced and identified as a toy; [Act 3 of 2021 wef 01/07/2025]",
      "source_provision": "s2"
    },
    {
      "term": "import",
      "definition": "“import” means to bring or cause to be brought into Singapore by any means from any place;",
      "source_provision": "s2"
    },
    {
      "term": "scheduled offence",
      "definition": "“scheduled offence” means any offence specified in the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "trafficking in guns",
      "definition": "“trafficking in guns” means to import, supply or transfer 2 or more guns (whether or not of the same kind) in contravention of the Guns, Explosives and Weapons Control Act 2021, or any Act, repealed by that Act intending to — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "unlawful possession",
      "definition": "“unlawful possession” , in relation to a gun, means possession of a gun when — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "use",
      "definition": "“use” , means — ( a )",
      "source_provision": "s2"
    }
  ]
}