{
  "id": "bwaa-1966",
  "type": "statute",
  "title": "Bretton Woods Agreements Act 1966",
  "title_en": "Bretton Woods Agreements Act 1966",
  "short_name": "BWAA1966",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/BWAA1966",
  "description": "An Act to enable Singapore to become a member of the International Monetary Fund and of the International Bank for Reconstruction and Development by acceptance of the International Agreements for the establishment and operation of the Fund and the Bank.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Bretton Woods Agreements Act 1966."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Authorisation of signature of Articles of Agreements of Fund and Bank respectively",
      "content": "2. The President is hereby authorised by instruments under his hand to empower such person as may be named in such instruments, on behalf of the Government — ( a ) to sign the Articles of Agreement of the International Monetary Fund and the Articles of Agreement of the International Bank for Reconstruction and Development respectively; and ( b ) to deposit with the Government of the United States of America instruments of acceptance of the Articles of Agreement of the Fund and of the Articles of Agreement of the Bank (referred to in this Act as the Bank Agreement), setting out that the Government of Singapore has accepted in accordance with its law the respective Articles and the terms and conditions prescribed thereunder as the terms upon which the Government of Singapore shall be admitted to membership of the Fund and of the Bank."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Interpretation",
      "content": "3. In this Act — “Fund” means the International Monetary Fund established under the Fund Agreement; “Fund Agreement” means the Articles of Agreement of the International Monetary Fund as originally adopted and as subsequently amended — ( a ) pursuant to Resolution No. 23-5 adopted by the Board of Governors of the Fund on 31 May 1968 in order to institute a facility based on special drawing rights; and ( b ) pursuant to Resolution No. 31-4 adopted by the Board of Governors of the Fund on 30 April 1976 in order to establish a reformed international monetary system; “Fund arrangement” means — ( a ) the credit arrangements provided pursuant to Decision No. 11428‑(97/6), dated 27 January 1997, of the Executive Board of the Fund, as subsequently amended and renewed by the decisions of the Executive Board of the Fund; or ( b ) any arrangement established by the Fund under section 1 of Article VII of the Fund Agreement; “Fund program” means — ( a ) the Poverty Reduction and Growth Trust established pursuant to Decision No. 8759‑(87/176), dated 18 December 1987, of the Executive Board of the Fund and as subsequently amended and renewed by the decisions of the Executive Board of the Fund; or ( b ) any program administered by the Fund in accordance with section 2 of Article V of the Fund Agreement; “Monetary Authority of Singapore” means the Monetary Authority of Singapore established under section 3 of the Monetary Authority of Singapore Act 1970. [18/2016]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Subscription to International Monetary Fund",
      "content": "4. —(1) It shall be the function of the Monetary Authority of Singapore to pay to the Fund the subscription payable on account of Singapore specified in the terms and conditions set out in the First Schedule and to include in the Authority’s own account the payments of the subscription to the Fund already made by the Government. (2) The Monetary Authority of Singapore may, with the approval of the Minister for Finance, accept on behalf of the Government any increase in the subscription of Singapore to the Fund in consequence of an increase in the quota of Singapore, and make payment of such part of the increase as may, under section 3 of Article III of the Fund Agreement, be payable in special drawing rights or in the currency of Singapore or in any other currency specified by the Fund. (3) The Monetary Authority of Singapore is hereby authorised to create and issue to the Fund in such form as is appropriate any such non-interest bearing and non-negotiable notes or other obligations as the Fund may, under section 4 of Article III of the Fund Agreement, determine to accept in place of any part of the subscription of Singapore which would, but for such acceptance, be payable in the currency of Singapore."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Power of Monetary Authority of Singapore in respect of special drawing rights",
      "content": "5. —(1) The Monetary Authority of Singapore shall have power from time to time to acquire, hold and deal with special drawing rights of the Government in accordance with the Fund Agreement and to perform all acts supplemental or incidental thereto, including — ( a ) the payment of any charges payable to the Fund under section 2 of Article XX of the Fund Agreement and any sums payable to the Fund under section 4 of that Article; ( b ) the receipt of the interest payable by the Fund in respect of special drawing rights under section 1 of the said Article XX; and ( c ) the discharge of any other obligations as a participant in the Special Drawing Rights Department maintained by the Fund. [18/2016] (2) In addition, the Monetary Authority of Singapore may buy, sell or otherwise deal with the special drawing rights of the Government to enable Singapore to carry out its obligations under any Fund arrangement or Fund program. [18/2016] [Act 20 of 2023 wef 11/12/2023]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Power of Monetary Authority of Singapore in relation to operations of General Resources Account of Fund",
      "content": "6. The Monetary Authority of Singapore is hereby authorised — ( a ) to take steps to ensure that the balances of the currency of Singapore purchased from the Fund by a member of the Fund can be exchanged at the time of purchase, by that member, for a freely usable currency selected by Singapore, in accordance with section 3 of Article V of the Fund Agreement; ( b ) to take steps to ensure that any member of the Fund repurchasing its own currency from the Fund can obtain the currency of Singapore (if the currency of Singapore is specified by the Fund for repurchase) at the time of repurchase in exchange for a freely usable currency selected by Singapore in accordance with section 7 of Article V of the Fund Agreement; ( c ) to make payment of any charges payable to the Fund under section 8 of Article V of the Fund Agreement or any other sums payable to the Fund; and ( d ) to receive any remuneration payable by the Fund under section 9 of Article V of the Fund Agreement or any other sums payable by the Fund."
    },
    {
      "provision_ref": "s6A",
      "section": "6A",
      "title": "Assistance in support of Fund arrangements or Fund programs",
      "content": "6A. —(1) Subject to subsections (2), (3) and (4), the Monetary Authority of Singapore may, on behalf of the Government, enter into an agreement (whether multilateral or bilateral) to lend, or give grants or other financial assistance, to support a Fund arrangement or Fund program. [18/2016] (2) An agreement under subsection (1) to lend, or give grants or other financial assistance, may be entered into (or varied subsequently) only if — ( a ) the Fund requests Singapore to provide assistance in support of a Fund arrangement or Fund program for the benefit of one or more countries; ( b ) the Monetary Authority of Singapore is satisfied that at least one other government has provided, or intends to provide, financial assistance in response to a similar request from the Fund; ( c ) the Minister has published in the Gazette a statement containing — (i) a description of the nature of the agreement (or its subsequent variation); and (ii) the maximum amount that the Monetary Authority of Singapore agrees to lend, or to give by way of grants or other financial assistance, to the Fund under the agreement (or its subsequent variation); and ( d ) in the case of grants, Parliament has, by a resolution, fixed the maximum amount of grants to be given by the Monetary Authority of Singapore under that agreement (or its subsequent variations). [18/2016] (3) It is not lawful for the Monetary Authority of Singapore to give any amount of grant under any agreement under subsection (1) (or its subsequent variations) that is in excess of the maximum amount fixed by Parliament by resolution under subsection (2)( d ) for that agreement. [18/2016] (3A) Subsections (2) and (3) do not apply to an agreement to finance the operations and the carrying out of the functions of an office of the Fund in Singapore. [Act 20 of 2023 wef 11/12/2023] (4) An agreement under subsection (1) to lend or give other financial assistance (even if subsequently varied) must provide for the Monetary Authority of Singapore to require early repayment or early recovery of moneys lent or given, as the case may be, in the event of the suspension, or premature termination, of the Fund arrangement or Fund program. [18/2016] (5) Subsection (4) does not apply if — ( a ) the agreement is in a standard form provided by the Fund, which cannot be unilaterally amended by the Monetary Authority of Singapore; or ( b ) the Fund arrangement or Fund program cannot be suspended or prematurely terminated. [Act 20 of 2023 wef 11/12/2023]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Subscription to International Bank for Reconstruction and Development",
      "content": "7. —(1) There shall be charged on the Consolidated Fund such part of the subscription of Singapore specified in paragraph 2 of the terms and conditions set out in the Second Schedule as may, in accordance with those terms and conditions and the provisions of Article II of the Bank Agreement, be payable in gold or United States dollars or in the currency of Singapore. (2) There shall be charged on the Consolidated Fund such part of any increase in the subscription of Singapore as may, in accordance with the provisions of Article II of the Bank Agreement, be payable in gold or United States dollars or in the currency of Singapore. (3) Except with the approval signified by resolution of Parliament, the subscription of Singapore shall not be increased so that it (including any increases) exceeds the sum of US$40 million. (4) The Minister for Finance with the President’s concurrence under Article 144(1)( b ) of the Constitution may create and issue to the International Bank for Reconstruction and Development such non-interest-bearing and non-negotiable notes or other obligations as the Bank may, under section 12 of Article V of the Bank Agreement, determine to accept in place of the currency of Singapore."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Other payments to International Bank",
      "content": "8. There shall be charged on the Consolidated Fund — ( a ) all sums payable to the International Bank for Reconstruction and Development under section 9 of Article II of the Bank Agreement (which relates to changes in the par of foreign exchange value of currencies of members); and ( b ) all sums required for the redemption of any notes or obligations created and issued to that Bank under this Act."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Power to raise loans",
      "content": "9. For the purpose of providing any sums required for making any payments under the Fund Agreement, Bank Agreement, or the membership resolutions set out in the First and Second Schedules, the Minister with the President’s concurrence under Article 144(1)( b ) of the Constitution may, on behalf of the Government, raise loans by the creation and issue of securities bearing such rates of interest and subject to such conditions as to repayment, redemption or otherwise as he may think fit and the principal and interest of such securities and the charges and expenses incurred in connection with their issue shall be charged on and paid out of the Consolidated Fund."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Moneys received by Government to be paid into Consolidated Fund",
      "content": "10. Any moneys received by the Government from the Bank in connection with the membership of Singapore shall be paid into and form part of the Consolidated Fund."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Orders for carrying Agreements into effect",
      "content": "11. —(1) The President may, by order, make such provision as he may consider reasonably necessary for carrying into effect any of the provisions of the Fund Agreement and the Bank Agreement including but not limited to those relating to the status, immunities and privileges of the International Monetary Fund and of the International Bank for Reconstruction and Development and their respective governors, executive directors, alternates, officers and employees, and the provisions of the Fund Agreement with regard to the unenforceability of exchange contracts. (2) Without prejudice to the generality of subsection (1), any order made under that subsection may declare that any specified provisions of the Fund Agreement or the Bank Agreement shall have the force of law in Singapore."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Companies Act 1967 not to apply to Bank and to issue by Bank of shares, debentures, etc.",
      "content": "12. The International Bank for Reconstruction and Development shall be deemed not to be a corporation within the meaning of the Companies Act 1967; and the provisions of that Act shall not, accordingly, apply to the Bank or to the issue by the Bank of any shares, debentures, bonds, notes or other securities."
    }
  ],
  "definitions": [
    {
      "term": "Fund",
      "definition": "“Fund” means the International Monetary Fund established under the Fund Agreement;",
      "source_provision": "s3"
    },
    {
      "term": "Fund Agreement",
      "definition": "“Fund Agreement” means the Articles of Agreement of the International Monetary Fund as originally adopted and as subsequently amended — ( a )",
      "source_provision": "s3"
    },
    {
      "term": "Fund arrangement",
      "definition": "“Fund arrangement” means — ( a )",
      "source_provision": "s3"
    },
    {
      "term": "Fund program",
      "definition": "“Fund program” means — ( a )",
      "source_provision": "s3"
    },
    {
      "term": "Monetary Authority of Singapore",
      "definition": "“Monetary Authority of Singapore” means the Monetary Authority of Singapore established under section 3 of the Monetary Authority of Singapore Act 1970. [18/2016]",
      "source_provision": "s3"
    }
  ]
}