{
  "id": "caa-1988",
  "type": "statute",
  "title": "Carriage by Air Act 1988",
  "title_en": "Carriage by Air Act 1988",
  "short_name": "CAA1988",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CAA1988",
  "description": "An Act to give effect to the provisions of the Warsaw Convention concerning international carriage by air and the Convention as amended by the Hague Protocol and the Montreal Protocol No. 4 and for purposes connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Carriage by Air Act 1988."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “court”, in an arbitration allowed by the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention, includes an arbitrator; “Hague Protocol” means the Protocol to amend the Warsaw Convention opened for signature at the Hague on 28 September 1955; “Montreal Protocol No. 4” means Protocol No. 4 to amend the Warsaw (Hague) Convention opened for signature at Montreal on 25 September 1975; “Warsaw Convention” means the original Convention for the unification of certain rules relating to international carriage by air opened for signature at Warsaw on 12 October 1929, the text of which is set out in the Second Schedule; “Warsaw (Hague) Convention” means the Warsaw Convention as amended by the Hague Protocol, the text of which is set out in the First Schedule; “Warsaw (Hague) (Montreal) Convention” means the Warsaw (Hague) Convention as amended by the Montreal Protocol No. 4, the text of which is set out in the Third Schedule."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Conventions to have force of law",
      "content": "3. —(1) Subject to this Act, the provisions of the Warsaw Convention, the Warsaw (Hague) Convention and the Warsaw (Hague) (Montreal) Convention, so far as they relate to the rights and liabilities of carriers, carriers’ employees and agents, passengers, consignors, consignees and other persons, have the force of law in Singapore in relation to any carriage by air to which the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention (as the case may require) applies irrespective of the nationality of the aircraft performing that carriage. (2) If there is any inconsistency between any of the texts set out in the First, Second and Third Schedules and the authentic text in the French language of the Warsaw Convention, or the Hague Protocol or the Montreal Protocol No. 4 (as the case may be), the authentic French text prevails."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "High Contracting Parties",
      "content": "4. —(1) For the purposes of this Act — ( a ) a High Contracting Party to the Warsaw Convention is a country that has ratified or acceded to that Convention; ( b ) a High Contracting Party to the Warsaw (Hague) Convention is a country that has ratified or acceded to that Convention; and ( c ) a High Contracting Party to the Warsaw (Hague) (Montreal) Convention is a country that has ratified or acceded to that Convention, except that this Act applies to any such High Contracting Party — ( d ) only in relation to the territories in respect of which it is a party to the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention, as the case may be; and ( e ) to the extent that it has availed itself of the provisions of the Additional Protocol at the end of the Warsaw Convention, the Warsaw (Hague) Convention and the Warsaw (Hague) (Montreal) Convention, as the case may be. [41/2007] (2) Article 40A(2) in the First and Third Schedules is not to be read as extending references in those Schedules to the territory of a High Contracting Party (except such as are references to the territory of any State, whether a High Contracting Party or not) to include any territory in respect of which that High Contracting Party is not a party. [41/2007]"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Fatal accidents",
      "content": "5. References in section 20 of the Civil Law Act 1909 to a wrongful act, neglect or default include references to any occurrence which gives rise to liability under Article 17 in the First, Second and Third Schedules."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Limitations of liability",
      "content": "6. —(1) It is declared that the limitations on liability in Article 22 in the First, Second and Third Schedules apply whatever the nature of the proceedings by which liability may be enforced and that, in particular the limitation for each passenger in Article 22(1) in the First, Second and Third Schedules applies to the aggregate liability of the carrier in all proceedings which may be brought against him under the law of Singapore, together with any proceedings brought against him outside Singapore. (2) A court before which proceedings are brought to enforce a liability which is limited by Article 22 in the First, Second or Third Schedule may at any stage of the proceedings make any such order as appears to the court to be just and equitable in view of the provisions of that Article, and of any other proceedings which have been, or are likely to be, started in Singapore or elsewhere to enforce the liability in whole or in part. (3) Without affecting subsection (2), a court before which proceedings are brought to enforce a liability which is limited by Article 22 in the First, Second or Third Schedule, where the liability is, or may be, partly enforceable in other proceedings in Singapore or elsewhere, has jurisdiction — ( a ) to award an amount less than the court would have awarded if the limitation applied solely to the proceedings before the court; or ( b ) to make any part of its award conditional on the result of any other proceedings. (4) The Minister may, by order in the Gazette , from time to time specify the respective amounts which, for the purposes of Article 22 in the First, Second and Third Schedules, are to be taken as equivalent to the sums expressed in francs or Special Drawing Rights (as the case may be) which are mentioned in that Article. (5) References in this section to Article 22 in the First and Third Schedules, subject to any necessary modifications, include references to that Article as applied by Article 25A in the First and Third Schedules respectively."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Notice of partial loss",
      "content": "7. In Article 26(2) in the First, Second and Third Schedules — ( a ) references to damage are to be construed as including loss of part of the baggage or cargo in question; and ( b ) references to the receipt of baggage or cargo, in relation to loss of part of it, are to be construed as receipt of the remainder of it."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Time for bringing proceedings",
      "content": "8. —(1) No action against a carrier’s employee or agent which arises out of damage to which the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention relates is, if the employee or agent was acting within the scope of his or her employment, to be brought after more than 2 years, reckoned from the date of arrival at the destination or from the date on which the aircraft ought to have arrived, or from the date on which the carriage stopped. (2) Article 29 in the First, Second and Third Schedules is not to be read as applying to any proceedings for contribution between persons liable for any damage to which the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention relates. (3) Subject to sections 4 and 29 of the Limitation Act 1959, no action may be brought by a person, liable for any damage to which the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention relates, to recover contribution from any other person in respect of the damage after the expiration of 2 years from the time when a court gives judgment or makes an award against the person seeking to recover the contribution. (4) Subsections (1), (2) and (3) and Article 29 in the First, Second and Third Schedules have effect as if references in those provisions to an action included references to an arbitration."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Contributory negligence",
      "content": "9. It is declared that, for the purposes of Article 21 in the First, Second and Third Schedules, the provisions of the Contributory Negligence and Personal Injuries Act 1953 are provisions of the law of Singapore under which a court may exonerate the carrier wholly or partly from any liability of the carrier."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Power to exclude aircraft in use for military purposes",
      "content": "10. —(1) The Minister may, by order in the Gazette , direct that this section applies, or ceases to apply, to Singapore or any other State specified in the order. (2) The Warsaw (Hague) Convention and the Warsaw (Hague) (Montreal) Convention do not apply to the carriage of persons, cargo and baggage for the military authorities of a State to which this section applies in aircraft registered in that State if the whole capacity of the aircraft has been reserved by or on behalf of those authorities."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Actions against High Contracting Parties",
      "content": "11. —(1) Every High Contracting Party to the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention that has not availed itself of the provisions of the Additional Protocol at the end of the First, Second or Third Schedule is, for the purposes of any action brought in a court in Singapore in accordance with Article 28 in the First, Second or Third Schedule to enforce a claim in respect of carriage undertaken by the High Contracting Party, deemed to have submitted to the jurisdiction of that court, and accordingly the Rules of Court may provide for the manner in which any action is to be commenced and carried on. (2) Nothing in this section authorises the issue of an enforcement order against the property of any High Contracting Party. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Application to carriage by air not governed by Warsaw (Hague) Convention and Warsaw (Hague) (Montreal) Convention",
      "content": "12. The Minister may make regulations applying the provisions of the First and Third Schedules and any provision of this Act to such carriage by air, not being international carriage as defined in the First and Third Schedules, as may be specified in the regulations, subject to such exceptions, adaptations and modifications, if any, as may be specified."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Application to Government",
      "content": "13. This Act binds the Government."
    }
  ],
  "definitions": [
    {
      "term": "court",
      "definition": "“court” , in an arbitration allowed by the Warsaw Convention, the Warsaw (Hague) Convention or the Warsaw (Hague) (Montreal) Convention, includes an arbitrator;",
      "source_provision": "s2"
    },
    {
      "term": "Hague Protocol",
      "definition": "“Hague Protocol” means the Protocol to amend the Warsaw Convention opened for signature at the Hague on 28 September 1955;",
      "source_provision": "s2"
    },
    {
      "term": "Montreal Protocol No. 4",
      "definition": "“Montreal Protocol No. 4” means Protocol No. 4 to amend the Warsaw (Hague) Convention opened for signature at Montreal on 25 September 1975;",
      "source_provision": "s2"
    },
    {
      "term": "Warsaw Convention",
      "definition": "“Warsaw Convention” means the original Convention for the unification of certain rules relating to international carriage by air opened for signature at Warsaw on 12 October 1929, the text of which is set out in the Second Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Warsaw (Hague) Convention",
      "definition": "“Warsaw (Hague) Convention” means the Warsaw Convention as amended by the Hague Protocol, the text of which is set out in the First Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Warsaw (Hague) (Montreal) Convention",
      "definition": "“Warsaw (Hague) (Montreal) Convention” means the Warsaw (Hague) Convention as amended by the Montreal Protocol No. 4, the text of which is set out in the Third Schedule.",
      "source_provision": "s2"
    }
  ]
}