{
  "id": "camc1999a-2007",
  "type": "statute",
  "title": "Carriage by Air (Montreal Convention, 1999) Act 2007",
  "title_en": "Carriage by Air (Montreal Convention, 1999) Act 2007",
  "short_name": "CAMC1999A2007",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CAMC1999A2007",
  "description": "An Act to give effect to the provisions of the Montreal Convention, 1999 concerning international carriage by air and for purposes connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Carriage by Air (Montreal Convention, 1999) Act 2007."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Convention” means the Convention for the unification of certain rules relating to international carriage by air opened for signature at Montreal on 28 May 1999, the text of which is set out in the Schedule; “court”, in relation to any arbitration proceedings allowed by Article 34 of the Convention, means the arbitrator or arbitration tribunal hearing the arbitration; “regulations” means regulations made under section 13."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Convention to have force of law",
      "content": "3. —(1) Despite any other written law or rule of law but subject to this Act, the provisions of the Convention, so far as they relate to the rights and liabilities of carriers, carriers’ servants and agents, passengers, consignors, consignees and other persons, have the force of law in Singapore in relation to any carriage by air to which the Convention applies regardless of the nationality of the aircraft performing that carriage. (2) Subsection (1) does not affect rights or liabilities arising out of an occurrence before 16 November 2007."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "State Parties to Convention",
      "content": "4. —(1) For the purposes of this Act, a State Party to the Convention refers to any country that has ratified, accepted, approved or acceded to the Convention in accordance with Article 53 of the Convention. (2) This Act applies to any such State Party to the Convention only in respect of such of its territorial units as it has, by a declaration made under Article 56 of the Convention, declared to be a territorial unit to which the Convention is to apply."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Liability for fatal accidents under Article 17 of Convention",
      "content": "5. References in section 20 of the Civil Law Act 1909 to a wrongful act, neglect or default include references to any occurrence which gives rise to liability under Article 17 of the Convention."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Limitations of liability under Article 22 of Convention",
      "content": "6. —(1) The limitations on liability under Article 22 of the Convention apply whatever the nature of the proceedings by which liability may be enforced. (2) The limitation for each passenger under paragraph 1 of Article 22 of the Convention applies to the aggregate liability of the carrier in all proceedings which may be brought against the carrier under the law of Singapore, together with any proceedings brought against the carrier outside Singapore. (3) A court before which proceedings are brought to enforce a liability which is limited by Article 22 of the Convention may at any stage of the proceedings make any such order as appears to the court to be just and equitable in view of — ( a ) the provisions of that Article; and ( b ) any other proceedings which have been, or are likely to be, commenced in Singapore or elsewhere to enforce the liability in whole or in part. (4) Without affecting subsection (3), a court before which proceedings are brought to enforce a liability which is limited by Article 22 of the Convention has, where the liability is, or may be, partly enforceable in other proceedings in Singapore or elsewhere, jurisdiction — ( a ) to award an amount less than what the court would have awarded if the limitation applied solely to the proceedings before the court; or ( b ) to make any part of its award conditional on the result of any other proceedings."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Power to amend Schedule arising from review of limits of liability under Article 24 of Convention",
      "content": "7. Where any limit of liability prescribed by Article 21, 22 or 23 of the Convention has been revised under Article 24 of the Convention, the Minister may, by order in the Gazette , amend the Schedule to append thereto, immediately after the text of the Convention, an addendum specifying how the limit of liability has been revised and the date on which the revision is to take effect."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Notice of partial loss under Article 31 of Convention",
      "content": "8. In paragraph 2 of Article 31 of the Convention — ( a ) the references to damage are to be construed as including loss of part of the baggage or cargo in question; and ( b ) the references to the receipt of baggage or cargo are, in relation to loss of part of it, to be construed as receipt of the remainder of it."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Time for bringing proceedings",
      "content": "9. —(1) An action against a carrier’s servant or agent which arises out of damage to which the Convention relates must not, if the servant or agent was acting within the scope of the servant’s or agent’s employment, be brought after more than 2 years, reckoned from — ( a ) the date of arrival at the destination; ( b ) the date on which the aircraft ought to have arrived at the destination; or ( c ) the date on which the carriage stopped. (2) Article 35 of the Convention must not be read as applying to any proceedings for contribution between persons liable for any damage to which the Convention relates. (3) Subject to sections 4 and 29 of the Limitation Act 1959, an action must not be brought by a person liable for any damage to which the Convention relates to recover contribution from any other person in respect of the damage after the expiration of 2 years from the time when a court gives judgment or makes an award against the person seeking to recover the contribution. (4) Subsections (1), (2) and (3) and Article 35 of the Convention have effect as if references in those provisions to an action included references to an arbitration."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Insurance coverage under Article 50 of Convention",
      "content": "10. —(1) The Minister may by regulations make such provisions as may be necessary to give effect to Article 50 of the Convention in relation to the insurance that a carrier must maintain to cover its liability under the Convention. (2) Regulations made for the purposes of subsection (1) may — ( a ) prescribe the minimum limits of insurance coverage that a carrier must have in respect of any liability that may be incurred by it under the Convention; ( b ) require any carrier to give evidence and other particulars relating to the policy of insurance held by the carrier for the purposes of Article 50 of the Convention and provide for the method and procedure by which such evidence and other particulars are to be given; and ( c ) provide for the prohibition of any aircraft from landing in, or taking off from, Singapore if the carrier operating that aircraft is not adequately or sufficiently insured."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Power to exclude aircraft in use for military purposes",
      "content": "11. —(1) The Minister may, by order in the Gazette , direct that the provisions of the Convention do not apply to either or both of the following: ( a ) international carriage by air performed and operated directly by any State Party to the Convention for non‑commercial purposes in respect to its functions and duties as a sovereign state; ( b ) the carriage of persons, cargo and baggage for the military authorities of any State Party to the Convention on aircraft registered in or leased by that State Party to the Convention, the whole capacity of which has been reserved by or on behalf of such authorities. (2) An order under subsection (1) must not be made in respect of any State Party to the Convention unless that State Party to the Convention has made a declaration under Article 57 of the Convention."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Application to carriage by air not governed by Convention",
      "content": "12. The Minister may by regulations apply the provisions of the Convention and any provision of this Act to such carriage by air, not being international carriage as defined in the Convention, as may be specified in the regulations, subject to such exceptions, adaptations and modifications (if any) as may be so specified."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Regulations",
      "content": "13. —(1) The Minister may make such regulations as appear to him or her to be necessary for carrying out or giving effect to the provisions of the Convention. (2) Regulations made under subsection (1) may provide for the imposition of penalties not exceeding a fine of $100,000 or imprisonment for a term of 5 years or both for any offence thereunder."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Application to Government",
      "content": "14. This Act binds the Government."
    }
  ],
  "definitions": [
    {
      "term": "Convention",
      "definition": "“Convention” means the Convention for the unification of certain rules relating to international carriage by air opened for signature at Montreal on 28 May 1999, the text of which is set out in the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "court",
      "definition": "“court” , in relation to any arbitration proceedings allowed by Article 34 of the Convention, means the arbitrator or arbitration tribunal hearing the arbitration;",
      "source_provision": "s2"
    },
    {
      "term": "regulations",
      "definition": "“regulations” means regulations made under section 13.",
      "source_provision": "s2"
    }
  ]
}