{
  "id": "cbca-1960",
  "type": "statute",
  "title": "Corporate Bodies’ Contracts Act 1960",
  "title_en": "Corporate Bodies’ Contracts Act 1960",
  "short_name": "CBCA1960",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CBCA1960",
  "description": "An Act to amend the law governing the making of contracts by or on behalf of bodies corporate; and for connected purposes.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Cases where contracts need not be under seal",
      "content": "1. —(1) Contracts may be made on behalf of any body corporate, wherever incorporated, as follows: ( a ) a contract which if made between private persons would by law be required to be in writing, signed by the parties to be charged therewith, may be made on behalf of the body corporate in writing signed by any person acting under its authority, express or implied; and ( b ) a contract which if made between private persons would by law be valid although made by parol only, and not reduced into writing, may be made by parol on behalf of the body corporate by any person acting under its authority, express or implied. (2) A contract made according to this section shall be effectual in law, and shall bind the body corporate and its successors and all other parties thereto. (3) A contract made according to this section may be varied or discharged in the same manner in which it is authorised by this section to be made. (4) Nothing in this section shall be taken as preventing a contract under seal from being made by or on behalf of a body corporate. (5) Nothing in this section applies to the making, variation or discharge of a contract before 12 November 1993 except in so far as it was applicable by virtue of section 5 of the Civil Law Act 1909 in force before that date."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Exclusion of companies under Companies Act 1967, etc.",
      "content": "2. This Act shall not apply to any company as defined in the Companies Act 1967, any limited liability partnership as defined in the Limited Liability Partnerships Act 2005 or any variable capital company as defined in the Variable Capital Companies Act 2018. [5/2005] [S 26/2022 wef 13/01/2022]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Short title",
      "content": "3. This Act may be cited as the Corporate Bodies’ Contracts Act 1960."
    }
  ],
  "definitions": []
}