{
  "id": "cesowa-1958",
  "type": "statute",
  "title": "Corrosive and Explosive Substances and Offensive Weapons Act 1958",
  "title_en": "Corrosive and Explosive Substances and Offensive Weapons Act 1958",
  "short_name": "CESOWA1958",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CESOWA1958",
  "description": "An Act to provide certain penalties relating to the unlawful possession of corrosive and explosive substances and the carrying of offensive and scheduled weapons.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Corrosive and Explosive Substances and Offensive Weapons Act 1958."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “corrosive substance” means any of the acids and substances specified in the First Schedule, and shall be deemed to include all substances which are capable on application to the human body of causing hurt through corrosive action; “explosive device” has the meaning given by section 2(1) of the Guns, Explosives and Weapons Control Act 2021; [Act 3 of 2021 wef 01/07/2025] “explosive substance” shall be deemed to include any materials for making any explosive substance and any explosive device or material used or intended to be used or adapted for causing or aiding in causing any explosion in or with any explosive substance and any explosive device or part of an explosive device; [Act 3 of 2021 wef 01/07/2025] “hurt” means hurt as defined in the Penal Code 1871; “offensive weapon” includes any instrument which if used as a weapon of offence is likely to cause hurt; “scheduled weapon” means a weapon specified in the First Schedule to the Guns, Explosives and Weapons Control Act 2021. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Possession of corrosive or explosive substance for purpose of causing hurt",
      "content": "3. Any person who carries or has in his possession or under his control any corrosive or explosive substance in circumstances which raise a reasonable presumption that he intends to use or intends to enable some other person to use the substance for the purpose of causing hurt shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 10 years and shall also be punished with caning with not less than 6 strokes."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Using corrosive or explosive substance or offensive weapon",
      "content": "4. Any person who unlawfully and maliciously uses or attempts to use any corrosive substance or offensive weapon for the purpose of causing hurt or causes or attempts to cause by any explosive substance an explosion of a nature likely to cause hurt shall, whether any hurt has actually been caused or not, be guilty of an offence and shall be liable on conviction to imprisonment for life and shall also be punished with caning with not less than 6 strokes."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Consorting with person carrying corrosive or explosive substance",
      "content": "5. Any person who consorts with, or is found in the company of, another person who is carrying or has in his possession or under his control any corrosive or explosive substance in contravention of section 3 in circumstances which raise a reasonable presumption that he knew that that other person was carrying or had in his possession or under his control any such substance shall, unless he shall prove that he had reasonable grounds for believing that that other person was carrying or had in his possession or under his control any such substance for a lawful purpose, be guilty of an offence and shall be liable on conviction to the like punishment as that other person with whom he was consorting or in whose company he was found."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Carrying offensive weapons in public places",
      "content": "6. —(1) Any person who in any public road or place carries or has in his possession or under his control any offensive weapon otherwise than with lawful authority or for a lawful purpose shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 3 years and shall also be punished with caning with not less than 6 strokes. (1A) However, where the offensive weapon involved in the commission of an offence under subsection (1) is a prohibited weapon within the meaning of the Guns, Explosives and Weapons Control Act 2021, the person committing the offence shall be liable on conviction instead to imprisonment for a term not exceeding 5 years and shall also be punished with caning with not less than 6 strokes. [Act 3 of 2021 wef 01/07/2025] (1B) For the purposes of subsection (1) only, “lawful purpose” includes — ( a ) for use at work; ( b ) for religious reasons; ( c ) for use in a theatrical production or film‑making for entertainment; ( d ) for an ornamental display; ( e ) for the slaughter or hunting of wild animals authorised under written law; and ( f ) for use in gardening, or in animal husbandry or primary production. [Act 3 of 2021 wef 01/07/2025] (2) In any prosecution for an offence under subsection (1), the onus of proving the existence of a lawful purpose shall lie upon the accused. (3) A weapon shall be presumed to be carried with lawful authority if it is carried — ( a ) by a member of the Singapore Armed Forces or of the Singapore Police Force or of any visiting force lawfully present in Singapore under the provisions of any law relating to visiting forces; or ( b ) by any person as part of his official or ceremonial dress on any official or ceremonial occasion. (4) An offence under subsection (1) shall be deemed to be an arrestable and non‑bailable offence."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Offences relating to scheduled weapons",
      "content": "7. —(1) Any person who, otherwise than for a lawful purpose — ( a ) carries or has in his possession or under his control; ( b ) manufactures, sells or hires or offers or exposes for sale or hire; or ( c ) lends or gives to any other person, any scheduled weapon shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 5 years and shall also be punished with caning with not less than 6 strokes and, in the case of a second or subsequent offence, to imprisonment for a term of not less than 2 years and not more than 8 years and shall also be punished with caning with not less than 6 strokes. (1A) A person does an act mentioned in subsection (1)( a ), ( b ) or ( c ) otherwise than for a lawful purpose if — ( a ) the person does so involving a scheduled weapon intending to — (i) injure, or endanger the safety of, another person; (ii) cause reasonable fear of the infliction of injury to another person; (iii) destroy or damage any property; or (iv) facilitate another person to injure, or endanger the safety of, another person, cause reasonable fear of the infliction of injury to another person, or destroy or damage any property, using the scheduled weapon; and ( b ) the person’s possession of the scheduled weapon is then — (i) not authorised by a licence or a class licence under the Guns, Explosives and Weapons Control Act 2021; (ii) not in accordance with the conditions of a licence or a class licence mentioned in sub‑paragraph (i); and (iii) not exempt from the Guns, Explosives and Weapons Control Act 2021 with respect to possession of that scheduled weapon. [Act 3 of 2021 wef 01/07/2025] (2) In any prosecution for an offence under subsection (1), the onus of proving the existence of a lawful purpose shall be upon the accused. (3) An offence under subsection (1) shall be deemed to be an arrestable and non‑bailable offence. (4) A reference to “second or subsequent offence” in relation to an offence under subsection (1) is a reference to a person who — ( a ) is convicted, or found guilty, of such an offence (called the current offence); and ( b ) has been convicted or found guilty of any of the following on at least one other earlier occasion within the period of 5 years immediately before the date on which the person is convicted or found guilty of the current offence: (i) the same offence under subsection (1); (ii) an offence under subsection (1) as in force before the date of commencement of section 94( g ) of the Guns, Explosives and Weapons Control Act 2021 and that involved a scheduled weapon. [Act 3 of 2021 wef 01/07/2025]"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Consorting with persons carrying offensive weapons in public places",
      "content": "8. —(1) Any person who consorts with, or is found in the company of, another person who is carrying or has in his possession or under his control any offensive weapon in contravention of section 6, in circumstances which raise a reasonable presumption that he knew that that other person was carrying or had in his possession or under his control any such weapon shall, unless he shall prove that he had reasonable grounds for believing that that other person was carrying or had in his possession or under his control any such weapon for a lawful purpose, be guilty of an offence and shall be liable on conviction to the like punishment as that other person with whom he was consorting or in whose company he was found. (2) An offence under this section shall be deemed to be an arrestable and non-bailable offence."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Powers of search and seizure",
      "content": "9. —(1) Any police officer may, without warrant and with or without assistance, stop and search any person or vehicle found in any public road or place if he has reasonable grounds for believing that any evidence of the commission of an offence under this Act is likely to be found on that person or in that vehicle, and may disarm that person and seize any offensive weapon, article or material or accumulation thereof capable of being used for causing hurt if he has reasonable grounds for believing that it is intended or likely to be used in the commission of an offence under this Act. (2) Any police officer may, without warrant and with or without assistance — ( a ) stop and search any person or vehicle, whether in a public road or place or not; ( b ) enter and search any premises; or ( c ) board and search any vessel, vehicle or aircraft not being, or having the status of, a naval, military or air force vessel, vehicle or aircraft, if he has reasonable grounds for believing that any evidence of the commission or of the preparation for the commission of an offence under this Act is likely to be found on such person or premises or in any such vessel, vehicle or aircraft, and may seize any article or material or accumulation thereof capable of being used for causing hurt if he has reasonable grounds for believing that it is intended or likely to be used for the purpose of causing hurt, and any such evidence so found and any vessel, vehicle or aircraft in which that article, material or evidence is found. (3) No woman shall be searched under this section except by a woman."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Disposal of property",
      "content": "10. —(1) Subject to subsection (2), the provisions of the Criminal Procedure Code 2010 relating to the disposal of property the subject of an offence, shall apply to any article coming into the possession of a police officer under section 9. (2) Any corrosive or explosive substance or offensive weapon coming into the possession of a police officer under section 9 may be disposed of in such manner as the Minister may order. (3) Nothing in this section shall be taken to prejudice any right to retain or dispose of property which may exist in law apart from this section."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Presumptions",
      "content": "11. —(1) Where any corrosive or explosive substance is found in or on any premises, the occupier of the premises shall be deemed to be in possession of that substance unless he shall prove that some other person was in possession thereof, or that he had no knowledge or reasonable means of knowledge that that substance was in or on the premises and that he had taken all reasonable precautions against that substance being kept in or on the premises. (2) In any prosecution under section 3 or 5, it shall be presumed until the contrary is proved that any substance was intended to be used for the purpose of causing hurt if — ( a ) the quantity of the substance found exceeded the quantity reasonably required to be kept by the accused for ordinary use and consumption in his household or establishment and, in the case of a person carrying on business, exceeded the quantity reasonably required to be kept in the ordinary course of that business; ( b ) the substance was kept concealed or in a place other than that in which it might reasonably be expected to be kept for domestic purposes or, in the case of a person carrying on business, for business purposes; or ( c ) the substance was kept in a container other than a container of a kind in which the substance is ordinarily kept for domestic purposes or, in the case of a person carrying on business, for business purposes."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Power to amend First Schedule",
      "content": "12. The Minister may by order add to or amend the First Schedule. [Act 3 of 2021 wef 01/07/2025]"
    }
  ],
  "definitions": [
    {
      "term": "corrosive substance",
      "definition": "“corrosive substance” means any of the acids and substances specified in the First Schedule, and shall be deemed to include all substances which are capable on application to the human body of causing hurt through corrosive action;",
      "source_provision": "s2"
    },
    {
      "term": "explosive device",
      "definition": "“explosive device” has the meaning given by section 2(1) of the Guns, Explosives and Weapons Control Act 2021; [Act 3 of 2021 wef 01/07/2025]",
      "source_provision": "s2"
    },
    {
      "term": "explosive substance",
      "definition": "“explosive substance” shall be deemed to include any materials for making any explosive substance and any explosive device or material used or intended to be used or adapted for causing or aiding in causing any explosion in or with any explosive substance and any explosive device or part of an explosive device; [Act 3 of 2021 wef 01/07/2025]",
      "source_provision": "s2"
    },
    {
      "term": "hurt",
      "definition": "“hurt” means hurt as defined in the Penal Code 1871;",
      "source_provision": "s2"
    },
    {
      "term": "offensive weapon",
      "definition": "“offensive weapon” includes any instrument which if used as a weapon of offence is likely to cause hurt;",
      "source_provision": "s2"
    },
    {
      "term": "scheduled weapon",
      "definition": "“scheduled weapon” means a weapon specified in the First Schedule to the Guns, Explosives and Weapons Control Act 2021. [Act 3 of 2021 wef 01/07/2025]",
      "source_provision": "s2"
    }
  ]
}