{
  "id": "cltpa-1955",
  "type": "statute",
  "title": "Criminal Law (Temporary Provisions) Act 1955",
  "title_en": "Criminal Law (Temporary Provisions) Act 1955",
  "short_name": "CLTPA1955",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CLTPA1955",
  "description": "An Act to make temporary provisions for the maintenance of public order, the control of supplies by sea to Singapore, and the prevention of strikes and lock‑outs in essential services.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. —(1) This Act is the Criminal Law (Temporary Provisions) Act 1955. [S 40/2022] (2) This Act continues in force for a period of 5 years starting on 21 October 2024. [Act 18 of 2024 wef 21/10/2024] (3) The expiry of this Act shall not affect the operation thereof as respects things previously done or omitted to be done."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the subject or context otherwise requires — “authorised officer” means — ( a ) any police officer or officer of customs; ( b ) any person holding a commission in the Singapore Armed Forces; or ( c ) any authority or any person by name or office appointed by the Minister to be an authorised officer for the purpose of exercising all or any of the powers conferred upon an authorised officer by this Act; “document” means any matter expressed or described upon any substance by means of letters, figures or marks, or by more than one of these means, and includes any banner, emblem or other insignia; “explosive substance” shall be deemed to include any materials for making any explosive substance and any bomb, grenade, apparatus, machine, implement or material used or intended to be used or adapted for causing or aiding in causing any explosion in or with any explosive substance and any part of such bomb, grenade, apparatus, machine or implement; “police officer” includes any member of the Special Constabulary constituted under Part 8 of the Police Force Act 2004; “subversive document” means any document which contains — ( a ) any subversive matter; ( b ) any propaganda or matter supporting, propagating or advocating acts prejudicial to the public safety in Singapore or the maintenance of public order therein or inciting to violence therein or counselling disobedience to the law thereof or to any lawful order therein; or ( c ) any reference to or account of any collection of, or any request or demand for, any subscription, contribution or donation, whether in money or in kind, or any request or demand for supplies for the benefit, directly or indirectly, or the use of persons who intend to or are about to act or have acted in a manner prejudicial to the public safety in Singapore or to the maintenance of public order therein or who incite to violence therein or counsel disobedience to the law thereof or any lawful order therein, and includes any document indicating a connection, association or affiliation with any unlawful society; “supplies” includes money, food, drink, clothing, rubber, tin or other valuable commodity, any medicine or drug or other medical supplies, and any material or instrument or part thereof for printing, typewriting or duplicating words or objects in visible form."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - MISCELLANEOUS OFFENCES RELATING TO PUBLIC SAFETY",
      "section": "3",
      "title": "Supplies",
      "content": "3. —(1) Any person who demands, collects or receives any supplies from any other person in circumstances which raise a reasonable presumption that he intends or is about to act or has recently acted in a manner prejudicial to public safety in Singapore or the maintenance of public order therein or that the supplies so demanded, collected or received are intended for the use of any person who that firstmentioned person knows or has reason to believe intends, or is about, so to act, or has recently so acted, shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 10 years. (2) Any person who is found in possession of any supplies for which he cannot satisfactorily account in circumstances which raise a reasonable presumption that the supplies are intended for the use of any person who that firstmentioned person knows or has reason to believe intends, or is about, to act, or has recently acted, in a manner prejudicial to public safety in Singapore or the maintenance of public order therein, shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 7 years. (3) Any person who provides, directly or indirectly, any supplies to any other person in circumstances which raise a reasonable presumption that the firstmentioned person knows or has reason to believe that other person intends, or is about, to act, or has recently acted, in a manner prejudicial to public safety in Singapore or the maintenance of public order therein, or that the supplies so provided are intended for the use of any person who intends, or is about, so to act, or has recently so acted, shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 7 years. (4) No person shall be convicted of any offence under subsection (3) if he proves that prior to being charged with or accused of that offence by a police officer or a person in authority he voluntarily gave full information of the offence to a police officer. (5) In any charge of any offence under any of the provisions of this section, it shall not be necessary to specify the person or persons from whom any supplies were demanded, collected or received or to whom any supplies were provided."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - MISCELLANEOUS OFFENCES RELATING TO PUBLIC SAFETY",
      "section": "4",
      "title": "Making and possession of subversive documents",
      "content": "4. —(1) Any person who, without lawful excuse, makes, causes to be made, carries or has in his possession or under his control any subversive document shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 10 years. (2) Every document purporting to be a subversive document shall be deemed to be a subversive document until the contrary is proved. (3) Where, in any prosecution under this section, it is proved that a person made, was carrying or had in his possession or under his control a subversive document, he shall be deemed to have known the nature and contents of the document. (4) No person shall be convicted of an offence under this section if he proves to the satisfaction of the court — ( a ) that he was not aware of the nature or contents of the subversive document which he made, caused to be made, was carrying or had in his possession or under his control; and ( b ) that he made, caused to be made, was carrying or had the subversive document in his possession or under his control in such circumstances that at no time did he have reasonable cause to believe or suspect that the document was a subversive document."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "5",
      "title": "Interpretation of this Part",
      "content": "5. In this Part, unless the context otherwise requires — “Commissioner” means the Commissioner for Labour, and includes any Deputy or Assistant Commissioner for Labour; “essential service” means any service, business, trade, undertaking, manufacture or calling included in Part 1 of the First Schedule; “lock-out” means the closing of a place of employment or the suspension of work, or the refusal by an employer to continue to employ any number of persons employed by him in consequence of a trade dispute, done with a view to compelling those persons, or to aid another employer in compelling persons employed by him, to accept terms or conditions of or affecting employment; “public health service” means — ( a ) any hospital, clinic, sanatorium or other institution for the care of the sick; and ( b ) any system of public conservancy or sanitation; “strike” means the cessation of work by a body of persons employed in any essential service acting in combination, or a concerted refusal or a refusal under a common understanding of a number of persons who are or who have been so employed to continue to work or to accept employment; “workman” means any person who has entered into or works under a contract with an employer, whether the contract be for manual labour, clerical work or otherwise, be expressed or implied, oral or in writing, and whether it be a contract of service or of apprenticeship or a contract personally to execute any work, and includes, for the purposes of any proceedings under this Part in relation to a trade dispute, a workman discharged during that dispute."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "6",
      "title": "Restrictions on strikes and lock-outs",
      "content": "6. —(1) No workman employed in any of the following essential services shall go on strike: ( a ) water services; ( b ) gas services; ( c ) electricity services. (2) No workman employed in any essential service, not being an essential service specified in subsection (1), shall go on strike — ( a ) unless at least 14 days before striking he has given to his employer notice of intention to strike as provided by this section; ( b ) before the date of striking specified in the notice of intention to strike; or ( c ) during the pendency of any proceedings. (3) No employer shall lock out any workman engaged in any essential service specified in subsection (1). (4) No employer shall lock out any workman engaged in any essential service, not being an essential service specified in subsection (1) — ( a ) unless at least 14 days before locking out he has given to his workmen notice of intention to lock out as provided by this section; ( b ) before the date of locking out specified in the notice of intention to lock out; or ( c ) during the pendency of any proceedings. (5) The notice referred to in subsection (2) shall — ( a ) be delivered to the employer or his manager; ( b ) be signed by not less than 7 workmen employed by the employer and concerned in the strike, or by 7 representatives of the trade union of which the workmen are members; and ( c ) be in accordance with Form 1 set out in Part 2 of the First Schedule. (6) The notice referred to in subsection (4) shall — ( a ) be signed by the employer; ( b ) be delivered to a representative of the workmen concerned or to an officer of the trade union to which the workmen belong; and ( c ) be in accordance with Form 2 set out in Part 2 of the First Schedule. (7) The employer shall cause a copy of the notice referred to in subsection (4) to be posted at 3 conspicuous places in the place of work where the workmen affected thereby are ordinarily employed. (8) A copy of every notice which is given under subsection (2) or (4) shall be delivered to the Commissioner within 3 days after the notice is given. (9) Every notice which is given under subsection (2) or (4) shall expire at the end of 30 days from the date of the notice. (10) In this section, “proceedings” means — ( a ) conciliation proceedings directed by the Commissioner under section 21(2) of the Industrial Relations Act 1960 or by the Minister under section 23(1) of that Act; ( b ) proceedings before an Industrial Arbitration Court in respect of a trade dispute of which that Court has cognizance by virtue of section 31 of the Industrial Relations Act 1960; or ( c ) proceedings before a board of inquiry appointed by the Minister under section 74(1) of the Industrial Relations Act 1960."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "7",
      "title": "Illegal strikes and lock-outs",
      "content": "7. A strike or lock-out shall be deemed to be illegal if it is commenced, declared or continued in contravention of section 6, or of any provision of any other written law."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "8",
      "title": "Lock-out or strike consequent on illegal strike or lock-out",
      "content": "8. A lock-out declared in consequence of an illegal strike or a strike declared in consequence of an illegal lock-out shall not be deemed to be illegal."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "9",
      "title": "Penalty for illegal strikes and lock-outs",
      "content": "9. —(1) Any workman who commences, continues or otherwise acts in furtherance of a strike which is illegal under this Part shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both. (2) Any employer who commences, continues or otherwise acts in furtherance of a lock-out which is illegal under this Part shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "10",
      "title": "Penalty for instigation",
      "content": "10. Any person who — ( a ) instigates or incites others to take part in, or otherwise acts in furtherance of, a strike or lock-out which is illegal under this Part; or ( b ) instigates or incites others to withhold their labour or services knowing or having reason to believe that the probable consequences of that action will be to endanger human life or the efficient operation of any public health service or cause serious bodily injury or expose valuable property whether real or personal to destruction or serious damage, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "11",
      "title": "Penalty for giving financial aid to illegal strikes or lock‑outs",
      "content": "11. Any person who knowingly expends or applies any money in direct furtherance or support of any illegal strike or lock‑out shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - ILLEGAL STRIKES AND LOCK-OUTS IN ESSENTIAL SERVICES",
      "section": "12",
      "title": "Protection of persons refusing to take part in illegal strikes or lock‑outs",
      "content": "12. No person refusing to take part or to continue to take part in any strike or lock‑out which is by this Part declared to be illegal shall be, by reason of the refusal, subject to expulsion from any trade union or society, or to any fine or penalty, or to the deprivation of any right or benefit to which he or his legal personal representatives would otherwise be entitled, or be liable to be placed in any respect, directly or indirectly, under any disability or at any disadvantage as compared with other members of the union or society, anything to the contrary in the rules of a trade union or society notwithstanding."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 4 - GENERAL",
      "section": "13",
      "title": "Dispersal of assemblies",
      "content": "13. —(1) Whenever the Minister declares that an immediate threat to public peace exists within Singapore or any part thereof, any police officer not below the rank of sergeant may command any assembly of 10 or more persons within Singapore to disperse and it shall thereupon be the duty of those persons to disperse accordingly. (2) Any person joining or continuing in any assembly referred to in subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding 6 months or to both. (3) Any declaration under subsection (1) shall, but without prejudice to the making of a further declaration, remain in force for a period not exceeding 48 hours. (4) In any prosecution under this section, a certificate signed by the Minister as to the date and time of the making of a declaration shall be admissible in evidence and shall not be called in question in any court."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 4 - GENERAL",
      "section": "14",
      "title": "Powers of search and boarding vessels",
      "content": "14. —(1) A police officer not below the rank of sergeant may, without warrant and with or without assistance, enter and search any premises, stop and search any vehicle or individual, whether in a public place or not, if he suspects that any evidence of the commission of an offence is likely to be found on the premises or individual or in the vehicle, and may seize any evidence so found. (2) Without prejudice to the provisions of any other written law, any police officer may, when on duty and on the authority of a police officer not below the rank of sergeant — ( a ) stop, board and search any vessel not being or having the status of a ship of war; and ( b ) remain on board so long as the vessel remains within the waters of Singapore. (3) Any police officer searching a vessel under subsection (2) may seize any evidence found therein of the commission of any offence under the provisions of any written law for the time being in force. (4) Any person resisting or hindering or in any way obstructing any police officer carrying out a search under this section shall be guilty of an offence."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - GENERAL",
      "section": "15",
      "title": "Disposal of subversive documents",
      "content": "15. Any subversive document seized under the provisions of this Act shall be destroyed or otherwise disposed of in such manner as the Commissioner of Police may order."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - GENERAL",
      "section": "16",
      "title": "Failure to report offences",
      "content": "16. —(1) Any person who, knowing or having reasonable cause to believe that another person is guilty of any offence included for the time being in the Second Schedule, fails to report the same to a police officer at the earliest possible opportunity shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 5 years. (2) Where any person is charged with an offence under subsection (1), the burden of proving that there was no opportunity of making a report to a police officer, or that such a report was, in fact, made by him at the earliest possible opportunity, shall lie on the accused. (3) Subsection (1) shall not apply to communications made by a client to an advocate and solicitor which are protected from disclosure under section 128 of the Evidence Act 1893."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - GENERAL",
      "section": "17",
      "title": "Attempt to commit offences and assisting offenders",
      "content": "17. —(1) Without prejudice to the operation of Chapter 5 and Chapter 23 of the Penal Code 1871, any person who attempts to commit, or does any act preparatory to the commission of an offence under this Act, shall be deemed to be guilty of that offence. (2) No person, knowing or having reasonable cause to believe that another person has committed an offence under this Act, shall give that other person any assistance with intent thereby to prevent, hinder or interfere with the apprehension, trial or punishment of that person for that offence."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - GENERAL",
      "section": "18",
      "title": "Offences arrestable and non-bailable",
      "content": "18. Every offence under this Act, other than an offence under section 9, shall be arrestable and non-bailable for the purposes of the Criminal Procedure Code 2010."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - GENERAL",
      "section": "19",
      "title": "Offences by companies, etc.",
      "content": "19. Where a person committing an offence under this Act is a company or other body corporate or any association of persons (whether incorporated or not), every director, manager, secretary, agent or other officer or person concerned with the management thereof shall, unless he proves that the offence was committed without his knowledge or consent, be deemed to be guilty of that offence."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 4 - GENERAL",
      "section": "20",
      "title": "Penalties",
      "content": "20. If any person contravenes or fails to comply with any of the provisions of this Act, or any order or rule made under any of those provisions, or any direction given or requirement imposed under any of those provisions, or abets such contravention or failure, he shall be guilty of an offence and, subject to any special provisions in this Act, shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 3 years or to both."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 4 - GENERAL",
      "section": "21",
      "title": "Jurisdiction of District Courts",
      "content": "21. Without prejudice to the jurisdiction of the General Division of the High Court, a District Court shall have jurisdiction to try any offence under this Act and to impose therefor a fine not exceeding $5,000 or imprisonment for a term not exceeding 5 years or both. [40/2019]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 4 - GENERAL",
      "section": "22",
      "title": "Admission of statements in evidence",
      "content": "22. —(1) Where any person is charged with any offence under this Act, any statement, whether the statement amounts to a confession or not or is oral or in writing, made at any time, whether before or after the person is charged and whether in the course of a police investigation or not, by that person to or in the hearing of any police officer of or above the rank of sergeant shall, notwithstanding anything to the contrary contained in any written law, be admissible at his trial in evidence and, if that person tenders himself as a witness, any such statement may be used in cross‑examination and for the purpose of impeaching his credit. (2) No statement referred to in subsection (1) shall be admissible or so used if the making of the statement appears to the court to have been caused by any inducement, threat or promise having reference to the charge against that person, proceeding from a person in authority and sufficient, in the opinion of the court, to give that person grounds which would appear to him reasonable for supposing that by making it he would gain any advantage or avoid any evil of a temporal nature in reference to the proceedings against him."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 4 - GENERAL",
      "section": "23",
      "title": "Trials may be in private",
      "content": "23. Notwithstanding anything to the contrary in any written law, a court may order that the whole or any part of any trial before it for any offence under this Act shall be dealt with in private if it is satisfied that it is expedient in the interests of justice or of public safety or security to do so. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 4 - GENERAL",
      "section": "24",
      "title": "Power to prohibit publication of witnesses’ names, etc.",
      "content": "24. —(1) A court may at any time order that no person shall publish the name, address or photograph of any witness in any case tried or about to be tried before it for an offence under this Act, or any evidence or any other thing likely to lead to the identification of any such witness. (2) Any person who acts in contravention of any order made under subsection (1) shall be guilty of an offence."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 4 - GENERAL",
      "section": "25",
      "title": "Disposal of articles in possession of authorities",
      "content": "25. —(1) The provisions of the Criminal Procedure Code 2010 relating to the disposal of property the subject of offences shall apply to any article coming into the possession of an authority which the authority has reasonable ground for believing to be evidence of the commission of an offence under this Act, as they apply to property coming into the possession of the police, and in relation to any such article, shall have effect as if any reference therein to a police officer included a reference to an authority. (2) For the purposes of this section, “authority” includes any public officer and any other person whomsoever having functions in connection with the operation of this Act. (3) Nothing in this section shall be taken to prejudice any right to retain or dispose of property which may exist in the law apart from this section."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 4 - GENERAL",
      "section": "26",
      "title": "Publicity of orders",
      "content": "26. —(1) When any order or declaration is made or direction given under the provisions of this Act, the authority making the order or declaration or giving the direction shall cause notice of the effect of it to be given as soon as possible in such manner as he thinks necessary for bringing it to the notice of all persons who in his opinion ought to have notice of it. (2) Any order or declaration made or direction given under subsection (1) shall have effect as soon as notice under that subsection has been given, without publication in the Gazette ."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 4 - GENERAL",
      "section": "27",
      "title": "Interpretation of sections 27A, 27B and 27C",
      "content": "27. —(1) In sections 27A, 27B and 27C — “appropriate consent” means — ( a ) for a person 16 years of age and above, the written consent of that person; ( b ) for a person 14 years of age and above but below 16 years of age, the written consent of both that person and of his parent or guardian; and ( c ) for a person below 14 years of age, the written consent of his parent or guardian, given to a police officer or officer of the Central Narcotics Bureau in charge of the case after that officer has informed the person concerned, his parent or guardian or both, as the case may be, of the purpose for which a body sample is required from such person and the manner by which such body sample is to be taken from him; “authorised analyst” means a person appointed by the Commissioner of Police to be an analyst; “body sample” means — ( a ) a sample of blood; ( b ) a sample of head hair, including the roots thereof; ( c ) a swab taken from a person’s mouth; or ( d ) such other sample as may be prescribed under subsection (2); “DNA” means deoxyribonucleic acid; “DNA information” means genetic information derived from the forensic DNA analysis of a body sample; “finger impression” includes thumb impression and palmar impression; [ Deleted by Act 26 of 2022 wef 12/06/2023 ] “invasive sample” means any body sample that is obtained by means of any invasive procedure, but does not include any sample described in subsection (3); [Act 26 of 2022 wef 12/06/2023] “other particulars”, in relation to a person, means any particulars, information or description of that person, other than his registrable particulars, that may be relevant or useful in the identification of that person; “photograph”, in relation to a person, includes the photograph of any distinguishing feature or mark on the body of that person; “registered medical practitioner” has the meaning given by the Medical Registration Act 1997 and includes a dentist registered under the Dental Registration Act 1999; “registrable particulars” means the particulars of any detention or supervision order made under section 30(1), 32 or 38 and any name, description, photograph or finger impression of, or document relating to, any person so detained or placed under supervision, as the case may be. [32/2004; 22/2007; 12/2018] (2) Subject to subsection (3), the Minister may prescribe additional types of body samples that may be taken under section 27A. [32/2004] (3) The additional types of body samples that may be prescribed under subsection (2) shall not include samples to be obtained from — ( a ) the genital or anal area of a person’s body; ( b ) a person’s body orifice other than the mouth; or ( c ) the breasts of a woman. [32/2004]"
    },
    {
      "provision_ref": "s27A",
      "chapter": "PART 4 - GENERAL",
      "section": "27A",
      "title": "Taking of photographs, finger impressions, body samples, etc., from person arrested, detained or subject to police supervision",
      "content": "27A. —(1) A police officer or officer of the Central Narcotics Bureau may exercise all or any of the following powers in respect of any person referred to in subsection (2): ( a ) take or cause to be taken photographs and finger impressions of such person; ( b ) make or cause to be made a record of the registrable particulars and any other particulars of such person; ( c ) cause body samples of such person to be taken by a person authorised under section 27B(1); ( d ) send any photograph, finger impression, record of particulars or body sample so taken or made to the Commissioner of Police for identification and report. [32/2004] (2) The powers referred to in subsection (1) may be exercised in respect of any of the following persons: ( a ) a person who, on 21 October 2004, is under arrest and detained under section 44 or 45; ( b ) a person who, on 21 October 2004, is under detention or subject to supervision under section 30(1), 32 or 38; ( c ) a person who, on or after 21 October 2004, is arrested, detained or placed under police supervision under any of the provisions of this Act. [32/2004; 12/2018] (3) Every person mentioned in subsection (2) shall — ( a ) submit to the taking of his photographs and finger impressions under subsection (1); ( b ) provide such registrable particulars and other particulars as may be required under subsection (1); and ( c ) subject to subsection (5), submit to the taking of his body samples by a person authorised under section 27B(1). [32/2004] (4) Where any person mentioned in subsection (2) fails, without reasonable excuse, to comply with subsection (3) — ( a ) that person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding one month or to both; and ( b ) a police officer or officer of the Central Narcotics Bureau may use such force as is reasonably necessary to take or cause to be taken the photographs, finger impressions and body samples of that person. [32/2004] (5) No — ( a ) sample of blood; or ( b ) invasive sample, which may be prescribed under section 27(2), shall be taken from any person unless the appropriate consent is given for the taking of the sample. [32/2004] [Act 26 of 2022 wef 12/06/2023] (6) All photographs, finger impressions and particulars of a person taken before 21 October 2004 under section 27 or 37 in force before that date shall be deemed to have been taken under this section. [32/2004]"
    },
    {
      "provision_ref": "s27B",
      "chapter": "PART 4 - GENERAL",
      "section": "27B",
      "title": "Further provisions for taking of body samples",
      "content": "27B. —(1) For the purposes of section 27A(1)( c ), a body sample may only be taken by — ( a ) a registered medical practitioner; ( b ) a police officer or officer of the Central Narcotics Bureau who has received training for the purpose; or ( c ) any other suitably qualified or trained person who is duly appointed in writing by the Commissioner of Police as an authorised person for the purpose. [32/2004] (2) Before taking any body sample, the person authorised by subsection (1) to take the sample must satisfy himself that the taking of the sample does not endanger the person from whom the sample is to be taken. [32/2004] (3) The fact that a body sample has been taken for the purposes of section 27A shall be recorded by the person who took the sample in such form or manner as may be required by the Commissioner of Police. [32/2004] (4) Every body sample taken for the purposes of section 27A shall be sent to an authorised analyst for forensic DNA analysis. [32/2004]"
    },
    {
      "provision_ref": "s27C",
      "chapter": "PART 4 - GENERAL",
      "section": "27C",
      "title": "Retention of photographs, finger impressions, particulars and body samples taken",
      "content": "27C. —(1) The Commissioner of Police shall cause to be maintained — ( a ) a register (whether in a computerised form or otherwise) in which shall be stored all photographs, finger impressions, registrable particulars and other particulars of a person taken or deemed to be taken under section 27A; and ( b ) a DNA database (whether in a computerised form or otherwise) in which shall be stored all DNA information derived from a body sample taken from a person under section 27A. [32/2004] (2) Any information stored in the register and the DNA database under subsection (1) may be used for all or any of the following purposes: ( a ) for comparison with any other information or any other DNA information, as the case may be, obtained in the course of an investigation of an offence conducted by a police officer or officer of the Central Narcotics Bureau; ( b ) for comparison with information in the register of criminals or identification database maintained under section 4 or 29 of the Registration of Criminals Act 1949 or with DNA information in the DNA database maintained under section 31 of that Act, as the case may be; [Act 26 of 2022 wef 12/06/2023] ( c ) for comparison with information or DNA information, as the case may be, in the register or DNA database, respectively, established under — (i) section 26D of the Intoxicating Substances Act 1987; or (ii) section 40D of the Misuse of Drugs Act 1973; ( d ) for any proceedings for any offence; ( e ) for administering the register and DNA database for the purposes of this Act; ( ea ) for any investigation into a death conducted by a police officer, a Coroner or a forensic pathologist (including a post-mortem examination) or any inquiry into any death held by a Coroner, under the Coroners Act 2010; [Act 26 of 2022 wef 12/06/2023] ( eb ) for identifying a dead person or any part of a person; [Act 26 of 2022 wef 12/06/2023] ( ec ) for identifying a person in order to provide police assistance to the person; [Act 26 of 2022 wef 12/06/2023] ( f ) for such other purposes as may be prescribed. [32/2004; 2/2006] (3) Where any photograph, finger impression, record of particulars or body sample has been taken under section 27A from an arrested person and that person is subsequently released, without being — ( a ) convicted of any offence under this Act; or ( b ) placed on detention or supervision under this Act, the Commissioner of Police shall cause all such photographs, finger impressions, records of particulars and body samples taken from that person to be removed from the register and DNA database maintained under subsection (1). [32/2004] (4) For the purposes of subsection (2)( d ) — ( a ) any photograph, finger impression, registrable particulars or other particulars stored in the register under subsection (1)( a ); ( b ) any DNA information stored in the DNA database under subsection (1)( b ); and ( c ) any certificate or report purporting to have been compiled or made from information stored in the register or DNA database maintained under subsection (1), shall, if produced from proper custody and authenticated by the signature of the Commissioner of Police or a police officer authorised by the Commissioner of Police, be admissible in evidence in any proceedings, without proof of signature; and, until the contrary is proved, shall be proof of all matters contained therein or appearing thereon. [32/2004; 2/2006]"
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 4 - GENERAL",
      "section": "28",
      "title": "Power to amend Schedules",
      "content": "28. The Minister may, by notification in the Gazette , add to, vary or amend any of the Schedules."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 4 - GENERAL",
      "section": "29",
      "title": "Effect of this Act",
      "content": "29. The provisions of this Act shall be in addition to and not in derogation of the provisions of any other written law and, in the event of conflict between any provision of this Act and any provision of any other written law, the provisions of this Act shall prevail."
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 5 - DETENTION",
      "section": "30",
      "title": "Power of Minister to make orders",
      "content": "30. —(1) Whenever the Minister is satisfied with respect to any person, whether the person is at large or in custody, that the person has been associated with activities of a criminal nature, the Minister may, with the consent of the Public Prosecutor — ( a ) if he is satisfied that it is necessary that the person be detained in the interests of public safety, peace and good order, by order under his hand direct that the person be detained for any period not exceeding 12 months from the date of the order; or ( b ) if he is satisfied that it is necessary that the person be subject to the supervision of the police, by order direct that the person be subject to the supervision of the police for any period not exceeding 3 years from the date of the order. [12/2018] (2) Every decision of the Minister on a matter in subsection (1) is final. [12/2018] (3) In this section, “activities of a criminal nature” means any activity specified in the Fourth Schedule. [12/2018]"
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 5 - DETENTION",
      "section": "31",
      "title": "Orders to be referred to advisory committee and subject to confirmation by President",
      "content": "31. —(1) Every order made by the Minister under section 30(1) shall, together with a written statement of the grounds upon which the Minister made the order, be referred by the Minister to an advisory committee constituted as provided in section 39, within 28 days of the making of the order. [12/2018] (2) The advisory committee shall submit to the President a written report on the making of the order and may make therein such recommendations as it shall think fit. (3) The President shall consider the report and may cancel or confirm the order and in confirming the order may make thereto such variations as he thinks fit."
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 5 - DETENTION",
      "section": "32",
      "title": "Power to substitute order for police supervision",
      "content": "32. —(1) At any time after an order of detention in respect of a person has been made under section 30(1) or confirmed under section 31(3) or after the expiry of the validity of the order, the Minister may by order direct that the person be subject to the supervision of the police for any period not exceeding 3 years from the date of the order and thereupon any detention order made or confirmed in respect of that person shall be deemed to be cancelled and that person if under detention shall be released. [12/2018] (2) Section 31 shall apply to any order made by the Minister under subsection (1) as it applies to an order made by the Minister under section 30(1). [12/2018]"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 5 - DETENTION",
      "section": "33",
      "title": "Obligations on person subject to supervision",
      "content": "33. —(1) The Minister may, by order in writing served on a person directed to be subject to the supervision of the police under section 30(1) or 32 (called in this Act a person subject to supervision), direct the person to comply with all or any of the obligations prescribed by rules made under section 49 for the purposes of this section. [12/2018] (2) The Minister may, from time to time, by order in writing served on the person subject to supervision — ( a ) cancel any of the obligations imposed on that person by an order under subsection (1) or this subsection; or ( b ) direct that person to comply with any obligation prescribed by rules made under section 49 for the purposes of this section. [12/2018] (3) A person subject to supervision who contravenes or fails to comply with any obligation imposed on that person by an order under subsection (1) or (2) shall be guilty of an offence and shall be liable on conviction to imprisonment for a term of not less than one year and not more than 3 years. [12/2018] (4) A person subject to supervision is not required to comply with any obligation imposed on that person by an order under subsection (1) or (2) — ( a ) while that person is imprisoned or otherwise in custody, or detained, under any other written law; or ( b ) if, and only to the extent that, the obligation is inconsistent with any order or direction made by a court in respect of that person, such as an order or a direction to attend any court proceeding despite the obligation. [12/2018] 34. [ Repealed by Act 12 of 2018 ]"
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 5 - DETENTION",
      "section": "35",
      "title": "Double penalties for crimes of violence",
      "content": "35. Any person subject to supervision who is convicted of an offence, committed after the date of the order directing him to be subject to supervision, under the provisions of any law specified in the Third Schedule shall, notwithstanding any other written law to the contrary, be liable to imprisonment for a term twice as long as the maximum term for which he would otherwise have been liable on conviction for that offence, and also to caning. [12/2018] 36. [ Repealed by Act 12 of 2018 ] 37. [ Repealed by Act 32 of 2004 ]"
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 5 - DETENTION",
      "section": "38",
      "title": "Extension of orders",
      "content": "38. —(1) The President may, from time to time, extend the validity of any order of detention confirmed under section 31(3) for periods not exceeding 12 months at any one time and may at any time refer any such order for further consideration by an advisory committee. (2) The President may, from time to time, extend the period for which a person is directed to be under the supervision of the police by any order confirmed under section 31(3) and may at any time refer any such order for further consideration by an advisory committee."
    },
    {
      "provision_ref": "s38A",
      "chapter": "PART 5 - DETENTION",
      "section": "38A",
      "title": "Revocation of orders",
      "content": "38A. The Minister may, at any time, revoke an order made under section 30(1) or 32, whether or not the order has been confirmed under section 31(3) or extended under section 38. [12/2018]"
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 5 - DETENTION",
      "section": "39",
      "title": "Constitution of advisory committees",
      "content": "39. For the purposes of this Act, the Minister may from time to time appoint one or more advisory committees each consisting of not less than 2 persons."
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 5 - DETENTION",
      "section": "40",
      "title": "Powers and procedure of advisory committees",
      "content": "40. —(1) Every advisory committee shall for the purposes of this Act have all the powers of a court for the summoning and examination of witnesses, the administration of oaths or affirmations and for compelling the production of documents. (2) Every member of an advisory committee shall be deemed to be a public servant within the meaning of the Penal Code 1871 and shall have in case of any action or suit brought against him for any act done or omitted to be done in the execution of his duty under the provisions of this Act the like protection and privileges as are by law given to a Judge in the execution of his office. (3) Every advisory committee shall have regard to the requirements of public safety, the protection of individuals and the safeguarding of sources of information and subject to the provisions of this Act and any rules made under section 49 may regulate its own procedure."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 5 - DETENTION",
      "section": "41",
      "title": "Disclosure of information",
      "content": "41. Nothing in this Act or in any rules made under section 49 shall require the Minister or any other public servant to disclose facts which he considers it to be against the public interest to disclose."
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 5 - DETENTION",
      "section": "42",
      "title": "Manner of detention and powers to order removal",
      "content": "42. —(1) Every person detained in pursuance of an order made under section 30(1) shall be detained in such place as the Minister may direct and in accordance with instructions issued by the Minister. [12/2018] (2) The Minister may by order direct the removal from any place of detention to another place of detention to be specified in the order of any person detained in pursuance of an order made under section 30(1). [12/2018] (3) On proof to his satisfaction that the presence at any place of any person detained in pursuance of an order made under section 30(1) is required in the interests of justice, or for the purpose of any inquiry, or in the public interest or in the interest of the person detained, the Minister may order that the person be taken to that place. [12/2018] (4) Any person in the course of removal under subsection (2) or in the course of being taken to any place in pursuance of subsection (3) and when so removed or while at that place shall be kept in such custody as the Minister may direct and while in that custody shall be deemed to be in lawful custody."
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 5 - DETENTION",
      "section": "43",
      "title": "Temporary release of detainees to engage in employment",
      "content": "43. —(1) The Minister may, from time to time, on the recommendation of an advisory committee appointed for the purposes of this section, direct that a detainee shall be released from day to day to engage in such employment (including self‑employment) as the Minister may specify. (2) Any direction made under subsection (1) shall have effect for a period to be fixed by the Minister and may be subject to such conditions and restrictions as may be imposed by the Minister. (3) The Minister may at any time revoke any direction made under subsection (1). (4) The Minister may, subject to such conditions and restrictions as he thinks fit, grant leave to a detainee in respect of whom a direction has been made under subsection (1) to spend his leave at such place as the Minister may specify. (5) The Minister may at any time revoke any leave granted to a detainee under subsection (4). (6) Where any direction made under subsection (1) is in force in respect of a detainee or any leave is granted under subsection (4) to a detainee, the superintendent of the place of detention shall release the detainee at such times and for such periods as are necessary to give effect to the direction or grant of leave. (7) If any detainee in respect of whom a direction has been made under subsection (1) or leave has been granted under subsection (4) remains at large without lawful excuse or fails to return to his place of detention after the direction or leave has been revoked, he shall be deemed to be unlawfully at large and to have escaped from lawful custody. (8) Every person released under this section shall continue to be in the legal custody of the superintendent of the place of detention from which he is released during every period for which he is so released. (9) For the purposes of this section, “detainee” means any person who is detained in pursuance of an order made under section 30(1). [12/2018]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 5 - DETENTION",
      "section": "44",
      "title": "Power to detain suspected persons",
      "content": "44. —(1) Any police officer may, without warrant, arrest and detain pending enquiries any person in respect of whom he has reason to believe there are grounds which would justify the detention of the person under section 30(1). [12/2018] (2) No person shall be detained under this section for a period exceeding 24 hours except with the authority of a police officer of or above the rank of assistant superintendent or for a period of 48 hours in all. (3) If an officer of or above the rank of superintendent of police is satisfied that the necessary enquiries cannot be completed within the period of 48 hours he may authorise the further detention of the person for an additional period not exceeding 14 days and shall on giving such authorisation forthwith report the circumstances to the Commissioner of Police. (4) Any person detained under the powers conferred by this section shall be deemed to be in lawful custody and may be detained in any prison, or in any police station or in any other similar place authorised generally or specially by the Minister."
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 5 - DETENTION",
      "section": "45",
      "title": "Duty to arrest persons ordered to be detained",
      "content": "45. —(1) Any police officer may, without warrant, arrest any person found at large in respect of whom there is in existence a detention order made by the Minister under section 30(1) and shall forthwith report the arrest to the Commissioner of Police. [12/2018] (2) Any person arrested under subsection (1) shall be deemed to be in lawful custody and may be detained for a period not exceeding 48 hours in any prison or in any police station pending the issuing of instructions by the Minister for his further detention."
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 5 - DETENTION",
      "section": "46",
      "title": "Power to enter and search",
      "content": "46. Notwithstanding anything to the contrary in any written law, it shall be lawful for any police officer of or above the rank of assistant superintendent, or a police officer of any rank specially authorised by a police officer of or above the rank of assistant superintendent, in order to effect the arrest of any person in pursuance of the provisions of this Part, to enter and search any place and in order to effect an entrance into that place to break open any outer or inner door or window of that place if he cannot otherwise obtain admittance thereto."
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 5 - DETENTION",
      "section": "47",
      "title": "Officers of Central Narcotics Bureau to exercise powers conferred on police officers under sections 44, 45 and 46, etc.",
      "content": "47. —(1) Subject to this section, the powers conferred upon a police officer under sections 44, 45 and 46 may be exercised by an officer of the Central Narcotics Bureau. [12/2018] (2) The powers conferred upon a police officer of or above the rank of assistant superintendent under sections 44(2) and 46 may be exercised by the Director, a Deputy Director or a Divisional Director of the Central Narcotics Bureau. [2/2006; 12/2018] (3) The power conferred upon an officer of or above the rank of superintendent of police under section 44(3) may be exercised by the Director or a Deputy Director of the Central Narcotics Bureau. [2/2006] (4) Subject to subsection (5), where the power conferred upon an officer of or above the rank of superintendent of police under section 44(3), or the power conferred upon a police officer under section 45(1), is exercised by an officer of the Central Narcotics Bureau in accordance with this section, the duty to report to the Commissioner of Police under those sections shall be read as a duty to report in a similar manner to the Director of the Central Narcotics Bureau. (5) The duty to report to the Director of the Central Narcotics Bureau referred to in subsection (4) shall not apply where the power under section 44(3) or 45(1) was exercised by the Director of the Central Narcotics Bureau himself. (6) In any case relating to the commission of an offence under section 33(3), an officer of the Central Narcotics Bureau — ( a ) has all the powers of a police officer under the Criminal Procedure Code 2010 in relation to an investigation into an arrestable offence; and ( b ) for the purposes of exercising such powers, is deemed to be a police officer not below the rank of inspector of police. [12/2018] (7) In this section — “Director”, “Deputy Director” and “Divisional Director”, in relation to the Central Narcotics Bureau, mean the Director, a Deputy Director and a Divisional Director, respectively, of the Central Narcotics Bureau appointed under section 3 of the Misuse of Drugs Act 1973; “officer of the Central Narcotics Bureau” means the Director, a Deputy Director, a Divisional Director or any other officer of the Central Narcotics Bureau appointed under section 3 of the Misuse of Drugs Act 1973. [12/2018]"
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 5 - DETENTION",
      "section": "48",
      "title": "Powers of Public Prosecutor",
      "content": "48. Nothing in this Act derogates from the powers of the Public Prosecutor with regard to the control and direction of criminal prosecutions."
    },
    {
      "provision_ref": "s49",
      "chapter": "PART 5 - DETENTION",
      "section": "49",
      "title": "Rules",
      "content": "49. —(1) The Minister may make rules for the purpose of carrying into effect all or any of the provisions of this Part. (2) Without prejudice to the generality of the powers conferred by subsection (1), such rules may provide for — ( a ) the issue by the Commissioner of National Registration appointed under the National Registration Act 1965 of special identity cards to all or any class of persons subject to supervision; ( b ) the form, custody, production, inspection, cancellation, alteration, endorsement on and replacement of those cards and the substitution thereof for identity cards issued to those persons under any written law; and ( c ) all other matters necessary or desirable in connection with those cards or the carrying thereof or the enforcement of those rules, including the prescription of penalties not exceeding in respect of any offence a fine of $5,000 or imprisonment for a term of 3 years or both. [12/2018]"
    }
  ],
  "definitions": [
    {
      "term": "authorised officer",
      "definition": "“authorised officer” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "document",
      "definition": "“document” means any matter expressed or described upon any substance by means of letters, figures or marks, or by more than one of these means, and includes any banner, emblem or other insignia;",
      "source_provision": "s2"
    },
    {
      "term": "explosive substance",
      "definition": "“explosive substance” shall be deemed to include any materials for making any explosive substance and any bomb, grenade, apparatus, machine, implement or material used or intended to be used or adapted for causing or aiding in causing any explosion in or with any explosive substance and any part of such bomb, grenade, apparatus, machine or implement;",
      "source_provision": "s2"
    },
    {
      "term": "police officer",
      "definition": "“police officer” includes any member of the Special Constabulary constituted under Part 8 of the Police Force Act 2004;",
      "source_provision": "s2"
    },
    {
      "term": "subversive document",
      "definition": "“subversive document” means any document which contains — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "supplies",
      "definition": "“supplies” includes money, food, drink, clothing, rubber, tin or other valuable commodity, any medicine or drug or other medical supplies, and any material or instrument or part thereof for printing, typewriting or duplicating words or objects in visible form.",
      "source_provision": "s2"
    },
    {
      "term": "Commissioner",
      "definition": "“Commissioner” means the Commissioner for Labour, and includes any Deputy or Assistant Commissioner for Labour;",
      "source_provision": "s5"
    },
    {
      "term": "essential service",
      "definition": "“essential service” means any service, business, trade, undertaking, manufacture or calling included in Part 1 of the First Schedule;",
      "source_provision": "s5"
    },
    {
      "term": "lock-out",
      "definition": "“lock-out” means the closing of a place of employment or the suspension of work, or the refusal by an employer to continue to employ any number of persons employed by him in consequence of a trade dispute, done with a view to compelling those persons, or to aid another employer in compelling persons employed by him, to accept terms or conditions of or affecting employment;",
      "source_provision": "s5"
    },
    {
      "term": "public health service",
      "definition": "“public health service” means — ( a )",
      "source_provision": "s5"
    },
    {
      "term": "strike",
      "definition": "“strike” means the cessation of work by a body of persons employed in any essential service acting in combination, or a concerted refusal or a refusal under a common understanding of a number of persons who are or who have been so employed to continue to work or to accept employment;",
      "source_provision": "s5"
    },
    {
      "term": "workman",
      "definition": "“workman” means any person who has entered into or works under a contract with an employer, whether the contract be for manual labour, clerical work or otherwise, be expressed or implied, oral or in writing, and whether it be a contract of service or of apprenticeship or a contract personally to execute any work, and includes, for the purposes of any proceedings under this Part in relation to a trade dispute, a workman discharged during that dispute.",
      "source_provision": "s5"
    },
    {
      "term": "appropriate consent",
      "definition": "“appropriate consent” means — ( a )",
      "source_provision": "s27"
    },
    {
      "term": "authorised analyst",
      "definition": "“authorised analyst” means a person appointed by the Commissioner of Police to be an analyst;",
      "source_provision": "s27"
    },
    {
      "term": "body sample",
      "definition": "“body sample” means — ( a )",
      "source_provision": "s27"
    },
    {
      "term": "DNA",
      "definition": "“DNA” means deoxyribonucleic acid;",
      "source_provision": "s27"
    },
    {
      "term": "DNA information",
      "definition": "“DNA information” means genetic information derived from the forensic DNA analysis of a body sample;",
      "source_provision": "s27"
    },
    {
      "term": "finger impression",
      "definition": "“finger impression” includes thumb impression and palmar impression;",
      "source_provision": "s27"
    },
    {
      "term": "invasive sample",
      "definition": "“invasive sample” means any body sample that is obtained by means of any invasive procedure, but does not include any sample described in subsection (3); [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s27"
    },
    {
      "term": "other particulars",
      "definition": "“other particulars” , in relation to a person, means any particulars, information or description of that person, other than his registrable particulars, that may be relevant or useful in the identification of that person;",
      "source_provision": "s27"
    },
    {
      "term": "photograph",
      "definition": "“photograph” , in relation to a person, includes the photograph of any distinguishing feature or mark on the body of that person;",
      "source_provision": "s27"
    },
    {
      "term": "registered medical practitioner",
      "definition": "“registered medical practitioner” has the meaning given by the Medical Registration Act 1997 and includes a dentist registered under the Dental Registration Act 1999;",
      "source_provision": "s27"
    },
    {
      "term": "registrable particulars",
      "definition": "“registrable particulars” means the particulars of any detention or supervision order made under section 30(1), 32 or 38 and any name, description, photograph or finger impression of, or document relating to, any person so detained or placed under supervision, as the case may be. [32/2004; 22/2007; 12/2018]",
      "source_provision": "s27"
    },
    {
      "term": "Director",
      "definition": "“Director” , “Deputy Director” and “Divisional Director”, in relation to the Central Narcotics Bureau, mean the Director, a Deputy Director and a Divisional Director, respectively, of the Central Narcotics Bureau appointed under section 3 of the Misuse of Drugs Act 1973;",
      "source_provision": "s47"
    },
    {
      "term": "officer of the Central Narcotics Bureau",
      "definition": "“officer of the Central Narcotics Bureau” means the Director, a Deputy Director, a Divisional Director or any other officer of the Central Narcotics Bureau appointed under section 3 of the Misuse of Drugs Act 1973. [12/2018]",
      "source_provision": "s47"
    }
  ]
}