{
  "id": "cmca-1997",
  "type": "statute",
  "title": "Community Mediation Centres Act 1997",
  "title_en": "Community Mediation Centres Act 1997",
  "short_name": "CMCA1997",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CMCA1997",
  "description": "An Act to provide for the establishment and operation of Community Mediation Centres to provide mediation services connected with certain disputes.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Community Mediation Centres Act 1997."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “Community Mediation Centre” means a Community Mediation Centre established under section 3; “Director” means a person holding office or duly acting as Director of a Community Mediation Centre; “functions” includes powers, authorities and duties; “mediation” includes — ( a ) the undertaking of any activity for the purpose of promoting the discussion and settlement of disputes; ( b ) the bringing together of the parties to any dispute for that purpose, either at the request of one of the parties to the dispute or on the initiative of a Director; and ( c ) the follow-up of any matter that is the subject of any such discussion or settlement; “mediation session” means a meeting in accordance with this Act between 2 or more parties who are in dispute on any matter; “mediator”, in relation to a Community Mediation Centre, means — ( a ) the Director of the Centre; or ( b ) any person for the time being appointed under section 8 as a mediator for the Centre. (2) A reference in this Act to the exercise of a function includes, where the function is a duty, a reference to the performance of the duty. (3) A reference in this Act to the parties to a mediation session includes a reference to the parties to a dispute in respect of which an application for a mediation session is duly made, but does not include a reference to the mediator conducting the mediation session. (4) A reference in this Act to the conduct of a mediation session by a mediator includes a reference to the conduct of a mediation session in the presence, or under the supervision, of the mediator."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - COMMUNITY MEDIATION CENTRES",
      "section": "3",
      "title": "Establishment of Community Mediation Centres",
      "content": "3. Community Mediation Centres are established at any premises that the Minister may, by order in the Gazette , determine and must be operated in accordance with this Act for the purpose of providing mediation services."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - COMMUNITY MEDIATION CENTRES",
      "section": "4",
      "title": "Directors",
      "content": "4. The Minister must appoint a Director for each Community Mediation Centre and the same person may be the Director for more than one Community Mediation Centre."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - COMMUNITY MEDIATION CENTRES",
      "section": "5",
      "title": "Delegation by Director",
      "content": "5. —(1) The Director of a Community Mediation Centre may authorise any member of the staff, employee or officer of the Centre to exercise such of the Director’s functions (except for this power of authorisation) as the Director thinks fit, and the Director may revoke wholly or in part any such authorisation. (2) A function which is authorised to be exercised under this section may, while the authorisation remains unrevoked, be exercised from time to time in accordance with the terms of the authorisation. (3) An authorisation under this section may be made subject to conditions or limitations. (4) Despite any authorisation under this section, the Director may continue to exercise all or any of the functions to which the authorisation relates. (5) Any act or thing done in the exercise of a function by a person authorised under this section to exercise the function has the same force and effect as if done by the Director."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - COMMUNITY MEDIATION CENTRES",
      "section": "6",
      "title": "Place of operation of Community Mediation Centres",
      "content": "6. —(1) The principal office of a Community Mediation Centre must be at the premises specified in relation to the Centre in the order under section 3. (2) The activities of a Community Mediation Centre may be conducted at its principal office or at any other places that its Director may approve from time to time."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - COMMUNITY MEDIATION CENTRES",
      "section": "7",
      "title": "Records",
      "content": "7. —(1) The Director of a Community Mediation Centre must ensure that such records relating to the activities of the Centre are made and kept as are necessary or appropriate to enable a proper evaluation of Community Mediation Centres under section 16 to be made. (2) The records of a Community Mediation Centre relating to any dispute before a mediator in the Centre must be kept for a period of 3 years after the date the dispute is settled before the mediator, or the date of withdrawal from or termination of the mediation, as the case may be."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - COMMUNITY MEDIATION CENTRES",
      "section": "8",
      "title": "Mediators",
      "content": "8. —(1) The Minister may, on the recommendation of the Director of a Community Mediation Centre, appoint any person (other than the Director) as a mediator for the Centre and may revoke the appointment. (2) A mediator appointed under subsection (1) is entitled to be paid such remuneration as the Minister may determine and must abide by the terms of any Code of Conduct as the Minister may approve."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - MEDIATION",
      "section": "9",
      "title": "Provision of mediation services",
      "content": "9. —(1) The Director of a Community Mediation Centre is responsible for the provision of mediation services and for the operation and management of the Centre. (2) Each mediation session must be conducted by one or more mediators assigned for the purpose by the Director. (3) Subject to sections 15, 15A and 15B and the Community Disputes Resolution Act 2015, a dispute must not be accepted for mediation except with the consent of the Director of a Community Mediation Centre who may decline to consent to the acceptance of any dispute for mediation under this Act at the Centre. [7/2015; 33/2018] [Act 43 of 2024 wef 24/03/2025] (4) A mediation session may be terminated at any time by the mediator or by the Director."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - MEDIATION",
      "section": "10",
      "title": "Conduct of mediation sessions",
      "content": "10. —(1) The procedure for starting and conducting a mediation session at a Community Mediation Centre is to be determined by its Director. (2) Mediation sessions must be conducted with as little formality and technicality, and with as much expedition, as possible. (3) The rules of evidence do not apply to mediation sessions. (4) A dispute may not be adjudicated or arbitrated upon at a mediation session. (5) A mediation session must be conducted in the absence of the public, but persons who are not parties to a mediation session may, with the permission of the Director and the parties, be present at or participate in a mediation session."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - MEDIATION",
      "section": "11",
      "title": "Disputes",
      "content": "11. —(1) Subject to sections 9(3), 15 and 15A and the Community Disputes Resolution Act 2015, any person may refer to a mediator of a Community Mediation Centre for mediation a case concerning a family, social or community dispute that does not involve a seizable offence under any written law. [7/2015; 33/2018] (2) A mediation session may be started or continued whether or not the dispute is justiciable before any court, tribunal or body and whether or not the dispute is the subject of any legal proceedings. (3) For the purposes of this Act, persons may be treated as being in dispute on any matter if they are not in agreement on the matter (whether or not any relevant negotiations are still in progress)."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - MEDIATION",
      "section": "12",
      "title": "Mediation to be voluntary",
      "content": "12. —(1) Attendance at and participation in a mediation session is voluntary. (2) A party to a mediation session may withdraw from the mediation session at any time. (2A) Subsections (1) and (2) do not apply to a mediation session that takes place because of a referral under any of the following provisions: ( a ) section 15; ( b ) section 13M or 30 of the Community Disputes Resolution Act 2015; ( c ) section 18A of the Small Claims Tribunals Act 1984. [Act 43 of 2024 wef 24/03/2025] (3) Attendance at, participation in or withdrawal from, a mediation session conducted under this Act does not affect any rights or remedies that a party to a dispute has apart from this Act."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - MEDIATION",
      "section": "13",
      "title": "Settlement or agreement to be reduced to writing",
      "content": "13. —(1) The terms of any settlement or agreement reached at, or drawn up pursuant to, a mediation session must, if the mediator thinks fit, be reduced to writing and signed by or on behalf of the parties to the mediation session. (2) No settlement or agreement is binding on the parties to a mediation session unless it has been reduced to writing with a statement signed by or on behalf of the parties to this effect."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - MEDIATION",
      "section": "14",
      "title": "Representation by agent",
      "content": "14. —(1) A party to a mediation session is not entitled to be represented by an agent unless — ( a ) it appears to the Director that — (i) an agent should be permitted to facilitate mediation; and (ii) the agent proposed to be appointed has sufficient knowledge of the matter in dispute to enable the agent to represent the party effectively; and ( b ) the Director so approves. (1A) Despite subsection (1), in the case of a mediation mentioned in section 12(2A), the Director must not approve the representation of a party by an agent unless — ( a ) the party authorises the agent in writing to represent the party at the mediation session and to agree on the party’s behalf to the terms of any settlement or agreement reached at, or drawn up under, the mediation session; and ( b ) the agent signifies in writing that he or she is willing to represent the party at the mediation session. [Act 43 of 2024 wef 24/03/2025] (2) Subsection (1) does not prevent — ( a ) where a body corporate is a party to a mediation session — an officer of the body corporate; ( b ) where a corporation that is a body corporate constituted under section 10A of the Land Titles (Strata) Act 1967 is a party to a mediation session — a council or committee member or its managing agent; ( c ) where a statutory body is a party to a mediation session — an officer of the statutory body; or ( d ) where a society registered under section 4 or 4A of the Societies Act 1966 is a party to a mediation session — an officer of the society as defined in section 2 of that Act, from representing that company, corporation, body corporate or society, as the case may be. [4/2010] (3) Where a Director approves of the representation of a party by an agent, the approval of the Director may be given subject to any conditions that the Director considers reasonable to ensure that any other party to the mediation session is not substantially disadvantaged by the agent appearing at the mediation session and, where the Director does so, the entitlement of the agent to represent the party is subject to compliance by the agent with those conditions. (4) This section does not apply to a claim referred to a mediator of a Community Mediation Centre under section 18A of the Small Claims Tribunals Act 1984. [33/2018]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - MEDIATION",
      "section": "15",
      "title": "Referral of cases by Magistrate",
      "content": "15. —(1) Despite any provision of this Act or any written law, a Magistrate who receives a complaint made by a private person under section 151 of the Criminal Procedure Code 2010 may, if — ( a ) the offence is one for which a summons must ordinarily issue in the first instance according to the fourth column of the First Schedule to the Criminal Procedure Code 2010; and ( b ) the Magistrate is of the opinion, from the nature of the case or the attitude of the parties or both, that the matter may more appropriately be resolved by mediation, refer the complaint to a mediator of a Community Mediation Centre for mediation with or without the consent of both the complainant and the person complained against. [6/2004; 15/2010] (2) In making any referral under subsection (1), the Magistrate may order the complainant or the person complained against to attend (personally or by a representative permitted under section 14) before a mediator of a Community Mediation Centre — ( a ) at a time and place to be specified in the Magistrate’s order; and ( b ) in a case where the mediation is to be conducted by electronic communication, video conference or other electronic means, at a time to be specified in the Magistrate’s order and in accordance with the electronic means specified in the Magistrate’s order. [Act 43 of 2024 wef 24/03/2025] (3) In a referral by a Magistrate under this section, the mediator of a Community Mediation Centre must record and notify the Magistrate of the outcome of the mediation to enable the Magistrate to take any further action that the Magistrate thinks fit under the provisions of the Criminal Procedure Code 2010."
    },
    {
      "provision_ref": "s15A",
      "chapter": "PART 3 - MEDIATION",
      "section": "15A",
      "title": "Referral of cases under Small Claims Tribunals Act 1984",
      "content": "15A. —(1) Where a claim is referred by a specified person to a mediator of a Community Mediation Centre under section 18A of the Small Claims Tribunals Act 1984 — ( a ) a party to the claim who is required to attend the mediation under that section may do so personally or by a representative permitted under section 23(2) of that Act; and ( b ) the mediator must record and notify the specified person of the outcome of the mediation. [33/2018] (2) In this section, “specified person” means a tribunal or the Registrar as defined in section 2(1) of the Small Claims Tribunals Act 1984. [33/2018]"
    },
    {
      "provision_ref": "s15B",
      "chapter": "PART 3 - MEDIATION",
      "section": "15B",
      "title": "Referral of cases under Community Disputes Resolution Act 2015",
      "content": "15B. —(1) Where a complaint or dispute is referred by a specified person under section 13M of the Community Disputes Resolution Act 2015 to a mediator of a Community Mediation Centre — ( a ) a party to the complaint or dispute who is required to attend the mediation under section 13M of that Act may do so personally or by a representative in accordance with that section; and ( b ) the mediator must record and notify the specified person of the outcome of the mediation. (2) Where a claim is referred by the Registrar or a tribunal judge under section 30 of the Community Disputes Resolution Act 2015 to a mediator of a Community Mediation Centre — ( a ) a party to the complaint or dispute who is required to attend the mediation under section 30 of that Act may do so personally or by a representative in accordance with that section; and ( b ) the mediator must record and notify the Registrar or tribunal judge (as the case may be) of the outcome of the mediation. (3) In this section — “Registrar” has the meaning given by section 2 of the Community Disputes Resolution Act 2015; “specified person” means a person mentioned in section 13M(2) of the Community Disputes Resolution Act 2015; “tribunal judge” means a District Judge designated as a tribunal judge for the Community Disputes Resolution Tribunals under section 14(1)( b ) of the Community Disputes Resolution Act 2015. [Act 43 of 2024 wef 24/03/2025]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "16",
      "title": "Evaluation",
      "content": "16. The Minister may cause or arrange for an evaluation to be made, at such times and in respect of such periods as the Minister thinks fit, of the Community Mediation Centres and of their operation and activities."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "17",
      "title": "Exoneration from liability",
      "content": "17. —(1) No matter or thing done or omitted to be done by — ( a ) a mediator; or ( b ) a Director or any member of the staff, employee or officer of a Community Mediation Centre, shall, if the matter or thing was done in good faith for the purpose of executing the provisions of this Act and did not involve any fraud or wilful misconduct, subject any of them to any action, liability, claim or demand. (2) No person shall be concerned to inquire whether or not any circumstance has arisen requiring or authorising a person to act in the office of a Director, and anything done or omitted to be done by that person while so acting is as valid and effectual and has the same consequences as if it had been done or omitted to be done by that Director."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "18",
      "title": "Order to attend court or order to produce documents in litigation or arbitration",
      "content": "18. —(1) A registrar must not, for the purpose of any court proceedings which relate to or are connected with a dispute referred to a mediator of a Community Mediation Centre, issue — ( a ) an order for the attendance before the court of the mediator, the Director or any member of the staff, employee or officer of the Community Mediation Centre; or [Act 25 of 2021 wef 01/04/2022] ( b ) an order for the production to the court of any of the records or documents of the Centre, unless the registrar is satisfied that, having regard to all the circumstances of the case, the attendance or production is necessary for the fair disposal of the case or to save costs. [42/2005] [Act 25 of 2021 wef 01/04/2022] (2) Where an order is made by the registrar under subsection (1)( b ), it is sufficient compliance for the Centre to produce certified true copies of any of the records or documents and such copies are, subject to section 19, admissible as evidence of the facts stated or contained therein. (3) In this section — “court” includes an arbitral tribunal; “registrar” means — ( a ) the Registrar, the Deputy Registrar or an Assistant Registrar of the Supreme Court, in any case where proceedings are taken in the General Division of the High Court (other than the Family Division thereof), the Appellate Division of the High Court or the Court of Appeal; ( b ) the registrar, the deputy registrar or an assistant registrar of the Family Justice Courts, in any case where proceedings are taken in the Family Division of the High Court, a Family Court or a Youth Court; or ( c ) the registrar or a deputy registrar of the State Courts, in any case where proceedings are taken in a State Court. [27/2014; 40/2019] [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "19",
      "title": "Privilege",
      "content": "19. —(1) Subject to subsection (2), the like privilege with respect to defamation that exists with respect to judicial proceedings and a document produced in judicial proceedings exists with respect to — ( a ) a mediation session; or ( b ) a document or other material sent to, or produced at, a Community Mediation Centre for the purpose of enabling a mediation session to be arranged. (2) The privilege conferred by subsection (1) does not extend to a publication made otherwise than — ( a ) at a mediation session; ( b ) as provided by subsection (1)( b ); or ( c ) as provided by section 20. (3) Evidence of anything said or of any admission made in a mediation session is not admissible in any proceedings before any court, tribunal or body. (4) A document prepared for the purposes of, or in the course of, or pursuant to, a mediation session, or any copy thereof is not admissible in evidence in any proceedings before any court, tribunal or body. (5) Subsections (3) and (4) do not apply with respect to any evidence or document — ( a ) where the persons in attendance at or named during the mediation session and, in the case of a document, all persons named in the document, consent to admission of the evidence or document; ( b ) in proceedings instituted with respect to any act or omission in connection with which a disclosure has been made under section 20( c ); or ( c ) if the court is satisfied that, having regard to all the circumstances of the case, the admission of the evidence or document is necessary for the fair disposal of the case or to save costs. (6) In this section, “mediation session” includes any step taken — ( a ) in the course of making arrangements for a mediation session; or ( b ) in the course of the follow-up of a mediation session."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "20",
      "title": "Secrecy",
      "content": "20. A person who is a mediator, a Director, a member of the staff of a Community Mediation Centre or a person making an evaluation under section 16 or carrying out research mentioned in paragraph ( e ) may disclose information obtained in connection with the administration or execution of this Act only as follows: ( a ) with the consent of the person from whom the information was obtained; ( b ) in connection with the administration or execution of this Act; ( c ) where there are reasonable grounds to believe that disclosure is necessary to prevent or minimise the danger of injury to any person or damage to any property; ( d ) where the disclosure is reasonably required for the purpose of referring any party or parties to a mediation session to any person, agency, organisation or other body and the disclosure is made with the consent of the parties to the mediation session for the purpose of aiding in the resolution of a dispute between those parties or assisting any such parties in any other manner; ( e ) where the disclosure does not reveal the identity of a person without the person’s consent and is reasonably required for the purposes of research carried out by, or with the approval of, the Director or an evaluation under section 16; ( f ) in accordance with any order of the court or a requirement imposed by or under any written law. 21. [ Repealed by Act 16 of 2016 ]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "22",
      "title": "Public servants",
      "content": "22. The Director and all members of the staff, employees and officers of Community Mediation Centres are deemed to be public servants for the purposes of the Penal Code 1871."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "23",
      "title": "Power to make regulations",
      "content": "23. —(1) The Minister may make regulations to — ( a ) regulate the practice and procedure of Community Mediation Centres; ( b ) provide for the training and accreditation of mediators of Community Mediation Centres; and ( c ) prescribe all matters as are necessary or expedient for the proper administration, or to achieve the objects and purposes, of this Act. (2) All regulations made under this section must be presented to Parliament as soon as possible after publication in the Gazette ."
    }
  ],
  "definitions": [
    {
      "term": "Community Mediation Centre",
      "definition": "“Community Mediation Centre” means a Community Mediation Centre established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Director",
      "definition": "“Director” means a person holding office or duly acting as Director of a Community Mediation Centre;",
      "source_provision": "s2"
    },
    {
      "term": "functions",
      "definition": "“functions” includes powers, authorities and duties;",
      "source_provision": "s2"
    },
    {
      "term": "mediation",
      "definition": "“mediation” includes — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "mediation session",
      "definition": "“mediation session” means a meeting in accordance with this Act between 2 or more parties who are in dispute on any matter;",
      "source_provision": "s2"
    },
    {
      "term": "mediator",
      "definition": "“mediator” , in relation to a Community Mediation Centre, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Registrar",
      "definition": "“Registrar” has the meaning given by section 2 of the Community Disputes Resolution Act 2015;",
      "source_provision": "s15B"
    },
    {
      "term": "specified person",
      "definition": "“specified person” means a person mentioned in section 13M(2) of the Community Disputes Resolution Act 2015;",
      "source_provision": "s15B"
    },
    {
      "term": "tribunal judge",
      "definition": "“tribunal judge” means a District Judge designated as a tribunal judge for the Community Disputes Resolution Tribunals under section 14(1)( b ) of the Community Disputes Resolution Act 2015. [Act 43 of 2024 wef 24/03/2025]",
      "source_provision": "s15B"
    },
    {
      "term": "court",
      "definition": "“court” includes an arbitral tribunal;",
      "source_provision": "s18"
    },
    {
      "term": "registrar",
      "definition": "“registrar” means — ( a )",
      "source_provision": "s18"
    }
  ]
}