{
  "id": "csca-2001",
  "type": "statute",
  "title": "Civil Service College Act 2001",
  "title_en": "Civil Service College Act 2001",
  "short_name": "CSCA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CSCA2001",
  "description": "An Act to establish the Civil Service College, to provide for its functions and powers, and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Civil Service College Act 2001."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Board” means the Board of Directors of the College established under section 5; “Chairperson” means the Chairperson of the Board appointed under section 5(2) and includes a temporary Chairperson appointed under section 8; “Chief Executive” means the Chief Executive of the College, and includes any individual acting in that capacity; “College” means the Civil Service College established under section 3; “incorporated departments” means the departments of the Prime Minister’s Office formerly known as the Civil Service College and the Personnel Guidance Unit; “member” means a member of the Board and includes the Chairperson; “officers in the public sector” means public officers and officers and employees of any public body; “public body” means any body, board or authority established by or under any written law to perform or discharge any public function; “public sector” means the Government and any public body. [9/2003; 5/2018]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "3",
      "title": "Establishment and incorporation of Civil Service College",
      "content": "3. A body called the Civil Service College is established, which is a body corporate with perpetual succession and a common seal and is by that name capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing, or disposing of property, both movable and immovable; and ( c ) doing and suffering all such other acts or things as a body corporate may lawfully do and suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "4",
      "title": "Common seal",
      "content": "4. —(1) The College must have a common seal and such seal may be broken, changed, altered or made anew as the College thinks fit. (2) All deeds and other documents requiring the seal of the College must be sealed with the common seal of the College. (3) All instruments to which the common seal is affixed must be signed by — ( a ) any 2 members generally or specially authorised by the Board for the purpose; or ( b ) one member and the Chief Executive. (4) The Board may, by resolution or otherwise in writing, appoint an officer of the College or any other agent either generally or in any particular case to execute or sign on behalf of the College any agreement or other instrument not under seal in relation to any matter coming within the powers of the College. (5) All courts, judges and persons acting judicially are to take judicial notice of the common seal of the College affixed to any document and presume that it was duly affixed."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "5",
      "title": "Board of Directors",
      "content": "5. —(1) There is to be a Board of Directors of the College which is the executive body of the College and may exercise all the powers conferred on the College under this Act. [9/2003] (2) The Board consists of — ( a ) a Chairperson; and ( b ) not less than 5 but not more than 15 other members, all of whom must be appointed by the Minister. (3) The Minister may appoint the Chief Executive to be a member of the Board."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "6",
      "title": "Chairperson may delegate functions",
      "content": "6. The Chairperson may in writing authorise any member to exercise any power or perform any function conferred on the Chairperson by or under this Act."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "7",
      "title": "Term of office of members",
      "content": "7. —(1) A member holds office on such conditions and for such term as the Minister specifies in the appointment. (2) Any member may resign from his or her office at any time by giving not less than one month’s notice in writing to the Minister. (3) The Minister may at any time revoke the appointment of any member as the Minister considers necessary in the interest of the effective performance of the functions of the College under this Act, or in the public interest. (4) If a member dies or resigns or has his or her appointment revoked, the Minister may appoint any person to fill the vacancy for the remainder of the term for which the vacating member was appointed. (5) The College is to pay to the Chairperson and other members, out of the funds of the College, such salaries, fees and allowances as the Minister may determine."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "8",
      "title": "Temporary Chairperson",
      "content": "8. If the Chairperson is absent from Singapore, or for any other reason unable to discharge his or her functions, the Minister may appoint one of the members to act as a temporary Chairperson."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "9",
      "title": "Meetings and proceedings of Board",
      "content": "9. —(1) The quorum at every meeting of the Board is the higher of the following: ( a ) one-third of the total number of members; ( b ) 3 members. [25/2009] (2) The Chairperson presides at all meetings of the Board and, in his or her absence, the members present must elect one of their number to preside. (3) Meetings of the Board must be held at such times and places as the Chairperson may determine. (4) All questions arising at any meeting must be decided by a majority of votes of the members present and voting. (5) At any meeting of the Board, the Chairperson or, in the Chairperson’s absence, the member presiding at the meeting has a deliberative vote and, in the case of an equality of votes, he or she also has a casting vote. (6) The validity of any proceedings of the Board is not affected by any vacancy among its members or by any defect in the appointment of any member. (7) Subject to the provisions of this Act and the Public Sector (Governance) Act 2018, the Board may regulate its own proceedings. [5/2018] 10. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "11",
      "title": "Committees",
      "content": "11. —(1) The Board may appoint committees consisting of one or more persons (whether members or not) and define or vary the terms of reference of those committees. (2) Subject to the provisions of this Act and the Public Sector (Governance) Act 2018 and to the control of the Board, each committee appointed under this section may regulate its procedure in any manner that the committee thinks fit. [5/2018]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION OF CIVIL SERVICE COLLEGE",
      "section": "12",
      "title": "Delegation of powers",
      "content": "12. —(1) The Board may, in respect of a specified matter or class of matters, by writing, delegate any of its powers to — ( a ) a member; ( b ) a committee of the Board; or ( c ) an officer of the College. (2) Every member, committee or officer purporting to act pursuant to a delegation under this section is, in the absence of proof to the contrary, presumed to be acting in accordance with the terms of the delegation."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - FUNCTIONS, OBJECTS, DUTIES AND POWERS OF COLLEGE",
      "section": "13",
      "title": "Functions, objects and duties of College",
      "content": "13. —(1) Subject to the provisions of this Act, the functions, objects and duties of the College are — ( a ) to provide training for the development of officers in the public sector; ( b ) to equip officers in the public sector with the appropriate values, workplace skills and management tools; ( c ) to promote lifelong learning among officers in the public sector; ( d ) to promote organisational excellence in the public sector; ( e ) to provide organisational development and consultancy services to the public sector; ( f ) to provide personnel assessment and selection services to the public sector; ( g ) to represent the Government internationally on matters related to or connected with the development of officers in the public sector and organisational excellence; ( h ) to engage in research relevant to the development of officers in the public sector and organisational excellence; and ( i ) to carry out any other functions that are imposed upon the College by or under this Act or any other written law. (2) The Minister may give to the College any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (3) Nothing in this section is to be construed as imposing on the College, directly or indirectly, any form of duty or liability enforceable by proceedings before any court."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - FUNCTIONS, OBJECTS, DUTIES AND POWERS OF COLLEGE",
      "section": "14",
      "title": "Powers of College",
      "content": "14. —(1) The College has power to do anything for the purpose of discharging its functions, objects and duties under this Act, or which is incidental or conducive to the discharge of those functions, objects or duties and, in particular, may — ( a ) establish and maintain facilities for the provision of services and conduct of activities related to or connected with the functions, objects or duties of the College; ( b ) collaborate with and assist any person in the provision and promotion of services and activities related to or connected with the functions, objects or duties of the College; ( c ) organise any courses and programmes for, and render any advice, consultancy and services to, the public sector and any other person or body in Singapore or elsewhere on any matter related to or connected with the functions, objects or duties of the College; ( d ) provide and hold tests and examinations, and grant certificates, awards and other qualifications (other than degrees), for the attainment of relevant skills, competencies and achievements; ( e ) provide financial support and assistance, including but not limited to loans, advances, grants, scholarships and aids to employees, students and any other person for all or any of the purposes of this Act; ( f ) enter into any contracts that may be necessary or expedient for the purpose of discharging the functions, objects or duties of the College; ( g ) lease, let, develop or otherwise utilise any property, movable or immovable, vested in or acquired by the College on any terms and conditions that the College thinks fit; ( h ) form or participate in the formation of any company, partnership or joint venture as a shareholder or partner or in any other capacity, and to share profits; ( i ) collect, analyse, compile, publish or disseminate information of a statistical nature; ( j ) become a member or affiliate of any international body the functions, objects or duties of which are similar to those of the College; ( k ) charge fees or commissions for services rendered by the College and for the use of any of its facilities; ( l ) carry out promotional activities or publicity in any form; ( m ) receive donations, grants, gifts, subsidies or contributions from any source, and raise funds by all lawful means; ( n ) publish or sponsor the publication of works on any matter related to the functions, objects or duties of the College; and ( o ) provide recreational facilities and promote recreational activities for, and activities conducive to, the welfare of officers or employees of the College and members of their families. (2) The College may, in addition to the powers vested in it by subsection (1), exercise any other powers that the Minister may in writing authorise the College to exercise. (3) This section is not to be construed as limiting any power of the College conferred by or under any other written law."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "15",
      "title": "Chief Executive, officers and employees, etc.",
      "content": "15. —(1) There must be a Chief Executive of the College, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The College may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive during any period, or during all periods, when the Chief Executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018] (3) The College may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on any terms and conditions that it may determine, any other officers, employees, consultants and agents that may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "16",
      "title": "Protection from personal liability",
      "content": "16. No suit or other legal proceedings shall lie personally against any officer or employee of the College, member or person acting under the direction of the College, for anything which is in good faith done or intended to be done in the execution or purported execution of this Act or any other written law. 17. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "18",
      "title": "Financial year",
      "content": "18. The financial year of the College begins on 1 April each year and ends on 31 March of the succeeding year."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "19",
      "title": "Estimates",
      "content": "19. A summary of the annual estimates and supplementary estimates adopted by the College must be published in the Gazette ."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "20",
      "title": "Funds of College",
      "content": "20. The funds of the College consist of — ( a ) all moneys transferred to the College under section 30; ( b ) all moneys received by the College by way of grants or subsidies; ( c ) all gifts, donations and contributions to the College; ( d ) all fees, charges, commissions, rents, interests, dividends and other income accruing to the College; ( e ) all moneys borrowed by the College under this Act; ( f ) all moneys recovered or collected under this Act by the College or any officer or employee of the College; and ( g ) all other moneys lawfully received by the College for the purposes of the College."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "21",
      "title": "Grants-in-aid",
      "content": "21. For the purpose of enabling the College to carry out its functions under this Act, the Minister may make grants‑in‑aid to the College of such sums of money, as the Minister may determine, out of moneys to be provided by Parliament."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "22",
      "title": "Power to borrow",
      "content": "22. For the discharge of its functions or duties under this Act or any other written law, the College may raise loans from the Government or, with the approval of the Minister for Finance, raise loans from banks or other financial institutions (whether in Singapore or elsewhere) by — ( a ) mortgage, overdraft or otherwise; ( b ) charge, whether legal or equitable, on any property vested in the College or on any other revenue receivable by the College under this Act or any other written law; or ( c ) the creation and issue of debentures or bonds."
    },
    {
      "provision_ref": "s22A",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "22A",
      "title": "Issue of shares, etc.",
      "content": "22A. As a consequence of the vesting of any property, rights or liabilities of the Government in the College under this Act, or of any capital injection or other investment by the Government in the College in accordance with any written law, the College must issue such shares or other securities to the Minister for Finance as that Minister may direct."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "23",
      "title": "Bank accounts",
      "content": "23. —(1) The College must open and maintain one or more accounts with any bank or banks that the College thinks fit. (2) Every such account must only be operated by such person or persons as may be authorised in that behalf by the College."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "24",
      "title": "Application of funds",
      "content": "24. The funds of the College must be applied only in payment or discharge of the expenses, obligations and liabilities of the College and in making any payment that the College is authorised or required to make."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "25",
      "title": "Power of investment",
      "content": "25. The College may invest its funds in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [45/2004] 26. [ Repealed by Act 5 of 2018 ] 27. [ Repealed by Act 5 of 2018 ] 28. [ Repealed by Act 5 of 2018 ] 29. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "30",
      "title": "Transfer to College of property, assets and liabilities",
      "content": "30. —(1) From 1 October 2001, such movable and immovable property vested in the Government as may be determined by the Minister for Finance and used or managed by any of the incorporated departments and all assets, interests, rights, privileges, liabilities and obligations of the Government relating to the incorporated departments are transferred to and vest in the College without further assurance, act or deed. (2) If any question arises as to whether any particular property, asset, interest, right, privilege, liability or obligation has been transferred to or vested in the College under subsection (1), a certificate under the hand of the Minister for Finance is conclusive evidence that the property, asset, interest, right, privilege, liability or obligation was or was not so transferred or vested. (3) Any immovable property to be transferred to and vested in the College under subsection (1) must be held by the College upon such tenure and subject to such terms and conditions as the President may determine."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "31",
      "title": "Transfer of employees",
      "content": "31. —(1) From 1 October 2001, such persons or categories of persons as the Minister may determine who, immediately before that date, were employed by the Government in any of the incorporated departments are transferred to the service of the College on terms no less favourable than those enjoyed by them immediately prior to their transfer. (2) If any question arises as to whether any person or category of persons has been transferred to the service of the College under subsection (1), a certificate under the hand of the Minister is conclusive evidence that the person or category of persons was or was not so transferred. (3) Until such time as terms and conditions of service are drawn up by the College, the scheme and terms and conditions of the Government continue to apply to every person transferred to the service of the College under subsection (1) as if he or she were still in the employment of the Government."
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "32",
      "title": "Pension rights, etc., of Government employees to be preserved",
      "content": "32. —(1) The terms and conditions to be drawn up by the College must take into account the terms and conditions of service (including salaries and accrued rights to leave) enjoyed by the persons transferred to the service of the College under section 31 while in the employment of the Government. (2) Any term or condition relating to the length of service with the College must recognise the length of service of the persons so transferred while in the employment of the Government to be service with the College. (3) Nothing in the terms and conditions to be drawn up by the College is to adversely affect the conditions that would have been applicable to persons transferred to the service of the College as regards any pension, gratuity or allowance payable under the Pensions Act 1956. (4) Where a person has been transferred to the service of the College under section 31, the Government shall be liable to pay to the College such portion of any pension, gratuity or allowance payable to the person on his or her retirement as the same bears to the proportion which the aggregate amount of his or her pensionable emoluments during his or her service with the Government bears to the aggregate amount of his or her pensionable emoluments during his or her service under both the Government and the College. (5) Where any person in the service of the College, whose case does not fall within the scope of any pension or other schemes established under this section, retires or dies in the service of the College or is discharged from such service, the College may grant to the person or to any other person or persons wholly or partly dependent on the person, as the College thinks fit, such allowance or gratuity as the College may determine."
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "33",
      "title": "No benefits in respect of abolition or reorganisation of office",
      "content": "33. Despite the provisions of the Pensions Act 1956, a person who is transferred to the service of the College under section 31 is not entitled to claim any benefit under that Act on the ground that the person has been retired from the service of the Government on account of abolition or reorganisation of office in consequence of the establishment and incorporation of the College."
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "34",
      "title": "Existing contracts",
      "content": "34. All deeds, contracts, schemes, bonds, agreements, instruments and arrangements, subsisting immediately before 1 October 2001 to which the Government is a party and relating to any of the incorporated departments or to any person transferred to the service of the College under section 31 continue in force on and after that date and are enforceable by or against the College as if the College had been named therein or had been a party thereto instead of the Government. 35. [ Omitted as spent ]"
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "36",
      "title": "Misconduct or neglect of duty by employee before transfer",
      "content": "36. The College may reprimand, reduce in rank, retire, dismiss or punish in some other manner a person who, while the person was in the employment of the Government, had been guilty of any misconduct or neglect of duty which would have rendered the person liable to be reprimanded, reduced in rank, retired, dismissed or punished in some other manner if the person had continued to be in the employment of the Government and if this Act had not been enacted."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "38",
      "title": "Symbol or representation of College",
      "content": "38. —(1) The College has the exclusive right to the use of any symbol or representation that it may select or devise and thereafter display or exhibit such symbol or representation in connection with its activities or affairs. (2) Any person who uses a symbol or representation which — ( a ) is identical with that of the College; or ( b ) so resembles the College’s symbol or representation as to deceive or cause confusion, or to be likely to deceive or to cause confusion, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "39",
      "title": "Titles of certificates and other qualifications issued by College",
      "content": "39. —(1) The College has the exclusive right in the form and presentation of its titles of certificates and other qualifications issued by the College to any person who attains the standard set by the College. (2) Any person who issues or uses, or causes or permits the use of, titles of certificates or other qualifications identical with those of the College shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000."
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "40",
      "title": "Preservation of secrecy",
      "content": "40. —(1) Except for the purpose of the performance of his or her duties or the exercise of his or her functions or when lawfully required to do so by any court or where required or allowed by any written law, a person who is or has been an officer, employee or agent of the College, a member or a member of a committee of the Board must not disclose any information relating to the affairs of the College, the Board or any other person which has been obtained by him or her in the performance of his or her duties or the exercise of his or her functions. [5/2018] (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "41",
      "title": "Composition of offences",
      "content": "41. —(1) The Chief Executive or any officer authorised by him or her may compound any offence under this Act which is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum of money not exceeding $500. (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence."
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "42",
      "title": "Regulations",
      "content": "42. The College may, with the approval of the Minister, make regulations providing for or prescribing any matters which are necessary or convenient to be provided or prescribed for carrying out or giving effect to the provisions of this Act."
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "43",
      "title": "Saving",
      "content": "43. So far as it is necessary to preserve the effect of any document issued by or relating to any of the incorporated departments, any reference in such document to any of the incorporated departments is to be construed as a reference to the College."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Board of Directors of the College established under section 5;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Board appointed under section 5(2) and includes a temporary Chairperson appointed under section 8;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive",
      "definition": "“Chief Executive” means the Chief Executive of the College, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "College",
      "definition": "“College” means the Civil Service College established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "incorporated departments",
      "definition": "“incorporated departments” means the departments of the Prime Minister’s Office formerly known as the Civil Service College and the Personnel Guidance Unit;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means a member of the Board and includes the Chairperson;",
      "source_provision": "s2"
    },
    {
      "term": "officers in the public sector",
      "definition": "“officers in the public sector” means public officers and officers and employees of any public body;",
      "source_provision": "s2"
    },
    {
      "term": "public body",
      "definition": "“public body” means any body, board or authority established by or under any written law to perform or discharge any public function;",
      "source_provision": "s2"
    },
    {
      "term": "public sector",
      "definition": "“public sector” means the Government and any public body. [9/2003; 5/2018]",
      "source_provision": "s2"
    }
  ]
}