{
  "id": "csgba-1981",
  "type": "statute",
  "title": "Central Sikh Gurdwara Board Act 1981",
  "title_en": "Central Sikh Gurdwara Board Act 1981",
  "short_name": "CSGBA1981",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/CSGBA1981",
  "description": "An Act to provide for the amalgamation of the Queen Street Gurdawara Board of Trustees (Incorporated) and the Silat Road Gurdwara Board of Trustees (Incorporated) into a single body corporate to be called the Central Sikh Gurdwara Board and for purposes connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act may be cited as the Central Sikh Gurdwara Board Act 1981."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Incorporation of Board",
      "content": "2. —(1) There shall be constituted in Singapore a body corporate under the name of the Central Sikh Gurdwara Board (referred to in this Act as the Board). (2) The Board may sue and be sued in its said name and shall have perpetual succession and a common seal which seal the Board may from time to time alter or make anew as it shall see fit to do. (3) All deeds, documents and other instruments requiring the seal of the Board shall be sealed with the common seal of the Board in the presence of the President, the Treasurer and the Secretary of the Board, and shall be signed by the President, the Treasurer and the Secretary of the Board. Such signing shall be taken as sufficient evidence of the due sealing of those deeds, documents and other instruments."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Constitution of Board",
      "content": "3. —(1) The Board shall consist of such number of members who are elected at an annual general meeting by persons whose names appear on the Membership Register maintained by the Board under section 5. [6/87] (2) Every elected member of the Board shall hold office for a term of 2 years, but may continue in office until the election of his successor in office. [6/87] (3) No person shall be elected or appointed as a member of the Board unless he is a citizen of Singapore and his name is on the Membership Register maintained by the Board under section 5. [6/87] (4) Members of the Board shall be eligible for re‑election or re‑appointment. [6/87]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Officials of Board",
      "content": "4. —(1) The Board shall elect a President, a Treasurer and a Secretary and may elect such other officials as it may consider necessary, all of whom shall be from among the members of the Board except that no member of the Board shall hold office as a Treasurer for more than 2 years consecutively. (2) The persons so elected under subsection (1) are in this Act referred to as officials of the Board."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Membership Register",
      "content": "5. The Board shall maintain a register (referred to in this Act as the Membership Register) containing the names and other particulars of persons who profess the Sikh faith. [6/87]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Vacation of office of member of Board",
      "content": "6. If any member of the Board dies, resigns or otherwise vacates his office before the expiry of his term, the remaining members of the Board shall appoint a person to fill the vacancy for the residue of the term for which his predecessor was elected. [6/87]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Duties of Board",
      "content": "7. —(1) The Board shall act in accordance with the terms of resolutions passed at meetings of the Board. At any such meeting 50% of the members present shall form a quorum. No business shall be transacted unless a quorum is present. [6/87] (2) Notwithstanding subsection (1), the Board shall be bound by and shall give effect to any resolution that may be passed at any general meeting of persons whose names are on the Membership Register."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Meetings of Board",
      "content": "8. —(1) The President of the Board shall preside at all meetings of the Board. If the President of the Board is not present at any meeting, the members present at the meeting shall elect one of their number to preside at the meeting. (2) Resolutions of the Board shall be in accordance with the votes of the majority of the members present. In the event of an equality of votes, the President of the Board or the person presiding at the meeting shall have a casting vote."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Board may exercise powers despite vacancy",
      "content": "9. The Board may at all times exercise all its powers and carry out all its duties under this Act notwithstanding that there shall be any vacancy or vacancies in the membership of the Board."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Minutes",
      "content": "10. —(1) The Secretary of the Board shall keep minutes of all meetings of the Board and at every meeting the minutes of the previous meeting, which shall have been previously circulated to members of the Board, shall be confirmed, subject to any amendment which may be required. (2) The minutes referred to in subsection (1) shall be entered in the minute book of the Board and shall include a full record of every resolution of the Board. [6/87]"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Disqualifications for membership of Board",
      "content": "11. No person shall be elected or appointed or shall continue to hold office as a member of the Board if — ( a ) he is an undischarged bankrupt or suspends payment to, or makes any arrangement or composition with, his creditors; ( b ) he has been sentenced to imprisonment for a term of not less than 6 months and has not received a free pardon; or ( c ) a resolution is passed at an extraordinary general meeting of those persons whose names appear on the Membership Register calling for the removal of such member from office. [6/87]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Powers of Board",
      "content": "12. The Board may — ( a ) acquire, purchase, lease, hold and enjoy movable and immovable property of every description for use in connection with any temple except that the Board shall not exercise such powers in regard to immovable property without a resolution being first passed at a general meeting of persons whose names are on the Membership Register; ( b ) sell, exchange, convey, assign, surrender, mortgage, demise, re‑assign, transfer or otherwise dispose of and deal with any of such property except that the Board shall not exercise such powers in regard to immovable property without a resolution being first passed at a general meeting of persons whose names are on the Membership Register; ( c ) erect such buildings on land belonging to the Board or on land acquired by the Board as may appear to the Board necessary or desirable for the purposes of any temple or for use in connection therewith; and ( d ) raise funds by means of voluntary subscriptions for the purposes of exercising its powers, performing its duties and discharging its obligations under this Act."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Funds of Board",
      "content": "13. —(1) All funds belonging to the Board shall be kept in a bank or banks as may be approved by the Board. (2) The Board’s funds shall be preserved, invested, utilised, disposed of and paid out in accordance with the resolutions passed under section 8(2) and with any rules made under section 16."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Accounts",
      "content": "14. —(1) The Board shall at least once in every year prepare an account of the funds and other property of the Board and of the way in which such funds and other property have been utilised and disposed of. (2) All such accounts shall be signed by the Treasurer of the Board and shall be audited by 2 persons whose names are on the Membership Register and have been elected to serve as such at the biennial general meeting of persons whose names are on the Membership Register. [6/87]"
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Liability of members of Board",
      "content": "15. No member of the Board shall be personally liable for or in connection with any act or omission done or committed in good faith and without gross negligence as such member of the Board nor for any debt, liability, act or omission of the Board."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Rules",
      "content": "16. The Board may make rules not inconsistent with the provisions of this Act for all or any of the following purposes: ( a ) to regulate the keeping, revision and publication of the Membership Register, and to prescribe the conditions required to be complied with, including the payment of fees, to entitle a person to have his name entered on the Membership Register; ( b ) to regulate the election of members of the Board, and to provide for the declaration and publication of the results of such election; ( c ) to regulate the calling and conduct of general meetings of persons whose names are on the Membership Register, and the procedure in the transaction of business thereat; ( d ) to regulate the election of officials of the Board and to provide for the declaration and publication of the results of that election; ( e ) to regulate the proceedings of the Board, the calling of meetings and the procedure for the transaction of business; ( f ) for the appointment of subcommittees; ( g ) to regulate the appointment, conduct, dismissal and remuneration of granthis or priests, ragis or musicians, and such other religious personnel as the Board may think fit; ( h ) to allocate duties to and to regulate the executive power of the Board, subcommittees and officials of the Board; ( i ) to regulate the keeping, audit, presentation and publication of accounts, including quarterly accounts; and to provide for the inspection of accounts by persons whose names are on the Membership Register; ( j ) to regulate the conduct of religious services and other ceremonies customary among the followers of the Sikh religion; ( k ) to regulate the admission of boarders, inmates or visitors; ( l ) to regulate the appointment, conduct, dismissal and remuneration of servants of the Board; ( m ) to regulate the use of any portion of the land and premises vested in the Board for the purposes of education; and ( n ) generally to carry out the purposes of this Act. [6/87]"
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Service of documents",
      "content": "17. Any originating claim or other legal process and any notice may be served on the Board by serving it on an official of the Board or by leaving it at, or sending it by registered post to, the Central Sikh Temple, Singapore. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Saving of other rights",
      "content": "18. Nothing in this Act shall affect the rights of the Government or of any bodies politic or corporate or of any other persons, except such persons as are mentioned in this Act and those claiming by, from or under them."
    }
  ],
  "definitions": []
}