{
  "id": "dcra-2005",
  "type": "statute",
  "title": "Diplomatic and Consular Relations Act 2005",
  "title_en": "Diplomatic and Consular Relations Act 2005",
  "short_name": "DCRA2005",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/DCRA2005",
  "description": "An Act relating to diplomatic and consular privileges and immunities, and for other purposes.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Diplomatic and Consular Relations Act 2005."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Vienna Convention on Diplomatic Relations” means the Vienna Convention on Diplomatic Relations adopted in 1961 by the United Nations Conference on Diplomatic Intercourse and Immunities, the English text of which is set out in the First Schedule; “Vienna Convention on Consular Relations” means the Vienna Convention on Consular Relations adopted in 1963 by the United Nations Conference on Consular Relations, the English text of which is set out in the Second Schedule."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - DIPLOMATIC RELATIONS",
      "section": "3",
      "title": "Application of Vienna Convention on Diplomatic Relations",
      "content": "3. —(1) Subject to this section and section 6, Articles 1, 22, 23, 24 and 27 to 40 of the Vienna Convention on Diplomatic Relations have the force of law in Singapore. (2) In the provisions of the Vienna Convention on Diplomatic Relations mentioned in subsection (1) — ( a ) a reference to agents of the receiving State includes a reference to any police officer and any person exercising a power of entry to any premises under any written law; and ( b ) a reference to a national of the receiving State is a reference to a citizen of Singapore. (3) For the purposes of Article 32 of the Vienna Convention on Diplomatic Relations, a waiver by the head, or any person for the time being performing the functions of the head, of any diplomatic mission of any State is treated as a waiver by that State."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 3 - CONSULAR RELATIONS",
      "section": "4",
      "title": "Application of Vienna Convention on Consular Relations",
      "content": "4. —(1) Subject to this section and section 6, Articles 1, 5, 15 and 17, paragraphs 1, 2 and 4 of Article 31, Articles 32, 33, 35 and 39, paragraphs 1 and 2 of Article 41, Articles 43, 44, 45 and 48 to 54, paragraphs 2 and 3 of Article 55, paragraph 2 of Article 57, paragraphs 1, 2 and 3 of Article 58 and Articles 60, 61, 62, 66, 67, 70 and 71 of the Vienna Convention on Consular Relations have the force of law in Singapore. (2) In the provisions of the Vienna Convention on Consular Relations mentioned in subsection (1) — ( a ) a reference to authorities of the receiving State includes a reference to any police officer and any person exercising a power of entry to any premises under any written law; ( b ) a reference to a grave crime is a reference to any offence punishable with imprisonment for a term that may extend to 5 years or with a more severe sentence; and ( c ) a reference to a national of the receiving State is a reference to a citizen of Singapore. (3) In paragraph 2 of Article 17 of the Vienna Convention on Consular Relations, the reference to privileges and immunities accorded by customary international law or by international agreements is a reference to privileges and immunities conferred under the International Organisations (Immunities and Privileges) Act 1948. (4) In Article 44 of the Vienna Convention on Consular Relations, the references to matters connected with the exercise of the functions of members of a consular post are references to matters connected with the exercise of consular functions by consular officers or consular employees. (5) For the purposes of Article 45 of the Vienna Convention on Consular Relations and that Article as applied by Article 58 of that Convention, a waiver is treated as having been expressed by a State if it had been expressed by the head, or any person for the time being performing the functions of the head, of the diplomatic mission of that State or, if there is no such mission, of the consular post of that State. (6) The reference in Article 57 of the Vienna Convention on Consular Relations to the privileges and immunities provided in Chapter II of that Convention is a reference to the privileges and immunities provided in Section II of that Chapter. (7) The reference in Article 70 of the Vienna Convention on Consular Relations to the rules of international law concerning diplomatic relations is a reference to Part 2 of this Act."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 3 - CONSULAR RELATIONS",
      "section": "5",
      "title": "Powers of consular officers in relation to property in Singapore of deceased persons",
      "content": "5. —(1) Subject to subsection (2), where — ( a ) any person who is a national of a State to which this section applies (called in this section a relevant person) — (i) is named as executor in the will of a deceased person disposing of property in Singapore; or (ii) is otherwise a person to whom a grant of representation to the estate in Singapore of a deceased person may be made; ( b ) a consular officer of that State has made an application to the court for a grant of representation to the estate of the deceased person; ( c ) the court is satisfied that the relevant person is not resident in Singapore; and ( d ) no application for a grant of representation has been made by the relevant person or by any person duly authorised under a power of attorney to act for the relevant person in that behalf, the court must make to the consular officer such grant of representation to the estate of the deceased person as the court would have made had the consular officer been authorised by the relevant person in accordance with paragraph ( d ). (2) The court may, if it thinks fit, postpone the making of a grant under subsection (1) during such period as the court considers appropriate having regard to the circumstances of the case. (3) Subsections (4) and (5) apply where a relevant person is not resident in Singapore and — ( a ) is entitled to payment or delivery of any money or property — (i) in respect of any interest in the estate of a deceased person; or (ii) vesting in possession on the death of any person; ( b ) is entitled to payment of any money becoming due on the death of any person; or ( c ) is a person to whom any money or property comprised in the estate of a deceased person may be paid or delivered under any written law authorising the payment or delivery of such money or property without representation to the estate of the deceased person being granted. (4) A consular officer of the State of which the relevant person is a national has the like right and power to receive and give a valid discharge for any money or property mentioned in subsection (3) in Singapore as if the consular officer were duly authorised by a power of attorney to act for the relevant person in that behalf. (5) Despite subsection (4), no person is authorised or required by that subsection to pay or deliver any money or property to a consular officer if the person has knowledge that any other person in Singapore has been expressly authorised to receive that money or property on behalf of the relevant person. (6) A grant of administration made under this section may be made to the consular officer by the official title, and to the successors in title, of the consular officer, and where a grant is so made — ( a ) the office of administrator and all the estate, rights, duties and liabilities of the administrator (including liabilities under the administration bond) vest in and are imposed on the person for the time being holding the office; and ( b ) no fresh grant is required by reason only of the death or vacation of office of the person to whom the grant was made or in whom it is vested. (7) Subsection (6) does not affect any limitation contained in the grant of administration or any power of the court to revoke the grant. (8) Despite section 6(2) of the Probate and Administration Act 1934 (which provides that in the case of a minority or a life interest, letters of administration must be granted either to a trust corporation or to not less than 2 individuals) — ( a ) letters of administration of an estate may in any case be granted under this section to a consular officer alone; and ( b ) section 6(4) of that Act (which provides for the appointment of additional personal representatives in the case of a minority or a life interest) does not apply in any case where the existing personal representative is a consular officer appointed under this section. (9) Without affecting section 29(3) of the Probate and Administration Act 1934 (which enables the court or the registrar of the Family Justice Courts to dispense with sureties to administration bonds in certain cases), no surety is required to an administration bond given by a consular officer upon the grant of letters of administration under this section. [27/2014] (10) This section does not affect sections 59, 60 and 61 of the Probate and Administration Act 1934. (11) Despite section 4(1), a consular officer is not entitled to any privilege or immunity in respect of — ( a ) any act done by virtue of powers conferred on the consular officer by this section or by section 59 of the Probate and Administration Act 1934; or ( b ) any document for the time being in the consular officer’s possession relating thereto. (12) The Minister may, by order in the Gazette , direct that this section applies to any State specified in the order, being a State with which a consular convention providing for the matters mentioned in this section has been concluded with Singapore. (13) Any order made under subsection (12) is to be presented to Parliament as soon as possible after publication in the Gazette . (14) In this section, “consular officer” means a consul general, consul, vice-consul or consular agent representing a State to whom an exequatur or provisional or other authorisation to perform consular functions has been granted."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 4 - GENERAL",
      "section": "6",
      "title": "Privileges and immunities",
      "content": "6. —(1) Where the Minister is satisfied that the privileges and immunities accorded to a Singapore diplomatic mission in any State, or to persons connected with that mission, are less than the privileges and immunities conferred by Part 2 on the diplomatic mission of that State, or on persons connected with that mission, the Minister may, by order in the Gazette , withdraw all or any of the privileges and immunities so conferred from the mission of that State or from such persons connected with it, as the Minister considers to be proper. (2) Where the Minister is satisfied that the privileges and immunities accorded to a Singapore consular post in any State, or to persons connected with that consular post, are less than the privileges and immunities conferred by Part 3 on a consular post of that State, or on persons connected with that consular post, the Minister may, by order in the Gazette , withdraw all or any of the privileges and immunities so conferred from all or any of the consular posts of that State or from such persons connected therewith, as the Minister considers to be proper. (3) The Minister may, by order in the Gazette , extend any privilege or immunity conferred by Part 2 or 3 to such person or class of persons as the Minister considers to be proper. (4) Any order made under this section is to be presented to Parliament as soon as possible after publication in the Gazette ."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 4 - GENERAL",
      "section": "7",
      "title": "Evidence",
      "content": "7. A certificate issued by or on behalf of the Minister is conclusive evidence on any question whether any person is entitled to any privilege or immunity under this Act."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 4 - GENERAL",
      "section": "8",
      "title": "Regulations",
      "content": "8. —(1) The Minister may make such regulations as are necessary or expedient for carrying out the purposes of this Act. (2) Any regulations made under this section is to be presented to Parliament as soon as possible after publication in the Gazette ."
    }
  ],
  "definitions": [
    {
      "term": "Vienna Convention on Diplomatic Relations",
      "definition": "“Vienna Convention on Diplomatic Relations” means the Vienna Convention on Diplomatic Relations adopted in 1961 by the United Nations Conference on Diplomatic Intercourse and Immunities, the English text of which is set out in the First Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Vienna Convention on Consular Relations",
      "definition": "“Vienna Convention on Consular Relations” means the Vienna Convention on Consular Relations adopted in 1963 by the United Nations Conference on Consular Relations, the English text of which is set out in the Second Schedule.",
      "source_provision": "s2"
    }
  ]
}