{
  "id": "dgmeao-1939",
  "type": "statute",
  "title": "District Grand Master of the Eastern Archipelago Ordinance 1939",
  "title_en": "District Grand Master of the Eastern Archipelago Ordinance 1939",
  "short_name": "DGMEAO1939",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/DGMEAO1939",
  "description": "An Ordinance to incorporate the titular District Grand Master of the Eastern Archipelago.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Ordinance may be cited as the District Grand Master of the Eastern Archipelago Ordinance 1939."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "The District Grand Master of the Eastern Archipelago to be a body corporate",
      "content": "2. —(1) Wilberforce Henry William Gubbins by patent of appointment from the Grand Master of the United Grand Lodge of Ancient Free and Accepted Masons of England the District Grand Master of the Eastern Archipelago and his successors in office so authorised and appointed shall be a body corporate (hereinafter called “the Corporation”) and shall have the name — “The District Grand Master of the Eastern Archipelago” and by that name have perpetual succession and shall and may have and use a corporate seal. (2) The said seal may from time to time be broken, changed, altered and made anew as to the Corporation seems fit."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Power to acquire and dispose of property",
      "content": "3. —(1) The Corporation may acquire, purchase, take, hold, and enjoy movable and immovable property of every description and whether situate in the Colony or elsewhere soever and either by way of gift or for valuable consideration or partly in one way and partly in the other, and may sell, convey, assign, surrender, yield up, mortgage, demise, re‑assign, transfer or otherwise dispose of any movable or immovable property vested in the Corporation upon such terms as to the Corporation seem fit. (2) The Corporation may either alone or in conjunction with any other person or persons whether incorporated or not accept and administer and either in the capacity of an operative or as a custodian trustee any trust express or implied and notwithstanding anything to the contrary contained in section 15 of the Trustees Act 1967 whenever any immovable property is vested in the Corporation as sole trustee upon trust for sale or with power of sale the Corporation shall have the right to give valid receipts for the proceeds of sale or other capital money arising from such property."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Property vested in Corporation to be held upon trust",
      "content": "4. —(1) All movable and immovable property held by any person or body of persons in trust for the purposes of Free Masonry in general or of any Lodge or body of Masons in particular that shall be assigned, conveyed or transferred to the Corporation shall be held by the Corporation upon and for or according to such trusts. (2) All movable and immovable property that shall come into or at any time be in the possession of the Corporation which shall not be impressed with any trust express or implied shall be held by the Corporation upon trust for the benefit of Free Masonry in general or for such charitable uses as are peculiar to the fraternity of Free and Accepted Masons as the Corporation shall, subject to the general laws and regulations for the Government of the Craft, from time to time direct or appoint."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Purchaser from Corporation not affected by implied trusts",
      "content": "5. Notwithstanding the trusts declared in section 4 hereof all movable and immovable property that shall from time to time be vested in the Corporation shall subject to the terms of the instrument of trust (if any) affecting the same be nevertheless deemed to be so vested that in favour of any purchaser from and any person dealing with the Corporation the Corporation shall have full power to sell, convey, assign, surrender, yield up, mortgage, demise, re‑assign, transfer or otherwise dispose of such property as fully and effectually as if the Corporation were the true and beneficial owner thereof."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Use of corporate seal",
      "content": "6. —(1) All deeds, documents and other instruments requiring the seal of the Corporation shall be sealed with the seal of the Corporation in the presence of the District Grand Master of the Eastern Archipelago for the time being or his attorney duly authorised by a power of attorney deposited under section 48 of the Conveyancing and Law of Property Act 1886 and shall also be signed by the said District Grand Master for the time being or his attorney so authorised as aforesaid. (2) Such signing shall be and be taken as sufficient evidence that the said seal was duly and properly affixed and that the same is the lawful seal of the Corporation."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Notification of appointment of District Grand Master",
      "content": "7. A notification in the Gazette of the appointment of any person to exercise the office of District Grand Master of the Eastern Archipelago shall be conclusive evidence that such person was duly authorised to exercise the said office."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Rights of Government",
      "content": "8. Nothing in this Ordinance shall affect the rights of the Government. [7/97]"
    }
  ],
  "definitions": []
}