{
  "id": "difa-2000",
  "type": "statute",
  "title": "Developmental Investment Fund Act 2000",
  "title_en": "Developmental Investment Fund Act 2000",
  "short_name": "DIFA2000",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/DIFA2000",
  "description": "An Act to establish a Developmental Investment Fund and to define its purposes and for matters connected therewith. [Act 35 of 2021 wef 31/01/2022]",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Developmental Investment Fund Act 2000."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “developmental purpose” means — ( a ) to promote, assist in or facilitate the establishment, development or expansion of any industry or class of business enterprise that will enhance, directly or indirectly, economic growth and employment opportunities in Singapore, that enjoys good export market prospects or that will enhance Singapore’s international competitiveness; ( b ) to construct, improve, extend or replace any buildings, building or engineering works, plant, machinery, equipment or other infrastructure required in respect of or connected with the economic development or general welfare of Singapore; ( c ) to reclaim or develop any land in Singapore or to commercially exploit or apply any scientific knowledge or technology; or ( d ) to promote, assist or facilitate any research, survey, investigation or other work preparatory to any purpose referred to in paragraph ( a ), ( b ) or ( c ); “financial year”, in relation to the Fund, means a period of 12 months ending on 31 March in any year; “Fund” means the Developmental Investment Fund established under section 3; “invest” includes entering into a transaction or an arrangement for the protection or enhancement of investments; “Minister” means the Minister charged with the responsibility for finance; “property” means any legal or equitable estate or interest (whether present or future and whether vested or contingent) in real or personal property of any description; “public authority” means any board or authority established by or under any written law to perform or discharge any public function; “responsible Minister” has the meaning given by section 6(1); “securities” includes shares, inscribed stock, debentures, bonds, debenture stock, notes or any other document creating, evidencing or acknowledging indebtedness. [Act 35 of 2021 wef 31/01/2022] [ Deleted by Act 35 of 2021 wef 31/01/2022 ]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - DEVELOPMENTAL INVESTMENT FUND",
      "section": "3",
      "title": "Establishment of Developmental Investment Fund",
      "content": "3. —(1) A fund called the Developmental Investment Fund is established, into which must be paid — ( a ) all moneys from time to time appropriated from the Consolidated Fund and authorised to be paid into the Fund by this Act or any other written law; ( b ) [ Deleted by Act 35 of 2021 wef 31/01/2022 ] ( c ) all other revenues of Singapore allocated by any written law to the Fund; and ( d ) the net income from investments of moneys in the Fund authorised to be made by this Act or any other written law. (2) The Fund must be regarded as a Government fund and as comprising public moneys for the purposes of any other written law. (3) For the purposes of subsection (1)( d ), the net income from investments is the amount ascertained by adding to, or deducting from, the income received from investments of moneys in the Fund any profit derived or loss sustained (as the case may be) from the realisation of those investments."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - DEVELOPMENTAL INVESTMENT FUND",
      "section": "4",
      "title": "Purposes of Fund",
      "content": "4. —(1) The moneys in the Fund may be withdrawn and applied for all or any of the following purposes only: ( a ) to invest in, subscribe for or acquire any securities in any public authority, corporation or body corporate for any developmental purpose; ( b ) to form or to participate in the formation of any company for any developmental purpose; ( c ) to invest in any funds or property (whether within or outside Singapore) for any developmental purpose; ( d ) to pay any charges, fees or expenses incidental to or arising from carrying out any of the activities in paragraphs ( a ), ( b ) and ( c ); ( e ) to pay any expenses mentioned in section 7. (2) Section 7(3) of the Financial Procedure Act 1966 does not apply to the application of any moneys in the Fund in accordance with subsection (1)( a ), ( b ) or ( c )."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - DEVELOPMENTAL INVESTMENT FUND",
      "section": "5",
      "title": "General responsibility for Fund",
      "content": "5. —(1) The Minister is responsible for the control, supervision and management of all moneys of the Fund not assigned to any responsible Minister under section 6(1). (2) Despite the assignment of any part of the moneys in the Fund to any responsible Minister under section 6(1), the Minister remains overall responsible for the control, supervision and management of the Fund."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - DEVELOPMENTAL INVESTMENT FUND",
      "section": "6",
      "title": "Responsible Ministers in charge of accounts in Fund",
      "content": "6. —(1) The Minister may, if it appears to him or her expedient in the interests of the improved management and sound and more efficient investment of any part of the moneys in the Fund, by order direct that, as of a date appointed in that order, an account within the Fund be established comprising those moneys and placed under the control, supervision and management of a Minister who is assigned in that order (called in this Act the responsible Minister). (2) In discharging his or her functions in relation to the Fund or an account established under subsection (1), it is the duty of the Minister or responsible Minister, as the case may be — ( a ) to manage the Fund or account (as the case may be) so that the revenue of the Fund or account is not less than sufficient to meet expenses which are properly chargeable to the Fund or account; ( b ) to establish and adhere to investment policies, and adopt standards and procedures that a reasonable prudent person would apply to a portfolio of investments to avoid undue risk of loss and to obtain a reasonable return; and ( c ) in the case of the responsible Minister, to achieve any specific developmental objectives that the Minister may by order under subsection (1), after consultation with the responsible Minister, determine to be desirable of achievement."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - DEVELOPMENTAL INVESTMENT FUND",
      "section": "7",
      "title": "Expenses",
      "content": "7. —(1) All expenses incidental to or arising from the administration, investment and management of moneys in the Fund or any account established under section 6(1) are charged upon and payable out of the Fund or account, as the case may be. (2) [ Deleted by Act 35 of 2021 wef 31/01/2022 ]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - DEVELOPMENTAL INVESTMENT FUND",
      "section": "8",
      "title": "Fund surpluses",
      "content": "8. —(1) The Minister may, by warrant under his or her hand, authorise the transfer to the Consolidated Fund any moneys in the Fund which, in the opinion of the Minister, are not immediately required to meet the liabilities or the purposes of the Fund. (2) The Minister may, after consulting the relevant responsible Minister, at any time by warrant under his or her hand direct the transfer to the Fund of all or any moneys from any account established under section 6(1) under the charge of that responsible Minister."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - DEVELOPMENTAL INVESTMENT FUND",
      "section": "9",
      "title": "Withdrawals",
      "content": "9. —(1) Moneys must not be withdrawn from the Fund or any account established under section 6(1) unless they are charged upon the Fund or are authorised or directed to be withdrawn or transferred under this Act. (2) A payment must not be made out of the Fund unless the payment is authorised by the Minister or, in the case of moneys in an account established under section 6(1), unless the payment is authorised by the responsible Minister in charge of that account."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "17",
      "title": "Accounts to be kept",
      "content": "17. —(1) The Minister must — ( a ) cause to be kept proper accounts and records of all transactions and affairs relating to the Fund; ( b ) do all things necessary to ensure that all payments out of the Fund are correctly made and properly authorised; and ( c ) ensure that adequate control is maintained over the assets and receipts of the Fund. (2) Every responsible Minister has the same responsibilities as specified in subsection (1) in relation to all moneys in the account established under section 6(1) under his or her charge. (3) Every responsible Minister must appoint a public officer or an officer of any public authority to be an accounting officer for the account established under section 6(1) under the responsible Minister’s charge, with responsibility for keeping proper accounts and records in relation to that account, and preparing and signing a statement of the accounts in respect of each financial year. (4) Any officer of a public authority who is appointed under subsection (3) as an accounting officer is deemed to be — ( a ) a public officer for the purposes of the Financial Procedure Act 1966, and section 20 of that Act applies to the officer even though the officer is not or was not in the employment of the Government; and ( b ) a public servant for the purposes of the Penal Code 1871."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "18",
      "title": "Financial statements and audit reports",
      "content": "18. The Minister must, as soon as practicable after the close of each financial year, cause to be prepared and submitted to the Auditor‑General — ( a ) the financial statements for the Fund relating to that financial year; or ( b ) if accounts have been established under section 6(1), the consolidated financial statements in respect of the Fund relating to that financial year, and the Auditor-General must then audit and report on them."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "19",
      "title": "Application of Financial Procedure Act 1966",
      "content": "19. Except as otherwise expressly provided in this Act, the Financial Procedure Act 1966 and any regulations made under that Act apply to the Fund."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "20",
      "title": "Regulations",
      "content": "20. The Minister may make regulations for the sound and efficient management and investment of the Fund, including — ( a ) prescribing the securities, funds and investments or classes of securities, funds and investments in which any moneys in the Fund may be invested for developmental purposes; and [Act 35 of 2021 wef 31/01/2022] ( b ) [ Deleted by Act 35 of 2021 wef 31/01/2022 ] ( c ) prescribing all other matters that are necessary or expedient for carrying out or giving effect to the provisions of this Act."
    }
  ],
  "definitions": [
    {
      "term": "developmental purpose",
      "definition": "“developmental purpose” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "financial year",
      "definition": "“financial year” , in relation to the Fund, means a period of 12 months ending on 31 March in any year;",
      "source_provision": "s2"
    },
    {
      "term": "Fund",
      "definition": "“Fund” means the Developmental Investment Fund established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "invest",
      "definition": "“invest” includes entering into a transaction or an arrangement for the protection or enhancement of investments;",
      "source_provision": "s2"
    },
    {
      "term": "Minister",
      "definition": "“Minister” means the Minister charged with the responsibility for finance;",
      "source_provision": "s2"
    },
    {
      "term": "property",
      "definition": "“property” means any legal or equitable estate or interest (whether present or future and whether vested or contingent) in real or personal property of any description;",
      "source_provision": "s2"
    },
    {
      "term": "public authority",
      "definition": "“public authority” means any board or authority established by or under any written law to perform or discharge any public function;",
      "source_provision": "s2"
    },
    {
      "term": "responsible Minister",
      "definition": "“responsible Minister” has the meaning given by section 6(1);",
      "source_provision": "s2"
    },
    {
      "term": "securities",
      "definition": "“securities” includes shares, inscribed stock, debentures, bonds, debenture stock, notes or any other document creating, evidencing or acknowledging indebtedness. [Act 35 of 2021 wef 31/01/2022]",
      "source_provision": "s2"
    }
  ]
}