{
  "id": "dpa-1989",
  "type": "statute",
  "title": "Destitute Persons Act 1989",
  "title_en": "Destitute Persons Act 1989",
  "short_name": "DPA1989",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/DPA1989",
  "description": "An Act to provide for the care and rehabilitation of destitute persons and to provide for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Destitute Persons Act 1989."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “destitute person” means — ( a ) any person found begging in a public place in a way that causes or is likely to cause annoyance to persons frequenting the place or otherwise creates a nuisance; or ( b ) any idle person found in a public place, whether or not he or she is begging, who has no visible means of subsistence or place of residence or is unable to give a satisfactory account of himself or herself; “Director‑General” means the Director‑General of Social Welfare and includes any person who is authorised by him or her to perform any of the duties or exercise any of the powers of the Director‑General under this Act or any of its rules; “public place” includes any place to which the public is admitted without payment or on payment; “superintendent” means a person having the management or control of any welfare home established under the provisions, and for the purposes, of this Act; “welfare home” means any institution or part of the institution for the reception, care and rehabilitation of destitute persons established under the provisions, and for the purposes, of this Act. [30/2019] (2) For the purposes of this Act, a person is deemed to be begging if the person’s conduct is calculated to induce the giving of alms, whether or not there is any pretence of singing, playing, performing, offering anything for sale or otherwise."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Power to require destitute person to reside in welfare home",
      "content": "3. —(1) Any public officer acting under the direction of the Director‑General or any police officer may take in the officer’s charge any destitute person and deliver that person to the custody of the Director‑General. [30/2019] (2) If the Director‑General has reasonable cause to believe that any person so delivered into his or her custody has no visible means of subsistence, he or she may arrange for that person to be temporarily admitted into a welfare home until the Director‑General has held an inquiry. [30/2019] (3) Every such inquiry must be completed within a period of 30 days from the date of that person’s admission into a welfare home or such further period, not exceeding 30 days, as the Minister may approve. (4) If after holding the inquiry the Director‑General is satisfied that the person is a destitute person within the meaning of this Act, the Director‑General may by warrant under his or her hand require that person to reside in a welfare home. [30/2019]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Penalty for begging",
      "content": "4. —(1) Any person being a habitual beggar found begging in a public place in a way that causes or is likely to cause annoyance to persons frequenting the place or otherwise creates a nuisance shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000 or to imprisonment for a term not exceeding 2 years. (2) In this section, “habitual beggar” means a person who on at least 2 previous occasions was found begging in a public place in a way that causes or is likely to cause annoyance to persons frequenting the place or otherwise creates a nuisance and, consequently, was required on those 2 occasions to reside in a welfare home."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Voluntary admission into welfare home",
      "content": "5. Any destitute person who voluntarily seeks admission into a welfare home is required to undertake that, if admitted, he or she will abide by the conditions of admission imposed under this Act or any rules made under this Act."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Taking of finger impressions and photographs",
      "content": "6. —(1) The Director‑General may authorise the taking of finger impressions and photographs of any destitute person residing in a welfare home. [30/2019] (2) Subject to subsection (3), after the end of 2 years from the date of discharge of a destitute person from a welfare home, the Director‑General must, on that person’s application, deliver to that person the sheet upon which that person’s finger impressions have been made, together with the negatives and copies of the photographs taken of that person, and if no application is received after that period of 2 years and before the end of 3 years from the date of discharge, those records must be destroyed. [30/2019] (3) The Director‑General may retain 3 copies of the photographs taken of the destitute person for maintaining a register of destitute persons admitted to and discharged from welfare homes. [30/2019]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Minister may establish welfare homes",
      "content": "7. —(1) The Minister may, by notification in the Gazette , establish welfare homes at any places within Singapore that he or she thinks proper for the reception, care and rehabilitation of destitute persons in accordance with the provisions of this Act. (2) The Minister may appoint superintendents and other officers for the management of those welfare homes. (3) Every superintendent or officer is deemed to be a public servant within the meaning of the Penal Code 1871."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Board of Visitors",
      "content": "8. —(1) The Minister may appoint a Board of Visitors to advise and make recommendations to the Director‑General on all matters pertaining to the welfare of the residents in a welfare home and any other matters that the Minister may refer to the Board. [30/2019] [Act 5 of 2025 wef 09/03/2025] (1A) An appointment under subsection (1) must be published in the Gazette . [Act 5 of 2025 wef 09/03/2025] (2) A Board of Visitors may be appointed for one or more welfare homes as the Minister thinks fit."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Rules for management of welfare homes",
      "content": "9. The Minister may make rules — ( a ) for prescribing the constitution and functions of the Board of Visitors; ( b ) for regulating the management of welfare homes and the admission of persons to welfare homes; ( c ) for the care, control and rehabilitation of persons residing in welfare homes; ( d ) for prescribing the forms to be used for the purposes of this Act; and ( e ) generally for carrying out the purposes of this Act."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Review Committee",
      "content": "10. —(1) The Minister may appoint a Review Committee which must review the case of every resident at intervals of not more than 12 months to assess the resident’s suitability for discharge from the welfare home. [Act 5 of 2025 wef 09/03/2025] (1A) An appointment under subsection (1) must be published in the Gazette . [Act 5 of 2025 wef 09/03/2025] (2) A Review Committee may be appointed for one or more welfare homes as the Minister thinks fit. (3) The Review Committee has power to recommend to the Director‑General that any resident may be discharged from a welfare home either conditionally or unconditionally. [30/2019]"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Discharge from welfare homes",
      "content": "11. Any person admitted to a welfare home, either on that person’s own application or otherwise, may be discharged by the Director‑General either conditionally or unconditionally on the advice of the Review Committee. [30/2019]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Discharge to care of relative or friend",
      "content": "12. —(1) Whenever any individual being a relative or friend of a destitute person who, in the opinion of the Director‑General is willing and able to provide care and support for the destitute person, desires that the destitute person be discharged from a welfare home to the individual’s care and support, the Director‑General must — ( a ) upon the application of the individual; and ( b ) on the individual giving security to the satisfaction of the Director‑General that the destitute person will be properly taken care of and that the individual will ensure the destitute person complies with any condition of discharge from the welfare home, order that destitute person to be discharged to the care of the individual. [30/2019] (2) If for any reason the care and support of the individual for the destitute person ceases, the individual must inform the Director‑General in writing within 24 hours of the cessation of such care and support. [30/2019] (3) An individual who, having undertaken the care and support of a destitute person discharged from a welfare home, fails to inform the Director‑General in writing within 24 hours of the cessation of such care and support shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $500 or to imprisonment for a term not exceeding 2 months. [30/2019]"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Persons in welfare home may be required to work",
      "content": "13. —(1) Any person residing in a welfare home may be required to engage in any suitable work for which the medical officer of the home certifies that person to be capable of, either with a view to fitting that person for an employment outside the welfare home or with a view to contributing to that person’s maintenance in the welfare home. (2) Any person residing in a welfare home who attends work outside the welfare home is deemed, while engaged in such employment, to be a resident of the welfare home."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Persons in welfare home may be sent to hospital",
      "content": "14. Any person residing in a welfare home may, if so directed by the medical officer of the home, be sent to a hospital or other medical institution for treatment, and is deemed, while receiving such treatment, to be a resident of the welfare home."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Director‑General may transfer persons in welfare homes",
      "content": "15. Any person residing in a welfare home may, if so directed by the Director‑General, be removed from that welfare home and admitted to another welfare home. [30/2019]"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Penalty for escape from lawful custody of welfare home",
      "content": "16. Any person who — ( a ) escapes from the police while committed to the charge of the police under this Act; ( b ) without permission of the superintendent, leaves a welfare home in which the person is required to reside in accordance with section 3 or to which the person has been admitted on the person’s own application under section 5; or ( c ) having obtained the permission of the superintendent leaves a welfare home for a limited time or for a specified purpose, but fails to return at the end of that time or when that purpose has been accomplished or found to be impracticable, shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 6 months."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Penalty for behaving in disorderly manner",
      "content": "17. Any person residing in a welfare home who — ( a ) takes part in any assault or attack on any officer of the welfare home; ( b ) aggravates or repeatedly assaults any other person residing in the welfare home; or ( c ) wilfully destroys any property of the welfare home, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000 or to imprisonment for a term not exceeding 2 years."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Arrest of escaped destitute person",
      "content": "18. Any person who is reasonably suspected of having committed an offence under section 16 or 17 and who refuses or fails to accompany a police officer to, or to appear before, a Magistrate’s Court when required to do so for the purposes of this Act may be arrested without a warrant."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Return to welfare home after serving sentence",
      "content": "19. A person who has completed serving a sentence imposed under section 16 or 17 must be returned to a welfare home, and the Director‑General may take that person into custody for this purpose after that person has served the sentence. [30/2019]"
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Discharge",
      "content": "20. The Minister may at any time order any person admitted to a welfare home to be discharged."
    }
  ],
  "definitions": [
    {
      "term": "destitute person",
      "definition": "“destitute person” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Director‑General",
      "definition": "“Director‑General” means the Director‑General of Social Welfare and includes any person who is authorised by him or her to perform any of the duties or exercise any of the powers of the Director‑General under this Act or any of its rules;",
      "source_provision": "s2"
    },
    {
      "term": "public place",
      "definition": "“public place” includes any place to which the public is admitted without payment or on payment;",
      "source_provision": "s2"
    },
    {
      "term": "superintendent",
      "definition": "“superintendent” means a person having the management or control of any welfare home established under the provisions, and for the purposes, of this Act;",
      "source_provision": "s2"
    },
    {
      "term": "welfare home",
      "definition": "“welfare home” means any institution or part of the institution for the reception, care and rehabilitation of destitute persons established under the provisions, and for the purposes, of this Act. [30/2019]",
      "source_provision": "s2"
    }
  ]
}