{
  "id": "emasa-2001",
  "type": "statute",
  "title": "Energy Market Authority of Singapore Act 2001",
  "title_en": "Energy Market Authority of Singapore Act 2001",
  "short_name": "EMASA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/EMASA2001",
  "description": "An Act to establish and incorporate the Energy Market Authority of Singapore, to provide for its functions and powers, and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Energy Market Authority of Singapore Act 2001."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Authority” means the Energy Market Authority of Singapore established under section 3; “Board” means the Public Utilities Board continued under section 3 of the Public Utilities Act 2001; “Chairperson” means the Chairperson of the Authority and includes any temporary Chairperson of the Authority; “Chief Executive” means the Chief Executive of the Authority, and includes any individual acting in that capacity; “Deputy Chairperson” means the Deputy Chairperson of the Authority and includes any temporary Deputy Chairperson of the Authority; “district cooling service” has the meaning given by the District Cooling Act 2001; “electricity” means electrical power when generated, transmitted, supplied or used for any purpose but excludes the transmission of any communication or signal; “energy utilities” includes electricity, gas and district cooling services; “Future Energy Fund” means the fund of that name established under section 19; [Act 27 of 2024 wef 08/11/2024] “gas” means natural gas and town gas, but excludes liquefied petroleum gas; “member” means any member of the Authority; “natural gas” means mixture of gaseous hydrocarbons which is conveyed by gas pipes and is composed — ( a ) predominantly of methane; and ( b ) as to the remainder, of varying amounts of other hydrocarbons and other combustible and non‑combustible gases; “premises” includes buildings, structures, streets, lands, waters, tenements, easements of any tenure, whether State land or not, whether open or enclosed, whether built on or not, whether public or private, and whether maintained or not under statutory authority; “Regulation Department” means the department of the Board by that name; “supply” — ( a ) in relation to electricity, means the supply of electricity through electric lines, and includes — (i) the supply to any person or premises in Singapore of electricity which is generated outside Singapore; and (ii) the supply to any person or premises outside Singapore of electricity which is generated in Singapore; and ( b ) in relation to gas, means the supply of gas through pipes; “town gas” means any substance in a gaseous state, which is conveyed in gas pipes and is manufactured from petrochemical feedstock, and has hydrogen as one of its main constituents. [5/2018]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION",
      "section": "3",
      "title": "Establishment and incorporation of Energy Market Authority of Singapore",
      "content": "3. A body called the Energy Market Authority of Singapore is established, which is a body corporate with perpetual succession and is by that name capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing or disposing of property, both movable and immovable; and ( c ) doing and suffering any other acts or things that bodies corporate may lawfully do and suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION",
      "section": "4",
      "title": "Common seal",
      "content": "4. —(1) The Authority must have a common seal and the seal may be broken, altered or made anew as the Authority thinks fit. (2) All courts, judges and persons acting judicially are to take judicial notice of the common seal of the Authority affixed to any document and presume that it was duly affixed."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND CONSTITUTION",
      "section": "5",
      "title": "Constitution of Authority",
      "content": "5. —(1) The Authority consists of the following members: ( a ) a Chairperson; ( b ) 5 or more other members as the Minister may from time to time determine. [Act 27 of 2024 wef 31/03/2025] (2) The First Schedule has effect as respects the Authority, its members and proceedings."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "6",
      "title": "Functions and duties of Authority",
      "content": "6. —(1) Subject to the provisions of this Act, it is the function and duty of the Authority — ( a ) to create a market framework in respect of the supply of — (i) electricity or gas; or (ii) other goods or services regulated by the Authority under any written law, which promotes and maintains fair and efficient market conduct and effective competition or, in the absence of a competitive market, which prevents the misuse of monopoly or market power; ( b ) to secure that all reasonable demands for the supply of electricity are satisfied; ( c ) to promote the development of the electricity and gas industries; ( d ) to protect the interests of consumers in respect of the quality of electricity supply, gas supply and district cooling services provided; ( e ) to protect the interests of the public in respect of the supply and use of electricity and gas and the provision of district cooling services; ( f ) to promote the efficient use of energy utilities; ( fa ) to manage and administer the Future Energy Fund in accordance with this Act subject to the directions of the Minister; [Act 27 of 2024 wef 08/11/2024] ( g ) to exercise licensing and regulatory functions in respect of electricity, gas and district cooling systems and services, including the establishment of standards and codes relating to any connected matter; ( h ) to advise the Government on national needs, policies and strategies relating to energy utilities, and on matters appertaining to the Authority generally; and ( i ) to exercise any other functions and duties conferred on the Authority by or under any other written law. (2) In addition to the functions and duties imposed by this section, the Authority may undertake any other functions that the Minister may assign to the Authority, and in so doing — ( a ) the Authority is deemed to be fulfilling the purposes of this Act; and ( b ) the provisions of this Act apply to the Authority in respect of those functions. (3) Nothing in this section is to be construed as imposing on the Authority, directly or indirectly, any form of duty or liability enforceable by proceedings before any court."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "7",
      "title": "Powers of Authority",
      "content": "7. —(1) Subject to the provisions of this Act, the Authority may carry on any activities that appear to the Authority to be advantageous, necessary or convenient for it to carry on for or in connection with the discharge of its functions and duties under this Act or other written law and, in particular, the Authority may exercise any of the powers specified in the Second Schedule. (2) This section is not to be construed as limiting any power of the Authority conferred by or under any other written law. (3) The Authority must furnish the Minister information with respect to its property and activities in such manner and at such times as the Minister may require."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "8",
      "title": "Directions by Minister",
      "content": "8. —(1) The Minister may, after consulting the Authority, give to the Authority any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (2) In addition to the power mentioned in subsection (1), if it appears to the Minister to be requisite or expedient to do so — ( a ) on the occurrence of any public emergency, in the public interest or in the interests of public security, national defence, or relations with the government of another country; or ( b ) in order — (i) to discharge or facilitate the discharge of an obligation binding on the Government by virtue of its being a member of an international organisation or a party to an international agreement; (ii) to attain or facilitate the attainment of any other object the attainment of which is in the Minister’s opinion requisite or expedient in view of the Government being a member of such an organisation or a party to such an agreement; or (iii) to enable the Government to become a member of such an organisation or a party to such an agreement, the Minister may, after consultation with the Authority, give any directions to the Authority that are necessary in the circumstances of the case. [5/2018] (3) The Authority must give effect to any direction given to it under subsection (1) or (2) despite any other duty imposed on it by or under this Act or any other written law. (4) The Authority must not disclose any direction given to it under subsection (1) or (2) if the Minister notifies the Authority that the Minister is of the opinion that the disclosure of the direction is against the public interest. (5) If any doubt arises as to the existence of a public emergency or as to whether any act done under this section was in the public interest or in the interests of public security, national defence or relations with the government of another country, a certificate signed by the Minister is conclusive evidence of the matters stated in the certificate."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "9",
      "title": "Chief Executive, officers and employees, etc.",
      "content": "9. —(1) There must be a Chief Executive of the Authority, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Authority may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive during any period, or during all periods, when the Chief Executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018] (3) The Authority may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on any terms and conditions that it may determine, any other officers, employees, consultants and agents that may be necessary for the effective performance of its functions. [5/2018] 10. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "11",
      "title": "Protection from personal liability",
      "content": "11. No suit or other legal proceedings shall lie against any member, officer or employee of the Authority or other person acting under the direction of the Authority for anything which is in good faith done or intended to be done in the execution or purported execution of this Act or any other written law."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "12",
      "title": "Power to borrow",
      "content": "12. —(1) The Authority cannot raise loans for the performance of its functions under this Act or any other Act administered by the Authority except in accordance with this section. (2) Subject to subsection (3), the Authority may raise loans by — ( a ) mortgage, overdraft or other means, with or without security; ( b ) charge, whether legal or equitable, on any property vested in the Authority or on any other revenue receivable by the Authority under this Act or any other written law; or ( c ) the creation and issue of debentures or bonds, or such other instrument as the Minister may approve. (3) The Authority may raise loans under subsection (2) — ( a ) from the Government; or ( b ) with the approval of the Minister, from another source, whether in or outside Singapore. (4) For the purposes of this section, the power to raise loans includes the power to enter into any financial agreement or arrangement under which credit facilities are granted to the Authority for the purchase of goods or services. [Act 37 of 2021 wef 29/01/2022]"
    },
    {
      "provision_ref": "s12A",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "12A",
      "title": "Issue of shares, etc.",
      "content": "12A. As a consequence of the vesting of any property, rights or liabilities of the Government in the Authority under this Act, or of any capital injection or other investment by the Government in the Authority in accordance with any written law, the Authority must issue such shares or other securities to the Minister for Finance as that Minister may direct. [5/2002]"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "13",
      "title": "Duty of Authority in financial matters",
      "content": "13. It is the duty of the Authority so to exercise and perform its functions under this Act as to secure that the total revenues of the Authority are sufficient, taking one financial year with another, to meet its total outgoings properly chargeable to revenue account, including depreciation and interest on capital and to meet a reasonable proportion of the cost of the development of the services of the Authority."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "14",
      "title": "Annual estimates",
      "content": "14. A summary of the annual estimates and supplementary estimates adopted by the Authority must be published in the Gazette ."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "15",
      "title": "Power of investment",
      "content": "15. The Authority may invest its moneys (including the moneys in the Future Energy Fund) in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [45/2004] [Act 27 of 2024 wef 08/11/2024]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "16",
      "title": "Bank accounts",
      "content": "16. —(1) The Authority must open and maintain an account or accounts with any bank or banks that the Authority thinks fit. (2) Every such account must be operated by such person or persons authorised to do so by the Authority."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "17",
      "title": "Application of moneys",
      "content": "17. The moneys of the Authority must be applied only in payment or discharge of the expenses, obligations and liabilities of the Authority and in making any payment that the Authority is authorised or required to make."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "18",
      "title": "Financial year",
      "content": "18. The financial year of the Authority begins on 1 April of each year and ends on 31 March of the succeeding year. [5/2018]"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "19",
      "title": "Future Energy Fund",
      "content": "19. —(1) The Future Energy Fund is established consisting of — ( a ) all moneys from time to time appropriated from the Consolidated Fund or Development Fund and authorised to be paid into the Future Energy Fund by Supply law; ( b ) all moneys authorised by or under any other written law to be paid into the Future Energy Fund; ( c ) any gifts or donations made by any person for the purposes of the Future Energy Fund; and ( d ) all investments out of moneys in the Future Energy Fund authorised to be made by this Act and the proceeds of any such investment, including the net income from such investments. (2) Upon the commencement of section 6(1) of the Energy Transition Measures and Other Amendments Act 2024, the Government must pay into the Future Energy Fund such sum as the Minister charged with the responsibility for finance may determine out of moneys provided by Parliament for the Future Energy Fund. (3) For the purposes of subsection (1)( d ), the net income from investments is the amount ascertained by adding to, or deducting from, the income received from investments of moneys in the Future Energy Fund, any gain derived or loss sustained, realised or unrealised (as the case may be) from such investments. (4) Upon the dissolution of the Future Energy Fund during any term of office of the Government (within the meaning of the Constitution), the balance then remaining in that Fund must be transferred to the Consolidated Fund and added to the reserves of the Government not accumulated by it during that term of office. [Act 27 of 2024 wef 08/11/2024]"
    },
    {
      "provision_ref": "s19A",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "19A",
      "title": "Purposes of Future Energy Fund",
      "content": "19A. —(1) The moneys in the Future Energy Fund may be withdrawn by the Authority only for the following purposes: ( a ) for the Authority to carry on, or to provide or enable the provision of financial support in connection with or as a consequence of the carrying on of, any low-carbon energy project or energy supply security project; ( b ) for the Authority to carry on any associated design, investigative and engineering studies, survey or research preparatory to the undertaking of any project in paragraph ( a ); ( c ) to pay any of the following which is incurred or payable (as the case may be) for the purposes of any project in paragraph ( a ): (i) the costs incurred by the Collector of Land Revenue in the acquisition of any land under the Land Acquisition Act 1966; (ii) the compensation payable for the acquisition of any land under the Land Acquisition Act 1966; ( d ) to pay insurance premiums on — (i) capital equipment or other investments; and (ii) land (including structures and installations), constructed, improved, extended, replaced, acquired or leased using moneys from the Future Energy Fund; ( e ) to pay all amounts relating to the sale, disposal or write-off of any investments paid for with moneys from the Future Energy Fund; ( f ) to invest in accordance with section 15; ( g ) to pay any expenses properly attributable to the setting up of the Future Energy Fund and the administration, management and investment of moneys in that Fund. (2) Where a low-carbon energy project or an energy supply security project was commenced before the appointed date, the moneys in the Future Energy Fund may be withdrawn by the Authority for a purpose mentioned in subsection (1) in relation to the project only if, before the appointed date — ( a ) any infrastructure or property constructed, improved, extended, replaced, acquired or leased under the project; or ( b ) any transmission or distribution system improved or enhanced under the project, is not in a position to be used to provide goods or services to any person. (3) No investment paid for with moneys from the Future Energy Fund may be written-off by the Authority without the prior approval of the Minister. (4) The moneys in the Future Energy Fund must not be withdrawn — ( a ) for the purposes of land reclamation by or on behalf of the Government; ( b ) to pay for any fuel used for the generation of any electricity; or ( c ) to pay for any recurrent costs of any low-carbon energy project or energy supply security project. (5) The moneys in the Future Energy Fund may be used, or used to provide or enable the provision of financial support, for a purpose mentioned in subsection (1), in an amount which, based on a reasonable estimation by the Authority, will not contravene subsection (4). (6) In this section — “appointed date” means the date of commencement of section 6(1) of the Energy Transition Measures and Other Amendments Act 2024; “energy supply security project” means a project to ensure the security and reliability of any supply of energy utilities in Singapore, necessitated by any low-carbon energy project, including — ( a ) the improvement or enhancement of any transmission or distribution system in Singapore; and ( b ) the construction, improvement, extension, replacement, acquisition or leasing of any infrastructure or property (including the acquisition of any intellectual property), to provide power back-up in the event of any interruption in the import, generation, transmission or distribution of any electricity under the low-carbon energy project, including — (i) energy storage systems; (ii) fast-response generators (including diesel generators and gas engines) for generating electricity; (iii) systems activating localised generators to reduce consumers’ electricity demand from any transmission system; and (iv) combined-cycle gas turbines; “greenhouse gas” has the meaning given by section 2(1) of the Carbon Pricing Act 2018; “low-carbon electricity” means any electricity that is generated (whether in Singapore or elsewhere) using — ( a ) energy from any renewable energy source; or ( b ) any low-carbon fuel by which the emission of any greenhouse gas may be reduced or minimised when the fuel is used for the generation of electricity; “low-carbon energy project” means a project (whether or not in Singapore) consisting of the construction, improvement, extension, replacement, acquisition or leasing of any infrastructure or property (including the acquisition of any intellectual property), to enable the carrying on of any of the following: ( a ) the generation of low-carbon electricity (including the import, production, transportation and storage of any fuel used to generate such electricity) for supply to any person or premises in Singapore, or to persons or premises both in Singapore and outside Singapore, and the disposal, processing, storage or transportation of any waste produced in connection with the generation of low-carbon electricity; ( b ) the use of any energy storage system for the purposes of the supply of any electricity to any person or premises in Singapore, or to persons or premises both in Singapore and outside Singapore; ( c ) the disposal, processing, storage or transportation of emissions produced in connection with electricity that is not low-carbon electricity, generated for supply to any person or premises in Singapore, or to persons or premises both in Singapore and outside Singapore; ( d ) the import into Singapore of any electricity generated outside Singapore, and the transmission and distribution of the electricity for supply to any person or premises in Singapore, or to persons or premises both in Singapore and outside Singapore; “recurrent costs”, in relation to a low-carbon energy project or an energy supply security project, means any costs of a recurring nature incurred or that would be incurred in the ongoing operations of the subject matter of the project in the provision of goods or services. (7) The Minister may by order in the Gazette prescribe — ( a ) what is or is not a low-carbon fuel for the purposes of paragraph ( b ) of the definition of “low-carbon electricity” in subsection (6), generally or for one or more periods of time; and ( b ) what is or is not a cost of a recurring nature for the purposes of the definition of “recurrent costs” in subsection (6), generally or for one or more low-carbon energy projects or energy supply security projects. [Act 27 of 2024 wef 08/11/2024]"
    },
    {
      "provision_ref": "s19B",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "19B",
      "title": "Recovery of costs for energy initiatives",
      "content": "19B. —(1) This section applies where the Authority undertakes any energy initiative for any of the following purposes, whether by itself or through a person appointed by the Authority (called in this section appointed person): ( a ) to ensure the security or reliability of the supply of any energy utilities; ( b ) to improve or enhance the operation of any market or section of a market for any energy utilities; ( c ) to lower carbon emissions in connection with the supply of any energy utilities. (2) Regulations made under section 31 may provide for the imposition of any rate to recover the costs of the Authority or appointed person in undertaking any energy initiative, whether or not payable at the time the rate is imposed. (3) Where a rate is to be imposed for any costs not yet payable, and which amounts are not yet determined, then, for the purpose of imposing the rate, the Authority may make a reasonable estimation of the amounts of the costs that will be incurred. (4) Without affecting section 31, the regulations may make provision in relation to the payment and recovery of any rate, including — ( a ) the persons who must pay the rate, being any one or more of the following: (i) any electricity licensee under the Electricity Act 2001, or any person exempted from the requirement of an electricity licence under that Act; (ii) any gas licensee under the Gas Act 2001, or any person exempted from the requirement of a gas licence under that Act; (iii) any licensee under the District Cooling Act 2001, or any person exempted from the requirement of a licence under that Act; (iv) any consumer of any energy utilities, whether or not the person derives any direct or immediate benefit from the energy initiative for which the rate is imposed; ( b ) the amount of the rate payable by each person (including by way of a formula or other method which may incorporate by reference any other formula or market index of another body or organisation, as may be amended from time to time); ( c ) the manner in which the amount of any rate payable by any person is to be paid by the person (including to any person authorised by the Authority to collect the amount); and ( d ) if the amount of any rate payable by a person is not paid by the person, the manner in which the amount may be recovered from the person, and the regulations may, for each rate, make different provisions for different persons or classes of persons, or for different circumstances. (5) To avoid doubt, the regulations may provide that the rate imposed for any energy initiative in relation to any energy utilities is payable by all or any licensee, all or any consumer, or any combination thereof, in relation to that or any other energy utilities. (6) To avoid doubt, the regulations may be amended from time to time to alter the amount of the rate imposed on any person in relation to any energy initiative, for the purpose of ensuring that the amounts paid or recovered under the rate are reasonably commensurate with the costs of the Authority or appointed person (as the case may be) in undertaking the energy initiative. (7) Subject to subsection (8), the amounts paid or recovered under a rate imposed for any energy initiative are to be applied to meet the costs of the Authority or appointed person (as the case may be) in undertaking the energy initiative. (8) Where (despite any alteration under subsection (6)) the amounts paid or recovered under a rate imposed for any energy initiative exceed the costs of the Authority or appointed person (as the case may be) in undertaking the energy initiative, the Authority may retain the excess and apply the excess in payment of the costs of any other energy initiative undertaken by the Authority or any appointed person. [Act 27 of 2024 wef 01/07/2025]"
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "20",
      "title": "Symbol or representation of Authority",
      "content": "20. —(1) The Authority has the exclusive right to the use of any symbol or representation that the Authority may select or devise and thereafter display or exhibit the symbol or representation in connection with its activities or affairs. (2) Any person who uses a symbol or representation identical with that of the Authority, or which so resembles the Authority’s symbol or representation as to deceive or cause confusion, or to be likely to deceive or to cause confusion, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $250 for every day or part of a day during which the offence continues after conviction."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 4 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "21",
      "title": "Transfer to Authority of property, assets and liabilities",
      "content": "21. —(1) As from 1 April 2001, such movable and immovable property vested in the Board and used or managed by the Regulation Department and all assets, interests, rights, privileges, liabilities and obligations of the Board relating to that Department are transferred to and vest in the Authority without further assurance, act or deed. (2) If any question arises as to whether any particular property, asset, interest, right, privilege, liability or obligation has been transferred to or vested in the Authority under subsection (1), a certificate under the hand of the Minister for Finance is conclusive evidence that the property, asset, interest, right, privilege, liability or obligation was or was not so transferred or vested. (3) Every proceeding by or against the Board relating to the Regulation Department which are pending on 1 April 2001 may be continued, completed and enforced by or against the Authority. (4) Every agreement relating to any of the transferred properties to which the Board was a party immediately before 1 April 2001, whether or not of such nature that the rights and liabilities thereunder could be assigned, has effect as from that date as if — ( a ) the Authority had been a party to the agreement; and ( b ) for any reference to the Board there were substituted in respect of anything to be done on or after 1 April 2001 a reference to the Authority."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 4 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "22",
      "title": "Transfer of employees",
      "content": "22. —(1) As from 1 April 2001 — ( a ) all persons in the Regulation Department; and ( b ) any other persons that the Board may determine, employed immediately before that date by the Board are transferred to the service of the Authority on terms no less favourable than those enjoyed by them immediately prior to their transfer. (2) Until such time as terms and conditions of service are drawn up by the Authority, the scheme and terms and conditions of service in the Board continue to apply to every person transferred to the service of the Authority under subsection (1) as if the person were still in the service of the Board."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 4 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "23",
      "title": "Service rights, etc., of transferred employees to be preserved",
      "content": "23. —(1) The terms and conditions to be drawn up by the Authority must take into account the salaries and terms and conditions of service, including any accrued rights to leave, enjoyed by the persons transferred to the service of the Authority under section 22 while in the employment of the Board. (2) Any term or condition relating to the length of service with the Authority must provide for the recognition of service under the Board by the persons transferred under section 22 to be service by them under the Authority."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 4 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "24",
      "title": "Existing contracts",
      "content": "24. All deeds, bonds, agreements, instruments and arrangements subsisting immediately before 1 April 2001 to which the Board is a party and relating to the Regulation Department or to any employee of the Board transferred to the service of the Authority under section 22 continue in force on and after that date and are enforceable by or against the Authority as if the Authority had been named therein or had been a party thereto instead of the Board."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 4 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "25",
      "title": "Continuation and completion of disciplinary proceedings",
      "content": "25. —(1) Where on 1 April 2001 any disciplinary proceedings were pending against any employee of the Board transferred to the service of the Authority under section 22, the proceedings must be carried on and completed by the Authority. (2) Where on 1 April 2001 any matter was in the course of being heard or investigated or had been heard or investigated by a committee acting under due authority but no order, ruling or decision had been made thereon, the committee must complete the hearing or investigation and must make any order, ruling or direction that it could have made under the authority vested in it before that date. (3) Any order, ruling or direction made by a committee under this section is to be treated as an order, a ruling or a direction of the Authority and have the same force or effect as if it had been made by the Authority pursuant to the authority vested in the Authority under this Act."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 4 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "26",
      "title": "Misconduct or neglect of duty by employee before transfer",
      "content": "26. The Authority may reprimand, reduce in rank, retire, dismiss or punish in some other manner a person who had, whilst the person was in the employment of the Board, been guilty of any misconduct or neglect of duty which would have rendered him or her liable to be reprimanded, reduced in rank, retired, dismissed or punished in some other manner if he or she had continued to be in the employment of the Board, and if this Act had not been enacted."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 5 - GENERAL",
      "section": "27",
      "title": "Powers of enforcement",
      "content": "27. —(1) In addition to the powers conferred by any written law, an officer or employee of the Authority may, on declaration of his or her office and production to the person against whom he or she is acting of such identification card as the Chief Executive may direct to be carried by officers or employees of the Authority, in relation to any offence under any such written law — ( a ) require any person whom the officer or employee reasonably believes to have committed an offence under any such written law to furnish evidence of the person’s identity; ( b ) require any person, for the purpose of any such written law, to furnish any information or produce any book, document or copy thereof in the possession of that person, and may, without fee or reward, inspect, copy or make extracts from the book or documents; and ( c ) when conducting any investigation under such written law require, by written order, the attendance before the officer or employee of any person being within the limits of Singapore who, from the information given or otherwise appears to be acquainted with the circumstances of the case, and the person so ordered must attend as so required. (2) A person who — ( a ) refuses to give access to, or assaults, obstructs, hinders or delays, an officer or employee of the Authority in the discharge of the officer’s or employee’s duties; ( b ) wilfully misstates or without lawful excuse refuses to give any information or without lawful excuse refuses to produce any book, document or copy thereof required of the person by an officer or employee of the Authority under subsection (1); or ( c ) fails to comply with a lawful demand of an officer or employee of the Authority in the discharge of his or her duties, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 5 - GENERAL",
      "section": "28",
      "title": "Preservation of secrecy",
      "content": "28. —(1) A person ( A ) who is or has been a member, an officer, an employee or an agent of the Authority or a member of a committee of the Authority must not, except for the purpose of the performance of A ’s duties or the exercise of A ’s functions or when lawfully required to do so by any court or where required or allowed by the provisions of any written law, disclose any information relating to the affairs of the Authority or of any other person which has been obtained by A in the performance of A ’s duties or the exercise of A ’s functions. [5/2018] (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 5 - GENERAL",
      "section": "29",
      "title": "Offences committed by bodies corporate, etc.",
      "content": "29. Where an offence under this Act has been committed by a company, firm, society or other body of persons, and that offence is proved to have been committed with the authority, consent or connivance of any person who, at the time of the commission of the offence, was a director, manager, secretary or other similar officer or a partner of the company, firm, society or other body of persons or was purporting to act in any such capacity, that person shall also be guilty of that offence and shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 5 - GENERAL",
      "section": "30",
      "title": "Composition of offences",
      "content": "30. —(1) The Authority may compound any offence under this Act which is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum not exceeding $3,000. [5/2018] (2) The Authority may, with the approval of the Minister, make regulations to prescribe the offences which may be compounded. (3) All sums collected under this section must be paid to the Authority."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 5 - GENERAL",
      "section": "31",
      "title": "Regulations",
      "content": "31. The Authority may, with the approval of the Minister, make regulations for or in respect of every purpose which is considered by the Authority necessary or convenient to be prescribed for carrying out the provisions of this Act."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "“Authority” means the Energy Market Authority of Singapore established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Board",
      "definition": "“Board” means the Public Utilities Board continued under section 3 of the Public Utilities Act 2001;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Authority and includes any temporary Chairperson of the Authority;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive",
      "definition": "“Chief Executive” means the Chief Executive of the Authority, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means the Deputy Chairperson of the Authority and includes any temporary Deputy Chairperson of the Authority;",
      "source_provision": "s2"
    },
    {
      "term": "district cooling service",
      "definition": "“district cooling service” has the meaning given by the District Cooling Act 2001;",
      "source_provision": "s2"
    },
    {
      "term": "electricity",
      "definition": "“electricity” means electrical power when generated, transmitted, supplied or used for any purpose but excludes the transmission of any communication or signal;",
      "source_provision": "s2"
    },
    {
      "term": "energy utilities",
      "definition": "“energy utilities” includes electricity, gas and district cooling services;",
      "source_provision": "s2"
    },
    {
      "term": "Future Energy Fund",
      "definition": "“Future Energy Fund” means the fund of that name established under section 19; [Act 27 of 2024 wef 08/11/2024]",
      "source_provision": "s2"
    },
    {
      "term": "gas",
      "definition": "“gas” means natural gas and town gas, but excludes liquefied petroleum gas;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means any member of the Authority;",
      "source_provision": "s2"
    },
    {
      "term": "natural gas",
      "definition": "“natural gas” means mixture of gaseous hydrocarbons which is conveyed by gas pipes and is composed — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "premises",
      "definition": "“premises” includes buildings, structures, streets, lands, waters, tenements, easements of any tenure, whether State land or not, whether open or enclosed, whether built on or not, whether public or private, and whether maintained or not under statutory authority;",
      "source_provision": "s2"
    },
    {
      "term": "Regulation Department",
      "definition": "“Regulation Department” means the department of the Board by that name;",
      "source_provision": "s2"
    },
    {
      "term": "supply",
      "definition": "“supply” — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "town gas",
      "definition": "“town gas” means any substance in a gaseous state, which is conveyed in gas pipes and is manufactured from petrochemical feedstock, and has hydrogen as one of its main constituents. [5/2018]",
      "source_provision": "s2"
    },
    {
      "term": "appointed date",
      "definition": "“appointed date” means the date of commencement of section 6(1) of the Energy Transition Measures and Other Amendments Act 2024;",
      "source_provision": "s19A"
    },
    {
      "term": "energy supply security project",
      "definition": "“energy supply security project” means a project to ensure the security and reliability of any supply of energy utilities in Singapore, necessitated by any low-carbon energy project, including — ( a )",
      "source_provision": "s19A"
    },
    {
      "term": "greenhouse gas",
      "definition": "“greenhouse gas” has the meaning given by section 2(1) of the Carbon Pricing Act 2018;",
      "source_provision": "s19A"
    },
    {
      "term": "low-carbon electricity",
      "definition": "“low-carbon electricity” means any electricity that is generated (whether in Singapore or elsewhere) using — ( a )",
      "source_provision": "s19A"
    },
    {
      "term": "low-carbon energy project",
      "definition": "“low-carbon energy project” means a project (whether or not in Singapore) consisting of the construction, improvement, extension, replacement, acquisition or leasing of any infrastructure or property (including the acquisition of any intellectual property), to enable the carrying on of any of the following: ( a )",
      "source_provision": "s19A"
    },
    {
      "term": "recurrent costs",
      "definition": "“recurrent costs” , in relation to a low-carbon energy project or an energy supply security project, means any costs of a recurring nature incurred or that would be incurred in the ongoing operations of the subject matter of the project in the provision of goods or services.",
      "source_provision": "s19A"
    }
  ]
}