{
  "id": "flcmia-1959",
  "type": "statute",
  "title": "Federal Lands Commissioner, Malaysia (Incorporation) Act 1959",
  "title_en": "Federal Lands Commissioner, Malaysia (Incorporation) Act 1959",
  "short_name": "FLCMIA1959",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/FLCMIA1959",
  "description": "An Act to incorporate the Federal Lands Commissioner, Malaysia, and vest in that Corporation the properties previously vested in the Chief Secretary, Federation of Malaya.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act may be cited as the Federal Lands Commissioner, Malaysia (Incorporation) Act 1959."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act — “Federal Lands Commissioner” means the Federal Lands Commissioner of Malaysia appointed under the relevant law for the time being in force in Malaysia; “property” includes all estates, interests, easements and rights, whether equitable or legal, in, to or out of property, and things in action."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Incorporation of Federal Lands Commissioner",
      "content": "3. —(1) The officer for the time being appointed to be the Federal Lands Commissioner, and his successors in office, shall be a body corporate under the name of “the Federal Lands Commissioner” (referred to in this Act as the Corporation). (2) The Corporation may sue and be sued in its name and shall have perpetual succession and a corporate seal, and the seal may from time to time be broken, changed, altered and made anew as to the Corporation seems fit, and, until a seal is provided under this section, a stamp bearing the inscription “the Federal Lands Commissioner” may be used as the corporate seal."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Powers of Corporation",
      "content": "4. The Corporation may enter into contracts and may acquire, purchase, take, hold and enjoy movable and immovable property of every description, and may convey, assign, surrender and yield up, charge, mortgage, demise, re‑assign, transfer or otherwise dispose of, or deal with, any movable or immovable property vested in the Corporation upon such terms as to the Corporation seem fit."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Execution of documents",
      "content": "5. —(1) All deeds, documents and other instruments requiring the seal of the Corporation shall be sealed with the seal of the Corporation in the presence of the Federal Lands Commissioner who shall sign every such deed, document or other instrument to which the corporate seal is affixed, and such signing shall be sufficient evidence that the seal was duly and properly affixed and that the seal is the lawful seal of the Corporation. (2) Section 11 of the Registration of Deeds Act 1988 shall not apply to any instrument purporting to be executed under subsection (1)."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "",
      "content": "6. A notification in the Malaysia Gazette of the appointment of any person to be the Federal Lands Commissioner shall be conclusive evidence that that person was duly so appointed."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Vesting of property",
      "content": "7. —(1) All movable and immovable property in Singapore which, immediately before 27 February 1959 was vested in the Chief Secretary, Federation of Malaya, under the provisions of the Chief Secretary, Federation of Malaya (Incorporation) Ordinance (Cap. 294, 1955 Revised Edition), shall, on that date and without any conveyance, assignment or transfer whatever, vest in the Corporation for the like title, estate or interest and on the like tenure as the same was vested or held immediately before that date. (2) The President may, by order, vest in the Corporation any property, movable or immovable, for the time being vested in any officer or person for the purposes of the Government of Malaysia and, upon the coming into operation of any such order, the property to which the order relates shall, without any conveyance, assignment or transfer whatever, vest in the Corporation for the like title, estate or interest and on the like tenure as the same was vested or held immediately before the coming into operation of the order."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Vesting of rights and liabilities of Chief Secretary",
      "content": "8. All rights, powers and liabilities which were, immediately before 27 February 1959, vested in or imposed on the Chief Secretary, Federation of Malaya, by virtue of the Chief Secretary, Federation of Malaya (Incorporation) Ordinance (Cap. 294, 1955 Revised Edition) or otherwise shall, on that date, be vested in or be imposed on the Corporation."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Corporation to be a company for purposes of land acquisition",
      "content": "9. For the purposes of the Land Acquisition Act 1966, the Corporation shall be deemed to be a company, and any person duly appointed by the Corporation and authorised by the Minister shall be deemed to be an officer of the company."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Act deemed a private Act for purposes of Registration of Deeds Act 1988",
      "content": "10. For the purposes of the Registration of Deeds Act 1988, this Act shall be deemed to be a private Act."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Saving and other rights",
      "content": "11. Nothing in this Act shall affect the rights of the Government or of any bodies politic or corporate or other persons except such as are mentioned in this Act and those claiming by, from or under them."
    }
  ],
  "definitions": [
    {
      "term": "Federal Lands Commissioner",
      "definition": "“Federal Lands Commissioner” means the Federal Lands Commissioner of Malaysia appointed under the relevant law for the time being in force in Malaysia;",
      "source_provision": "s2"
    },
    {
      "term": "property",
      "definition": "“property” includes all estates, interests, easements and rights, whether equitable or legal, in, to or out of property, and things in action.",
      "source_provision": "s2"
    }
  ]
}