{
  "id": "gca-1973",
  "type": "statute",
  "title": "Geneva Conventions Act 1973",
  "title_en": "Geneva Conventions Act 1973",
  "short_name": "GCA1973",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/GCA1973",
  "description": "An Act to enable effect to be given to certain international Conventions relative to the amelioration of the condition of the wounded and sick in armed forces in the field, the amelioration of the condition of wounded, sick and shipwrecked members of armed forces at sea, the treatment of prisoners of war, and the protection of civilian persons in time of war, and for purposes connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Geneva Conventions Act 1973."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “court” does not include a subordinate military court constituted under the Singapore Armed Forces Act 1972; “protected internee” means a person protected by the Convention set out in the Fourth Schedule and interned in Singapore; “protected prisoner of war” means a person protected by the Convention set out in the Third Schedule; “Protecting Power”, in relation to a protected prisoner of war or a protected internee, means the Power or organisation which is carrying out, in the interests of the Power of which he or she is a national, or of whose forces he or she is, or was at any material time, a member, the duties assigned to Protecting Powers under the Convention set out in the Third or (as the case may be) the Fourth Schedule; “red crescent emblem” means the emblem of a red crescent on a white ground as depicted in Part 1 of the Sixth Schedule; “red cross emblem” means the emblem of a red cross on a white ground formed by reversing the Federal Colours of Switzerland as depicted in Part 2 of the Sixth Schedule; “red crystal emblem” means the emblem of a red crystal composed of a red frame in the shape of a square on edge on a white ground as depicted in Part 3 of the Sixth Schedule; “red lion and sun emblem” means the emblem of a red lion and sun on a white ground as depicted in Part 4 of the Sixth Schedule; “scheduled Conventions” means the Conventions set out in the Schedules. [55/2007]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - PUNISHMENT OF OFFENDERS AGAINST CONVENTIONS",
      "section": "3",
      "title": "Grave breaches of scheduled Conventions",
      "content": "3. —(1) Any person, whatever his or her citizenship or nationality, who, whether in or outside Singapore, commits, aids, abets or procures the commission by any other person of any grave breach of any scheduled Convention as is mentioned in the following Articles respectively of those Conventions: ( a ) Article 50 of the Convention set out in the First Schedule; ( b ) Article 51 of the Convention set out in the Second Schedule; ( c ) Article 130 of the Convention set out in the Third Schedule; or ( d ) Article 147 of the Convention set out in the Fourth Schedule, shall be guilty of an offence and shall be liable on conviction — ( e ) in the case of such a grave breach involving the wilful killing of a person protected by the Convention in question, to imprisonment for life; ( f ) in the case of any other such grave breach, to imprisonment for a term not exceeding 14 years. (2) In the case of an offence under this section committed outside Singapore, a person may be proceeded against, charged, tried and punished therefor in any place in Singapore as if the offence had been committed in that place, and the offence is, for all purposes incidental to or consequential on the trial or punishment thereof, deemed to have been committed in that place. (3) No Magistrate’s Court or District Court has jurisdiction to try any offence under this section, and proceedings for the offence must not be instituted except by or on behalf of the Public Prosecutor. (4) If in proceedings under this section in respect of a grave breach of any scheduled Convention any question arises under Article 2 of that Convention (which relates to the circumstances in which the Convention applies), that question is to be determined by the Minister and a certificate purporting to set out any such determination and to be signed by or on behalf of the Minister must be received in evidence and is deemed to be so signed without further proof, unless the contrary is shown. (5) The written law relating to the trial by a subordinate military court of persons who commit civil offences has effect for the purposes of the jurisdiction of subordinate military courts convened in Singapore as if this section had not been passed."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - PUNISHMENT OF OFFENDERS AGAINST CONVENTIONS",
      "section": "4",
      "title": "Notice of trial of protected person to be served on Protecting Power",
      "content": "4. —(1) The court before which — ( a ) a protected prisoner of war is brought up for trial for any offence; or ( b ) a protected internee is brought up for trial for an offence for which that court has power to sentence him or her to death or to imprisonment for a term of 2 years or more, must not proceed with the trial until it is proved to the satisfaction of the court that a notice containing the particulars mentioned in subsection (2), so far as they are known to the Public Prosecutor, has been served not less than 3 weeks previously on the Protecting Power and, if the accused is a protected prisoner of war, on the accused and the prisoner’s representative. (2) The particulars mentioned in subsection (1) are — ( a ) the full name and description of the accused, including the date of the accused’s birth and his or her profession or trade (if any) and, if the accused is a protected prisoner of war, his or her rank and army, regimental, personal or serial number; ( b ) the accused’s place of detention, internment or residence; ( c ) the offence with which the accused is charged; and ( d ) the court before which the trial is to take place and the time and place appointed for the trial. (3) For the purposes of this section a document purporting — ( a ) to be signed on behalf of the Protecting Power or by the prisoner’s representative or by the person accused, as the case may be; and ( b ) to be an acknowledgment of the receipt by that Power, representative or person on a specified day of a notice described therein as a notice under this section, is, unless the contrary is shown, sufficient evidence that the notice required by subsection (1) was served on that Power, representative or person on that day. (4) In this section “prisoner’s representative”, in relation to a particular protected prisoner of war at a particular time, means the person by whom the functions of prisoners’ representative within the meaning of Article 79 of the Convention set out in the Third Schedule were exercisable in relation to that protected prisoner at the camp or place at which that protected prisoner was, at or last before that time, detained as a protected prisoner of war. (5) Any court which adjourns a trial for the purpose of enabling the requirements of this section to be complied with may, despite anything in any other written law, remand the accused for the period of the adjournment."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - PUNISHMENT OF OFFENDERS AGAINST CONVENTIONS",
      "section": "5",
      "title": "Legal representation of certain persons",
      "content": "5. —(1) The court before which — ( a ) any person is brought up for trial for an offence under section 3; or ( b ) a protected prisoner of war is brought up for trial for any offence, shall not proceed with the trial unless — ( c ) the accused is represented by counsel; and ( d ) it is proved to the satisfaction of the court that a period of at least 14 days has elapsed since instructions for the representation of the accused at the trial were first given to the counsel, and if the court adjourns the trial for the purpose of enabling the requirements of this subsection to be complied with, then, despite anything in any other written law, the court may remand the accused for the period of the adjournment. (2) Where the accused is a protected prisoner of war, in the absence of counsel accepted by the accused as representing him or her, counsel instructed for the purpose on behalf of the Protecting Power is to be regarded, without affecting the requirements of subsection (1)( d ), for the purposes of that subsection as representing the accused. (3) If the court adjourns the trial pursuant to subsection (1) by reason that the accused is not represented by counsel, the court shall direct that a counsel be assigned to watch over the interests of the accused at any further proceedings in connection with the offence, and at any such further proceedings, in the absence of counsel either accepted by the accused as representing him or her or instructed as mentioned in subsection (2), counsel assigned pursuant to this subsection is to be regarded, without affecting the requirement of subsection (1)( d ), for the purposes of that subsection as representing the accused. (4) Counsel must be assigned, pursuant to subsection (3), in such manner as the Minister may by order prescribe, and any counsel so assigned is entitled to be paid out of moneys provided by such sums in respect of fees and disbursements as the Minister may by regulations prescribe."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - PUNISHMENT OF OFFENDERS AGAINST CONVENTIONS",
      "section": "6",
      "title": "Appeals by protected persons",
      "content": "6. —(1) A protected prisoner of war or a protected internee who has been convicted and sentenced to death or to imprisonment for a term of 2 years or more may appeal against the conviction and sentence imposed upon him or her. (2) Despite section 377(2) of the Criminal Procedure Code 2010, notice of an appeal under subsection (1) shall be given not later than 10 days after the date on which the protected person receives a notice given — ( a ) in the case of a protected prisoner of war, by an officer of the Singapore Armed Forces; or ( b ) in the case of a protected internee, by or on behalf of the governor of the prison in which the protected internee is confined, that the Protecting Power has been notified of the protected person’s conviction and sentence. [40/2019]"
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - PUNISHMENT OF OFFENDERS AGAINST CONVENTIONS",
      "section": "7",
      "title": "Powers of Minister",
      "content": "7. —(1) It is lawful for the Minister, in any case in which a protected prisoner of war or a protected internee is convicted of an offence and sentenced to a term of imprisonment, to direct that there is to be deducted from that term a period not exceeding the period (if any) during which that person was in custody in connection with that offence, either on remand or after committal for trial (including the period of the trial), before the sentence began, or is deemed to have begun, to run. (2) It is lawful for the Minister in a case where he or she is satisfied that a protected prisoner of war accused of an offence has been in custody in connection with that offence, either on remand or after committal for trial (including the period of the trial), for an aggregate period of at least 3 months, to direct that the prisoner be transferred from that custody to the custody of an officer of the Singapore Armed Forces and thereafter remain in military custody at a camp or place in which protected prisoners of war are detained, and be brought before the court at the time appointed by the remand or committal order."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - PREVENTION OF ABUSE OF RED CROSS",
      "section": "8",
      "title": "Prohibition of use of emblem without authority",
      "content": "8. A person must not, without the Minister’s authority, use for any purpose in Singapore — ( a ) the red crescent emblem; ( b ) the red cross emblem; ( c ) the red crystal emblem; ( d ) the red lion and sun emblem; or ( e ) the words “Red Cross” or “Geneva Cross”. [55/2007]"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - PREVENTION OF ABUSE OF RED CROSS",
      "section": "9",
      "title": "Prohibition of use of certain words and designs",
      "content": "9. A person must not, without the Minister’s authority, use for any purpose whatsoever — ( a ) any design consisting of a white or silver cross on a red ground, none of the limbs of which extends to the margin of the ground, being the cross comprised in the Arms of the Swiss Confederation; ( b ) any design being a colourable imitation of the design mentioned in paragraph ( a ); ( c ) any design being a colourable imitation of the red crescent emblem, the red cross emblem, the red crystal emblem or the red lion and sun emblem; or ( d ) any words so nearly resembling the words “Red Cross” or “Geneva Cross” as to be capable of being understood as referring to the red cross emblem. [55/2007]"
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - PREVENTION OF ABUSE OF RED CROSS",
      "section": "10",
      "title": "Penalty",
      "content": "10. —(1) If any person contravenes any of the provisions of this Part, he or she shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both and, in addition, any goods upon or in connection with which the emblem, design or words (as the case may be) was or were used, shall be forfeited. [55/2007] (2) Where an offence committed by a body corporate or society is proved to have been committed with the consent or connivance of any director, manager, secretary or other officer of the body corporate or society, he or she, as well as the body corporate or society, shall be deemed to be guilty of the offence and shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "s10A",
      "chapter": "PART 3 - PREVENTION OF ABUSE OF RED CROSS",
      "section": "10A",
      "title": "Inspectors",
      "content": "10A. —(1) The Minister may appoint one or more public officers as inspectors to investigate the commission of an offence under this Part. [55/2007] (2) For the purposes of an investigation under subsection (1) — ( a ) an inspector may — (i) require any person to furnish any information that is within the person’s knowledge that the inspector believes on reasonable grounds to be connected with any suspected contravention of this Part; (ii) require any person to produce any book, document, paper or other record, or other article, which may be related to the subject matter of the investigation for inspection by the inspector and for making copies thereof; and (iii) examine orally any person supposed to be acquainted with the facts and circumstances relevant to the carrying out of the provisions of this Part; and ( b ) an inspector may, without warrant, enter, inspect and search any premises that the inspector has reason to suspect are being used, for or in connection with any purpose that is in contravention of this Part, and may — (i) inspect and make copies of and take extracts from, or require the person having the management or control of the premises to provide copies of or extracts from, any book, document, record or electronic material which the inspector reasonably believes to be the subject matter of, or to be connected with, an investigation under subsection (1); (ii) take such photographs or video recordings as the inspector thinks necessary to record the premises or part thereof, including any apparatus, appliance, equipment, instrument, article, book, document, record or thing found on the premises; and (iii) seize and remove from the premises any book, record, document, apparatus, equipment, instrument, material or thing which the inspector reasonably believes to be the subject matter of, or to be connected with, an investigation under subsection (1). [55/2007] (3) Any information given by any person under subsection (2)( a )(i) or (iii) must — ( a ) be reduced to a statement in writing and read over to the person; and ( b ) after correction, be signed by the person. [55/2007] (4) Any person who, without lawful excuse — ( a ) refuses to answer any question put to the person by an inspector or gives a false answer to such question; ( b ) refuses or fails to comply with any requirement of the inspector under subsection (2); or ( c ) wilfully obstructs an inspector in the exercise of the inspector’s authority under subsection (2), shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both. [55/2007]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - PREVENTION OF ABUSE OF RED CROSS",
      "section": "11",
      "title": "Prosecution of offences",
      "content": "11.   Proceedings under this Part must not be instituted without the consent of the Public Prosecutor.   Note: Part IV of this Act is here omitted as having had its effect."
    }
  ],
  "definitions": [
    {
      "term": "court",
      "definition": "“court” does not include a subordinate military court constituted under the Singapore Armed Forces Act 1972;",
      "source_provision": "s2"
    },
    {
      "term": "protected internee",
      "definition": "“protected internee” means a person protected by the Convention set out in the Fourth Schedule and interned in Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "protected prisoner of war",
      "definition": "“protected prisoner of war” means a person protected by the Convention set out in the Third Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Protecting Power",
      "definition": "“Protecting Power” , in relation to a protected prisoner of war or a protected internee, means the Power or organisation which is carrying out, in the interests of the Power of which he or she is a national, or of whose forces he or she is, or was at any material time, a member, the duties assigned to Protecting Powers under the Convention set out in the Third or (as the case may be) the Fourth Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "red crescent emblem",
      "definition": "“red crescent emblem” means the emblem of a red crescent on a white ground as depicted in Part 1 of the Sixth Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "red cross emblem",
      "definition": "“red cross emblem” means the emblem of a red cross on a white ground formed by reversing the Federal Colours of Switzerland as depicted in Part 2 of the Sixth Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "red crystal emblem",
      "definition": "“red crystal emblem” means the emblem of a red crystal composed of a red frame in the shape of a square on edge on a white ground as depicted in Part 3 of the Sixth Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "red lion and sun emblem",
      "definition": "“red lion and sun emblem” means the emblem of a red lion and sun on a white ground as depicted in Part 4 of the Sixth Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "scheduled Conventions",
      "definition": "“scheduled Conventions” means the Conventions set out in the Schedules. [55/2007]",
      "source_provision": "s2"
    }
  ]
}