{
  "id": "gsno-1958",
  "type": "statute",
  "title": "Good Shepherd Nuns Ordinance 1958",
  "title_en": "Good Shepherd Nuns Ordinance 1958",
  "short_name": "GSNO1958",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/GSNO1958",
  "description": "An Ordinance to incorporate the Reverend Mother Superior of the Good Shepherd Nuns in Malaya.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Ordinance may be cited as the Good Shepherd Nuns Ordinance 1958."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Reverend Mother Superior of the Good Shepherd Nuns to be a body corporate",
      "content": "2. —(1) The said Reverend Mother Mary of St. Liguori and her successors for the time being in office of the Reverend Mother Superior of the Good Shepherd Nuns in Malaya, duly authorised and appointed as hereinafter provided, shall be a body corporate, hereinafter in this Ordinance called the “Corporation” and shall hereafter for the purposes of this Ordinance have the name of the “Reverend Mother Superior of the Good Shepherd Nuns in Malaya”, and by that name have perpetual succession and shall and may have and use a corporate seal. (2) The said seal may from time to time be broken, changed, altered and made anew as the Corporation thinks fit. (3) The Corporation may acquire, purchase, take, hold and enjoy movable and immovable property of every description, and may sell, convey, assign, surrender and yield up, mortgage, demise, re‑assign, transfer or otherwise dispose of any movable and immovable property vested in the Corporation upon such terms as the Corporation thinks fit."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Use of corporate seal",
      "content": "3. —(1) All deeds, documents and other instruments requiring the seal of the Corporation shall be sealed with the seal of the Corporation in the presence of the Reverend Mother Superior for the time being or her attorney, duly authorised by power of attorney deposited under section 48 of the Conveyancing and Law of Property Act 1886, and shall also be signed by the said Reverend Mother Superior for the time being, or her attorney so authorised as aforesaid. (2) Such signing shall be and be taken as sufficient evidence that the said seal was duly and properly affixed and that the same is the lawful seal of the Corporation."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Notification of appointment of Reverend Mother Superior",
      "content": "4. A notification in the Gazette of the appointment of any person to exercise the office of Reverend Mother Superior of the Good Shepherd Nuns in Malaya shall be conclusive evidence that such person was duly authorised to exercise the said office."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Saving of Government and other rights",
      "content": "5. Nothing in this Ordinance shall affect the rights of the Government, all bodies politic and corporate, and all others, except such as are expressly mentioned in this Ordinance and those claiming by, from or under them. [7/97]"
    }
  ],
  "definitions": []
}