{
  "id": "hpba-2001",
  "type": "statute",
  "title": "Health Promotion Board Act 2001",
  "title_en": "Health Promotion Board Act 2001",
  "short_name": "HPBA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/HPBA2001",
  "description": "An Act to establish the Health Promotion Board, to provide for its functions and powers, and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Health Promotion Board Act 2001."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Board” means the Health Promotion Board established under section 3; “Chairperson” means the Chairperson of the Board and includes a temporary Chairperson appointed under section 8; “Chief Executive” means the Chief Executive of the Board, and includes any individual acting in that capacity; “member” means a member of the Board. [5/2018]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION",
      "section": "3",
      "title": "Establishment and incorporation of Health Promotion Board",
      "content": "3. A body called the Health Promotion Board is established, which is a body corporate with perpetual succession and a common seal and is by that name capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing, or disposing of property, both movable and immovable; and ( c ) doing and suffering all such other acts or things as a body corporate may lawfully do and suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION",
      "section": "4",
      "title": "Common seal",
      "content": "4. —(1) The Board must have a common seal and the seal may be broken, changed, altered or made anew as the Board thinks fit. (2) All deeds and other documents requiring the seal of the Board must be sealed with the common seal of the Board. (3) All instruments to which the common seal is affixed must be signed by any 2 members generally or specially authorised by the Board for the purpose or by one member and the Chief Executive. (4) The Board may, by resolution or otherwise in writing, appoint an officer of the Board or any other agent either generally or in any particular case to execute or sign on behalf of the Board any agreement or other instrument not under seal in relation to any matter coming within the powers of the Board. (5) All courts, judges and persons acting judicially are to take judicial notice of the common seal of the Board affixed to any document and presume that it was duly affixed."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION",
      "section": "5",
      "title": "Constitution of Board",
      "content": "5. —(1) The Board consists of — ( a ) a Chairperson; and ( b ) not less than 6 but not more than 10 other members, all of whom must be appointed by the Minister. (2) The Minister may appoint the Chief Executive to be a member of the Board."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION",
      "section": "6",
      "title": "Chairperson may delegate functions",
      "content": "6. The Chairperson may in writing authorise any member to exercise any power or perform any function conferred on the Chairperson by or under this Act."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION",
      "section": "7",
      "title": "Term of office of members",
      "content": "7. —(1) A member of the Board (including the Chairperson) holds office on such conditions and for such term, not exceeding 3 years, as the Minister specifies in the appointment, and may be re‑appointed. (2) Any member of the Board may resign from his or her office at any time by giving at least one month’s notice in writing to the Minister. (3) The Minister may at any time revoke the appointment of any member as the Minister considers necessary in the interest of the effective performance of the functions of the Board under this Act, or in the public interest. (4) If a member dies or resigns or has his or her appointment revoked, the Minister may appoint any person to fill the vacancy for the remainder of the term for which the vacating member was appointed. (5) The Board is to pay to the Chairperson and other members of the Board, out of the funds of the Board, such salaries, fees and allowances as the Minister may determine."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION",
      "section": "8",
      "title": "Temporary Chairperson",
      "content": "8. If the Chairperson is absent from Singapore, or for any other reason unable to discharge his or her functions, the Minister may appoint one of the members to act as a temporary Chairperson."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION",
      "section": "9",
      "title": "Meetings and proceedings of Board",
      "content": "9. —(1) At all meetings of the Board, 5 members form a quorum. (2) The Chairperson presides at all meetings of the Board and, in his or her absence, the members present must elect one of their number to preside. (3) Meetings of the Board must be held at such times and places as the Chairperson may determine. (4) All questions arising at any meeting must be decided by a majority of votes of the members present and voting. (5) At any meeting of the Board, the Chairperson or, in his or her absence, the member presiding at the meeting has a deliberative vote and, in the case of an equality of votes, he or she also has a casting vote. (6) The validity of any proceedings of the Board is not affected by any vacancy among its members or by any defect in the appointment of any member. (7) Subject to the provisions of this Act and the Public Sector (Governance) Act 2018, the Board may regulate its own proceedings. [5/2018] 10. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - FUNCTIONS, OBJECTS, DUTIES AND",
      "section": "11",
      "title": "Functions, objects and duties of Board",
      "content": "11. —(1) Subject to the provisions of this Act, the functions, objects and duties of the Board are — ( a ) to advise the Government, either of its own motion or upon request made to it by the Minister, on all matters connected with the promotion of good health and healthy lifestyles among the people of Singapore, including the formulation of policies, the creation of conditions and the provision of public facilities that are conducive to the promotion of good health and healthy lifestyles among the people of Singapore; ( b ) to devise, organise and implement — (i) programmes and other activities for or related to the promotion of good health and healthy lifestyles among the people of Singapore; (ii) health education programmes; and (iii) programmes and other activities for or related to the prevention or detection of diseases; ( c ) to collaborate with any organisation to devise, organise and implement, or to provide support or assistance to any organisation in devising, organising and implementing, any of the programmes or activities mentioned in paragraph ( b ); ( d ) to monitor and conduct investigations and research into any matter relating to the health and nutritional statuses of the people of Singapore; ( e ) to encourage and facilitate healthier food choices in Singapore; ( f ) to determine, establish and recommend — (i) nutritional standards and dietary guidelines; and (ii) guidelines for the provision of nutritional information; ( g ) to provide healthcare services (including medical, dental, health-screening and immunisation services) to school children and such other persons or class of persons as the Board thinks fit; ( h ) to provide consultancy services to Government departments, members of the healthcare industry and the private sector on matters relating to health education, the preservation and promotion of health, healthy lifestyles and healthy dietary practices and the prevention and detection of diseases; ( i ) to represent the Government internationally on matters related to or connected with health education, the preservation and promotion of health and the prevention and detection of diseases; and ( j ) to carry out any other functions that are imposed upon the Board by or under this Act or any other written law. [11/2019] (2) The Minister may give to the Board any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (3) Nothing in this section is to be construed as imposing on the Board, directly or indirectly, any form of duty or liability enforceable by proceedings before any court."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - FUNCTIONS, OBJECTS, DUTIES AND",
      "section": "12",
      "title": "Powers of Board",
      "content": "12. The Board has power to do anything for the purpose of discharging its functions, objects and duties under this Act, or which is incidental or conducive to the discharge of those functions, objects or duties and, in particular, may — ( a ) enter into any contracts that may be necessary or expedient for the purpose of discharging its functions, objects or duties; ( b ) with the approval of the Minister, acquire and hold such movable or immovable property as may be necessary or expedient for carrying into effect the provisions of this Act and for the same purposes may sell, lease, mortgage, or otherwise alienate or dispose of any property so acquired; ( c ) with the approval of the Minister, form or participate in the formation of any company, partnership or joint venture as a shareholder or partner or in any other capacity and to share profits; ( d ) organise such courses and other programmes as the Board thinks necessary or desirable for the discharge of its functions, objects or duties; ( e ) collect, analyse, compile, publish or disseminate information of a statistical nature relating to — (i) the health or nutritional statuses of the people of Singapore; or (ii) any other subject matter that may be necessary for the discharge of the functions, objects or duties of the Board; ( f ) provide technical, consultancy or advisory services to any Government agency or to any other person or body in Singapore or elsewhere on any matter related to or connected with the functions, objects or duties of the Board; ( g ) become a member or affiliate of any international body the functions, objects or duties of which are similar to those of the Board; ( h ) charge fees or commissions for services rendered by the Board or for the use of any of its facilities; ( i ) carry out promotional or publicity activities in any form; ( j ) receive donations, grants, gifts, subsidies or contributions from any source, and raise funds by all lawful means; ( k ) publish or sponsor the publication of works concerning the preservation and promotion of good health, health education or any other matter related to the functions, objects or duties of the Board; ( l ) grant loans to officers or employees of the Board for any purposes specifically approved by the Board as are likely to increase the efficiency of its officers or employees; ( m ) provide recreational facilities and promote recreational activities for, and activities conducive to, the welfare of officers or employees of the Board and members of their families; and ( n ) provide training for employees of the Board and to award scholarships or otherwise pay for such training."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - FUNCTIONS, OBJECTS, DUTIES AND",
      "section": "13",
      "title": "Committees",
      "content": "13. —(1) The Board may appoint committees consisting of one or more persons (whether members of the Board or not) and define or vary the terms of reference of those committees. (2) Subject to this Act and the Public Sector (Governance) Act 2018 and to the control of the Board, each committee appointed under this section may regulate its procedure in such manner as the committee thinks fit. [5/2018]"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - FUNCTIONS, OBJECTS, DUTIES AND",
      "section": "14",
      "title": "Delegation of powers",
      "content": "14. —(1) The Board may, in respect of a specified matter or class of matters, by writing, delegate any of its powers to a member, officer or committee of the Board. (2) Every member, officer or committee purporting to act pursuant to a delegation under this section is, in the absence of proof to the contrary, presumed to be acting in accordance with the terms of the delegation."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "15",
      "title": "Chief Executive, officers and employees, etc.",
      "content": "15. —(1) There must be a Chief Executive of the Board, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Board may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive during any period, or during all periods, when the Chief Executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018] (3) The Board may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on such terms and conditions as it may determine, such other officers, employees, consultants and agents as may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "16",
      "title": "Protection from personal liability",
      "content": "16. —(1) No suit or other legal proceedings shall lie personally against any member, officer or employee of the Board or other person acting under the direction of the Board for anything which is in good faith done or intended to be done in the execution or purported execution of this Act or any other written law. (2) Where the Board provides a service to the public by which information is supplied to the public, neither the Board nor any of its employees involved in the supply of the information shall be liable for any loss or damage suffered by any member of the public by reason of any error or omission of whatever nature appearing in the information or however caused if made in good faith and in the ordinary course of the discharge of the duties of such employees. 17. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "18",
      "title": "Financial year",
      "content": "18. The financial year of the Board begins on 1 April of each year and ends on 31 March of the succeeding year."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "19",
      "title": "Minister’s approval of estimates",
      "content": "19. —(1) A copy of all annual estimates of revenue and expenditure and supplementary estimates must, upon their adoption by the Board, be sent without delay to the Minister. [5/2018] (2) The Minister may approve or disallow any item or portion of any item shown in the annual estimates or supplementary estimates. [5/2018] (3) The Minister must return the annual estimates or supplementary estimates as amended under subsection (2) to the Board, and the Board is bound by the Minister’s decision. [5/2018] (4) However, the Board may transfer all or any part of moneys assigned to one item of expenditure to any item under the same head of expenditure in any estimates approved by the Minister. [5/2018]"
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "20",
      "title": "Funds of Board",
      "content": "20. The funds of the Board consist of — ( a ) all moneys transferred to the Board under section 30; ( b ) all moneys received by the Board by way of grants or subsidies; ( c ) all gifts, donations and contributions to the Board; ( d ) all fees, charges, commissions, rents, interests, dividends and other income accruing to the Board; ( e ) all moneys borrowed by the Board under this Act; ( f ) all moneys recovered or collected by the Board or any officer or employee of the Board (including sums collected for the composition of offences) under this Act or any other written law administered by the Board; and ( g ) all other moneys lawfully received by the Board for the purposes of the Board."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "21",
      "title": "Grants-in-aid",
      "content": "21. For the purpose of enabling the Board to carry out its functions under this Act, the Minister may make grants‑in‑aid to the Board of such sums of money, as the Minister may determine, out of moneys to be provided by Parliament."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "22",
      "title": "Borrowing powers",
      "content": "22. The Board may for the purposes of this Act raise loans from the Government or, with the consent of the Minister, from any other source."
    },
    {
      "provision_ref": "s22A",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "22A",
      "title": "Issue of shares, etc.",
      "content": "22A. As a consequence of the vesting of any property, rights or liabilities of the Government in the Board under this Act, or of any capital injection or other investment by the Government in the Board in accordance with any written law, the Board must issue such shares or other securities to the Minister for Finance as that Minister may direct."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "23",
      "title": "Bank accounts",
      "content": "23. The Board must open and maintain one or more accounts with such bank or banks as the Board thinks fit and every such account must be operated by such person or persons authorised to do so by the Board."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "24",
      "title": "Application of funds",
      "content": "24. The funds of the Board must be applied only in payment or discharge of the expenses, obligations and liabilities of the Board and in making any payment that the Board is authorised or required to make."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "25",
      "title": "Power of investment",
      "content": "25. The Board may invest its funds in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [45/2004] 26. [ Repealed by Act 5 of 2018 ] 27. [ Repealed by Act 5 of 2018 ] 28. [ Repealed by Act 5 of 2018 ] 29. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "30",
      "title": "Transfer to Board of property, assets and liabilities",
      "content": "30. —(1) As from 1 April 2001, such movable and immovable property vested in the Government as may be determined by the Minister for Finance and used or managed by any of the departments as specified in the Schedule and all assets, interests, rights, privileges, liabilities and obligations of the Government relating to any such department are transferred to and vest in the Board without further assurance, act or deed. (2) If any question arises as to whether any particular property, or whether any particular asset, interest, right, privilege, liability or obligation has been transferred to or vested in the Board under subsection (1), a certificate under the hand of the Minister for Finance is conclusive evidence that the property, asset, interest, right, privilege, liability or obligation was or was not so transferred or vested. (3) Any immovable property to be transferred to and vested in the Board under subsection (1) is held by the Board upon such tenure and subject to such terms and conditions as the President may determine."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "31",
      "title": "Transfer of employees",
      "content": "31. —(1) As from 1 April 2001, all persons who immediately before that date were employed by the Government in any of the departments as specified in the Schedule are transferred to the service of the Board on terms no less favourable than those enjoyed by them immediately prior to their transfer. (2) Until such time as terms and conditions of service are drawn up by the Board, the scheme and terms and conditions of the Government continue to apply to every person transferred to the service of the Board under subsection (1) as if he or she were still in the employment of the Government."
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "32",
      "title": "Pension rights, etc., of Government employees to be preserved",
      "content": "32. —(1) The terms and conditions to be drawn up by the Board must take into account the terms and conditions of service (including salaries and accrued rights to leave) enjoyed by the persons transferred to the service of the Board under section 31 while in the employment of the Government. (2) Any term or condition relating to the length of service with the Board must recognise the length of service of the persons so transferred while in the employment of the Government to be service with the Board. (3) Nothing in the terms and conditions to be drawn up by the Board is to adversely affect the conditions that would have been applicable to persons transferred to the service of the Board as regards any pension, gratuity or allowance payable under the Pensions Act 1956. (4) Where a person has been transferred to the service of the Board under section 31, the Government is liable to pay to the Board such portion of any pension, gratuity or allowance payable to the person on his or her retirement as the same bears to the proportion which the aggregate amount of his or her pensionable emoluments during his or her service with the Government bears to the aggregate amount of his or her pensionable emoluments during his or her service under both the Government and the Board. (5) Where any person in the service of the Board, whose case does not fall within the scope of any pension or other schemes established under this section, retires or dies in the service of the Board or is discharged from such service, the Board may grant to him or her or to such other person or persons wholly or partly dependent on him or her, as the Board thinks fit, such allowance or gratuity as the Board may determine."
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "33",
      "title": "No benefits in respect of abolition or reorganisation of office",
      "content": "33. Despite the provisions of the Pensions Act 1956, no person who is transferred to the service of the Board under section 31 is entitled to claim any benefit under that Act on the ground that he or she has been retired from the service of the Government on account of abolition or reorganisation of office in consequence of the establishment and incorporation of the Board."
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "34",
      "title": "Existing contracts",
      "content": "34. All deeds, contracts, schemes, bonds, agreements, instruments and arrangements, subsisting immediately before 1 April 2001 to which the Government is a party and relating to any of the departments specified in the Schedule or to any person transferred to the service of the Board under section 31 continue in force on and after that date and are enforceable by or against the Board as if the Board had been named therein or had been a party thereto instead of the Government."
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "35",
      "title": "Continuation and completion of disciplinary and other legal proceedings",
      "content": "35. —(1) Where on 1 April 2001, any disciplinary proceedings were pending against any employee of the Government transferred to the service of the Board, the proceedings must be carried on and completed by the Board. (2) Where on 1 April 2001, any matter was in the course of being heard or investigated or had been heard or investigated by a committee acting under due authority but no order, ruling or decision had been made on the matter, the committee must complete the hearing or investigation and must make an order, ruling or direction that it could have made under the authority vested in it before that date. (3) Any order, ruling or direction made by a committee pursuant to this section is to be treated as an order, a ruling or a direction of the Board and has the same force or effect as if it had been made by the Board pursuant to the authority vested in the Board under this Act. (4) All proceedings or causes of action pending or existing immediately before 1 April 2001 by or against the Government in respect of any of the departments specified in the Schedule may be continued, completed and enforced by or against the Board."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "36",
      "title": "Misconduct or neglect of duty by employee before transfer",
      "content": "36. The Board may reprimand, reduce in rank, retire, dismiss or punish in some other manner a person who had, while he or she was in the employment of the Government, been guilty of any misconduct or neglect of duty which would have rendered him or her liable to be reprimanded, reduced in rank, retired, dismissed or punished in some other manner if he or she had continued to be in the employment of the Government and if this Act had not been enacted."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "38",
      "title": "Symbol or representation of Board",
      "content": "38. —(1) The Board has the exclusive right to the use of such symbol or representation as it may select or devise and thereafter display or exhibit the symbol or representation in connection with its activities or affairs. (2) Any person who uses a symbol or representation identical with that of the Board, or which so resembles the Board’s symbol or representation as to deceive or cause confusion, or to be likely to deceive or to cause confusion, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "39",
      "title": "Preservation of secrecy",
      "content": "39. —(1) Except for the purpose of the performance of his or her duties or the exercise of his or her functions or when lawfully required to do so by any court or where required or allowed by any written law, a person who is or has been a member, an officer, an employee or an agent of the Board or a member of a committee of the Board must not disclose any information relating to the affairs of the Board or of any other person which has been obtained by him or her in the performance of his or her duties or the exercise of his or her functions. [5/2018] (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "40",
      "title": "Composition of offences",
      "content": "40. —(1) The Chief Executive or any officer authorised by the Chief Executive may compound any offence under this Act that is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum of money not exceeding $1,000. (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "41",
      "title": "Regulations",
      "content": "41. The Board may, with the approval of the Minister, make regulations for any or both of the following purposes: ( a ) regulating the proceedings of the Board or of the committees of the Board; ( b ) providing for or prescribing any matters which are necessary or convenient to be provided for or prescribed for carrying out or giving effect to the provisions of this Act."
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "42",
      "title": "Saving",
      "content": "42. Insofar as it is necessary to preserve the effect of any document issued by or relating to any of the departments specified in the Schedule, any reference in such document to any such department is to be construed as a reference to the Board."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Health Promotion Board established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Board and includes a temporary Chairperson appointed under section 8;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive",
      "definition": "“Chief Executive” means the Chief Executive of the Board, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means a member of the Board. [5/2018]",
      "source_provision": "s2"
    }
  ]
}