{
  "id": "hta-2010",
  "type": "statute",
  "title": "Hostage-Taking Act 2010",
  "title_en": "Hostage-Taking Act 2010",
  "short_name": "HTA2010",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/HTA2010",
  "description": "An Act to give effect to the International Convention against the Taking of Hostages and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Hostage-Taking Act 2010."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “bank” means a bank or merchant bank licensed under the Banking Act 1970, and includes a finance company licensed under the Finance Companies Act 1967; “Convention” means the International Convention against the Taking of Hostages adopted by the General Assembly of the United Nations on 17 December 1979; “Convention country” means a foreign country that is a Party to the Convention; “country” includes a State or territory, as the case may be; “hostage-taking offence” means — ( a ) the offence under section 3; or ( b ) an abetment of, or a conspiracy or attempt to commit, the offence under section 3. [1/2020]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Hostage-taking",
      "content": "3. —(1) Any person ( A ) who — ( a ) seizes or detains another person ( B ); and ( b ) threatens to cause death or hurt to B or to continue to detain B , or by A ’s conduct gives rise to a reasonable apprehension that B may be put to death or hurt or may continue to be detained, or causes death or hurt to B , in order to compel — ( c ) the Government, the government of another State or an international intergovernmental organisation to do or abstain from doing any act shall be guilty of an offence, and shall be punished with death or imprisonment for life, and shall, if A is not sentenced to death, also be liable to fine or to caning; or ( d ) any other person ( C ) to do or abstain from doing any act shall be guilty of an offence, and shall be punished with imprisonment for a term which may extend to 15 years, and shall also be liable to fine or to caning. (2) Subsection (1) does not apply to any act which is an offence under section 3 of the Geneva Conventions Act 1973."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Extraterritoriality",
      "content": "4. Every person who, outside Singapore, commits an act that, if committed in Singapore, would constitute a hostage-taking offence is deemed to commit the act in Singapore and may be proceeded against, charged, tried and punished accordingly."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Information relating to hostage-taking offence",
      "content": "5. —(1) Every person in Singapore who has information which he or she knows or believes may be of material assistance — ( a ) in preventing the commission by another person of a hostage-taking offence; or ( b ) in securing the apprehension, prosecution or conviction of another person, in Singapore, for a hostage-taking offence, and who fails to disclose the information immediately to a police officer shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $50,000 or to imprisonment for a term not exceeding 5 years or to both. (2) No criminal or civil proceedings shall lie against a person for any disclosure made in good faith under this section. (3) A person who makes a disclosure in good faith under this section is not to be treated as being in breach of any restriction upon the disclosure of information imposed by law, contract or rules of professional conduct."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Power to freeze bank account",
      "content": "6. —(1) The Public Prosecutor may, where he or she is satisfied that it is likely that the money for the payment of ransom for the release of any person may be paid out of any account with any bank, by order direct any bank not to pay any money out of, nor to pay cheques drawn on, such account for a specified period not exceeding one month. (2) A bank which complies with an order under subsection (1) is relieved of any liability to any other person in respect of the payment prohibited by that order. (3) A bank which fails to comply with an order under subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Power to order inspection of customer information",
      "content": "7. —(1) Despite anything to the contrary in any other written law, the Public Prosecutor may, if he or she considers that any evidence of the commission by a person of — ( a ) a hostage-taking offence; or ( b ) an act which is an offence by virtue of section 4, is likely to be found in any document containing customer information relating to that person, to the spouse, son or daughter of that person or to a person reasonably believed by the Public Prosecutor to be a trustee or agent for that person, by order authorise any police officer of or above the rank of assistant superintendent named in the order to inspect any document of a bank specified in the order. (2) The police officer so authorised may, at all reasonable times, enter the premises of the bank specified in the order and inspect the documents kept therein and may take copies of any relevant entry in any such document. (3) Any person who, without reasonable excuse, fails to produce any document demanded by the police officer which is in his or her possession or control shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 2 years or to both. (4) The Public Prosecutor may delegate to a Deputy Public Prosecutor or the Commissioner of Police the power of the Public Prosecutor under this section, except the power of delegation conferred by this subsection. (5) In this section, “customer information” has the meaning given by section 40A of the Banking Act 1970."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Power to obtain information",
      "content": "8. —(1) In the course of any investigation into or proceedings relating to a hostage-taking offence by a person or an act by a person which is an offence by virtue of section 4, the Public Prosecutor may by order — ( a ) require the person to furnish a sworn statement in writing enumerating all movable or immovable property belonging to or possessed by that person and by the spouse, son or daughter of that person, and specifying the date on which each of the properties enumerated was acquired and whether it was acquired by way of purchase, gift, bequest, inheritance or otherwise; ( b ) require the person to furnish a sworn statement in writing of any money or other property paid or disposed of by him or her during such period as may be specified in the order; ( c ) require any other person to furnish a sworn statement in writing enumerating all movable or immovable property belonging to or possessed by that person where the Public Prosecutor has reasonable grounds to believe that that information may be relevant to the investigation or proceedings; ( d ) require the Comptroller of Income Tax to furnish all information available to the Comptroller relating to the affairs of the person or of the spouse, son or daughter of the person and to produce or furnish any document or a certified copy of any document specified in the order relating to that person or the spouse, son or daughter of that person which is in the possession or under the control of the Comptroller; ( e ) require the person in charge of any ministry or department of the Government or the president, chairperson, manager or chief executive officer of any statutory board to furnish, as specified in the order, any document or a certified copy of any document which is in his or her possession or under his or her control; and ( f ) require a bank to give copies of the accounts of the person or of the spouse, son or daughter of the person with the bank. (2) Subject to subsection (3), every person to whom an order is given under subsection (1) must, despite any obligation of secrecy imposed under any written law or rule of law, comply with the terms of the order within such time as may be specified in the order. (3) Subsection (2) does not apply to a person mentioned in subsection (1)( e ) if the Minister responsible for the ministry or department of the Government or for the statutory board (as the case may be) certifies that it would be against the interests of national security for the contents of the document to be disclosed. (4) To avoid doubt, any disclosure of the contents of a document to the Minister for the purposes of the Minister’s certification under subsection (3) does not constitute a breach of any obligation of secrecy imposed under any written law or rule of law. (5) Any person who contravenes subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 2 years or to both. (6) Any person who, in purported compliance with an order under subsection (1), furnishes any information, statement or document known to him or her to be false or misleading in a material particular, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 2 years or to both."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "No prosecution without Public Prosecutor’s consent",
      "content": "9. A prosecution under this Act must not be instituted except by or with the consent of the Public Prosecutor."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Protection of informers",
      "content": "10. —(1) Except as provided in subsection (3), a witness in any civil or criminal proceedings must not be obliged — ( a ) to disclose the name or address of any informer who has given information with respect to an offence under this Act; or ( b ) to answer any question if the answer to the question would lead, or would tend to lead, to the discovery of the name or address of any informer. (2) If any book, document or paper which is in evidence or liable to inspection in any civil or criminal proceedings contains any entry in which any informer is named or described or which may lead to the informer’s discovery, the court must cause those entries to be concealed from view or to be obliterated so far as may be necessary to protect the informer from discovery. (3) If — ( a ) in any proceedings for an offence under this Act, the court, after full inquiry into the case, is satisfied that an informer wilfully made a material statement which he or she knew or believed to be false or did not believe to be true; or ( b ) in any other proceedings, the court is of the opinion that justice cannot be fully done between the parties to the proceedings without the disclosure of the name of an informer, the court may permit inquiry and require full disclosure concerning the informer."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Offences by bodies corporate, etc.",
      "content": "11. —(1) Where an offence under this Act committed by a body corporate is proved — ( a ) to have been committed with the consent or connivance of an officer; or ( b ) to be attributable to any act or default on the officer’s part, the officer as well as the body corporate shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (2) Where the affairs of a body corporate are managed by its members, subsection (1) applies in relation to the acts and defaults of a member in connection with his or her functions of management as if he or she were a director of the body corporate. (3) Where an offence under this Act committed by a partnership is proved — ( a ) to have been committed with the consent or connivance of a partner; or ( b ) to be attributable to any act or default on the partner’s part, the partner as well as the partnership shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (4) Where an offence under this Act committed by a limited liability partnership is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of, a partner or manager of the limited liability partnership, the partner or manager as well as the partnership shall be guilty of that offence and shall be liable to be proceeded against and punished accordingly. (5) Where an offence under this Act committed by an unincorporated association (other than a partnership) is proved — ( a ) to have been committed with the consent or connivance of an officer of the unincorporated association or a member of its governing body; or ( b ) to be attributable to any act or default on the part of such an officer or a member, the officer or member as well as the unincorporated association shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (6) In this section — “body corporate” and “partnership” exclude a limited liability partnership within the meaning of the Limited Liability Partnerships Act 2005; “officer” — ( a ) in relation to a body corporate, means any director, member of the committee of management, chief executive officer, manager, secretary or other similar officer of the body corporate and includes any person purporting to act in any such capacity; and ( b ) in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, or any person holding a position analogous to that of the president, secretary or member of such a committee and includes any person purporting to act in any such capacity; “partner” includes a person purporting to act as a partner. (7) The Minister may make rules to provide for the application of any provision of this section, with such modifications as the Minister considers appropriate, to any body corporate, limited liability partnership or unincorporated association formed or recognised under the law of a territory outside Singapore."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Power of arrest",
      "content": "12. A police officer may arrest without warrant any person whom he or she reasonably believes has committed an offence under this Act."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Assistance in criminal matters for Convention offences",
      "content": "13. —(1) For the purposes of providing assistance under Part 3 of the Mutual Assistance in Criminal Matters Act 2000 to a foreign country for a criminal matter involving a relevant offence of that country, the relevant offence is deemed not to be an offence of a political character. (2) In this section — “criminal matter” has the meaning given by section 2(1) of the Mutual Assistance in Criminal Matters Act 2000; “relevant offence”, in relation to a foreign country, means an offence against the law of that country that consists of or includes conduct which, if it had occurred in Singapore, would have constituted a hostage-taking offence."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Extradition",
      "content": "14. —(1) Every hostage-taking offence is deemed to be an extradition offence under the Extradition Act 1968. [Act 17 of 2022 wef 01/07/2022] (2) Subject to subsection (3), where no extradition treaty is in force between Singapore and a Convention country, a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act as if there were an extradition treaty between Singapore and that country. (3) Where the Extradition Act 1968 is applied under subsection (2), that Act has effect in relation to that country as if the only extradition offences under that Act were the relevant offences of that country. [Act 17 of 2022 wef 01/07/2022] (4) Subsection (3) does not affect any other notification made under section 4 of the Extradition Act 1968. (5) Where — ( a ) an extradition treaty is in force between Singapore and a Convention country; and ( b ) the treaty does not provide for the extradition of persons accused of or convicted of a relevant offence of that country, a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act in relation to that country as if the treaty provided for the matter referred to in paragraph ( b ). (6) Where a notification mentioned in subsection (5) is made, any limitation, condition, exception or qualification specified in — ( a ) any other notification made under section 4 of the Extradition Act 1968; or ( b ) any Order in Council mentioned in section 3 of that Act, in relation to that country is, to the extent that it prevents the relevant offence from being considered an extradition offence in relation to that country, to be disregarded in the application of that Act in relation to that country. [Act 17 of 2022 wef 01/07/2022] (7) For the purposes of the Extradition Act 1968 — ( a ) any act, wherever committed, which is a relevant offence of a Convention country in the case of which that Act has been applied by a notification in the Gazette made under section 4 of that Act, is deemed to be an offence within the jurisdiction of that country; and ( b ) any such offence is deemed not to be an offence of a political character. (8) In this section, “relevant offence”, in relation to a Convention country, means an offence against the law of, or of part of, that country where the act or omission constituting the offence or the equivalent act or omission would, if it took place in Singapore — ( a ) constitute a hostage-taking offence; or ( b ) be such an offence if the description concerned contained a reference to any intent or state of mind on the part of the person committing the offence, or to any circumstance of aggravation, necessary to constitute the offence."
    }
  ],
  "definitions": [
    {
      "term": "bank",
      "definition": "“bank” means a bank or merchant bank licensed under the Banking Act 1970, and includes a finance company licensed under the Finance Companies Act 1967;",
      "source_provision": "s2"
    },
    {
      "term": "Convention",
      "definition": "“Convention” means the International Convention against the Taking of Hostages adopted by the General Assembly of the United Nations on 17 December 1979;",
      "source_provision": "s2"
    },
    {
      "term": "Convention country",
      "definition": "“Convention country” means a foreign country that is a Party to the Convention;",
      "source_provision": "s2"
    },
    {
      "term": "country",
      "definition": "“country” includes a State or territory, as the case may be;",
      "source_provision": "s2"
    },
    {
      "term": "hostage-taking offence",
      "definition": "“hostage-taking offence” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "body corporate",
      "definition": "“body corporate” and “partnership” exclude a limited liability partnership within the meaning of the Limited Liability Partnerships Act 2005;",
      "source_provision": "s11"
    },
    {
      "term": "officer",
      "definition": "“officer” — ( a )",
      "source_provision": "s11"
    },
    {
      "term": "partner",
      "definition": "“partner” includes a person purporting to act as a partner.",
      "source_provision": "s11"
    },
    {
      "term": "criminal matter",
      "definition": "“criminal matter” has the meaning given by section 2(1) of the Mutual Assistance in Criminal Matters Act 2000;",
      "source_provision": "s13"
    },
    {
      "term": "relevant offence",
      "definition": "“relevant offence” , in relation to a foreign country, means an offence against the law of that country that consists of or includes conduct which, if it had occurred in Singapore, would have constituted a hostage-taking offence.",
      "source_provision": "s13"
    }
  ]
}