{
  "id": "hwceita-1997",
  "type": "statute",
  "title": "Hazardous Waste (Control of Export, Import and Transit) Act 1997",
  "title_en": "Hazardous Waste (Control of Export, Import and Transit) Act 1997",
  "short_name": "HWCEITA1997",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/HWCEITA1997",
  "description": "An Act to provide for the regulation of the export, import and transit of hazardous and other wastes, and for related purposes.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Hazardous Waste (Control of Export, Import and Transit) Act 1997."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “Antarctica” means the area south of 60&#186; South latitude, including all ice shelves in that area; “Article 11 arrangement” has the meaning given to it by section 7; “authorised officer” means a person appointed under section 16 as an authorised officer; “Basel Convention” means the Basel Convention on the Control of Transboundary Movements of Hazardous Wastes and their Disposal and any amendment or protocol to the Convention that has come into force and has been accepted by the Government, a copy of the English text of which is set out in the Schedule; “Basel export permit” means a permit given in accordance with the Basel Convention permitting the export of hazardous or other waste; “Basel import permit” means a permit given in accordance with the Basel Convention permitting the import of hazardous or other waste; “Basel permit” means a Basel export permit, a Basel import permit or a Basel transit permit; “Basel transit permit” means a permit given in accordance with the Basel Convention permitting the carrying out of one or more transit proposals relating to hazardous or other waste; “competent authority”, in relation to a foreign country, means — ( a ) if the country is a party to the Basel Convention — the competent authority of the country within the meaning of the Basel Convention; and ( b ) otherwise — a person or an organisation that officially represents the country; “deal with”, in relation to hazardous or other waste, includes dispose of; “Director‑General” means the Director‑General of Environmental Protection appointed under section 3(1) of the Environmental Protection and Management Act 1999; “disposal” means an operation specified in Annex IV to the Basel Convention; “environmentally sound management”, in relation to hazardous or other waste, has the meaning given by section 8; “export permit” means a Basel export permit or a special export permit; “export proposal” means a proposal to export hazardous or other waste and to deal with it outside Singapore; “foreign country” includes — ( a ) a colony, overseas territory, overseas province or protectorate of a foreign country; ( b ) a territory outside Singapore, where a foreign country is to any extent responsible for the international relations of the territory; and ( c ) a territory outside Singapore that is to some extent self-governing, but that is not recognised as an independent sovereign state by Singapore; “holder”, in relation to a Basel permit or a special permit, means the person to whom the permit was granted; “household waste” means waste collected from households, but does not include such waste as may be specified in any regulations made under this Act; “import permit” means a Basel import permit or a special import permit; “import proposal” means a proposal to import hazardous or other waste and to deal with it in Singapore; “permit application” means an application for a Basel or special permit; “permit condition” means a condition specified in — ( a ) a Basel permit; ( b ) a notice specified in any regulations made under section 17 varying a Basel permit; ( c ) a special permit; or ( d ) a notice under a set of Article 11 regulations varying a special permit; “platform” includes any structure at sea, whether fixed or not fixed, but does not include a vessel; “premises” includes any place, whether or not enclosed or built on; “relevant person”, in relation to a searchable place, means — ( a ) in the case of premises in Singapore — the occupier of the premises; and ( b ) in any other case — the person in command or control, or who appears to be in command or control, of the place; “searchable place” means — ( a ) any premises in Singapore; ( b ) an aircraft, a vehicle or a vessel within the jurisdiction of Singapore; ( c ) a Singapore aircraft; ( d ) a Singapore platform; or ( e ) a Singapore vessel; “set of Article 11 regulations” has the meaning given by section 19(3); “Singapore aircraft” means an aircraft that is registered in Singapore; “Singapore platform” means a platform — ( a ) that is fixed to the seabed or subsoil beneath Singapore waters; or ( b ) that is otherwise operating in Singapore waters; “Singapore vessel” means a vessel that is registered in Singapore; “Singapore waters” means the following waters: ( a ) the whole of the sea within the seaward limits of the territorial waters of Singapore; and ( b ) all other waters (including inland waters) which are within these limits and are subject to the ebb and flow of the ordinary tides; “special export permit” means a permit under a set of Article 11 regulations permitting the export of hazardous or other waste; “special import permit” means a permit under a set of Article 11 regulations permitting the import of hazardous or other waste; “special permit” means a special export permit, a special import permit or a special transit permit; “special transit permit” means a permit under a set of Article 11 regulations permitting the carrying out of one or more transit proposals relating to hazardous or other waste; “through bill of lading” or “through airway bill” means a bill of lading or airway bill, as the case may be, for the consignment of goods from a place outside Singapore to a final destination outside Singapore without a consignee in Singapore; “transit permit” means a Basel transit permit or a special transit permit; “transit proposal” has the meaning given by section 6; “vessel” means anything capable of carrying persons or goods through or on water, and includes an air-cushion vehicle or similar craft; “waste” means a substance or object that is — ( a ) proposed to be disposed of; ( b ) disposed of; or ( c ) required by any written law to be disposed of. [6/2020] (2) In this Act — ( a ) a reference to this Act includes a reference to regulations made under this Act; ( b ) a reference to an offence under this Act includes a reference to an attempt or conspiracy to commit an offence under this Act or an abetment of an offence under this Act; ( c ) “within the jurisdiction of Singapore” means within or over Singapore or Singapore waters."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Treatment of colonies, etc.",
      "content": "3. —(1) For the purposes of this Act, if — ( a ) a territory is covered by either of the following subparagraphs: (i) a colony, overseas territory, overseas province or protectorate of a foreign country; (ii) a territory outside Singapore, where a foreign country is to any extent responsible for the international relations of the territory; ( b ) the foreign country is a party to the Basel Convention; and ( c ) the territory is not specified in any regulations made under this Act, the territory is taken to be a party to the Basel Convention. (2) For the purposes of this Act, if a territory is covered by any of the following paragraphs: ( a ) a colony, overseas territory, overseas province or protectorate of a foreign country; ( b ) a territory outside Singapore, where a foreign country is to any extent responsible for the international relations of the territory; or ( c ) a territory outside Singapore that is to some extent self‑governing, but that is not recognised as an independent sovereign state by Singapore, a person or an organisation that officially represents the territory is taken to be a competent authority of the territory. (3) Subsection (2) has effect despite anything in the definition of “competent authority” in section 2(1)."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "4",
      "title": "Meaning of hazardous and other wastes",
      "content": "4. Subject to section 5, for the purposes of this Act — ( a ) “hazardous waste” means — (i) waste prescribed by any regulations made under this Act, where the waste has any of the characteristics mentioned in Annex III to the Basel Convention; or (ii) waste that belongs to any category contained in Annex I to the Basel Convention, unless it does not possess any of the characteristics contained in Annex III to that Convention; ( b ) “other waste” means waste that belongs to any category contained in Annex II to the Basel Convention, but hazardous and other wastes do not include wastes which derive from the normal operations of a ship and radioactive wastes. [6/2020]"
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "5",
      "title": "Exports and transits to foreign countries — extended meaning of hazardous and other wastes",
      "content": "5. —(1) This section has effect for the purposes of the application of this Act — ( a ) to the export or proposed export of a substance or object to a particular foreign country; or ( b ) to, or to the carrying out of, a transit proposal that involves the taking out of Singapore of a substance or object to a particular foreign country. (2) If — ( a ) the foreign country is a party to the Basel Convention; and ( b ) the prescribed website of the Secretariat of the Basel Convention states that the particular substance or object is, in particular circumstances, classified as hazardous or other waste under a law of that foreign country that gives effect to the Basel Convention, then that substance or object is, in those circumstances, hazardous or other waste for those purposes. [6/2020] (3) If — ( a ) the foreign country is a party to the Basel Convention; ( b ) the Minister is satisfied that, under a law of that country that gives effect to the Basel Convention, the particular substance or object is, in particular circumstances, classified as hazardous or other waste; and ( c ) apart from this section, the particular substance or object is not hazardous or other waste, the Minister must, by notification in the Gazette , declare that the substance or object is, in those circumstances, hazardous or other waste for those purposes. (4) If — ( a ) the Minister is satisfied that the foreign country classifies particular waste collected from the households as hazardous or other waste; and ( b ) apart from this section, the waste is not hazardous waste, the Minister must, by notification in the Gazette , declare that the waste is hazardous or other waste for those purposes. (5) A declaration under this section has effect accordingly. (6) The Minister must revoke a declaration made under this section if the Minister ceases to be satisfied of the matter referred to in subsection (3)( b ) or (4)( a ), as the case may be. (7) The revocation of a declaration must be published in the Gazette ."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "6",
      "title": "Transit proposals",
      "content": "6. —(1) This section sets out the proposals that are transit proposals for the purposes of this Act. (2) A proposal — ( a ) to bring hazardous or other waste into Singapore for the purpose of being carried to a foreign country either by the same or another conveyance; and ( b ) if the waste is brought into Singapore by sea or air, the carriage is on a through bill of lading or through airway bill, is a transit proposal so long as it is not proposed to dispose of the waste in Singapore."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "7",
      "title": "Article 11 arrangements",
      "content": "7. —(1) If — ( a ) Singapore has entered into an agreement or arrangement; and ( b ) the Minister is satisfied that the agreement or arrangement is of a kind mentioned in Article 11 of the Basel Convention, the Minister must, by notice in the Gazette , declare that the agreement or arrangement is an Article 11 arrangement for the purposes of this Act. (2) A declaration under this section has effect accordingly. (3) The Minister must revoke a declaration made under this section if the Minister ceases to be satisfied of the matter referred to in subsection (1)( b ). (4) A revocation made under subsection (3) must be published in the Gazette ."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "8",
      "title": "Environmentally sound management of hazardous or other waste",
      "content": "8. A reference in this Act to the environmentally sound management of hazardous or other waste is a reference to taking all practicable steps to ensure that the waste is managed in a manner that will protect human health and the environment against the adverse effects that may result from the waste."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "9",
      "title": "Article 11 arrangements — substances taken to be hazardous or other waste",
      "content": "9. —(1) This section has effect for the purposes of the application of this Act — ( a ) to the import or proposed import of a substance or object from a particular foreign country; ( b ) to the export or proposed export of a substance or object to a particular foreign country; or ( c ) to, or to the carrying out of, a transit proposal that involves the taking out of Singapore of a substance or object to a particular foreign country. (2) If — ( a ) the country is a party to an Article 11 arrangement; ( b ) the substance or object is subject to notification or control under the arrangement; and ( c ) apart from this section, the substance or object is not hazardous or other waste, the substance or object is taken to be hazardous or other waste for those purposes."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "10",
      "title": "Article 11 arrangements — substances not classified as hazardous or other waste",
      "content": "10. —(1) This section has effect for the purposes of the application of this Act — ( a ) to the import or proposed import of a substance or object from a particular foreign country; ( b ) to the export or proposed export of a substance or object to a particular foreign country; or ( c ) to, or to the carrying out of, a transit proposal that involves the taking out of Singapore of a substance or object to a particular foreign country. (2) If — ( a ) the country is a party to an Article 11 arrangement; and ( b ) the arrangement expressly provides that the substance or object is not subject to notification or control under the arrangement, the substance or object is taken not to be hazardous or other waste for those purposes."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "11",
      "title": "Time limit for compliance with permit condition",
      "content": "11. —(1) For the purposes of this Act, if — ( a ) the Director-General specifies the day on or before which a permit condition relating to a Basel or special permit is to be complied with; and ( b ) the condition is not complied with on or before that day, the holder of the permit is taken to have breached the condition at the end of that day. [6/2020] (2) For the purposes of this Act, if — ( a ) under a set of Article 11 regulations, the Minister specifies the day on or before which a permit condition relating to a special permit is to be complied with; and ( b ) the condition is not complied with on or before that day, the holder of the permit is taken to have breached that condition at the end of that day."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "12",
      "title": "Exemption of naval vessels, military aircraft, etc.",
      "content": "12. This Act does not apply to or in relation to any vessel or aircraft belonging to the naval, military or air forces of Singapore or any other country."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "13",
      "title": "Act binds the Government",
      "content": "13. This Act binds the Government."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "14",
      "title": "Other written laws not affected",
      "content": "14. This Act is in addition to, and not in derogation of or substitution for, any other written law, whether enacted before or after 16 March 1998."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 2 - ADMINISTRATION",
      "section": "15",
      "title": "Administration of Act",
      "content": "15. —(1) The Director‑General is, subject to any general or special directions of the Minister, responsible for the administration of this Act. [6/2020] (2) The Director‑General may, with the approval of the Minister, delegate the exercise of all or any of the powers conferred or duties imposed on the Director‑General by this Act (except the power of delegation conferred by this subsection) to any authorised officer, subject to such conditions or limitations as the Director‑General may specify. [6/2020]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 2 - ADMINISTRATION",
      "section": "16",
      "title": "Appointment of authorised officers",
      "content": "16. —(1) The Director‑General may, by writing, appoint for the purposes of this Act — ( a ) an eligible person to be an authorised officer; or ( b ) a class of eligible persons to be authorised officers. [6/2020] (2) A person who is an authorised officer ceases to be an authorised officer if the person ceases to be an eligible person. (3) For the purposes of this section, an eligible person is any public officer or any officer of a statutory body."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "17",
      "title": "Regulations to give effect to Basel Convention",
      "content": "17. The Minister may make regulations to provide for and in relation to giving effect to — ( a ) the Basel Convention; and ( b ) any amendment or protocol to the Basel Convention that has come into force and has been accepted by the Government."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "18",
      "title": "Contents of regulations made to give effect to Basel Convention",
      "content": "18. —(1) Any regulations made under section 17 to give effect to the Basel Convention may — ( a ) specify the kinds of import proposals, export proposals and transit proposals that are within the scope of the Basel Convention; ( b ) provide for the application to the Director‑General for import permits and the granting of import permits by the Director‑General authorising the import of hazardous and other waste, where the permit relates to an import proposal within the scope of the Basel Convention; ( c ) provide for the application to the Director‑General for export permits and the granting of export permits by the Director‑General authorising the export of hazardous or other waste, where the permit relates to an export proposal within the scope of the Basel Convention; and ( d ) provide for the application to the Director‑General for transit permits and the granting of transit permits by the Director‑General authorising the carrying out of transit proposals within the scope of the Basel Convention. [6/2020] (2) Such regulations may provide for — ( a ) conditions of the Basel permits, including the giving of guarantees and security deposits, and for securing compliance with such conditions; and ( b ) the revocation, surrender and variation of Basel permits. (3) This section does not, by implication, limit sections 17 and 48."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "19",
      "title": "Regulations to give effect to Article 11 arrangements",
      "content": "19. —(1) The Minister may make regulations to provide for and in relation to giving effect to — ( a ) an Article 11 arrangement; and ( b ) an amendment of an Article 11 arrangement. (2) Regulations made for the purposes of this section do not come into operation before — ( a ) the arrangement enters into force, or comes into effect, for Singapore; or ( b ) the amendment enters into force, or comes into effect, for Singapore, as the case requires. (3) Regulations made for the purposes of this section that give effect to a particular Article 11 arrangement, including regulations that give effect to an amendment of the Article 11 arrangement, are called a set of Article 11 regulations."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "20",
      "title": "Contents of set of Article 11 regulations",
      "content": "20. —(1) Each set of Article 11 regulations may — ( a ) specify the kinds of import proposals, export proposals and transit proposals that are within the scope of that set of regulations; ( b ) provide for the application to the Director‑General for import permits and the granting of import permits by the Director‑General authorising the import of hazardous or other waste, where the permit relates to an import proposal within the scope of that set of regulations; ( c ) provide for the application to the Director‑General for export permits and the granting of export permits by the Director‑General authorising the export of hazardous or other waste, where the permit relates to an export proposal within the scope of that set of regulations; and ( d ) provide for the application to the Director‑General for transit permits and the granting of transit permits by the Director‑General authorising the carrying out of transit proposals within the scope of that set of regulations. [6/2020] (2) A set of Article 11 regulations may provide for — ( a ) conditions of special permits, including the giving of guarantees and security deposits, and for securing compliance with such conditions; and ( b ) the revocation, surrender and variation of special permits. (3) This section does not, by implication, limit sections 19 and 48."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "21",
      "title": "When special permit may be granted under set of Article 11 regulations",
      "content": "21. —(1) If — ( a ) a person applies for a special import permit in relation to an import proposal that is within the scope of a particular set of Article 11 regulations; and ( b ) the proposal is within the scope of another set of Article 11 regulations, the Director‑General must not grant the permit unless he or she is satisfied that the corresponding requirements of the other set of regulations have been met in relation to the proposal. [6/2020] (2) For the purposes of subsection (1), a corresponding requirement of a particular set of Article 11 regulations is a requirement under that set of regulations that — ( a ) must be met before granting a special import permit under that set of regulations; and ( b ) is declared by the regulations to be a corresponding requirement for the purposes of this subsection. (3) Subsection (1) does not prevent the set of Article 11 regulations mentioned in subsection (1)( a ) from setting out other requirements that must be met before granting a special import permit under that set of regulations. (4) If — ( a ) a person applies for a special export permit in relation to an export proposal that is within the scope of a particular set of Article 11 regulations; and ( b ) the proposal is within the scope of another set of Article 11 regulations, the Director-General must not grant the permit unless he or she is satisfied that the corresponding requirements of the other set of regulations have been met in relation to the proposal. [6/2020] (5) For the purposes of subsection (4), a corresponding requirement of a particular set of Article 11 regulations is — ( a ) a requirement under that set of regulations to obtain the consent (whether actual or constructive) of an authority of a foreign country before granting a special export permit under that set of regulations authorising the export of hazardous or other waste to that country; or ( b ) another requirement under that set of regulations that — (i) must be met before granting a special export permit under that set of regulations; and (ii) is declared by the regulations to be a corresponding requirement for the purposes of this subsection. (6) Subsection (4) does not prevent the set of Article 11 regulations mentioned in subsection (5)( a ) from setting out other requirements that must be met before granting a special export permit under that set of regulations. (7) If — ( a ) a person applies for a special transit permit in relation to a transit proposal that is within the scope of a particular set of Article 11 regulations; and ( b ) the proposal is within the scope of another set of Article 11 regulations, the Director-General must not grant the permit unless he or she is satisfied that the corresponding requirements of the other set of regulations have been met in relation to the proposal. [6/2020] (8) For the purposes of subsection (7), a corresponding requirement of a particular set of Article 11 regulations is — ( a ) a requirement under that set of regulations to obtain the consent (whether actual or constructive) of an authority of a foreign country before granting a special transit permit under that set of regulations authorising the carrying out of a transit proposal that involves the taking out of Singapore of hazardous or other waste to that country; or ( b ) another requirement under that set of regulations that — (i) must be met before granting a special transit permit under that set of regulations; and (ii) is declared by the regulations to be a corresponding requirement for the purposes of this subsection. (9) Subsection (7) does not prevent the set of Article 11 regulations mentioned in subsection (8)( a ) from setting out other requirements that must be met before granting a special transit permit under that set of regulations."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "22",
      "title": "When Basel permit may be granted",
      "content": "22. —(1) If — ( a ) a person applies for a Basel import permit in relation to an import proposal; and ( b ) the proposal is within the scope of a particular set of Article 11 regulations, the Director-General must not grant the permit unless he or she is satisfied that the corresponding requirements of that set of regulations have been met in relation to the proposal. [6/2020] (2) For the purposes of subsection (1), a corresponding requirement of a particular set of Article 11 regulations is a requirement under that set of regulations that — ( a ) must be met before granting a special import permit under that set of regulations; and ( b ) is declared by the regulations to be a corresponding requirement for the purposes of this subsection. (3) If — ( a ) a person applies for a Basel export permit in relation to an export proposal; and ( b ) the proposal is within the scope of a particular set of Article 11 regulations, the Director-General must not grant the permit unless he or she is satisfied that the corresponding requirements of that set of regulations have been met in relation to the proposal. [6/2020] (4) For the purposes of subsection (3), a corresponding requirement of a particular set of Article 11 regulations is — ( a ) a requirement under that set of regulations to obtain the consent (whether actual or constructive) of an authority of a foreign country before granting a special export permit under that set of regulations authorising the export of hazardous or other waste to that country; or ( b ) another requirement under that set of regulations that — (i) must be met before granting a special export permit under that set of regulations; and (ii) is declared by the regulations to be a corresponding requirement for the purposes of this subsection. (5) If — ( a ) a person applies for a Basel transit permit in relation to a transit proposal; and ( b ) the proposal is within the scope of a particular set of Article 11 regulations, the Director-General must not grant the permit unless he or she is satisfied that the corresponding requirements of that set of regulations have been met in relation to the proposal. [6/2020] (6) For the purposes of subsection (5), a corresponding requirement of a particular set of Article 11 regulations is — ( a ) a requirement under that set of regulations to obtain the consent (whether actual or constructive) of an authority of a foreign country before granting a special transit permit under that set of regulations authorising the carrying out of a transit proposal that involves the taking out of Singapore of hazardous or other waste to that country; or ( b ) another requirement under that set of regulations that — (i) must be met before granting a special transit permit under that set of regulations; and (ii) is declared by the regulations to be a corresponding requirement for the purposes of this subsection."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "23",
      "title": "Prohibition of bringing waste into Antarctica",
      "content": "23. The Director-General must not grant a Basel permit or special permit if he or she is satisfied that the grant could result in hazardous or other waste being brought into Antarctica. [6/2020]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 3 - IMPORT, EXPORT AND TRANSIT PERMITS",
      "section": "24",
      "title": "Applications and notices to be accompanied by fees",
      "content": "24. —(1) Any regulations made under this Act may prescribe fees to be paid in relation to applications and notices given to the Director‑General under this Act. [6/2020] (2) An application or a notice given to the Director‑General under this Act must be accompanied by the prescribed fee, if any. [6/2020] (3) If an application or a notice given to the Director‑General under this Act is not accompanied by the prescribed fee (if any), the application or notice is taken not to have been received by the Director‑General until the fee has been paid. [6/2020] (4) The Director-General may determine in writing that the prescribed fee payable in relation to a specified application or a specified notice is reduced by a specified amount. [6/2020] (5) The determination has effect accordingly."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 4 - REGULATION OF IMPORT, EXPORT AND TRANSIT OF",
      "section": "25",
      "title": "Prohibition of import",
      "content": "25. —(1) A person must not import hazardous or other waste unless — ( a ) the person is the holder of an import permit authorising the person to import the waste; ( b ) the import is authorised by an order made under any regulation made under Part 3; or ( c ) the import has been ordered under any regulation made under Part 3. (2) The holder of an import permit must not — ( a ) import the hazardous or other waste to which the permit relates except in accordance with the permit; or ( b ) whether before or after importing the hazardous or other waste to which the permit relates, breach any of the permit conditions. (3) A person authorised by an order made under any regulation made under Part 3 to import hazardous or other waste must not import or deal with the waste except in accordance with the order. (4) Any person who contravenes subsection (1), (2) or (3) shall be guilty of an offence and shall be liable on conviction — ( a ) in the case of a body corporate, to a fine not exceeding $300,000; or ( b ) in the case of an individual, to a fine not exceeding $100,000 or to imprisonment for a term not exceeding 2 years or to both."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 4 - REGULATION OF IMPORT, EXPORT AND TRANSIT OF",
      "section": "26",
      "title": "Prohibition of export",
      "content": "26. —(1) A person must not export hazardous or other waste unless — ( a ) the person is the holder of an export permit authorising the person to export the waste; or ( b ) the export has been ordered under any regulation made under Part 3. (2) The holder of an export permit must not — ( a ) export the hazardous or other waste to which the permit relates except in accordance with the permit; or ( b ) whether before or after exporting the hazardous or other waste to which the permit relates, breach any of the permit conditions. (3) Any person who contravenes subsection (1) or (2) shall be guilty of an offence and shall be liable on conviction — ( a ) in the case of a body corporate, to a fine not exceeding $300,000; or ( b ) in the case of an individual, to a fine not exceeding $100,000 or to imprisonment for a term not exceeding 2 years or to both."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 4 - REGULATION OF IMPORT, EXPORT AND TRANSIT OF",
      "section": "27",
      "title": "Prohibition of bringing waste into Singapore in course of carrying out transit proposal",
      "content": "27. —(1) A person must not bring hazardous or other waste into Singapore in the course of carrying out a transit proposal unless the person is the holder of a transit permit authorising the person to bring the waste into Singapore. (2) The holder of a transit permit must not — ( a ) bring into Singapore the hazardous or other waste to which the permit relates except in accordance with the permit; ( b ) take out of Singapore the hazardous or other waste to which the permit relates except in accordance with the permit; or ( c ) whether before or after bringing into Singapore the hazardous or other waste to which the permit relates, breach any of the permit conditions. (3) Any person who contravenes subsection (1) or (2) shall be guilty of an offence and shall be liable on conviction — ( a ) in the case of a body corporate, to a fine not exceeding $300,000; or ( b ) in the case of an individual, to a fine not exceeding $100,000 or to imprisonment for a term not exceeding 2 years or to both."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "28",
      "title": "Injunctions",
      "content": "28. —(1) Where a person has engaged, is engaging, or is proposing to engage, in any conduct that constituted, constitutes or would constitute an offence under this Act, the court may, on the application of the Director-General or any other person, grant an injunction — ( a ) restraining the person from engaging in the conduct; and ( b ) if in the opinion of the court it is desirable to do so, requiring the person to do anything. [6/2020] (2) Where — ( a ) a person has refused or failed, is refusing or failing, or is proposing to refuse or fail, to do anything; and ( b ) the refusal or failure was, is, or would be, an offence under this Act, the court may, on the application of the Director‑General or any other person, grant an injunction requiring the person to do the thing. [6/2020] (3) If in the opinion of the court it is desirable to do so, the court may grant an interim injunction pending determination of an application under subsection (1). (4) The court may discharge or vary an injunction granted under this section. (5) The power of the court to grant an injunction under this section restraining a person from engaging in any conduct may be exercised — ( a ) whether or not it appears to the court that the person intends to engage again, or to continue to engage, in conduct of that kind; ( b ) whether or not the person has previously engaged in conduct of that kind; and ( c ) whether or not there is a significant risk of injury or damage to human beings or the environment if the person engages, or continues to engage, in conduct of that kind. (6) The power of the court to grant an injunction under this section requiring a person to do a thing may be exercised — ( a ) whether or not it appears to the court that the person intends to refuse or fail again, or to continue to refuse or fail, to do the thing; ( b ) whether or not the person has previously refused or failed to do the thing; and ( c ) whether or not there is a significant risk of injury or damage to human beings or the environment if the person refuses or fails, or continues to refuse or fail, to do the thing. (7) Where the Director-General or any other person makes an application to the court for the grant of an injunction under this section, the court is not to require the Director‑General or that other person, as a condition for granting an interim injunction, to give any undertaking as to damages. [6/2020] (8) The powers conferred on the court by this section are in addition to, and not in derogation of, any other powers of the court."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "29",
      "title": "Power to obtain information",
      "content": "29. —(1) The Director‑General may, by written notice served on any person, require that person to provide the Director‑General, within the time and in the form specified in the notice, any information specified in the notice which the Director‑General may reasonably require for the purpose of exercising and performing his or her functions, duties or powers under this Act. [6/2020] (2) A person who — ( a ) fails without reasonable excuse to comply with any of the requirements of a notice served on the person under subsection (1); or ( b ) in purported compliance with such a notice — (i) makes any statement to the Director‑General which the person knows to be incorrect in a material respect; (ii) recklessly makes any statement to the Director‑General which is incorrect in a material respect; or (iii) knowingly omits any material particular, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both. [6/2020]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "30",
      "title": "Power to control movement of vessels, aircraft and vehicles, etc.",
      "content": "30. —(1) This section applies if the Director‑General or an authorised officer has reasonable grounds for suspecting that there is in or on — ( a ) a Singapore vessel or Singapore aircraft; or ( b ) a vessel, an aircraft or a vehicle that is within the jurisdiction of Singapore, hazardous or other waste that is to be, or that has been, imported, exported or the subject of a transit proposal. [6/2020] (2) If this section applies in relation to a vessel, the Director‑General or an authorised officer may require the master or the person in command or charge, or who appears to be in command or charge, of the vessel to do one or more of the following things: ( a ) ensure that the vessel does not remain within, or does not come within, as the case requires, the jurisdiction of Singapore; ( b ) ensure that the vessel is brought to a specified place to which it is safe and practicable to bring the vessel; ( c ) ensure that the vessel remains at a specified place until the Director‑General or the authorised officer permits the vessel to leave; ( d ) arrange for goods being carried on the vessel to be unloaded; ( e ) ensure that goods being carried on the vessel are not unloaded until the Director‑General or the authorised officer permits their unloading. [6/2020] (3) If this section applies in relation to an aircraft, the Director‑General or an authorised officer may require the person in command or control, or who appears to be in command or control, of the aircraft to do one or more of the following things: ( a ) ensure that the aircraft does not remain within, or does not come within, as the case requires, the jurisdiction of Singapore; ( b ) ensure that the aircraft is landed at a specified airport at which it is safe and practicable to land the aircraft; ( c ) ensure that the aircraft remains at a specified airport until the Director‑General or the authorised officer permits the aircraft to leave; ( d ) arrange for goods being carried on the aircraft to be unloaded; ( e ) ensure that goods being carried on the aircraft are not unloaded until the Director‑General or the authorised officer permits their unloading. [6/2020] (4) If this section applies in relation to a vehicle, the Director‑General or an authorised officer may require the person in command or control, or who appears to be in command or control, of the vehicle to do one or more of the following things: ( a ) ensure that the vehicle does not remain within the jurisdiction of Singapore; ( b ) ensure that the vehicle is brought to a specified place in which it is safe and practicable to park the vehicle; ( c ) ensure that the vehicle remains at the specified place until the Director‑General or an authorised officer permits the vehicle to leave; ( d ) arrange for goods being carried in or on the vehicle to be unloaded; ( e ) ensure that goods being carried in or on the vehicle are not unloaded until the Director‑General or an authorised officer permits their unloading. [6/2020] (5) The Director‑General or an authorised officer may communicate a requirement under this section by means of — ( a ) an international signal code; ( b ) if the requirement relates to a vessel, any other internationally recognised means of communication with a vessel; ( c ) if the requirement relates to an aircraft, any other internationally recognised means of communication with an aircraft; or ( d ) if the requirement relates to a vehicle, a written notice given to the person in command or control, or who appears to be in command or control, of the vehicle. [6/2020] (6) Any person who refuses or fails, without reasonable excuse, to comply with a requirement made under this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both. (7) It is a reasonable excuse for the person to refuse or fail to comply with the requirement if complying with the requirement would have endangered the person or any other person."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "31",
      "title": "Powers of entry and search",
      "content": "31. —(1) The Director‑General or an authorised officer may, for the purposes of this Act — ( a ) enter or board a searchable place; and ( b ) exercise the powers set out in section 32(1) and (2), without being liable to any legal proceedings or molestation on account of such entry or of anything done in part of that searchable place pursuant to this Act. [6/2020] (2) The Director‑General or an authorised officer must not, pursuant to this section, enter into any dwelling house in actual occupation, unless with the consent of the occupier of the dwelling house or with 6 hours’ previous notice to the occupier. [6/2020] (3) If it is shown to the satisfaction of the court that admission to any searchable place has been refused or that the searchable place is unoccupied or the owner or occupier is absent (whether temporarily or permanently) and that the case is one of urgency, the court may by warrant authorise the Director‑General or an authorised officer to enter the premises, if need be by force. [6/2020] (4) The Director‑General or an authorised officer who is permitted by this section to enter or board a vessel, aircraft or vehicle may, for the purpose of effecting the entry or boarding and for the purpose of exercising any powers that the Director‑General or authorised officer is permitted to exercise, stop and detain the vessel, aircraft or vehicle. [6/2020]"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "32",
      "title": "General powers of Director‑General on entering or boarding searchable places",
      "content": "32. —(1) The Director‑General or an authorised officer may, on entering or boarding a searchable place, exercise the following powers under section 31(1)( b ): ( a ) to search any part of the place; ( b ) to inspect, examine, take measurements of, or conduct tests (including by the taking of samples) concerning, any structure, plant, substance or other thing in or on the place; ( c ) to seal the samples and require the owner of the materials to send the samples to an analyst and to bear any cost and expenses arising from the analysis; ( d ) to require the owner or analyst to submit the results of the analysis to the Director‑General or authorised officer; ( e ) to take extracts from, and make copies of, any document relating to any hazardous or other waste in or on the place; ( f ) to take such photographs as he or she thinks necessary for the purposes of this Act; ( g ) to require any person in or on the place or the relevant person to — (i) answer any question put by the Director‑General or authorised officer; and (ii) produce any books, records or documents requested by the Director‑General or authorised officer; ( h ) to take into or onto the place such equipment and materials as the Director‑General or authorised officer requires for the purpose of exercising any power in relation to the place. [6/2020] (2) If the Director‑General or authorised officer enters or boards the searchable place and finds anything (called in this section the evidence) that may afford evidence of the commission of an offence under this Act, the following provisions have effect: ( a ) the Director‑General or authorised officer may seize the evidence; ( b ) the Director‑General or authorised officer may keep the evidence — (i) pending an order of court made under this Act in regard to the disposal of the evidence; or (ii) if a prosecution for an offence under this Act in the commission of which the evidence may have been used or otherwise involved is instituted within that period, until the completion of the proceedings for the offence and of any appeal from the decision in relation to the proceedings; ( c ) if the evidence is a book, record or document, while the Director‑General or authorised officer has possession of the evidence, the Director‑General or authorised officer must allow the evidence to be inspected at any reasonable time by a person who would be entitled to inspect it if it were not in the possession of the Director‑General or authorised officer. [6/2020] (3) A person who refuses or fails, without reasonable excuse, to comply with a requirement made under subsection (1)( d ) or ( g ) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both. (4) It is a reasonable excuse for a person to refuse or fail to answer a question or produce a document if answering the question, or producing the document, might tend to incriminate the person."
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "33",
      "title": "Production of Basel permits or special permits and orders",
      "content": "33. —(1) This section applies if the Director‑General or an authorised officer has reasonable grounds for suspecting that a person (called in this section the suspected person) — ( a ) intends to import or export hazardous or other waste; ( b ) is importing or exporting hazardous or other waste; or ( c ) has imported or exported hazardous or other waste. [6/2020] (2) The Director-General or authorised officer may require the suspected person to produce, or to produce evidence of the existence and contents of — ( a ) a Basel permit or special permit authorising the import or export; or ( b ) an order made under this Act authorising or requiring the import or export. [6/2020] (3) Any suspected person who refuses or fails, without reasonable excuse, to comply with the requirement in subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000."
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "34",
      "title": "Production of transit permits",
      "content": "34. —(1) This section applies if the Director‑General or an authorised officer has reasonable grounds for suspecting that a person (called in this section the suspected person) — ( a ) intends to carry out a transit proposal; ( b ) is carrying out a transit proposal; or ( c ) has carried out a transit proposal. [6/2020] (2) The Director-General or authorised officer may require the suspected person to produce, or to produce evidence of the existence and contents of, a transit permit authorising the carrying out of the transit proposal. [6/2020] (3) Any suspected person who refuses or fails, without reasonable excuse, to comply with the requirement in subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000."
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "35",
      "title": "Assistance to Director-General",
      "content": "35. —(1) The Director-General or an authorised officer who proposes to exercise powers under this Part in relation to a searchable place may require the relevant person in relation to the place to provide reasonable assistance to the Director‑General or authorised officer in relation to the exercise of those powers. [6/2020] (2) Any relevant person who refuses or fails, without reasonable excuse, to comply with the requirement in subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "36",
      "title": "Obstruction of Director-General, etc.",
      "content": "36. Any person who — ( a ) hinders, obstructs or molests the Director‑General or an authorised officer, in the performance and execution of his or her duty or of anything which he or she is empowered or required to do under this Act; ( b ) interferes with any work authorised to be executed under this Act; or ( c ) fails to facilitate by all reasonable means the entry and inspection of any searchable place by the Director‑General or an authorised officer or the making of any test which the Director‑General or an authorised officer is empowered under this Act, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both. [6/2020]"
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "37",
      "title": "False statements",
      "content": "37. —(1) A person must not, in or in relation to an application or a notice under this Act, knowingly or recklessly — ( a ) make a statement that is false or misleading in a material particular; or ( b ) give to the Director‑General or an authorised officer a document containing information that is false or misleading in a material particular without — (i) indicating to the Director‑General or authorised officer that the document is false or misleading and in which respect it is so; and (ii) providing correct information to the Director‑General or authorised officer if the person has, or can reasonably obtain, the correct information. [6/2020] (2) A person must not, otherwise than in or in relation to an application or a notice under this Act, knowingly or recklessly — ( a ) make to the Director‑General or an authorised officer doing duty in relation to this Act a statement that is false or misleading in a material particular; or ( b ) give to the Director‑General or an authorised officer doing duty in relation to this Act a document containing information that is false or misleading in a material particular without — (i) indicating to the Director‑General or authorised officer that the document is false or misleading and in which respect it is so; and (ii) providing correct information to the Director‑General or authorised officer if the person is in possession of, or can reasonably obtain, the correct information. [6/2020] (3) Any person who contravenes this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 5 - ENFORCEMENT",
      "section": "38",
      "title": "Part does not limit power to impose permit conditions",
      "content": "38. This Part does not limit the power of the Director‑General to impose permit conditions on a Basel permit or special permit. [6/2020]"
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "39",
      "title": "Evidentiary certificate — classification of hazardous or other waste",
      "content": "39. —(1) The Director‑General may issue a written certificate stating that a specified substance or object is, or is not, in specified circumstances, hazardous or other waste — ( a ) for the purposes of this Act; or ( b ) for the purposes of the application of this Act to a specified matter. [6/2020] (2) In any proceedings relating to this Act, a certificate issued under subsection (1) is prima facie evidence of the matters stated in the certificate. (3) A copy of a certificate mentioned in subsection (1) must be published in the Gazette ."
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "40",
      "title": "Evidentiary certificate — environmentally sound management of hazardous or other waste",
      "content": "40. —(1) The Director‑General may issue a written certificate stating that engaging, or failing to engage, in specified conduct in relation to specified hazardous or other waste is, or is not, environmentally sound management of that waste for the purposes of this Act. [6/2020] (2) In any proceedings relating to this Act, a certificate issued under subsection (1) is prima facie evidence of the matters stated in the certificate. (3) A copy of a certificate mentioned in subsection (1) must be published in the Gazette ."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "41",
      "title": "Evidence of analyst",
      "content": "41. —(1) The Director‑General may, by instrument in writing under the hand of the Director‑General, appoint persons who in his or her opinion are qualified to be analysts for the purposes of this Act. [6/2020] (2) Subject to subsection (4), a certificate of an analyst appointed under subsection (1) stating that the analyst has analysed or examined a substance and stating the result of the analysis or examination is admissible in evidence in any proceedings for an offence under this Act as prima facie evidence of the facts stated in the certificate and of the correctness of the result of the analysis or examination. (3) For the purposes of this section, a document purporting to be a certificate mentioned in subsection (2) on its production by the prosecution is, unless the contrary is proved, deemed to be such a certificate. (4) A certificate mentioned in subsection (2) shall not be received in evidence pursuant to that subsection unless the person charged has been given a copy of the certificate together with reasonable notice of the intention of the prosecution to produce the certificate as evidence in the proceedings. (5) Where a certificate of an analyst appointed under subsection (1) is admitted in evidence under subsection (2), the person charged may require the analyst to be called as a witness for the prosecution and the analyst may be cross‑examined as if the analyst had given evidence of the matters stated in the certificate."
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "42",
      "title": "Offences by body corporate",
      "content": "42. —(1) Where an offence under this Act has been committed by a body corporate, any person who, at the time of the commission of the offence, was a director, manager, secretary or other similar officer of the body, or who was purporting to act in any such capacity, shall also be guilty of that offence and shall be liable to be proceeded against and punished accordingly unless the person proves that — ( a ) the offence was committed without his or her knowledge, consent or connivance; and ( b ) he or she had exercised all such diligence to prevent the commission of the offence as he or she ought to have exercised having regard to the nature of his or her functions in that capacity and to all the circumstances. (2) Without limiting subsection (1), in determining whether a person has exercised all such diligence to prevent the commission of the offence under subsection (1), a court is to have regard to whether the person took any action directed towards ensuring the following (to the extent that the action is relevant to the contravention): ( a ) that the body arranges regular professional assessments of the body’s compliance with this Act; ( b ) that the body implements any appropriate recommendations arising from such an assessment; ( c ) that the body implements an effective system of hazardous or other waste management, where the system is consistent with the environmentally sound management of the waste; ( d ) that the body has contingency procedures for dealing with an emergency involving hazardous or other waste, where the procedures are directed towards — (i) reducing the risk of injury or damage to human beings or the environment; and (ii) mitigating any such injury or damage; ( e ) that the body’s employees, agents and contractors have a reasonable knowledge and understanding of the requirements of this Act, so far as those requirements affect the employees, agents or contractors concerned."
    },
    {
      "provision_ref": "s42A",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "42A",
      "title": "Jurisdiction of District Court",
      "content": "42A. Despite any provision to the contrary in the Criminal Procedure Code 2010, a District Court has jurisdiction to try any offence under this Act and has power to impose the full penalty or punishment in respect of the offence. [9/2003]"
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "43",
      "title": "Protection from personal liability",
      "content": "43. No suit or other legal proceedings shall lie personally against the Director‑General or an authorised officer or any person acting under the direction of the Director‑General for anything which is in good faith done or intended to be done in the execution or purported execution of this Act. [6/2020]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "44",
      "title": "Public servants for purposes of Penal Code 1871",
      "content": "44. The Director‑General and all authorised officers are deemed to be public servants for the purposes of the Penal Code 1871. [6/2020]"
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "45",
      "title": "Appeal to Minister",
      "content": "45. Any applicant who is aggrieved by the refusal of the Director‑General to grant a permit under this Act may, within 30 days of the decision of the Director‑General, appeal in writing to the Minister whose decision is final and must be given effect to by the Director‑General. [6/2020]"
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "46",
      "title": "Service of notice, etc.",
      "content": "46. —(1) Any notice, order or document required or authorised by this Act to be given or served on any person, and any summons issued by a court in connection with any offence under this Act, may be served on the person concerned — ( a ) by delivering it to the person or to some adult member or employee of his or her family at the nominated address for service or last known place of residence; ( b ) by leaving it at the nominated address for service or usual or last known place of residence or business in a cover addressed to him or her; ( c ) by affixing it to some conspicuous part of the nominated address for service or last known place of residence; ( d ) by sending it by registered post addressed to the person at the nominated address for service or usual or last known place of residence or business; ( e ) where the person is a body corporate — (i) by delivering it to the secretary or other similar officer of the body corporate at its nominated address for service or registered or principal office; or (ii) by sending it by registered post addressed to the body corporate at its nominated address for service or registered or principal office; or ( f ) where the person is a body corporate incorporated outside Singapore and does not have a registered or principal office in Singapore but has an agent in Singapore, by delivering it to that agent. (2) Any notice, order, document or summons sent by registered post to any person in accordance with subsection (1) is deemed to be duly served on the person to whom the letter is addressed at the time when the letter would, in the ordinary course of post, be delivered and in proving service of the same it is sufficient to prove that the envelope containing the notice, order, document or summons was properly addressed, stamped and posted by registered post. (3) In this section, “nominated address for service” means the address nominated for service by the person concerned for the purposes of this Act."
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "47",
      "title": "Convention countries",
      "content": "47. —(1) Where the Minister, by order in the Gazette , declares that any country specified in the order is a party to the Basel Convention, the order, while in force, is evidence of that fact. (2) For the purposes of this Act, a certificate signed by the Minister, stating that a country specified in the certificate (but not specified in any order made under subsection (1) which is in force) is, or was at a time specified in the certificate, a Convention country, is, upon mere production, prima facie evidence of that fact."
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 6 - MISCELLANEOUS",
      "section": "48",
      "title": "Regulations",
      "content": "48. —(1) The Minister may make regulations prescribing matters — ( a ) required or permitted by this Act to be prescribed; or ( b ) necessary to be prescribed for carrying out or giving effect to this Act. (2) Without limiting subsection (1), the regulations may also — ( a ) empower the Director‑General to determine the type of permit, whether a Basel permit or special permit, to be granted regardless of the type applied for; ( b ) prescribe the procedure to be followed by the Director‑General and authorised officers in the exercise of their functions under this Act; ( c ) require the provision of information in relation to the import, export or transit of such waste by the holder of a Basel permit or special permit to any authority as may be specified in the regulations; ( d ) provide for the Director‑General to give orders or to take action in relation to the dealing of such waste where there is a contravention of the provisions of this Act or any regulations made under this Act or of an order made by the Director‑General and for the recovery of the costs of any such action taken by the Director‑General; and ( e ) provide that any person who contravenes the regulations shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $1,000 for every day or part of a day during which the offence continues after conviction. [6/2020] (3) The regulations may amend or add to the Schedule for the purpose of ensuring that the Schedule correctly sets out the English text of the Basel Convention as in force from time to time."
    }
  ],
  "definitions": [
    {
      "term": "Antarctica",
      "definition": "“Antarctica” means the area south of 60&#186; South latitude, including all ice shelves in that area;",
      "source_provision": "s2"
    },
    {
      "term": "Article 11 arrangement",
      "definition": "“Article 11 arrangement” has the meaning given to it by section 7;",
      "source_provision": "s2"
    },
    {
      "term": "authorised officer",
      "definition": "“authorised officer” means a person appointed under section 16 as an authorised officer;",
      "source_provision": "s2"
    },
    {
      "term": "Basel Convention",
      "definition": "“Basel Convention” means the Basel Convention on the Control of Transboundary Movements of Hazardous Wastes and their Disposal and any amendment or protocol to the Convention that has come into force and has been accepted by the Government, a copy of the English text of which is set out in the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Basel export permit",
      "definition": "“Basel export permit” means a permit given in accordance with the Basel Convention permitting the export of hazardous or other waste;",
      "source_provision": "s2"
    },
    {
      "term": "Basel import permit",
      "definition": "“Basel import permit” means a permit given in accordance with the Basel Convention permitting the import of hazardous or other waste;",
      "source_provision": "s2"
    },
    {
      "term": "Basel permit",
      "definition": "“Basel permit” means a Basel export permit, a Basel import permit or a Basel transit permit;",
      "source_provision": "s2"
    },
    {
      "term": "Basel transit permit",
      "definition": "“Basel transit permit” means a permit given in accordance with the Basel Convention permitting the carrying out of one or more transit proposals relating to hazardous or other waste;",
      "source_provision": "s2"
    },
    {
      "term": "competent authority",
      "definition": "“competent authority” , in relation to a foreign country, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "deal with",
      "definition": "“deal with” , in relation to hazardous or other waste, includes dispose of;",
      "source_provision": "s2"
    },
    {
      "term": "Director‑General",
      "definition": "“Director‑General” means the Director‑General of Environmental Protection appointed under section 3(1) of the Environmental Protection and Management Act 1999;",
      "source_provision": "s2"
    },
    {
      "term": "disposal",
      "definition": "“disposal” means an operation specified in Annex IV to the Basel Convention;",
      "source_provision": "s2"
    },
    {
      "term": "environmentally sound management",
      "definition": "“environmentally sound management” , in relation to hazardous or other waste, has the meaning given by section 8;",
      "source_provision": "s2"
    },
    {
      "term": "export permit",
      "definition": "“export permit” means a Basel export permit or a special export permit;",
      "source_provision": "s2"
    },
    {
      "term": "export proposal",
      "definition": "“export proposal” means a proposal to export hazardous or other waste and to deal with it outside Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "foreign country",
      "definition": "“foreign country” includes — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "holder",
      "definition": "“holder” , in relation to a Basel permit or a special permit, means the person to whom the permit was granted;",
      "source_provision": "s2"
    },
    {
      "term": "household waste",
      "definition": "“household waste” means waste collected from households, but does not include such waste as may be specified in any regulations made under this Act;",
      "source_provision": "s2"
    },
    {
      "term": "import permit",
      "definition": "“import permit” means a Basel import permit or a special import permit;",
      "source_provision": "s2"
    },
    {
      "term": "import proposal",
      "definition": "“import proposal” means a proposal to import hazardous or other waste and to deal with it in Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "permit application",
      "definition": "“permit application” means an application for a Basel or special permit;",
      "source_provision": "s2"
    },
    {
      "term": "permit condition",
      "definition": "“permit condition” means a condition specified in — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "platform",
      "definition": "“platform” includes any structure at sea, whether fixed or not fixed, but does not include a vessel;",
      "source_provision": "s2"
    },
    {
      "term": "premises",
      "definition": "“premises” includes any place, whether or not enclosed or built on;",
      "source_provision": "s2"
    },
    {
      "term": "relevant person",
      "definition": "“relevant person” , in relation to a searchable place, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "searchable place",
      "definition": "“searchable place” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "set of Article 11 regulations",
      "definition": "“set of Article 11 regulations” has the meaning given by section 19(3);",
      "source_provision": "s2"
    },
    {
      "term": "Singapore aircraft",
      "definition": "“Singapore aircraft” means an aircraft that is registered in Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "Singapore platform",
      "definition": "“Singapore platform” means a platform — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Singapore vessel",
      "definition": "“Singapore vessel” means a vessel that is registered in Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "Singapore waters",
      "definition": "“Singapore waters” means the following waters: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "special export permit",
      "definition": "“special export permit” means a permit under a set of Article 11 regulations permitting the export of hazardous or other waste;",
      "source_provision": "s2"
    },
    {
      "term": "special import permit",
      "definition": "“special import permit” means a permit under a set of Article 11 regulations permitting the import of hazardous or other waste;",
      "source_provision": "s2"
    },
    {
      "term": "special permit",
      "definition": "“special permit” means a special export permit, a special import permit or a special transit permit;",
      "source_provision": "s2"
    },
    {
      "term": "special transit permit",
      "definition": "“special transit permit” means a permit under a set of Article 11 regulations permitting the carrying out of one or more transit proposals relating to hazardous or other waste;",
      "source_provision": "s2"
    },
    {
      "term": "through bill of lading",
      "definition": "“through bill of lading” or “through airway bill” means a bill of lading or airway bill, as the case may be, for the consignment of goods from a place outside Singapore to a final destination outside Singapore without a consignee in Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "transit permit",
      "definition": "“transit permit” means a Basel transit permit or a special transit permit;",
      "source_provision": "s2"
    },
    {
      "term": "transit proposal",
      "definition": "“transit proposal” has the meaning given by section 6;",
      "source_provision": "s2"
    },
    {
      "term": "vessel",
      "definition": "“vessel” means anything capable of carrying persons or goods through or on water, and includes an air-cushion vehicle or similar craft;",
      "source_provision": "s2"
    },
    {
      "term": "waste",
      "definition": "“waste” means a substance or object that is — ( a )",
      "source_provision": "s2"
    }
  ]
}