{
  "id": "icaa-2010",
  "type": "statute",
  "title": "International Child Abduction Act 2010",
  "title_en": "International Child Abduction Act 2010",
  "short_name": "ICAA2010",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/ICAA2010",
  "description": "An Act to give effect to the Convention on the Civil Aspects of International Child Abduction and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the International Child Abduction Act 2010."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “Convention” means the Convention on the Civil Aspects of International Child Abduction which was signed at The Hague on 25 October 1980; “Court” means the General Division of the High Court or a Family Court; “Minister” means — ( a ) except as provided in paragraph ( b ), the Minister charged with the responsibility for child welfare and protection; and ( b ) for the purposes of Part 4, the Minister charged with the responsibility for legal aid. [27/2014; 40/2019] (2) Unless the contrary intention appears, words and expressions used in this Act have the same meanings as in the provisions of the Convention set out in the Schedule."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Certain provisions of Convention to have force of law",
      "content": "3. Despite any written law or rule of law but subject to the provisions of Parts 1 to 5, the provisions of the Convention as set out in the Schedule have the force of law in Singapore."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "4",
      "title": "Contracting States",
      "content": "4. —(1) For the purposes of the Convention, the Contracting States (other than Singapore) are those for the time being specified by the Minister by an order in the Gazette . (2) An order under subsection (1) must specify the date of coming into force of the Convention as between Singapore and any Contracting State specified in the order, and, except where the order otherwise provides, the Convention applies as between Singapore and that Contracting State only in relation to — ( a ) wrongful removals or retentions of children; or ( b ) breaches of access rights to children, occurring on or after that date. (3) Where the Convention applies, or applies only, to a particular territory specified in a declaration made by a Contracting State under Article 39 or 40 of the Convention, references to that Contracting State in subsections (1) and (2) are to be construed as references to that territory."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - CENTRAL AUTHORITY OF SINGAPORE",
      "section": "5",
      "title": "Central Authority",
      "content": "5. Subject to the provisions of this Part, the functions of a Central Authority under the provisions of the Convention set out in the Schedule are to be discharged in Singapore by the Minister."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - CENTRAL AUTHORITY OF SINGAPORE",
      "section": "6",
      "title": "Applications to Central Authority under Article 8 of Convention",
      "content": "6. —(1) A person who claims that, in breach of rights of custody attributed to a person, either jointly or alone, under the law of a Contracting State, a child has been wrongfully removed to or retained in Singapore within the meaning of the Convention may apply to the Central Authority of Singapore for the Central Authority’s assistance in facilitating the voluntary return of the child or an amicable resolution of the dispute relating to the removal or retention of the child. (2) A person who claims that, in breach of rights of custody attributed to a person, either jointly or alone, under the law of Singapore, a child has been wrongfully removed to or retained in a Contracting State within the meaning of the Convention may apply to the Central Authority of Singapore to have the person’s claim sent to the Central Authority of the Contracting State. (3) An application under subsection (1) or (2) must be made in the form and manner, and must contain the information and be accompanied by the documents, that the Central Authority of Singapore specifies. (4) The Central Authority of Singapore may accept an application under subsection (1) or (2) from — ( a ) the person to whom the rights of custody (claimed to have been breached) are attributed under the law of the Contracting State or Singapore, as the case may be; or ( b ) any other person appearing to the Central Authority of Singapore to have sufficient interest in the matter. (5) The Central Authority of Singapore may refuse to accept an application under subsection (1) or (2) if it is not submitted in accordance with this section or section 21 or for any of the reasons specified in Article 27 of the Convention. (6) In this section, “person” includes an institution or other body."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - CENTRAL AUTHORITY OF SINGAPORE",
      "section": "7",
      "title": "Applications to Central Authority under Article 21 of Convention",
      "content": "7. —(1) A person who claims that his or her rights of access under the law of a Contracting State to a child in Singapore have been breached within the meaning of the Convention may apply to the Central Authority of Singapore for the Central Authority’s assistance in facilitating an amicable resolution of the dispute relating to the exercise of those rights. (2) A person who claims that his or her rights of access under the law of Singapore to a child in a Contracting State have been breached within the meaning of the Convention may apply to the Central Authority of Singapore to have the person’s claim sent to the Central Authority of the Contracting State. (3) An application under subsection (1) or (2) must be made in the form and manner, and must contain the information and be accompanied by the documents, that the Central Authority of Singapore specifies. (4) The Central Authority of Singapore may refuse to accept an application under subsection (1) or (2) if it is not submitted in accordance with this section or section 21 or for any of the reasons specified in Article 27 of the Convention."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - APPLICATIONS TO COURT",
      "section": "8",
      "title": "Application for return of child",
      "content": "8. —(1) A person who claims that, in breach of rights of custody attributed to a person, either jointly or alone, under the law of a Contracting State, a child has been wrongfully removed to or retained in Singapore within the meaning of the Convention may apply to the Court for an order that the child be returned. (2) An application under subsection (1) may be made by — ( a ) the person to whom the rights of custody (claimed to have been breached) are attributed under the law of the Contracting State; or ( b ) any person appearing to the Court to have sufficient interest in the matter. (3) The applicant must notify the Central Authority of Singapore of the application by forwarding a copy of the application to the Central Authority of Singapore as soon as practicable. (4) The Court may, if it determines that the child should be returned to the Contracting State, give permission for the child to be taken out of Singapore either unconditionally or subject to the conditions or undertakings that the Court may think fit. [Act 25 of 2021 wef 01/04/2022] (5) In this section, “person” includes an institution or other body."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - APPLICATIONS TO COURT",
      "section": "9",
      "title": "Power to allow intervention on terms",
      "content": "9. On the application of any person who is not a party to an application under section 8, the Court may, if satisfied that it is in the interest of the child (in respect of whom the application under section 8 has been made) for that person to be made a party, allow that person to intervene in the proceedings upon the terms that the Court thinks just."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - APPLICATIONS TO COURT",
      "section": "10",
      "title": "Interim powers of Court",
      "content": "10. —(1) Where an application has been made to the Court under section 8 for the return of a child, the Court may, at any time before it determines the application, make such interim orders or give such interim directions as it thinks fit for the purpose of securing the welfare of the child or of preventing changes in the circumstances relevant to the determination of the application. (2) Without limiting subsection (1), the Court may make interim orders or give interim directions for the care and control of or access to the child."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - APPLICATIONS TO COURT",
      "section": "11",
      "title": "Power of Court to restrain taking of child out of Singapore",
      "content": "11. —(1) Without limiting section 10, where an application under section 8 for the return of a child is pending or has been dismissed by the Court, the Court may issue an injunction restraining any person from taking the child out of Singapore. (2) An application for an order under subsection (1) may be made by any person appearing to the Court to have sufficient interest in the matter."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - APPLICATIONS TO COURT",
      "section": "12",
      "title": "Advice of welfare officers, etc.",
      "content": "12. The Court may receive advice from any person, whether or not a public officer, who is trained or experienced in matters relevant to the Court’s determination of an application under section 8, but is not bound to follow any such advice."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - APPLICATIONS TO COURT",
      "section": "13",
      "title": "Stay of decision in respect of custody, care and control and access",
      "content": "13. —(1) When an application has been made to the Court under section 8 for the return of a child, no decision may be made by any court in respect of the custody of, care and control of or access to the child in any proceedings until the Court has determined the application. (2) The reference to deciding on the merits in respect of the custody of, care and control of or access to a child in subsection (1) is a reference to making, varying, revoking or enforcing a custody order, a care and control order or an access order (as the case may be) in respect of the child. (3) Subsection (1) does not affect or limit the Court’s power to make interim orders or give interim directions under section 10. (4) In this section, “court” includes the Syariah Court and the Appeal Board constituted under the Administration of Muslim Law Act 1966."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - APPLICATIONS TO COURT",
      "section": "14",
      "title": "Declarations by Court",
      "content": "14. —(1) The Court may, on an application made for the purpose of Article 15 of the Convention by any person appearing to the Court to have sufficient interest in the matter, make a declaration that the removal of a child from Singapore, or the retention of the child outside Singapore, was wrongful within the meaning of the Convention. (2) To avoid doubt, section 35A of the Administration of Muslim Law Act 1966 and section 17A(3) of the Supreme Court of Judicature Act 1969 do not apply to an application under subsection (1)."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - LEGAL AID AND ADVICE",
      "section": "15",
      "title": "Interpretation of this Part",
      "content": "15. In this Part, unless the context otherwise requires — “authorised solicitor” means a solicitor on any panel established under section 4 of the Legal Aid and Advice Act 1995 who has been assigned by the Director to provide legal representation or legal advice to a person under this Part; “Director” means the Director of Legal Aid appointed under section 3 of the Legal Aid and Advice Act 1995 and includes a Deputy Director and an Assistant Director of Legal Aid appointed under section 3 of that Act."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - LEGAL AID AND ADVICE",
      "section": "16",
      "title": "Administration of legal aid and advice",
      "content": "16. The provision of legal aid and advice under this Part is to be administered by the Director."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - LEGAL AID AND ADVICE",
      "section": "17",
      "title": "Legal aid",
      "content": "17. Subject to the provisions of this Part, the Director may grant legal aid in connection with any proceedings under section 8 or 14 to any person — ( a ) who is a citizen of, or habitually resident in, Singapore or a Contracting State; and ( b ) who is or will be — (i) a party to the proceedings under section 8; or (ii) the applicant in the proceedings under section 14."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - LEGAL AID AND ADVICE",
      "section": "18",
      "title": "Legal advice",
      "content": "18. Subject to the provisions of this Part, on the application of any person who is a citizen of, or habitually resident in, Singapore or a Contracting State — ( a ) the Director or an authorised solicitor may provide oral advice to the person on the law of Singapore in connection with the Convention; or ( b ) the Director may provide the person assistance with the preparation of an application by the person for legal aid under this Part."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - LEGAL AID AND ADVICE",
      "section": "19",
      "title": "Application of Legal Aid and Advice Act 1995 and Legal Aid and Advice Regulations to legal aid and advice under this Part",
      "content": "19. Except where expressly provided in this Part, the provisions of the Legal Aid and Advice Act 1995 and the Legal Aid and Advice Regulations apply (so far as relevant) in relation to the provision of legal aid and legal advice under this Part as they apply to the provision of legal aid and legal advice under the Legal Aid and Advice Act 1995, with such exceptions, modifications and adaptations as the Minister may prescribe."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 4 - LEGAL AID AND ADVICE",
      "section": "20",
      "title": "Regulations",
      "content": "20. The Minister may make regulations for the purposes of carrying out the provisions of this Part or for the prescribing of anything which may be prescribed or is required to be prescribed under this Part."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "21",
      "title": "Language and translation",
      "content": "21. For the purposes of Article 24 of the Convention, any application, communication or other document sent to the Central Authority of Singapore must, if it is in a language other than English, be accompanied by an English translation of the application, communication or other document."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "22",
      "title": "Proof of documents and evidence",
      "content": "22. —(1) For the purposes of Article 14 of the Convention, a decision of a judicial or administrative authority outside Singapore may be proved by a duly authenticated copy of the decision, and any document purporting to be such a copy is deemed to be a true copy unless the contrary is shown. (2) For the purposes of subsection (1), a copy is duly authenticated if it bears the seal, or is certified by a judge or officer, of the authority. (3) For the purposes of Articles 14 and 30 of the Convention, any document specified in Article 8 of the Convention or a certified copy of the document is sufficient evidence of anything stated in it."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "23",
      "title": "Costs",
      "content": "23. No costs mentioned in Article 26 of the Convention are to be borne by the Government, the Central Authority of Singapore or any other public authority in Singapore except insofar as they fall to be so borne by virtue of the grant of legal aid or advice under Part 4."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "24",
      "title": "Regulations",
      "content": "24. The Minister may make regulations for the purposes of carrying out the provisions of this Act (other than those in Parts 3 and 4)."
    }
  ],
  "definitions": [
    {
      "term": "Convention",
      "definition": "“Convention” means the Convention on the Civil Aspects of International Child Abduction which was signed at The Hague on 25 October 1980;",
      "source_provision": "s2"
    },
    {
      "term": "Court",
      "definition": "“Court” means the General Division of the High Court or a Family Court;",
      "source_provision": "s2"
    },
    {
      "term": "Minister",
      "definition": "“Minister” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "authorised solicitor",
      "definition": "“authorised solicitor” means a solicitor on any panel established under section 4 of the Legal Aid and Advice Act 1995 who has been assigned by the Director to provide legal representation or legal advice to a person under this Part;",
      "source_provision": "s15"
    },
    {
      "term": "Director",
      "definition": "“Director” means the Director of Legal Aid appointed under section 3 of the Legal Aid and Advice Act 1995 and includes a Deputy Director and an Assistant Director of Legal Aid appointed under section 3 of that Act.",
      "source_provision": "s15"
    }
  ]
}