{
  "id": "iiaea-2009",
  "type": "statute",
  "title": "International Interests in Aircraft Equipment Act 2009",
  "title_en": "International Interests in Aircraft Equipment Act 2009",
  "short_name": "IIAEA2009",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/IIAEA2009",
  "description": "An Act to implement the Convention on International Interests in Mobile Equipment and the Protocol to the Convention on International Interests in Mobile Equipment on Matters Specific to Aircraft Equipment, each signed at Cape Town on 16 November 2001 and for purposes connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the International Interests in Aircraft Equipment Act 2009."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “agreement” has the meaning given by Article 1( a ) of the Convention; “aircraft objects” has the meaning given by Article I(2)( c ) of the Protocol; “commencement of insolvency proceedings” means — ( a ) in the case of proceedings in bankruptcy under Part 16 of the Insolvency, Restructuring and Dissolution Act 2018, the date of presentation of the bankruptcy application under section 307 or 308 of that Act; ( b ) in the case of winding up proceedings under Part 8 of the Insolvency, Restructuring and Dissolution Act 2018, the time the winding up is deemed to have commenced under section 126 of that Act or the time specified under section 161(6) of that Act; ( c ) in the case of a voluntary arrangement under Part 14 of the Insolvency, Restructuring and Dissolution Act 2018, the date of the application for an interim order under section 276(1) of that Act; ( d ) in the case of a compromise or an arrangement under section 210 of the Companies Act 1967, the date of the application for an order under section 210(1) of that Act; ( e ) in the case of a compromise or an arrangement under section 71 of the Insolvency, Restructuring and Dissolution Act 2018, the date of the application under section 71 of that Act; or ( f ) in the case of judicial management proceedings under Part 7 of the Insolvency, Restructuring and Dissolution Act 2018 — (i) the date of the application for a judicial management order under section 91 of that Act; or (ii) the date of lodgment of the notice of appointment of the interim judicial manager under section 94(5)( a ) of that Act; “Convention” means the Convention on International Interests in Mobile Equipment signed at Cape Town on 16 November 2001, the text of which is set out in the First Schedule; “creditor” has the meaning given by Article 1( i ) of the Convention; “debtor” has the meaning given by Article 1( j ) of the Convention; “declaration” means a declaration or designation made by Singapore under the Convention or Protocol; “insolvency administrator” means — ( a ) in the case of proceedings in bankruptcy under Part 16 of the Insolvency, Restructuring and Dissolution Act 2018, the trustee of the bankrupt’s estate; ( b ) in the case of winding up proceedings under Part 8 of the Insolvency, Restructuring and Dissolution Act 2018, the liquidator or provisional liquidator; or ( c ) in the case of judicial management proceedings under Part 7 of the Insolvency, Restructuring and Dissolution Act 2018, the judicial manager or interim judicial manager; “insolvency proceedings” means — ( a ) proceedings in bankruptcy under Part 16 of the Insolvency, Restructuring and Dissolution Act 2018; ( b ) winding up proceedings under Part 8 of the Insolvency, Restructuring and Dissolution Act 2018; ( c ) the making of a voluntary arrangement under Part 14 of the Insolvency, Restructuring and Dissolution Act 2018 or a compromise or an arrangement under section 210 of the Companies Act 1967 or section 71 of the Insolvency, Restructuring and Dissolution Act 2018; or ( d ) judicial management proceedings under Part 7 of the Insolvency, Restructuring and Dissolution Act 2018; “international interest” has the meaning given by Article 1( o ) of the Convention; “Protocol” means the Protocol to the Convention on International Interests in Mobile Equipment on Matters Specific to Aircraft Equipment signed at Cape Town on 16 November 2001, the text of which is set out in the Second Schedule; “registered” has the meaning given by Article 1( bb ) of the Convention. [15/2017; 40/2018] (2) Unless a contrary intention appears, words and expressions used in this Act have the meanings given by the Convention and Protocol."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Application of Convention and Protocol",
      "content": "3. —(1) Subject to the provisions of this Act, the Convention and Protocol, to the extent that they apply — ( a ) in respect of aircraft objects; and ( b ) to Singapore as described in the declarations, have the force of law in Singapore. (2) If a provision of this Act, including a provision given force of law by this section, is inconsistent with any other law, the provision prevails over the other law to the extent of the inconsistency. (3) In interpreting the Convention and the Protocol, recourse may be had to — ( a ) the Official Commentary on the Convention on International Interests in Mobile Equipment and the Protocol thereto on Matters Specific to Aircraft Equipment, as approved for distribution by the Governing Council of the International Institute for the Unification of Private Law (UNIDROIT); and ( b ) the Consolidated Text of the Convention on International Interests in Mobile Equipment and the Protocol to the Convention on International Interests in Mobile Equipment on Matters Specific to Aircraft Equipment, the text of which is set out in the Third Schedule."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Remedies on insolvency",
      "content": "4. —(1) This section gives effect to Article XI of the Protocol to the extent that it applies to Singapore as described in the declarations. (2) This section applies in relation to an agreement where — ( a ) the debtor of the agreement — (i) if it is a body corporate or firm, is incorporated or registered in Singapore; or (ii) if he or she is a natural person, is domiciled in or has his or her principal place of business in Singapore; ( b ) the international interest of the agreement has been registered; and ( c ) the debtor and creditor have not by written agreement excluded the application of this section. (3) Subject to subsection (4), where any insolvency proceedings have commenced against the debtor of an agreement and the aircraft object is in Singapore, the debtor or (if the insolvency administrator of the debtor has custody of the aircraft object) the insolvency administrator of the debtor must, no later than the date referred to in subsection (14), give an opportunity to the creditor to take possession of the aircraft object. (4) The insolvency administrator of the debtor or the debtor (as the case may be) may retain possession of the aircraft object where, on or before the date referred to in subsection (14) — ( a ) the insolvency administrator of the debtor or the debtor (as the case may be) has agreed to perform all future obligations of the debtor under the agreement; and ( b ) all defaults under the agreement (other than a default constituted by the commencement of the insolvency proceedings) have been cured. (5) Where the insolvency administrator of the debtor or the debtor fails to perform all future obligations of the debtor as agreed under subsection (4)( a ), the creditor may immediately exercise the creditor’s right to take possession of the aircraft object. (6) Unless and until the creditor is given the opportunity by the insolvency administrator of the debtor or the debtor (as the case may be) to exercise the creditor’s right to take possession of the aircraft object under subsection (3) — ( a ) the insolvency administrator of the debtor or the debtor (as the case may be) must preserve the aircraft object and maintain it and its value in accordance with the agreement; and ( b ) the creditor is entitled (despite anything in any law) to apply for and obtain any interim relief available to it under this Act or any other law. (7) For the purposes of subsection (6)( a ), the insolvency administrator of the debtor or the debtor may use the aircraft object under arrangements designed to preserve it and its value. (8) The insolvency administrator of the debtor is to be indemnified by the creditor for all reasonable costs incurred in complying with subsection (6)( a ). (9) The right of the creditor to exercise any remedies under the Convention or Protocol after the date referred to in subsection (14) is not limited or otherwise affected by any other law. (10) No obligation of the debtor under the agreement may be modified under the relevant insolvency law except with the creditor’s consent. (11) Subsection (10) does not affect the right of the insolvency administrator of the debtor to terminate the agreement under the relevant insolvency law. (12) In this section, “insolvency law” means a provision of Part 7 of the Companies Act 1967, or Part 5, 7, 8, 9, 10, 11, 14 or 16 of the Insolvency, Restructuring and Dissolution Act 2018. [40/2018] (13) Subsections (3) to (8) do not apply to the insolvency administrator of the debtor if the insolvency administrator is appointed on or after the date referred to in subsection (14). (14) The date referred to in subsections (3), (4), (9) and (13) is the earlier of — ( a ) 30 days after the commencement of insolvency proceedings; and ( b ) the date on which the creditor would have been entitled to take possession of the aircraft object but for this section. (15) No rights or interests, except for non-consensual rights or interests of a category covered by a declaration pursuant to Article 39(1) of the Convention, have priority in insolvency proceedings over registered interests. (16) The Convention as modified by Article IX of the Protocol applies to the exercise of any remedies under this section."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "General Division of High Court to be court having jurisdiction",
      "content": "5. The General Division of the High Court shall be the court having jurisdiction to hear and determine all matters under this Act, including provisions given force of law by section 3. [40/2019]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Regulations",
      "content": "6. —(1) The Minister may make such regulations as are necessary or expedient for carrying out the purposes of this Act. (2) Any regulations made under subsection (1) must be presented to Parliament as soon as possible after publication in the Gazette ."
    }
  ],
  "definitions": [
    {
      "term": "agreement",
      "definition": "“agreement” has the meaning given by Article 1( a ) of the Convention;",
      "source_provision": "s2"
    },
    {
      "term": "aircraft objects",
      "definition": "“aircraft objects” has the meaning given by Article I(2)( c ) of the Protocol;",
      "source_provision": "s2"
    },
    {
      "term": "commencement of insolvency proceedings",
      "definition": "“commencement of insolvency proceedings” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Convention",
      "definition": "“Convention” means the Convention on International Interests in Mobile Equipment signed at Cape Town on 16 November 2001, the text of which is set out in the First Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "creditor",
      "definition": "“creditor” has the meaning given by Article 1( i ) of the Convention;",
      "source_provision": "s2"
    },
    {
      "term": "debtor",
      "definition": "“debtor” has the meaning given by Article 1( j ) of the Convention;",
      "source_provision": "s2"
    },
    {
      "term": "declaration",
      "definition": "“declaration” means a declaration or designation made by Singapore under the Convention or Protocol;",
      "source_provision": "s2"
    },
    {
      "term": "insolvency administrator",
      "definition": "“insolvency administrator” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "insolvency proceedings",
      "definition": "“insolvency proceedings” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "international interest",
      "definition": "“international interest” has the meaning given by Article 1( o ) of the Convention;",
      "source_provision": "s2"
    },
    {
      "term": "Protocol",
      "definition": "“Protocol” means the Protocol to the Convention on International Interests in Mobile Equipment on Matters Specific to Aircraft Equipment signed at Cape Town on 16 November 2001, the text of which is set out in the Second Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "registered",
      "definition": "“registered” has the meaning given by Article 1( bb ) of the Convention. [15/2017; 40/2018]",
      "source_provision": "s2"
    }
  ]
}