{
  "id": "iposa-2001",
  "type": "statute",
  "title": "Intellectual Property Office of Singapore Act 2001",
  "title_en": "Intellectual Property Office of Singapore Act 2001",
  "short_name": "IPOSA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/IPOSA2001",
  "description": "An Act to establish and incorporate the Intellectual Property Office of Singapore, to provide for its functions and powers, and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Intellectual Property Office of Singapore Act 2001."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Chairperson” means the Chairperson of the Office and includes any temporary Chairperson of the Office; “Chief Executive” means the Chief Executive of the Office, and includes any individual acting in that capacity; “Copyright Tribunal” means a Copyright Tribunal established under Part 10 of the Copyright Act 2021; “debenture” includes debenture stock; “Deputy Chairperson” means the Deputy Chairperson of the Office and includes any temporary Deputy Chairperson of the Office; “intellectual property adviser” means any person who in the course of the person’s profession or business provides legal or other advice relating to any intellectual property, including advice given in relation to an application for protection of an intellectual property whether in Singapore or elsewhere; “intellectual property agent” means a person acting on behalf of another — ( a ) in connection with the application for or obtaining of a patent or any procedure relating to a patent under the Patents Act 1994; ( b ) in connection with the registration of a trade mark or any procedure relating to a registered trade mark under the Trade Marks Act 1998; ( c ) in connection with the registration of a design or any procedure relating to a registered design under the Registered Designs Act 2000; or ( d ) in connection with the registration of a geographical indication or any procedure relating to a registered geographical indication under the Geographical Indications Act 2014; “member” means a member of the Office; “Office” means the Intellectual Property Office of Singapore established under section 3; “securities”, in relation to a company, includes shares, debentures, bonds and other securities of the company, whether or not constituting a charge on the assets of the company; “shares” includes stocks. [23/2009; 19/2014; 5/2018; 22/2021]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "3",
      "title": "Establishment and incorporation of Intellectual Property Office of Singapore",
      "content": "3. A body called the Intellectual Property Office of Singapore is established, which is a body corporate with perpetual succession and a common seal and is by that name capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing or disposing of property, both movable and immovable; and ( c ) doing and suffering any other acts or things that a body corporate may lawfully do and suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "4",
      "title": "Common seal",
      "content": "4. —(1) The Office must have a common seal and the seal may be broken, changed, altered or made anew as the Office thinks fit. (2) All deeds and other documents requiring the seal of the Office must be sealed with the common seal of the Office. (3) All instruments to which the common seal is affixed must be signed by the Chief Executive and one officer of the Office or by any 2 officers of the Office generally or specially authorised by the Chief Executive for that purpose. (4) All courts, judges and persons acting judicially are to take notice of the common seal of the Office affixed to any document and presume that it was duly affixed."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "5",
      "title": "Constitution of Office",
      "content": "5. —(1) The Office consists of — ( a ) a Chairperson; ( b ) a Deputy Chairperson; and ( c ) not less than 8 and not more than 20 other members as the Minister may determine. (2) The First Schedule has effect with respect to the Office, its members and its proceedings."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF OFFICE",
      "section": "6",
      "title": "Functions and duties of Office",
      "content": "6. —(1) Subject to the provisions of this Act, it is the function and duty of the Office — ( a ) to administer the systems in Singapore for the protection of intellectual property; ( b ) to provide administrative support services to the Copyright Tribunals in the performance of their functions under the Copyright Act 2021; ( c ) to maintain and provide access by the public to documents and information relating to any intellectual property kept or maintained by the Office; ( d ) to promote public awareness and effective use of intellectual property rights; ( e ) to represent the Government internationally on matters related to intellectual property; ( f ) to advise and make recommendations to the Government on matters related to intellectual property; ( g ) to advise and make recommendations to the Government on the recognition, accreditation and conduct of persons acting as intellectual property agents or intellectual property advisers, and exercise any regulatory functions over them; ( h ) to promote or assist in the development of the profession of intellectual property agents and intellectual property advisers in Singapore; ( i ) to promote and facilitate the training of persons desiring to be intellectual property agents in Singapore; ( j ) to manage technical cooperation and exchange in the area of intellectual property with other persons and organisations, including foreign intellectual property offices and international intergovernmental organisations, on its own behalf or on behalf of the Government; ( k ) to provide advice, training and assistance in relation to intellectual property to any Government department or statutory board, or to authorities of other countries and territories which administer intellectual property laws; and ( l ) to exercise any other functions and duties conferred on the Office by or under this Act or any other written law. [23/2009; 22/2021] (2) The Office may undertake such other functions as the Minister may assign to the Office and in so doing, the Office is deemed to be fulfilling the purposes of this Act, and the provisions of this Act apply to the Office in respect of the functions. (3) Nothing in this section is to be construed as imposing on the Office, directly or indirectly, any form of duty or liability enforceable by proceedings before any court."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF OFFICE",
      "section": "7",
      "title": "Powers of Office",
      "content": "7. —(1) The Office has the power to do anything for the purpose of discharging its functions under this Act or any other written law, or which it may consider advantageous, necessary or convenient to the discharge of those functions and, in particular, may — ( a ) administer systems for the protection of patents, trade marks, designs and geographical indications; ( b ) prescribe, regulate or implement measures and standards on any matter related to or connected with intellectual property; ( c ) accredit or certify, and regulate any person as an intellectual property agent or intellectual property adviser; ( d ) levy such charges or fees as may be reasonable for services and facilities provided by the Office; ( e ) subscribe for or acquire any securities and shares of an incorporated company or other body corporate, procure its admission to membership of an incorporated company limited by guarantee and not having a share capital, promote the formation of an incorporated company or participate in the promotion of the company or acquire an undertaking or part of an undertaking; ( f ) form or participate in the formation of any company or in any joint venture as a shareholder or partner or in any other capacity, with any firm, body corporate, society or institution for the purposes of this Act or any other written law; ( g ) carry out such other works or activities as may appear to the Office to be requisite, advantageous or convenient, with a view to making the best use of any of the assets of the Office; ( h ) engage, in conjunction with other authorities, international agencies or organisations, in any study or cooperation project related to intellectual property or in the promotion of intellectual property; ( i ) enter into contracts for the supply of goods or materials or for the execution of works as may be necessary for the discharge of any of its duties and functions; ( j ) provide financial loans, advances, grants, aid or assistance to any person for all or any of the purposes of this Act; ( k ) use the services, records, facilities or personnel of any local, foreign or international agency, organisation or other body in the discharge by the Office of any of its duties and functions; ( l ) operate such agency services as the Office may think fit and employ any number of agents to do anything that the Office may do; ( m ) provide bursaries, scholarships and training grants in the fields of intellectual property; ( n ) receive donations, grants, gifts, subsidies and contributions from any source and raise funds by all lawful means; ( o ) make provision for gratuities, pensions, allowances or other benefits for employees or former employees of the Office; ( p ) grant or guarantee loans to officers or employees of the Office for any purpose specifically approved by the Office; ( q ) provide recreational facilities and promote recreational activities for, and activities conducive to, the welfare of officers and employees of the Office and members of their families; and ( r ) do any other acts that are incidental to any of its functions and powers. [19/2014] (2) This section is not to be construed as limiting any power of the Office conferred by or under any other written law."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF OFFICE",
      "section": "8",
      "title": "Directions by Minister",
      "content": "8. —(1) The Minister may give to the Office any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (2) The Office must furnish the Minister with such information in respect of its property and activities in such manner and at such times as the Minister may require."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF OFFICE",
      "section": "9",
      "title": "Appointment of committees and delegation of powers",
      "content": "9. —(1) The Office may appoint from among its own members or other persons who are not members any number of committees that it thinks fit consisting of members or other persons, or members and other persons for purposes which, in the opinion of the Office, would be better regulated and managed by means of those committees. (2) The Office may, subject to any conditions or restrictions that it thinks fit, delegate to any such committee or to the Chairperson or Chief Executive or to any other member, officer or employee of the Office, any of the functions or powers of the Office under this Act or any other written law. [5/2018]"
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "10",
      "title": "Chief Executive, officers and employees, etc.",
      "content": "10. —(1) There must be a Chief Executive of the Office, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Office may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive during any period, or during all periods, when the Chief Executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018] (3) The Office may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on such terms and conditions as it may determine, such other officers, employees, consultants and agents as may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "11",
      "title": "Protection from liability",
      "content": "11. —(1) No suit or other legal proceedings shall lie personally against any member, officer or employee of the Office or any other person acting under the direction of the Office for anything which is in good faith done or intended to be done in the execution or purported execution of this Act. (2) Where the Office provides a service to the public under which information is supplied to the public pursuant to any written law, neither the Office nor any of its officers or employees involved in the supply of the information shall be liable for any loss or damage suffered by any member of the public by reason of any error or omission of whatever nature appearing in the information or however caused if made in good faith and in the ordinary course of the discharge of the duties of such officer or employee. 12. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "13",
      "title": "Funds and property of Office",
      "content": "13. The funds and property of the Office consist of — ( a ) grants made under section 18; ( b ) all fees paid into the funds of the Office under any written law; [Act 7 of 2022 wef 26/05/2022] ( c ) all moneys paid to the Office for the purposes of the Office; ( d ) all moneys paid to the Office by way of grants, subsidies, donations, gifts and contributions; ( e ) all moneys received by the Office by way of charges and fees for services rendered by the Office to any person; ( f ) all moneys, dividends, royalties, interest or income received from any transaction made pursuant to the powers conferred on the Office under this Act or any other written law; ( g ) all moneys borrowed by the Office under this Act; ( h ) all other moneys and property lawfully received by the Office for the purposes of the Office; and ( i ) all accumulations of income derived from any such property or money."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "14",
      "title": "Application of moneys",
      "content": "14. The moneys of the Office must be applied only in payment or discharge of the expenses, obligations and liabilities of the Office and in making any payment that the Office is authorised or required to make."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "15",
      "title": "Bank accounts and application of revenue",
      "content": "15. —(1) The Office must open and maintain an account or accounts with such bank or banks as the Office thinks fit. (2) Every such account must be operated by such person or persons authorised to do so by the Office."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "16",
      "title": "Minister’s approval of estimates",
      "content": "16. —(1) A copy of all annual estimates of revenue and expenditure and supplementary estimates must, upon their adoption by the Office, be sent without delay to the Minister. [5/2018] (2) The Minister may approve or disallow any item or portion of any item shown in the annual estimates or supplementary estimates. [5/2018] (3) The Minister must return the annual estimates or supplementary estimates as amended under subsection (2) to the Office, and the Office is bound by the Minister’s decision. [5/2018]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "17",
      "title": "Power of investment",
      "content": "17. The Office may invest its moneys in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [45/2004]"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "18",
      "title": "Grants",
      "content": "18. For the purpose of enabling the Office to carry out its functions under this Act, the Minister may make grants to the Office of such sums of money as the Minister may determine out of moneys to be provided by Parliament."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "19",
      "title": "Power to borrow",
      "content": "19. For the discharge of its functions or duties under this Act or any other written law, the Office may raise loans from the Government or, with the approval of the Minister for Finance, raise loans from banks or other financial institutions (whether in Singapore or elsewhere) by — ( a ) mortgage, overdraft or otherwise; ( b ) a charge, whether legal or equitable, on any property vested in the Office or on any other revenue receivable by the Office under this Act or any other written law; or ( c ) the creation and issue of debentures or bonds."
    },
    {
      "provision_ref": "s19A",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "19A",
      "title": "Issue of shares, etc.",
      "content": "19A. As a consequence of the vesting of any property, rights or liabilities of the Government in the Office under this Act, or of any capital injection or other investment by the Government in the Office in accordance with any written law, the Office must issue such shares or other securities to the Minister for Finance as that Minister may direct."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "20",
      "title": "Financial year",
      "content": "20. The financial year of the Office begins on 1 April of each year and ends on 31 March of the succeeding year. [5/2018]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "21",
      "title": "Transfer to Office of property, assets and liabilities",
      "content": "21. —(1) As from 1 April 2001, such movable and immovable property vested in the Government as may be determined by the Minister for Finance and used or managed by the Government department known as the Intellectual Property Office of Singapore or the Copyright Tribunal, and all assets, interests, rights, privileges, liabilities and obligations of the Government relating to that department and the Copyright Tribunal must be transferred to and vest in the Office without further assurance, act or deed. (2) If any question arises as to whether any particular property, asset, interest, right, privilege, liability or obligation has been transferred to or vested in the Office under subsection (1), a certificate under the hand of the Minister for Finance is conclusive evidence that the property, asset, interest, right, privilege, liability or obligation was or was not so transferred or vested. (3) Any immovable property to be transferred to and vested in the Office under subsection (1) must be held by the Office upon such tenure and subject to such terms and conditions as the President may determine."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "22",
      "title": "Transfer of employees",
      "content": "22. —(1) As from 1 April 2001, such persons or categories of persons as the Minister may determine who, immediately before that date, were employed by the Government in the Government department known as the Intellectual Property Office of Singapore or the Copyright Tribunal must be transferred to the service of the Office on terms no less favourable than those enjoyed by them immediately prior to their transfer. (2) If any question arises as to whether any person or any category of persons has been transferred to the service of the Office under subsection (1), a certificate under the hand of the Minister is conclusive evidence that the person or category of persons was or was not so transferred. (3) Until such time as terms and conditions of service are drawn up by the Office, the scheme and terms and conditions of service in the Government continue to apply to every person transferred to the service of the Office under subsection (1) as if the person were still in the service of the Government. (4) Despite the provisions of the Pensions Act 1956, no person who is transferred to the service of the Office under this section is entitled to claim any benefit under that Act on the ground that the person has been retired from the public service on account of abolition or reorganisation of office in consequence of the incorporation of the Office."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "23",
      "title": "Service rights, etc., of transferred employees to be preserved",
      "content": "23. —(1) The terms and conditions to be drawn up by the Office must take into account the salaries and terms and conditions of service, including any accrued rights to leave, enjoyed by the persons transferred to the service of the Office under section 22 while in the employment of the Government. (2) Any term or condition relating to the length of service with the Office must provide for the recognition of service under the Government by the persons transferred under section 22 to be service by them under the Office. (3) Nothing in the terms and conditions of service to be drawn up by the Office adversely affects the conditions that would have been applicable to persons transferred to the service of the Office as regards any pension, gratuity or allowance payable under the Pensions Act 1956. (4) Where a person has been transferred to the service of the Office under section 22, the Government is liable to pay to the Office such portion of any pension, gratuity or allowance payable to the person on the person’s retirement as the same bears to the proportion which the aggregate amount of the person’s pensionable emoluments during the person’s service with the Government bears to the aggregate amount of the person’s pensionable emoluments during the person’s service under both the Government and the Office. (5) Where any person in the service of the Office, whose case does not fall within the scope of any pension or other scheme established under this section, retires or dies in the service of the Office or is discharged from that service, the Office may grant to the person or to such other person or persons wholly or partly dependent on that person, as the Office thinks fit, such allowance or gratuity as the Office may determine."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "24",
      "title": "Existing contracts",
      "content": "24. All deeds, bonds, agreements, instruments and arrangements subsisting immediately before 1 April 2001 to which the Government is a party and relating to the Government department known as the Intellectual Property Office of Singapore or to the Copyright Tribunal or to any person transferred to the service of the Office under section 22 continue in force on or after that date and are enforceable by or against the Office as if the Office had been named therein or had been a party thereto instead of the Government."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "25",
      "title": "Pending proceedings",
      "content": "25. Any proceedings or cause of action relating to the portion of the property, assets, interests, rights, privileges, liabilities and obligations transferred to the Office under section 21 or to any person transferred to the service of the Office under section 22 pending or existing immediately before 1 April 2001 by or against the Government, or any person acting on its behalf, may be continued and is to be enforced by or against the Office."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "26",
      "title": "Continuation and completion of disciplinary proceedings",
      "content": "26. —(1) Where on 1 April 2001 any disciplinary proceedings were pending against any person transferred to the service of the Office under section 22, the proceedings must be carried on and completed by the Office. (2) Where on 1 April 2001 any matter was in the course of being heard or investigated or had been heard or investigated by a committee acting under due authority but no order, ruling or decision had been made thereon, the committee must complete the hearing or investigation and may make such order, ruling or direction as it could have made under the authority vested in it before that date. (3) Any order, ruling or direction made by a committee pursuant to this section is treated as an order, a ruling or a direction of the Office and has the same force or effect as if it had been made by the Office pursuant to the authority vested in the Office under this Act."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "27",
      "title": "Misconduct or neglect of duty by employee before transfer",
      "content": "27. The Office may reprimand, reduce in rank, retire, dismiss or punish in some other manner a person transferred to the service of the Office under section 22 for any misconduct or neglect of duty, committed prior to 1 April 2001 while the person was in the employment of the Government which would have rendered the person liable to be reprimanded, reduced in rank, retired, dismissed or punished in some other manner if the person had continued to be in the employment of the Government and if this Act had not been enacted."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "29",
      "title": "Symbol or representation of Office",
      "content": "29. —(1) The Office has the exclusive right to the use of such symbol or representation as it may select or devise and thereafter display or exhibit the symbol or representation in connection with its activities or affairs. (2) Any person who uses a symbol or representation identical with that of the Office or which so resembles the Office’s symbol or representation as to deceive or cause confusion, or to be likely to deceive or cause confusion, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "30",
      "title": "Powers of enforcement",
      "content": "30. —(1) In addition to the powers conferred on him or her by this Act or any other written law, an officer or employee of the Office may, in relation to any offence under this Act or any written law set out in the Third Schedule, on declaration of his or her office and production to the person against whom he or she is acting such identification card as the Chief Executive may direct to be carried by officers or employees of the Office — ( a ) require any person whom he or she reasonably believes to have committed that offence to furnish evidence of the person’s identity; ( b ) require any person to furnish any information or produce any book, document or copy thereof in the possession of that person, and may, without fee or reward, inspect, copy or make extracts from the book or document; or ( c ) require, by written order, the attendance before the officer or employee of any person within the limits of Singapore who, from any information given or otherwise obtained by the officer or employee, appears to be acquainted with the circumstances of the case. (2) Any person who — ( a ) refuses to give access to, or assaults, obstructs, hinders or delays, an officer or employee of the Office in the discharge of the duties by the officer or employee of the Office under this Act or that written law; ( b ) wilfully mis-states or without lawful excuse refuses to give any information or produce any book, document or copy thereof required of the person by an officer or employee of the Office under subsection (1); or ( c ) fails to comply with a lawful demand of an officer or employee of the Office in the discharge by the officer or employee of the officer’s or employee’s duties under this Act or that written law, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "31",
      "title": "Offences committed by bodies corporate, etc.",
      "content": "31. —(1) Where an offence under this Act which has been committed by a body corporate is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of, a director, manager, secretary or any similar officer of the body corporate, or any person who was purporting to act in any such capacity, he or she, as well as the body corporate, shall be guilty of that offence and shall be liable to be proceeded against and punished accordingly. (2) Where the affairs of a body corporate are managed by its members, subsection (1) applies in relation to the acts and defaults of a member in connection with the member’s functions of management as if the member were a director of the body corporate. (3) Proceedings for an offence under this Act alleged to have been committed by a partnership must be brought in the name of the partnership and not in that of the partners; but without affecting any liability of the partners under subsection (5). (4) A fine imposed on a partnership on its conviction in such proceedings must be paid out of the partnership assets. (5) Where a partnership is guilty of an offence under this Act, every partner, other than a partner who is proved to have been ignorant of or to have attempted to prevent the commission of the offence, shall also be guilty of the offence and shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "32",
      "title": "Jurisdiction of court",
      "content": "32. Despite any provision to the contrary in the Criminal Procedure Code 2010, a District Court or a Magistrate’s Court has jurisdiction to try any offence under this Act and has power to impose the full penalty or punishment in respect of any offence under this Act."
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "33",
      "title": "Composition of offences",
      "content": "33. —(1) The Chief Executive or any officer authorised by the Chief Executive may compound any offence under this Act that is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum of money not exceeding $1,000. (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence. (3) All sums collected under this section must be paid into the Consolidated Fund. [Act 7 of 2022 wef 26/05/2022]"
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "34",
      "title": "Proceedings conducted by officers of Office",
      "content": "34. —(1) Proceedings in respect of an offence under this Act or under any written law set out in the Third Schedule may, with the authorisation of the Public Prosecutor, be conducted by an officer of the Office who is authorised in writing in that behalf by the Chief Executive. [15/2010] (2) Despite any written law, a legal officer of the Office who has been admitted as an advocate and solicitor under the Legal Profession Act 1966 may — ( a ) appear in any civil proceedings involving the Office or any Registrar in the performance of the legal officer’s functions or duties under any written law; and ( b ) make and do all acts and applications in respect of such proceedings on behalf of the Office or any Registrar. (3) For the purposes of this section, “Registrar” means the Registrar of Designs referred to in section 49 of the Registered Designs Act 2000, the Registrar of Geographical Indications referred to in section 17 of the Geographical Indications Act 2014, the Registrar of Patents referred to in section 4 of the Patents Act 1994, the Registrar of Trade Marks referred to in section 62 of the Trade Marks Act 1998, or the principal officer administering the system for the protection of any other intellectual property under any other written law. [19/2014]"
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "35",
      "title": "Power of Minister to amend Third Schedule",
      "content": "35. The Minister may, by order in the Gazette , amend the Third Schedule."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "36",
      "title": "Preservation of secrecy",
      "content": "36. —(1) Except for the purpose of the performance of his or her duties or the exercise of his or her functions or when lawfully required to do so by any court or where required or allowed by the provisions of any written law, a person who is or has been a member, officer, agent, employee or former employee of the Office or a member of a committee of the Office must not disclose any information or matter relating to the affairs of the Office or of any other person which has been obtained by him or her in the performance of his or her duties or the exercise of his or her functions. [5/2018] (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "37",
      "title": "Rules",
      "content": "37. —(1) The Office may, with the approval of the Minister, make rules for carrying out the purposes and provisions of this Act. (2) Without limiting subsection (1), the Office may, with the approval of the Minister, make rules for or with respect to all or any of the following matters: ( a ) the manner of appointment, conduct and discipline and the terms and conditions of service of the officers and employees of the Office; ( b ) the establishment of funds for the payment of gratuities and other benefits to employees of the Office; ( c ) the fees to be charged in respect of anything done or any services rendered by the Office under or by virtue of this Act or any other written law; ( d ) the regulation, accreditation and certification of intellectual property advisers. 38. [ Repealed by Act 31 of 2022 wef 01/11/2022 ]"
    }
  ],
  "definitions": [
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Office and includes any temporary Chairperson of the Office;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive",
      "definition": "“Chief Executive” means the Chief Executive of the Office, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Copyright Tribunal",
      "definition": "“Copyright Tribunal” means a Copyright Tribunal established under Part 10 of the Copyright Act 2021;",
      "source_provision": "s2"
    },
    {
      "term": "debenture",
      "definition": "“debenture” includes debenture stock;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means the Deputy Chairperson of the Office and includes any temporary Deputy Chairperson of the Office;",
      "source_provision": "s2"
    },
    {
      "term": "intellectual property adviser",
      "definition": "“intellectual property adviser” means any person who in the course of the person’s profession or business provides legal or other advice relating to any intellectual property, including advice given in relation to an application for protection of an intellectual property whether in Singapore or elsewhere;",
      "source_provision": "s2"
    },
    {
      "term": "intellectual property agent",
      "definition": "“intellectual property agent” means a person acting on behalf of another — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means a member of the Office;",
      "source_provision": "s2"
    },
    {
      "term": "Office",
      "definition": "“Office” means the Intellectual Property Office of Singapore established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "securities",
      "definition": "“securities” , in relation to a company, includes shares, debentures, bonds and other securities of the company, whether or not constituting a charge on the assets of the company;",
      "source_provision": "s2"
    },
    {
      "term": "shares",
      "definition": "“shares” includes stocks. [23/2009; 19/2014; 5/2018; 22/2021]",
      "source_provision": "s2"
    }
  ]
}