{
  "id": "ippa-2008",
  "type": "statute",
  "title": "Internationally Protected Persons Act 2008",
  "title_en": "Internationally Protected Persons Act 2008",
  "short_name": "IPPA2008",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/IPPA2008",
  "description": "An Act to give effect to the Convention on the Prevention and Punishment of Crimes against Internationally Protected Persons and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Internationally Protected Persons Act 2008."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Convention” means the Convention on the Prevention and Punishment of Crimes against Internationally Protected Persons, including Diplomatic Agents, adopted by the General Assembly of the United Nations on 14 December 1973; “Convention country” means a foreign country that is a Party to the Convention; “country” includes a State or territory, as the case may be; “internationally protected person” has the meaning given by section 3; “offence against an internationally protected person” means — ( a ) an offence under section 4, 5 or 6; or ( b ) an abetment of, or a conspiracy or an attempt to commit, an offence under section 4 or 5; “relevant premises” means premises at which an internationally protected person resides or is staying or which he or she uses for the purpose of carrying out his or her functions as such person; “vehicle” includes any means of conveyance."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Internationally protected persons",
      "content": "3. —(1) In this Act, “internationally protected person” means — ( a ) a Head of State, including any member of a collegial body that performs the functions of a Head of State under the constitution of the State concerned, a head of a government or a minister responsible for foreign affairs, whenever he or she is outside the State in which he or she holds that position or office; ( b ) a member of the family of a person referred to in paragraph ( a ) who is accompanying the person; ( c ) a representative or official of a State or an official or agent of an international organisation of an intergovernmental character who, at the time and place of the alleged offence, is entitled under international law to special protection from any attack on his or her person, freedom or dignity; or ( d ) a member of the family of a person referred to in paragraph ( c ) who forms part of the person’s household. (2) The Minister may give a written certificate stating any matter relevant to the question whether a person is, or was at any time or in respect of any period, an internationally protected person, and the certificate is admissible in any proceedings as prima facie evidence of the matters stated in the certificate."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Offences against persons",
      "content": "4. —(1) Any person who commits outside Singapore any act — ( a ) to or in relation to a person whom the firstmentioned person knows to be an internationally protected person; and ( b ) which, if committed in Singapore, would have constituted an offence specified in the First Schedule, shall be guilty of that offence and shall be liable on conviction to the same punishment to which he or she would have been liable had he or she been convicted of that offence. (2) That person may be dealt with as if the offence had been committed in Singapore."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Offences against premises or vehicles",
      "content": "5. —(1) Any person who commits outside Singapore any act — ( a ) to or in relation to — (i) premises which he or she knows to be relevant premises; or (ii) a vehicle which he or she knows is used by an internationally protected person; ( b ) which is likely to endanger the person or liberty of the internationally protected person; and ( c ) which, if committed in Singapore, would have constituted an offence specified in the Second Schedule, shall be guilty of that offence and shall be liable on conviction to the same punishment to which he or she would have been liable had he or she been convicted of that offence. (2) That person may be dealt with as if the offence had been committed in Singapore."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Making threats",
      "content": "6. —(1) Any person who, in or outside Singapore, threatens to commit an act which is — ( a ) an offence specified in the First Schedule or under section 4 to or in relation to a person whom the firstmentioned person knows to be an internationally protected person; or ( b ) an offence specified in the Second Schedule or under section 5 to or in relation to — (i) premises which he or she knows to be relevant premises; or (ii) a vehicle which he or she knows is used by an internationally protected person, and which, if committed, is likely to endanger the person or liberty of the internationally protected person, shall be guilty of an offence and shall be liable on conviction to a fine or to imprisonment for a term not exceeding — ( c ) 7 years; or ( d ) the term of imprisonment to which a person would be liable for the offence constituted by committing the act threatened at the time of the offence to which the conviction relates, whichever is the lesser, or to both fine and imprisonment. (2) Where no term of imprisonment is prescribed for the offence under subsection (1)( d ), the person shall be liable on conviction to a fine or to imprisonment for a term not exceeding 7 years, or to both fine and imprisonment. (3) If the offence is committed outside Singapore, that person may be dealt with as if the offence had been committed in Singapore."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Attempt, abetment and conspiracy punishable as offences",
      "content": "7. Any person who, outside Singapore, commits an act which, if committed in Singapore, would constitute an abetment of or a conspiracy or an attempt to commit — ( a ) an offence specified in the First Schedule or under section 4, where the offence is or is to be committed to or in relation to a person whom the firstmentioned person knows to be an internationally protected person; or ( b ) an offence specified in the Second Schedule or under section 5, where the offence is or is to be committed to or in relation to — (i) premises which he or she knows to be relevant premises; or (ii) a vehicle which he or she knows is used by an internationally protected person, and which, if committed, is likely to endanger the person or liberty of the internationally protected person, is deemed to commit the act in Singapore and may be dealt with accordingly."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Presumption of knowledge",
      "content": "8. —(1) Where, in any proceedings for an offence under section 4, it is proved that the accused had committed the act mentioned in that section to or in relation to an internationally protected person, it is presumed, unless the contrary is proved, that the accused knew that the person in question was an internationally protected person. (2) Where, in any proceedings for an offence under section 5, it is proved that the accused had committed the act mentioned in that section to or in relation to relevant premises or a vehicle used by an internationally protected person, it is presumed, unless the contrary is proved, that the accused knew that the premises in question were relevant premises or the vehicle in question was a vehicle used by an internationally protected person. (3) Where, in any proceedings for an offence under section 6, it is proved that the accused had made a threat to commit an act mentioned in that section to or in relation to an internationally protected person, relevant premises or a vehicle used by an internationally protected person (as the case may be), it is presumed, unless the contrary is proved, that the accused knew that the person in question was an internationally protected person, the premises in question were relevant premises or the vehicle in question was a vehicle used by an internationally protected person. (4) Where, in any proceedings for an offence under section 7, it is proved that — ( a ) the accused had committed an act which, if committed in Singapore, would constitute an abetment of or a conspiracy or an attempt to commit an offence mentioned in that section; and ( b ) the offence is or is to be committed to or in relation to an internationally protected person, relevant premises or a vehicle used by an internationally protected person (as the case may be), it is presumed, unless the contrary is proved, that the accused knew that the person in question was an internationally protected person, the premises in question were relevant premises or the vehicle in question was a vehicle used by an internationally protected person."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Information relating to offence",
      "content": "9. —(1) Every person in Singapore who has information which the person knows or believes may be of material assistance — ( a ) in preventing the commission by another person of a relevant offence; or ( b ) in securing the apprehension, prosecution or conviction of another person, in Singapore, for an offence involving the commission, preparation or instigation of a relevant offence, and who fails to disclose the information immediately to a police officer shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $50,000 or to imprisonment for a term not exceeding 5 years or to both. (2) No criminal or civil proceedings shall lie against a person for any disclosure made in good faith under this section. (3) A person who makes a disclosure in good faith under this section is not to be treated as being in breach of any restriction upon the disclosure of information imposed by law, contract or rules of professional conduct. (4) In this section, “relevant offence” means — ( a ) an offence specified in the First Schedule committed to or in relation to an internationally protected person; ( b ) an offence specified in the Second Schedule committed to or in relation to relevant premises or a vehicle used by an internationally protected person; ( c ) an offence under section 4 or 5; or ( d ) an abetment of or a conspiracy or an attempt to commit an offence under paragraph ( a ), ( b ) or ( c )."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Assistance under Mutual Assistance in Criminal Matters Act 2000",
      "content": "10. —(1) Assistance under any provision of Part 3 of the Mutual Assistance in Criminal Matters Act 2000 may be provided by Singapore to a Convention country for a criminal matter involving a relevant offence of that country. (2) For the purposes of subsection (1) — ( a ) a relevant offence is deemed to be a foreign serious offence for the purposes of that Act; ( b ) that offence is deemed not to be an offence of a political character for the purposes of that Act; ( c ) section 20(3) of that Act does not apply to any request for assistance mentioned in subsection (1); and ( d ) the reference to the appointed date in the definition of “foreign confiscation order” in section 2(1) of that Act is a reference to 1 April 2006. (3) The following offences are deemed to be Singapore offences for the purposes of the Mutual Assistance in Criminal Matters Act 2000: ( a ) an offence specified in the First Schedule committed to or in relation to an internationally protected person; ( b ) an offence specified in the Second Schedule committed to or in relation to relevant premises or a vehicle used by an internationally protected person; ( c ) an abetment of or a conspiracy or an attempt to commit an offence under paragraph ( a ) or ( b ); ( d ) an offence against an internationally protected person. (4) In this section, “relevant offence”, in relation to a Convention country, means an offence against the law of that country where the act or omission constituting the offence or the equivalent act or omission — ( a ) would constitute an offence against an internationally protected person; or ( b ) would be such an offence if the description concerned contained a reference to any intent or state of mind on the part of the person committing the offence, or to any circumstance of aggravation, necessary to constitute the offence."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Extradition",
      "content": "11. —(1) Offences against an internationally protected person are deemed to be extradition offences for the purposes of Parts 3, 4 and 5 of the Extradition Act 1968. [Act 17 of 2022 wef 01/07/2022] (2) For the purposes of the Extradition Act 1968, the expression “extradition offence”, in relation to a Convention country that is a declared Commonwealth territory, is deemed to include relevant offences. [Act 17 of 2022 wef 01/07/2022] (3) Subject to subsection (4), where no extradition treaty is in force between Singapore and a Convention country that is not a declared Commonwealth territory, a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act as if there were an extradition treaty between Singapore and that country. [Act 17 of 2022 wef 01/07/2022] (4) Where the Extradition Act 1968 is applied under subsection (3), that Act has effect in relation to that country as if the only extradition offences under that Act were the relevant offences of that country. [Act 17 of 2022 wef 01/07/2022] (5) Subsection (4) does not affect any other notification made under section 4 of the Extradition Act 1968. (6) Where — ( a ) an extradition treaty is in force between Singapore and a Convention country; and ( b ) the treaty does not provide for the extradition of persons accused of or convicted of a relevant offence of that country, a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act in relation to that country as if the treaty provided for the matter referred to in paragraph ( b ). (7) Where a notification mentioned in subsection (6) is made, any limitation, condition, exception or qualification specified in any other notification made under section 4 of the Extradition Act 1968 in relation to that country must, to the extent that it prevents the relevant offence from being considered an extradition offence in relation to that country, be disregarded in the application of that Act in relation to that country. [Act 17 of 2022 wef 01/07/2022] (8) For the purposes of the Extradition Act 1968 — ( a ) any act, wherever committed, which is — (i) a relevant offence of a Convention country that is a declared Commonwealth territory; or [Act 17 of 2022 wef 01/07/2022] (ii) a relevant offence of a Convention country that is not a declared Commonwealth territory in the case of which the Extradition Act 1968 has been applied by a notification in the Gazette made under section 4 of that Act, [Act 17 of 2022 wef 01/07/2022] is deemed to be an offence within the jurisdiction of that country; and ( b ) any such offence is deemed not to be an offence of a political character. (9) In this section — [ Deleted by Act 17 of 2022 wef 01/07/2022 ] “declared Commonwealth territory” has the meaning given by the Extradition Act 1968; [Act 17 of 2022 wef 01/07/2022] “relevant offence”, in relation to a Convention country, means an offence against the law of that country where the act or omission constituting the offence or the equivalent act or omission — ( a ) would constitute an offence against an internationally protected person; or ( b ) would be such an offence if the description concerned contained a reference to any intent or state of mind on the part of the person committing the offence, or to any circumstance of aggravation, necessary to constitute the offence."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "No prosecution without Public Prosecutor’s consent",
      "content": "12. A prosecution under this Act must not be instituted except by or with the consent of the Public Prosecutor."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Amendment of Schedules",
      "content": "13. The Minister may, by order in the Gazette , amend the First or Second Schedule for the purposes of giving effect to the Convention, including any amendment to the Convention that is binding on Singapore."
    }
  ],
  "definitions": [
    {
      "term": "Convention",
      "definition": "“Convention” means the Convention on the Prevention and Punishment of Crimes against Internationally Protected Persons, including Diplomatic Agents, adopted by the General Assembly of the United Nations on 14 December 1973;",
      "source_provision": "s2"
    },
    {
      "term": "Convention country",
      "definition": "“Convention country” means a foreign country that is a Party to the Convention;",
      "source_provision": "s2"
    },
    {
      "term": "country",
      "definition": "“country” includes a State or territory, as the case may be;",
      "source_provision": "s2"
    },
    {
      "term": "internationally protected person",
      "definition": "“internationally protected person” has the meaning given by section 3;",
      "source_provision": "s2"
    },
    {
      "term": "offence against an internationally protected person",
      "definition": "“offence against an internationally protected person” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "relevant premises",
      "definition": "“relevant premises” means premises at which an internationally protected person resides or is staying or which he or she uses for the purpose of carrying out his or her functions as such person;",
      "source_provision": "s2"
    },
    {
      "term": "vehicle",
      "definition": "“vehicle” includes any means of conveyance.",
      "source_provision": "s2"
    },
    {
      "term": "declared Commonwealth territory",
      "definition": "“declared Commonwealth territory” has the meaning given by the Extradition Act 1968; [Act 17 of 2022 wef 01/07/2022]",
      "source_provision": "s11"
    },
    {
      "term": "relevant offence",
      "definition": "“relevant offence” , in relation to a Convention country, means an offence against the law of that country where the act or omission constituting the offence or the equivalent act or omission — ( a )",
      "source_provision": "s11"
    }
  ]
}