{
  "id": "itea-1992",
  "type": "statute",
  "title": "Institute of Technical Education Act 1992",
  "title_en": "Institute of Technical Education Act 1992",
  "short_name": "ITEA1992",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/ITEA1992",
  "description": "An Act to establish the Institute of Technical Education, Singapore, and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Institute of Technical Education Act 1992."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Board” means the Board of Governors established under section 7(1); “Chairperson” means the Chairperson of the Board appointed under section 7(3); “Chief Executive Officer” means the Chief Executive Officer of the Institute, and includes any individual acting in that capacity; “commerce or industry” includes any trade, manufacturing or service industry, business or other related activity; “Deputy Chairperson” means the Deputy Chairperson of the Board appointed under section 7(4); “Institute” means the Institute of Technical Education, Singapore established under section 3; “member” means a member of the Board; “technical skills” means the skills acquired through technical education and training or other means for employment in commerce or industry; “Vocational and Industrial Training Board” means the Vocational and Industrial Training Board established under the repealed Vocational and Industrial Training Board Act (Cap. 345, 1985 Revised Edition). [5/2018]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT OF INSTITUTE",
      "section": "3",
      "title": "Establishment of Institute",
      "content": "3. An Institute called the Institute of Technical Education, Singapore is established, which is a body corporate with perpetual succession and a common seal and is by that name capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding or disposing of property, both movable and immovable; and ( c ) doing all such other acts as bodies corporate may lawfully do."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT OF INSTITUTE",
      "section": "4",
      "title": "Common seal",
      "content": "4. —(1) The Institute must have a common seal and the seal may be broken, changed, altered and made anew as the Institute thinks fit. (2) All deeds, documents and other instruments requiring the seal of the Institute must be sealed with the common seal of the Institute and every instrument to which the common seal is affixed must be signed by a member and must be countersigned by the Chief Executive Officer or by some other person duly authorised by the Board for that purpose, and the signing is sufficient evidence that the seal was duly and properly affixed and that the seal is the lawful seal of the Institute. (3) Section 11 of the Registration of Deeds Act 1988 does not apply to any instrument purporting to have been executed under subsection (2)."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT OF INSTITUTE",
      "section": "5",
      "title": "Functions",
      "content": "5. The functions of the Institute include — ( a ) the provision and conduct of technical education and training, and further education programmes, for persons employed in or intending to be employed in commerce or industry; ( b ) the provision of consultancy services, and the accrediting of programmes and qualifications, for training and education in technical skills; and ( c ) cooperating and collaborating with the SkillsFuture Singapore Agency established by section 3 of the SkillsFuture Singapore Agency Act 2016, and the Workforce Singapore Agency established by section 3 of the Workforce Singapore Agency Act 2003, in the discharge of their respective functions under those Acts. [20/2016; 24/2016]"
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - ESTABLISHMENT OF INSTITUTE",
      "section": "6",
      "title": "Powers",
      "content": "6. —(1) The Institute may, for the purpose of discharging its functions — ( a ) provide for and regulate the holding of examinations, grant of awards, certificates and other qualifications for attainment of technical skills, competency and achievements; ( b ) establish facilities for the provision of training and education in technical skills; ( c ) collaborate with and assist any person in the provision and promotion of training and education in technical skills; ( d ) render professional advice and expertise and other consultancy services to any person involved in the provision and promotion of training and education in technical skills; ( e ) carry on any trade or business whether with other persons or by itself for the purpose of providing training to persons employed or intending to be employed in commerce or industry; ( f ) form or participate in the formation of companies having such objects as the Minister may approve; ( g ) acquire, hire, procure, construct, erect, develop, manufacture, operate, maintain and repair any property whether movable or immovable required by the Institute for the purposes of the Act; ( h ) with the approval of the Minister, dispose of, surrender or sell any immovable property; ( i ) levy and collect — (i) such fees, rates or charges for training and other services, use of facilities and conduct of activities; and (ii) such charges for the late payment thereof, as the Institute may consider expedient; [Act 4 of 2008 wef 01/04/2024] ( j ) solicit and receive donations and contributions from any source or raise funds by all lawful means; ( k ) give donations and contributions to any person or organisation; ( l ) regulate and provide for the welfare and discipline of employees and students of the Institute; ( m ) inspect, approve and register training institutions conducting or intending to conduct training courses in technical skills; ( n ) undertake surveys or carry out research about teaching and learning practices; ( o ) promote or undertake publicity in any form; and ( p ) do all other things incidental to, or necessary for, the attainment of its functions. [24/2016; S 461/2020] (2) In subsection (1)( f ), “company” — ( a ) has the meaning given by section 4(1) of the Companies Act 1967; and ( b ) includes a foreign company within the meaning of that Act. [S 461/2020]"
    },
    {
      "provision_ref": "s6A",
      "chapter": "PART 2 - ESTABLISHMENT OF INSTITUTE",
      "section": "6A",
      "title": "Validation of collection of charge for late payment of fee, rate or charge",
      "content": "6A. Every amount collected before the date of commencement of the Statutes (Miscellaneous Amendments) Act 2008 as, or purportedly as, a charge for the late payment of any fee, rate or charge referred to in section 6( i ) 1 shall be deemed to be and always to have been validly collected, and no legal proceedings shall lie or be instituted or maintained in any court of law on account of or in respect of any such collection. 1 Section 6( i ) is to be read as section 6(1)( i ) of the Institute of Technical Education Act 1992 as amended by S 461/2020. [Act 4 of 2008 wef 01/04/2024]"
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "7",
      "title": "Constitution of Board of Governors",
      "content": "7. —(1) There is to be a Board of Governors of the Institute which is the executive body of the Institute and may exercise all the powers conferred on the Institute under this Act. (2) The Board consists of the following members: ( a ) a Chairperson; ( b ) the Chief Executive Officer; ( c ) such number of other members, not being less than 9 or more than 18 as the Minister may determine, representing the Government, employers and trade unions. (3) The Chairperson and other members are to be appointed by the Minister and, unless the Minister otherwise directs, hold office for a period of 3 years from the date of their respective appointments and are eligible for re‑appointment. (4) The Minister may appoint any member to be the Deputy Chairperson of the Board. (5) The Deputy Chairperson so appointed may, subject to any direction that the Chairperson may give, exercise all or any of the powers exercisable by the Chairperson under this Act. (6) The Minister may appoint a person to be a temporary member during the absence from Singapore, or incapacity owing to illness or otherwise, of a member. (7) The Minister may at any time revoke the appointment of a member without giving any reason. (8) A member may resign from his or her appointment at any time by giving written notice to the Minister."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "8",
      "title": "Salaries, fees and allowances payable to members",
      "content": "8. There are to be paid to the members out of the funds of the Institute such salaries, fees and allowances as the Minister may determine."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "9",
      "title": "Vacation of office",
      "content": "9. The office of a member is vacated if the member — ( a ) becomes mentally disordered and incapable of managing himself or herself or his or her affairs; ( b ) is adjudicated a bankrupt; ( c ) is convicted of an offence involving dishonesty or fraud; ( d ) fails to attend, without leave of the Board, 3 consecutive meetings of the Board; or ( e ) resigns from his or her office. [21/2008]"
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "10",
      "title": "Filling of vacancies",
      "content": "10. —(1) If a vacancy occurs in the membership of the Board, the Minister may appoint any person to fill the vacancy and the person so appointed holds office for the unexpired period of the term of office of the member in whose place he or she is appointed. (2) Where the member in whose place a person is appointed under subsection (1) was a representative of a person or class of persons, the member so appointed must be a representative of the same person or class of persons."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "11",
      "title": "Meetings of Board",
      "content": "11. —(1) The Chairperson must summon meetings as often as may be required. (2) At every meeting of the Board, one‑third of the number of members constitutes a quorum. (3) Decisions at meetings of the Board are to be adopted by a simple majority of the votes of the members present and voting, except that in the case of an equality of votes the Chairperson, or in his or her absence the Deputy Chairperson, has a casting vote. (4) The Chairperson, or in his or her absence the Deputy Chairperson, presides at meetings of the Board. (5) The Board is not precluded from holding a meeting or acting in any matter merely by reason of any vacancy in its membership. (6) Subject to the provisions of this Act and the Public Sector (Governance) Act 2018, the Board may make standing orders to regulate its own procedure and, in particular, the holding of meetings, the notice to be given of the meetings, the proceedings at the meetings, the keeping of minutes and the custody, production and inspection of the minutes. [5/2018] 12. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "13",
      "title": "Validity of acts of members",
      "content": "13. The acts of a member are valid despite any defect that may afterwards be discovered in the member’s appointment or qualifications."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "14",
      "title": "Directions by Minister",
      "content": "14. —(1) The Minister may, after consulting the Board, give to the Institute any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (2) The Board must give the Minister such information or facilities for obtaining information with regard to the exercise of its powers and functions in such manner and at such times as the Minister may reasonably require."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - CONSTITUTION AND PROCEEDINGS OF BOARD OF GOVERNORS",
      "section": "15",
      "title": "Appointment of committees and delegation of powers",
      "content": "15. —(1) The Board may appoint any number of committees consisting of members or other persons or members and other persons for purposes that, in the opinion of the Board, would be better regulated and managed by means of those committees. (2) The Board may, subject to any conditions or restrictions that it thinks fit, delegate to any committee or the Chairperson or the Chief Executive Officer all or any of the powers, functions and duties by this Act vested in the Institute, and a power, function or duty so delegated may be exercised or performed by the committee or the Chairperson or the Chief Executive Officer (as the case may be) in the name and on behalf of the Institute. (3) The Board may, subject to any conditions or restrictions that it thinks fit, delegate to any employee of the Institute all or any of the powers, functions and duties by this Act vested in the Institute, and a power, function or duty so delegated may be exercised or performed by the employee in the name and on behalf of the Institute."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "16",
      "title": "Transfer to Institute of assets and liabilities",
      "content": "16. —(1) As from 1 April 1992, all lands, buildings and other properties, movable or immovable, rights, interests, privileges, obligations and liabilities vested in, belonging to or incurred by the Vocational and Industrial Training Board are transferred to and vest in the Institute without further assurance. (2) If any question arises as to which property, movable or immovable, has been transferred to and vested in the Institute under subsection (1), a certificate under the hand of the Minister is conclusive evidence of the vesting of that property in the Institute."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "17",
      "title": "Existing contracts",
      "content": "17. All deeds, bonds, agreements, instruments and working arrangements subsisting immediately before 1 April 1992 affecting the lands, buildings and other properties, movable or immovable, transferred under section 16 or any employee of the Vocational and Industrial Training Board transferred to the service of the Institute under section 19 are of full force and effect against or in favour of the Institute and enforceable as fully and effectually as if, instead of the Vocational and Industrial Training Board, the Institute had been named therein or had been a party thereto."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "18",
      "title": "Pending proceedings",
      "content": "18. Any proceedings or cause of action pending or existing immediately before 1 April 1992 by or against the Vocational and Industrial Training Board in respect of the lands, buildings and other properties, movable or immovable, transferred under section 16 and the rights, interests, obligations and liabilities in connection with or appertaining thereto may be continued and enforced by or against the Institute as it might have been by or against the Vocational and Industrial Training Board as if this Act had not been enacted."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "19",
      "title": "Transfer of employees",
      "content": "19. —(1) As from 1 April 1992, the persons employed by the Vocational and Industrial Training Board immediately before that date are transferred to the service of the Institute on terms no less favourable than those enjoyed by them immediately prior to their transfer. (2) Until the time that schemes and terms and conditions of service are drawn up by the Institute, the schemes and terms and conditions of service in the Vocational and Industrial Training Board continue to apply to every person transferred to the service of the Institute under subsection (1) as if the person were still in the service of that Board. (3) Where any person who is transferred to the service of the Institute under subsection (1) is a contributor under the Widows’ and Orphans’ Pension Act 1904, the person must for the purposes of that Act continue to make contributions under that Act as if the person had not been transferred to the service of the Institute; and for the purposes of that Act the person’s service with the Institute is deemed to be service with the Government and the Institute has the right to make deductions from the salary of that person to be paid as contributions under that Act. (4) Where any person who is transferred to the service of the Institute under subsection (1) was an employee of the Government transferred to the service of the Vocational and Industrial Training Board with the person’s pension benefits in respect of that employment preserved, the Government is liable to pay to the Institute the portion of any pension benefits payable on the person’s retirement that the same bears to the proportion which the aggregate amount of the person’s pensionable emoluments during the person’s service with the Government bears to the aggregate amount of the person’s pensionable emoluments during the person’s service under the Government, the former Industrial Training Board, the Vocational and Industrial Training Board and the Institute. 20. [ Omitted as spent ] 21. [ Omitted as spent ]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - PROVISIONS RELATING TO STAFF",
      "section": "22",
      "title": "Chief Executive Officer",
      "content": "22. —(1) There must be a Chief Executive Officer of the Institute, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Board may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive Officer during any period, or during all periods, when the Chief Executive Officer — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - PROVISIONS RELATING TO STAFF",
      "section": "23",
      "title": "Employment of staff",
      "content": "23. The Institute may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on the terms and conditions determined by the Institute, such other officers, employees, consultants and agents as may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - PROVISIONS RELATING TO STAFF",
      "section": "24",
      "title": "Protection from personal liability",
      "content": "24. No suit or other legal proceedings shall lie against any member or any employee of the Institute or other person acting under the direction of the Institute for anything which is in good faith done or intended to be done in the execution or purported execution of this Act. 25. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "26",
      "title": "Financial year",
      "content": "26. The financial year of the Institute begins on 1 April of each year and ends on 31 March of the succeeding year."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "27",
      "title": "Grants",
      "content": "27. For the purpose of enabling the Institute to carry out its functions under this Act, the Minister may make grants‑in‑aid to the Institute out of moneys to be provided by Parliament."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "28",
      "title": "Loans",
      "content": "28. The Institute may, for the purposes of this Act, raise loans from the Government or, with the consent of the Minister, from any source."
    },
    {
      "provision_ref": "s28A",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "28A",
      "title": "Issue of shares, etc.",
      "content": "28A. As a consequence of the vesting of any property, rights or liabilities of the Government in the Institute under this Act, or of any capital injection or other investment by the Government in the Institute in accordance with any written law, the Institute must issue such shares or other securities to the Minister for Finance as that Minister may direct. [5/2002]"
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "29",
      "title": "Power of investment",
      "content": "29. The Institute may invest its moneys in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [45/2004] 30. [ Repealed by Act 5 of 2018 ] 31. [ Repealed by Act 5 of 2018 ] 32. [ Repealed by Act 5 of 2018 ] 33. [ Repealed by Act 5 of 2018 ] 34. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "35",
      "title": "Symbol of Institute",
      "content": "35. —(1) The Institute has the exclusive right to the use of such symbol, design or representation as it may select or devise in connection with its activities or affairs. (2) Any person or body corporate who uses a symbol, design or representation identical with that of the Institute or which so resembles the symbol, design or representation of the Institute as to deceive or cause confusion or to be likely to deceive or cause confusion shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "36",
      "title": "Titles of certificates issued by Institute",
      "content": "36. —(1) The Institute has the exclusive right in the form and presentation of its titles of certificates or other qualifications issued by the Institute to any person who attains the standard set by the Institute. (2) Any person who issues or uses, or causes or permits the use of, titles of certificates or other qualifications identical with those of the Institute shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000."
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "37",
      "title": "Compulsory insurance",
      "content": "37. The Institute may require any person who attends any course or avails himself or herself of any facility provided or approved by the Institute under this Act to be insured against personal injuries and loss of life."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "38",
      "title": "Accidents happening to employees during training provided or approved by Institute",
      "content": "38. —(1) In relation to accidents happening to employees (within the meaning given by the Work Injury Compensation Act 2019 or the Work Injury Compensation Act (Cap. 354, 2009 Revised Edition) repealed by that Act) who attend courses or avail themselves of the facilities provided or approved by the Institute, that Act has effect subject to subsection (2). [5/2008; 27/2019] (2) For the purposes of the Work Injury Compensation Act 2019 or the Work Injury Compensation Act (Cap. 354, 2009 Revised Edition) repealed by that Act, any act done by an employee for the purposes of and in connection with his or her training referred to in subsection (1) is, if it is not done for the purposes of and in connection with his or her employer’s trade or business, deemed to be so done. [5/2008; 27/2019]"
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "39",
      "title": "Power to obtain information from employers",
      "content": "39. —(1) The Chief Executive Officer may require employers in commerce or industry to furnish such returns and other information and to keep such records and produce them for examination as appear to the Chief Executive Officer to be necessary for the purposes of this Act. (2) Subject to subsection (3), returns and other information furnished pursuant to subsection (1) and any information obtained on an examination made pursuant to subsection (1) must not, without the consent of the employer to whose business the returns or information relate, be disclosed otherwise than to — ( a ) the Institute or a committee appointed by the Institute; ( b ) an officer of the Institute or of the committee; or ( c ) any person entitled to take part in the proceedings of the Institute. (3) Subsection (2) does not apply to — ( a ) the disclosure of returns or information in the form of a summary of similar returns or information furnished by or obtained from a number of employers, if the summary is so framed as not to enable particulars relating to any individual business to be ascertained from it; or ( b ) any disclosure of information made for the purposes of any legal proceedings pursuant to this Act or any criminal proceedings, whether pursuant to this Act or not, or for the purposes of any report of those proceedings. (4) A certificate purporting to be issued by or on behalf of the Chief Executive Officer and stating that he or she has approved any kind of information, return or record for the purposes of subsection (2) is, in any legal proceedings, evidence of the facts stated in the certificate. (5) Any person who fails to comply with any requirement made under subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 and, in the case of a second or subsequent conviction, to a fine not exceeding $2,000. (6) Any person who — ( a ) knowingly or recklessly furnishes, pursuant to any requirement made under subsection (1), any return or other information which is false in a material particular; ( b ) wilfully makes a false entry in any record required to be produced under subsection (1) or, with intent to deceive, makes use of any such entry which the person knows to be false; or ( c ) discloses any information in contravention of subsection (2), shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000."
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "40",
      "title": "Obstructing officers of Institute",
      "content": "40. Any person who obstructs or hinders any officer, employee or agent of the Institute acting in the discharge of his or her duty under this Act or any regulations made under this Act shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "41",
      "title": "Proceedings conducted by employees of Institute",
      "content": "41. Proceedings in respect of any offence under this Act or any regulations made under this Act may, with the authorisation of the Public Prosecutor, be conducted by an employee of the Institute. [15/2010]"
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "42",
      "title": "Consent of Public Prosecutor",
      "content": "42. No prosecution in respect of any offence under this Act or any regulations made under this Act may be instituted except by or with the consent of the Public Prosecutor. [15/2010]"
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "43",
      "title": "Offence by body corporate",
      "content": "43. Where an offence under this Act or any regulations made under this Act is committed by a body corporate and it is proved to have been committed with the consent or connivance of, or to be attributable to any act or default on the part of, any director, manager, secretary or other similar officer of the body corporate, or any person who was purporting to act in any such capacity, he or she, as well as the body corporate, shall be guilty of that offence and shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "44",
      "title": "Regulations",
      "content": "44. —(1) The Institute may, with the approval of the Minister, make any regulations necessary for carrying into effect the provisions of this Act. (2) Without limiting subsection (1), the Institute may make regulations for all or any of the following matters: ( a ) the collection of fees, rates or charges and the award of scholarships and other financial assistance to persons attending training and education in technical skills; ( b ) the registration of apprentices and the conduct and supervision and regulation of apprenticeship programmes and schemes; ( c ) the appointment, promotion, conduct, disciplinary control, dismissal and termination of service of employees of the Institute. [24/2016]"
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "45",
      "title": "Transitional provisions",
      "content": "45. —(1) Any document or thing done under any provision of the repealed Vocational and Industrial Training Board Act (Cap. 345, 1985 Revised Edition), and every such document or thing so far as it is subsisting or in force on 1 April 1992 continues and has effect as if it had been made or done under the corresponding provisions of this Act. (2) As from 1 April 1992, all references in any written law to the Vocational and Industrial Training Board are references to the Institute of Technical Education, Singapore."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Board of Governors established under section 7(1);",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Board appointed under section 7(3);",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive Officer",
      "definition": "“Chief Executive Officer” means the Chief Executive Officer of the Institute, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "commerce or industry",
      "definition": "“commerce or industry” includes any trade, manufacturing or service industry, business or other related activity;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means the Deputy Chairperson of the Board appointed under section 7(4);",
      "source_provision": "s2"
    },
    {
      "term": "Institute",
      "definition": "“Institute” means the Institute of Technical Education, Singapore established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means a member of the Board;",
      "source_provision": "s2"
    },
    {
      "term": "technical skills",
      "definition": "“technical skills” means the skills acquired through technical education and training or other means for employment in commerce or industry;",
      "source_provision": "s2"
    },
    {
      "term": "Vocational and Industrial Training Board",
      "definition": "“Vocational and Industrial Training Board” means the Vocational and Industrial Training Board established under the repealed Vocational and Industrial Training Board Act (Cap. 345, 1985 Revised Edition). [5/2018]",
      "source_provision": "s2"
    }
  ]
}