{
  "id": "jso-1878",
  "type": "statute",
  "title": "Jewish Synagogue Ordinance 1878",
  "title_en": "Jewish Synagogue Ordinance 1878",
  "short_name": "JSO1878",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/JSO1878",
  "description": "An Ordinance to empower the Trustees of the Jewish Synagogue in Singapore to sell certain property, and for other purposes.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Ordinance may be cited as the Jewish Synagogue Ordinance 1878."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Certain trustees may sell and convey land",
      "content": "2. The said Joshua Raphael Joshua, Ezra Abraham Solomon, Salleh Menasseh, Menasseh Meyer, Reuben Meyer, Sassoon Aaron Gubbay, and David Aaron Gubbay as trustees of the Jewish Synagogue of Singapore, or the survivors of them, or any 2 or more of such surviving trustees, who are for the time being resident within the Colony may sell and dispose of the said piece or parcel of land comprised in and demised by the hereinbefore recited indenture of lease made between the late Government of these Settlements of the one part, and Joseph Dewk Cohen, Nassim Joseph Ezra and Ezra Ezra Ezekiel of the other part, dated 1 September 1841, and also all erections and buildings which have been erected, and are now standing on the said premises, with power also to execute assurances, give effectual receipts for the purchase money, and do all other acts and things for completing such sale as they, or the survivors of them, or any 2 or more of such survivors, think proper."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Proceeds of sale to be applied to purchase other land and to building a synagogue",
      "content": "3. —(1) The moneys to arise from such sale, after deducting the cost and expenses attending the sale or otherwise incurred in relation thereto, shall be paid to the trustees, or continuing acting trustees for the time being, of the said synagogue as hereinbefore mentioned for the purpose of acquiring land, and erecting and building on such land as is acquired for that purpose, or any part thereof, a new synagogue or place of worship for the use of the members of the Jewish community in Singapore. (2) Such moneys shall be applied by such trustees to the purchase of such land and the building of such synagogue, and to no other purpose. To be held in trust (3) The said land and the building when erected shall be held subject to the trust set out in this Ordinance."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Purchaser discharged by trustees’ receipts",
      "content": "4. The receipts for the purchase money given by the persons exercising the power of sale hereby conferred shall be sufficient discharges to the purchasers who shall not be bound to see to the application of such purchase money."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Land purchased to be held in trust for Jewish community",
      "content": "5. —(1) The land so to be purchased by the said trustees for the purpose of having erected thereon a synagogue for the use of the Jewish community of Singapore shall be held by the said trustees and their successors in office as trustees for the use of the Jewish community of Singapore for the purpose of erecting and maintaining thereon a suitable synagogue or place of Divine worship according to the Jewish form. When to be forfeited (2) So soon as the said piece of land ceases to be used for such purpose it shall ipso facto revert to the Government. [7/97]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Conveyance to state trust",
      "content": "6. The conveyance to the trustees of any lands to be paid for by them out of the proceeds of the land in this Ordinance authorised to be sold shall express that the said lands are conveyed to, and are to be held by them subject to the trust and condition set out in this Ordinance."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Style of trustees",
      "content": "7. —(1) The said trustees may be styled the “Trustees of the Jewish Synagogue at Singapore”, and they or the remaining trustees, being not less than 3, may at any time appoint new trustees to take the place of such trustees as have died, or left the Colony, or declined further to act. New trustees (2) In the event of the number of trustees at any time falling below 3, the General Division of the High Court, on an originating application made by the remaining trustees or by any of the members of the Jewish community, may appoint suitable persons being members of the Jewish community residing in Singapore to be trustees under this Ordinance. [42/2005; 40/2019] [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Property to vest without assignment",
      "content": "8. The property of the said trust, including the land, building, fixtures, furniture and other movable property belonging to the synagogue for the purpose of Divine worship shall be held to vest in the Trustees of the Jewish Synagogue at Singapore for the time being without transfer or assignment from trustees to trustees."
    }
  ],
  "definitions": []
}