{
  "id": "la-1934",
  "type": "statute",
  "title": "Legitimacy Act 1934",
  "title_en": "Legitimacy Act 1934",
  "short_name": "LA1934",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/LA1934",
  "description": "An Act to provide for the legitimation of children born out of wedlock.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Legitimacy Act 1934."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless there is something repugnant in the subject or context — “court” means the General Division of the High Court or a Family Court; “date of legitimation” means the date of the marriage leading to the legitimation, or, where the marriage occurred before 18 May 1934, that day; “disposition” means an assurance of any interest in property by any instrument whether inter vivos or by will; “intestate” includes a person who leaves a will but dies intestate as to some beneficial interest in his estate; “legitimated person” means a person legitimated by this Act; “will” includes “codicil”. [27/2014; 40/2019]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Legitimation by subsequent marriage of parents",
      "content": "3. —(1) Subject to this section, where the parents of an illegitimate person marry or have married one another, whether before, on or after 18 May 1934 the marriage shall, if the father or mother of the illegitimate person was or is at the date of the marriage domiciled in Singapore, render that person, if living, legitimate from 18 May 1934 or from the date of the marriage, whichever last happens. [16/2013] (2) Nothing in this Act shall operate to legitimate a person unless the marriage leading to the legitimation was solemnised and registered in accordance with the provisions of the repealed Christian Marriage Ordinance (Cap. 37, 1955 Revised Edition) or of the Civil Marriage Ordinance (Cap. 38, 1955 Revised Edition) or unless that marriage was registered or deemed to be registered under the Women’s Charter 1961. (3) The legitimation of a person under this Act does not enable him or his spouse, children or remoter issue to take any interest in property save as hereinafter expressly provided in this Act. (4) [ Deleted by Act 17 of 2021 wef 29/05/2022 ]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Declarations of legitimacy of legitimated persons",
      "content": "4. —(1) A person claiming that he or his parent or any remoter ancestor became or has become a legitimated person may, whether domiciled in Singapore or elsewhere, and whether a citizen of Singapore or not, apply to the court by an originating application for a decree declaring that the applicant is the legitimate child of his parents, or that his parent or remoter ancestor was legitimate, and the court shall have jurisdiction to hear and determine that application and to make such decree declaratory of the legitimacy or illegitimacy of such person as to the court may seem just; and that decree shall be binding to all intents and purposes on the Government and on all persons whomsoever. [42/2005; 27/2014] [Act 19 of 2025 wef 05/12/2025] (2) Every application under this section shall be supported by an affidavit verifying the facts alleged in the same, and by such proof of the absence of fraud and collusion, as the court may by any general rule direct. [42/2005] (3) In all proceedings under this section the court shall have full power to award and enforce payment of costs to any person cited, whether that person does or does not oppose the declaration applied for, in case the court considers it reasonable that the costs should be paid. (4) A copy of every application under this section and of the affidavit in support thereof shall be served on the Attorney-General, who may apply to intervene in the application if he thinks necessary. [42/2005] (5) Where any application is made under this section to the court, the person or persons, if any, besides the Attorney-General as the court thinks fit shall, subject to the rules made under this section, be cited to the proceedings or otherwise summoned in such manner as the court directs, and may be permitted to become parties to the proceedings, and oppose the application. (6) The decree of the court shall not in any case prejudice any person — ( a ) if it is subsequently proved to have been obtained by fraud or collusion; or ( b ) unless that person has been cited or made a party to the proceedings or is the heir at law, next of kin, or other real or personal representative of, or derives title under or through, a person so cited or made a party. (7) No proceedings to be had under this section shall affect any final judgement or decree already pronounced or made by any court of competent jurisdiction. (8) The Family Justice Rules Committee constituted under section 46(1) of the Family Justice Act 2014 may make Family Justice Rules for carrying the provisions of this section into effect. [27/2014] (9) The Family Justice Rules may, instead of providing for any matter, refer to any provision made or to be made about that matter by practice directions issued for the time being by the registrar of the Family Justice Courts. [27/2014]"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Rights of legitimated persons to take interests in property",
      "content": "5. —(1) Subject to the provisions of this Act a legitimated person and his spouse, children or remoter issue shall be entitled to take any interest — ( a ) in the estate of an intestate dying after the date of legitimation; ( b ) under any disposition coming into operation after the date of legitimation, in the like manner as if the legitimated person had been born legitimate. (2) Where the right to any property depends on the relative seniority of the children of any person, and those children include one or more legitimated persons, the legitimated person or persons shall rank as if he or they had been born on the day when he or they became legitimated by virtue of this Act, and if more than one such legitimated person became legitimated at the same time they shall rank as between themselves in order of seniority. (3) This section applies only if and so far as a contrary intention is not expressed in the disposition, and shall have effect subject to the terms of the disposition and to the provisions therein contained."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Succession on intestacy of legitimated persons and their issue",
      "content": "6. Where a legitimated person or a child or remoter issue of a legitimated person dies intestate in respect of any of his property, the same persons shall be entitled to take the same interests therein as they would have been entitled to take if the legitimated person had been legitimate."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Application to illegitimate person dying before marriage of parents",
      "content": "7. Where an illegitimate person dies on or after 18 May 1934 and before the marriage of his parents leaving any spouse, children or remoter issue living at the date of the marriage, then if that person would, if living at the time of the marriage of his parents, have become a legitimated person, the provisions of this Act with respect to the taking of interests in property by, or in succession to, the spouse, children and remoter issue of a legitimated person shall apply as if that person had been a legitimated person and the date of the marriage of his parents had been the date of legitimation."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Personal rights and obligations of legitimated persons",
      "content": "8. A legitimated person shall have the same rights and be under the same obligations in respect of the maintenance and support of himself or of any other person as if he had been born legitimate, and, subject to the provisions of this Act, the provisions of any Act relating to claims for damages, compensation, allowance, benefit, or otherwise by or in respect of a legitimate child shall apply in the like manner in the case of a legitimated person."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Provisions as to legitimation by extraneous law",
      "content": "9. —(1) Where the parents of an illegitimate person marry or have married one another, whether before, on or after 18 May 1934 and the father of the illegitimate person was or is, at the time of the marriage, domiciled in a country other than Singapore, by the law of which the illegitimate person became legitimated by virtue of the subsequent marriage, that person, if living, shall within Singapore be recognised as having been so legitimated from 17 May 1934 or from the date of the marriage, whichever last happens, notwithstanding that his father was not at the time of the birth of that person domiciled in a country in which legitimation by subsequent marriage was permitted by law. (2) All the provisions of this Act relating to legitimated persons and to the taking of interests in property by or in succession to a legitimated person and the spouse, children and remoter issue of a legitimated person shall apply in the case of a person recognised as having been legitimated under this section, or who would, had he survived the marriage of his parents, have been so recognised; and accordingly this Act shall have effect as if references therein to a legitimated person included a person so recognised as having been legitimated. (3) For the purposes of this section, “country” includes any part of the Commonwealth, as well as a foreign country."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Right of illegitimate child and mother of illegitimate child to succeed on intestacy of the other",
      "content": "10. —(1) Where, on or after 18 May 1934, the mother of an illegitimate child, the child not being a legitimated person, dies intestate as respects all or any of her property, and does not leave any legitimate issue her surviving, the illegitimate child, or if he is dead his issue, shall be entitled to take any interest therein to which he or his issue would have been entitled if he had been born legitimate. (2) Where, on or after 18 May 1934, an illegitimate child, not being a legitimated person, dies intestate as respects all or any of his property, his mother, if surviving, shall be entitled to take any interest therein to which she would have been entitled if the child had been born legitimate and she had been the only surviving parent."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Saving",
      "content": "11. Nothing in this Act shall affect the operation or construction of any disposition coming into operation before 18 May 1934 or affect any rights under the intestacy of a person dying before that date."
    }
  ],
  "definitions": [
    {
      "term": "court",
      "definition": "“court” means the General Division of the High Court or a Family Court;",
      "source_provision": "s2"
    },
    {
      "term": "date of legitimation",
      "definition": "“date of legitimation” means the date of the marriage leading to the legitimation, or, where the marriage occurred before 18 May 1934, that day;",
      "source_provision": "s2"
    },
    {
      "term": "disposition",
      "definition": "“disposition” means an assurance of any interest in property by any instrument whether inter vivos or by will;",
      "source_provision": "s2"
    },
    {
      "term": "intestate",
      "definition": "“intestate” includes a person who leaves a will but dies intestate as to some beneficial interest in his estate;",
      "source_provision": "s2"
    },
    {
      "term": "legitimated person",
      "definition": "“legitimated person” means a person legitimated by this Act;",
      "source_provision": "s2"
    },
    {
      "term": "will",
      "definition": "“will” includes “codicil”. [27/2014; 40/2019]",
      "source_provision": "s2"
    }
  ]
}