{
  "id": "llefa-2001",
  "type": "statute",
  "title": "Lifelong Learning Endowment Fund Act 2001",
  "title_en": "Lifelong Learning Endowment Fund Act 2001",
  "short_name": "LLEFA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/LLEFA2001",
  "description": "An Act to provide for the establishment of a Lifelong Learning Endowment Fund and for purposes connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Lifelong Learning Endowment Fund Act 2001."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Council” means the Advisory Council established under section 6; “Endowment Fund” means the Lifelong Learning Endowment Fund established under section 3."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - LIFELONG LEARNING ENDOWMENT FUND",
      "section": "3",
      "title": "Establishment of Lifelong Learning Endowment Fund",
      "content": "3. —(1) A fund called the Lifelong Learning Endowment Fund is established, into which must be paid — ( a ) all capital money appropriated from time to time from the Consolidated Fund and authorised to be paid into the Endowment Fund by this Act or any other written law; ( b ) all gifts or bequests given or made for the purposes of the Endowment Fund; and ( c ) the net income from investments of capital money in the Endowment Fund. (2) The Minister is responsible for the administration of the Endowment Fund and all moneys belonging to the Fund may be deposited in any bank and invested in any investment authorised under the Financial Procedure Act 1966. (3) The Endowment Fund must be regarded as a Government fund and as comprising public moneys for the purposes of any other written law."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - LIFELONG LEARNING ENDOWMENT FUND",
      "section": "4",
      "title": "Capital money of Endowment Fund",
      "content": "4. —(1) The Minister for Finance may, from time to time, pay into the Endowment Fund any sums of capital money that the Minister may determine out of moneys to be provided by Parliament. (2) Despite the terms of any gift or bequest, all gifts and bequests given or made for the purposes of the Endowment Fund must be paid into the Fund as capital money. (3) The capital money of the Endowment Fund must not be used for any purpose other than for investment. (4) Where at any time there is a permanent diminution of the capital money of the Endowment Fund, the Minister must, before paying out any income of the Fund, make good the diminution from the income of the Fund."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - LIFELONG LEARNING ENDOWMENT FUND",
      "section": "5",
      "title": "Objects and application of income of Endowment Fund",
      "content": "5. —(1) The objects for which the income of the Endowment Fund may be applied are — ( a ) the acquisition of skills and expertise by persons, and the development and upgrading of skills and expertise of persons, to enhance their employability; and ( b ) the promotion of the acquisition, development and upgrading of skills and expertise to enhance the employability of persons. (2) In carrying out the objects of the Endowment Fund, the Minister may, from time to time, authorise the income of the Fund to be paid out and expended for all or any of the following purposes: ( a ) the provision of financial assistance or incentives to persons to acquire, develop or upgrade, whether in Singapore or elsewhere, skills and expertise to enhance their employability; ( b ) the research or development, whether in Singapore or elsewhere, in or of learning methods and technology to enhance the acquisition, development or upgrading of such skills and expertise; ( c ) the promotion of the acquisition, development or upgrading of such skills and expertise; ( d ) the provision of financial assistance or incentives to persons to carry out, whether in Singapore or elsewhere, activities or programmes which are consistent with the objects of the Fund; ( e ) the establishment, expansion or maintenance of facilities, whether in Singapore or elsewhere, to be used for purposes consistent with the objects of the Fund; ( f ) any other purposes consistent with the objects of the Fund (whether carried out in Singapore or elsewhere) that are prescribed."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - LIFELONG LEARNING ENDOWMENT FUND",
      "section": "6",
      "title": "Advisory Council",
      "content": "6. —(1) For the purpose of advising the Minister on the application of the income of the Endowment Fund, an Advisory Council is established, comprising such members as the Minister may appoint. (2) The Minister must appoint one of the members as chairperson. (3) The Schedule has effect with respect to the Council."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - GENERAL FINANCIAL PROVISIONS",
      "section": "7",
      "title": "Expenses",
      "content": "7. All expenses incurred in connection with the administration of the Endowment Fund, including the cost of auditing the accounts of the Fund, must be defrayed out of the income of the Fund."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - GENERAL FINANCIAL PROVISIONS",
      "section": "8",
      "title": "Financial year of Endowment Fund",
      "content": "8. The financial year of the Endowment Fund begins on 1 April of each year and ends on 31 March of the succeeding year."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - GENERAL FINANCIAL PROVISIONS",
      "section": "9",
      "title": "Accounts",
      "content": "9. —(1) The Minister must cause to be kept proper accounts and records of all transactions and affairs relating to the Endowment Fund and must do all things necessary to ensure that all payments out of the Fund are correctly made and properly authorised and that adequate control is maintained over the assets and receipts of the Fund. (2) The Minister must, as soon as practicable after the close of each financial year, cause to be prepared and submitted financial statements in respect of that year to the auditor of the Endowment Fund."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - GENERAL FINANCIAL PROVISIONS",
      "section": "10",
      "title": "No payment unless authorised by Minister",
      "content": "10. A payment must not be made out of the Endowment Fund unless the payment is authorised by the Minister."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - GENERAL FINANCIAL PROVISIONS",
      "section": "11",
      "title": "Appointment, powers and duties of auditor",
      "content": "11. —(1) The accounts of the Endowment Fund must be audited by the Auditor‑General or any other auditor that may be appointed annually by the Minister after consulting the Auditor‑General. (2) A person is not qualified for appointment as an auditor under subsection (1) unless the person is a public accountant within the meaning of the Companies Act 1967. (3) The auditor or any person authorised by the auditor is entitled at all reasonable times to full and free access to all accounting and other records relating, directly or indirectly, to the financial transactions of the Endowment Fund and may make copies of, or extracts from, any such accounting and other records. (4) The auditor must state in the auditor’s report — ( a ) whether the financial statements show fairly the financial transactions and the state of affairs of the Endowment Fund; ( b ) whether proper accounting and other records have been kept, including records of all assets of the Endowment Fund; ( c ) whether receipts, expenditure, and investment of moneys and the acquisition and disposal of assets on account of the Endowment Fund during the financial year were in accordance with the provisions of this Act; and ( d ) such other matters arising from the audit as the auditor considers necessary. (5) The auditor must — ( a ) as soon as practicable after the accounts have been submitted for audit, send a report of the audit to the Minister; and ( b ) submit such periodical and special reports to the Minister as may appear to the auditor to be necessary or as the Minister may require. (6) Where the Auditor-General is not the auditor of the Endowment Fund, a copy of the audited financial statements and any report made by the auditor must be forwarded to the Auditor-General."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - GENERAL FINANCIAL PROVISIONS",
      "section": "12",
      "title": "Failure to furnish information to auditor",
      "content": "12. —(1) The auditor or any person authorised by the auditor (called in this section the authorised person) may require any person to furnish the auditor or authorised person with such information in the possession of that person required or to which that person required has access as the auditor considers necessary for the purposes of the auditor’s functions under this Act. (2) Any person who, without reasonable excuse, fails to comply with any requirement of the auditor under subsection (1) or who otherwise hinders, obstructs or delays the auditor in the performance of the auditor’s duties or the exercise of the auditor’s powers shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - GENERAL FINANCIAL PROVISIONS",
      "section": "13",
      "title": "Presentation of annual report, financial statements and auditor’s report to Parliament",
      "content": "13. The Minister must, as soon as practicable, cause an annual report in respect of the administration of the Endowment Fund during the preceding financial year to be prepared and must present a copy of the annual report and of the audited financial statements and the auditor’s report to Parliament."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 4 - MISCELLANEOUS PROVISIONS",
      "section": "14",
      "title": "Making of false statement, etc.",
      "content": "14. Any person who for any purpose connected with this Act — ( a ) knowingly makes any false statement to the Minister or a person authorised by the Minister or to the auditor or a person authorised by the auditor; or ( b ) produces or furnishes or causes or knowingly allows to be produced or furnished to the Minister or a person authorised by the Minister or to the auditor or a person authorised by the auditor, any document which the person knows to be false in a material particular, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - MISCELLANEOUS PROVISIONS",
      "section": "15",
      "title": "Offences by body corporate, etc.",
      "content": "15. —(1) Where an offence under this Act has been committed by a body corporate, a partnership, or an unincorporated association of persons, any person who, at the time of the commission of the offence, was a director, manager, partner, secretary or other similar officer thereof, or was purporting to act in any such capacity, shall also be guilty of that offence and shall be liable to be proceeded against and punished accordingly unless the person proves that — ( a ) the offence was committed without the person’s consent or connivance; and ( b ) the person had exercised all such diligence to prevent the commission of the offence as the person ought to have exercised having regard to the nature of the person’s functions in that capacity and to all the circumstances. (2) In relation to a body corporate whose affairs are managed by its members, “director” means a member of a body corporate."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - MISCELLANEOUS PROVISIONS",
      "section": "16",
      "title": "Composition of offences",
      "content": "16. —(1) The Minister or any person authorised by the Minister may compound any offence under this Act that is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum of money not exceeding $500. (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - MISCELLANEOUS PROVISIONS",
      "section": "17",
      "title": "Regulations",
      "content": "17. The Minister may make such regulations as are necessary or expedient for the purpose of carrying out the provisions of this Act, and, in particular, the regulations may — ( a ) prescribe the procedure for payments out of the Endowment Fund; ( b ) provide for matters relating to applications for funds, financial assistance or incentives; ( c ) prescribe the procedure of the Council; and ( d ) prescribe anything which may be prescribed under this Act."
    }
  ],
  "definitions": [
    {
      "term": "Council",
      "definition": "“Council” means the Advisory Council established under section 6;",
      "source_provision": "s2"
    },
    {
      "term": "Endowment Fund",
      "definition": "“Endowment Fund” means the Lifelong Learning Endowment Fund established under section 3.",
      "source_provision": "s2"
    }
  ]
}