{
  "id": "llpa-2005",
  "type": "statute",
  "title": "Limited Liability Partnerships Act 2005",
  "title_en": "Limited Liability Partnerships Act 2005",
  "short_name": "LLPA2005",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/LLPA2005",
  "description": "An Act to provide for limited liability partnerships.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Limited Liability Partnerships Act 2005."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — [ Deleted by Act 21 of 2024 wef 09/12/2024 ] “ACRA administered Act” means the Accounting and Corporate Regulatory Authority Act 2004 or any of the written laws specified in the Second Schedule to that Act; [Act 21 of 2024 wef 09/12/2024] “Authority” means the Accounting and Corporate Regulatory Authority established under the Accounting and Corporate Regulatory Authority Act 2004; “Authority’s website” means the Authority’s Internet website; “company” has the meaning given by section 4(1) of the Companies Act 1967; “contact address”, in relation to an individual, means an address that meets all of the following conditions: ( a ) it is a physical address at which the individual can be physically found or contacted by post; ( b ) it is not a post office box number; ( c ) it is located in the same jurisdiction as the individual’s residential address; [Act 21 of 2024 wef 09/12/2024] “corporation” means any body corporate formed or incorporated or existing in Singapore or outside Singapore and includes — ( a ) any limited liability partnership registered under this Act; and ( b ) any foreign company, but does not include — ( c ) any corporation sole; ( d ) any co-operative society; [Act 30 of 2024 wef 01/11/2024] ( e ) any registered trade union; or [Act 30 of 2024 wef 01/11/2024] ( f ) any registered platform work association; [Act 30 of 2024 wef 01/11/2024] “financial year”, in relation to a limited liability partnership, means the period in respect of which any profit and loss account of the limited liability partnership is made up, whether that period is a year or not; “firm” has the meaning given by section 2(1) of the Business Names Registration Act 2014; “foreign company” has the meaning given by section 4(1) of the Companies Act 1967; “full name” or “name” means — ( a ) in the case of an individual registered under the National Registration Act 1965 — the name as it appears in the latest identity card issued to that individual under section 9 of that Act; or ( b ) in the case of an individual not registered under the National Registration Act 1965 — the name as it appears in the latest passport issued to that individual or such other similar evidence of identification as is available; [Act 21 of 2024 wef 09/12/2024] “identification” means — ( a ) in the case of an individual issued with an identity card under the National Registration Act 1965, the number of the individual’s identity card; and ( b ) in the case of an individual not issued with an identity card under that Act, particulars of the individual’s passport or any other similar evidence of identity that is acceptable to the Registrar; “limited liability partnership” has the meaning given by section 4(1); “limited liability partnership agreement”, in relation to a limited liability partnership, means any agreement expressed or implied between the partners of the limited liability partnership or between the limited liability partnership and its partners which determines the mutual rights and duties of the partners and their rights and duties in relation to the limited liability partnership; “liquidator” includes the Official Receiver when acting as the liquidator of a corporation; “manager”, in relation to a limited liability partnership, means any person (whether or not a partner of the limited liability partnership) who is concerned in or takes part in the management of the limited liability partnership (whether or not the person’s particulars or consent to act are lodged with the Registrar as required under section 29(2)); “officer”, in relation to a limited liability partnership, means — ( a ) any manager of the limited liability partnership; ( b ) a receiver and manager of any part of the undertaking of the limited liability partnership appointed under a power contained in any instrument; or ( c ) any liquidator of the limited liability partnership appointed in a voluntary winding up, but does not include — ( d ) any receiver who is not also a manager; ( e ) any receiver and manager appointed by the General Division of the High Court; or ( f ) any liquidator appointed by the General Division of the High Court or by the creditors; “Official Receiver” has the meaning given by section 2(1) of the Insolvency, Restructuring and Dissolution Act 2018; “partner”, in relation to a limited liability partnership, means any person who has been admitted as a partner in the limited liability partnership in accordance with the limited liability partnership agreement; “private company” has the meaning given by section 4(1) of the Companies Act 1967; “register” means any register kept and maintained under this Act; “Registrar” means the Registrar of Limited Liability Partnerships appointed under section 3(2)( a ) and includes any Deputy Registrar or Assistant Registrar appointed under section 3(2)( b ); “residential address”, in relation to an individual, means the individual’s usual place of residence; “solicitor” means an advocate and solicitor of the Supreme Court. [2/2007; 18/2014; 29/2014; 35/2014; 16/2017; 40/2018; 40/2019] (2) Where a limited liability partnership has more than one manager — ( a ) anything that the manager is required by this Act to do may be done by any one of the managers; and ( b ) anything which constitutes an offence by the manager under this Act constitutes an offence by each of the managers. (3) A reference in this Act to the managers of a limited liability partnership is, in the case of a limited liability partnership which has only one manager, a reference to that manager. (4) A reference in this Act to the doing of any act by 2 or more managers of a limited liability partnership, in the case of a limited liability partnership which has only one manager, is to the doing of that act by that manager. (5) For the purposes of sections 20(6), 21(2), 23(5) and 24(9) and (10), any reference to the Minister includes a reference to the Minister of State for his or her Ministry who is authorised by the Minister for the purpose of hearing an appeal under that section. [35/2014]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Administration of Act and appointment of Registrar of Limited Liability Partnerships, etc.",
      "content": "3. —(1) The Authority is responsible for the administration of this Act, subject to the general or special directions of the Minister. (2) The Minister may, after consultation with the Authority and for the proper administration of this Act — ( a ) appoint an officer of the Authority to be the Registrar of Limited Liability Partnerships; and ( b ) from among the officers of the Authority, public officers and the officers of any other statutory board, appoint any number of Deputy Registrars and Assistant Registrars of Limited Liability Partnerships that the Minister considers necessary. (3) The Registrar is responsible generally for the carrying out of the provisions of this Act and for the collection of the fees under this Act and must pay all amounts so collected into the funds of the Authority. (4) The Authority may give to the Registrar directions, not inconsistent with the provisions of this Act, as to the exercise of his or her powers, functions or duties under this Act, and the Registrar must give effect to those directions. (5) The Registrar may, subject to any conditions or restrictions that he or she thinks fit, for the purposes of the administration of this Act, delegate to any person all or any of the powers, functions and duties vested in the Registrar by this Act except the power of delegation conferred by this subsection."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "4",
      "title": "Separate legal personality",
      "content": "4. —(1) A limited liability partnership is a body corporate which is formed by being registered under this Act and which has legal personality separate from that of its partners. (2) A limited liability partnership has perpetual succession. (3) Any change in the partners of a limited liability partnership does not affect the existence, rights or liabilities of the limited liability partnership."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "5",
      "title": "Capacity",
      "content": "5. A limited liability partnership is, by its name, capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing or disposing of property, both movable and immovable; and ( c ) doing and suffering any other acts and things that bodies corporate may lawfully do and suffer. [16/2017]"
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "6",
      "title": "Common seal",
      "content": "6. —(1) A limited liability partnership may have a common seal but need not have one. [16/2017] (2) Sections 7 and 8 apply whether a limited liability partnership has a common seal or not. [5A [16/2017]"
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "7",
      "title": "Execution of deeds by limited liability partnership",
      "content": "7. —(1) A limited liability partnership may execute a document described or expressed as a deed without affixing a common seal to the document by signature — ( a ) on behalf of the limited liability partnership by at least 2 partners of the limited liability partnership; or ( b ) on behalf of the limited liability partnership by a partner of the limited liability partnership in the presence of a witness who attests the signature. [16/2017] (2) A document mentioned in subsection (1) that is signed on behalf of the limited liability partnership in accordance with that subsection has the same effect as if the document were executed under the common seal of the limited liability partnership. [16/2017] (3) Where a document is to be signed by a person on behalf of more than one limited liability partnership, the document is not considered to be signed by that person for the purposes of subsection (1) or (2) unless the person signs the document separately in each capacity. [16/2017] (4) This section applies in the case of a document mentioned in subsection (1) that is executed by the limited liability partnership in the name or on behalf of another person, whether or not that person is also a limited liability partnership. [5B [16/2017]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "8",
      "title": "Alternative to sealing",
      "content": "8. Where any written law or rule of law requires any document to be under or executed under the common seal of a limited liability partnership, or provides for certain consequences if it is not, a document satisfies that written law or rule of law if the document is signed in the manner set out in section 7(1)( a ) or ( b ) and (3). [5C [16/2017]"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "9",
      "title": "Application of provisions of Companies Act 1967",
      "content": "9. —(1) Subject to section 8, section 41(1) to (8) of the Companies Act 1967 applies to a limited liability partnership as it applies to a corporation within the meaning of that Act. [16/2017] (2) Section 144(1)( a ) of the Companies Act 1967 applies to a limited liability partnership as it applies to a company under that Act. [5D [16/2017]"
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "10",
      "title": "Non-applicability of partnership law",
      "content": "10. Except as otherwise provided by this Act, the law relating to partnerships does not apply to a limited liability partnership. [6"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "11",
      "title": "Partners",
      "content": "11. —(1) Any individual or body corporate may be a partner in a limited liability partnership. (2) To avoid doubt, the reference in subsection (1) to body corporate excludes any trade union or platform work association. [7 [Act 30 of 2024 wef 01/11/2024]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "12",
      "title": "Limited liability of partners",
      "content": "12. —(1) An obligation of the limited liability partnership, whether arising in contract, tort or otherwise, is solely the obligation of the limited liability partnership. (2) A partner is not personally liable, directly or indirectly, by way of indemnification, contribution, assessment or otherwise, for an obligation mentioned in subsection (1) solely by reason of being a partner of the limited liability partnership. (3) Subsections (1) and (2) do not affect the personal liability of a partner in tort for the partner’s own wrongful act or omission, but a partner is not personally liable for the wrongful act or omission of any other partner of the limited liability partnership. (4) Where a partner of a limited liability partnership is liable to any person (other than another partner of the limited liability partnership) as a result of the partner’s wrongful act or omission in the course of the business of the limited liability partnership or with its authority, the limited liability partnership is liable to the same extent as the partner. (5) The liabilities of the limited liability partnership must be met out of the property of the limited liability partnership. [8"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "13",
      "title": "Power of partner to bind the limited liability partnership",
      "content": "13. —(1) Every partner of a limited liability partnership is the agent of the limited liability partnership. (2) Despite subsection (1), a limited liability partnership is not bound by anything done by a partner in dealing with a person if — ( a ) the partner has in fact no authority to act for the limited liability partnership by doing that thing; and ( b ) the person knows that the partner has no authority or does not know or believe the partner to be a partner of the limited liability partnership. (3) Where a person has ceased to be a partner of a limited liability partnership, the person (called in this subsection former partner) is to be regarded (in relation to any person dealing with the limited liability partnership) as still being a partner of the limited liability partnership unless — ( a ) the person has notice that the former partner has ceased to be a partner of the limited liability partnership; or ( b ) notice that the former partner has ceased to be a partner of the limited liability partnership has been delivered to the Registrar. [9"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "14",
      "title": "Relationship of partners, etc.",
      "content": "14. —(1) Except as otherwise provided by this Act, the mutual rights and duties of the partners of a limited liability partnership, and the mutual rights and duties of a limited liability partnership and its partners, are governed — ( a ) by the limited liability partnership agreement; or ( b ) in the absence of agreement as to any matter, by any provision relating to that matter set out in the First Schedule. (2) Any reference to a resolution of partners for a particular matter is a reference to a resolution passed by all or such number of partners as may be required by the limited liability partnership agreement for that matter. [10"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "15",
      "title": "Cessation of partnership interest",
      "content": "15. —(1) A partner of a limited liability partnership may cease to be a partner in accordance with the limited liability partnership agreement, or in the absence of such agreement, by that partner giving 30 days’ notice to the other partners of the partner’s intention to resign as partner. (2) Without limiting subsection (1), a partner of a limited liability partnership ceases to be a partner upon the death or dissolution of the partner. (3) Where a partner of a limited liability partnership ceases to be a partner, unless otherwise provided in the limited liability partnership agreement, the former partner, his or her personal representative or its liquidator (as the case may be) is entitled to receive from the limited liability partnership an amount — ( a ) equal to the former partner’s capital contribution to the limited liability partnership and the former partner’s right to share in the accumulated profits of the limited liability partnership after the deduction of losses of the limited liability partnership; and ( b ) determined as at the date the former partner ceased to be a partner. (4) To avoid doubt, a former partner, his or her personal representative or its liquidator (as the case may be) must not interfere in the management of the limited liability partnership. [11"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "16",
      "title": "Bankruptcy of partner",
      "content": "16. Unless otherwise provided in the limited liability partnership agreement, if a partner of a limited liability partnership is adjudicated a bankrupt by a court in Singapore or elsewhere — ( a ) the bankruptcy does not by itself cause the bankrupt partner to cease being a partner of the limited liability partnership, but the restriction on the bankrupt partner being a manager of the limited liability partnership under section 58 applies; and ( b ) the Official Assignee or trustee of the estate of the bankrupt partner must not interfere in the management of the limited liability partnership but is entitled to receive distributions from the limited liability partnership that the bankrupt partner is entitled to receive under the limited liability partnership agreement. [12"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 2 - NATURE OF LIMITED LIABILITY PARTNERSHIP",
      "section": "17",
      "title": "Assignment of partner’s interest in distributions",
      "content": "17. —(1) Unless otherwise provided in the limited liability partnership agreement, a partner may assign the whole or any part of the partner’s interest in the limited liability partnership but only to the extent that the assignee becomes entitled to receive distributions from the limited liability partnership that the partner would otherwise have been entitled to receive. (2) An assignment under subsection (1) does not by itself — ( a ) cause the partner to cease being a partner of the limited liability partnership; and ( b ) entitle the assignee to interfere in the management of the limited liability partnership. [13"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - REGISTRATION",
      "section": "18",
      "title": "Registration of limited liability partnership",
      "content": "18. Subject to the provisions of this Act, any 2 or more persons associated for carrying on a lawful business with a view to profit may, by complying with the requirements as to registration, register a limited liability partnership under this Act. [14"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 3 - REGISTRATION",
      "section": "19",
      "title": "Manner and particulars of registration",
      "content": "19. —(1) A limited liability partnership may be registered under this Act if a statement by every person who is to be a partner of the limited liability partnership is lodged with the Registrar in such medium and form as the Registrar may determine, containing the following particulars: ( a ) the name of the proposed limited liability partnership; ( b ) the general nature of the proposed business of the limited liability partnership; ( c ) the proposed registered office of the limited liability partnership; ( d ) all of the following information of each individual who is to be a partner of the limited liability partnership: (i) full name; (ii) identification; (iii) nationality; (iv) residential address and contact address; [Act 21 of 2024 wef 09/12/2024] ( e ) all of the following information of each body corporate which is to be a partner of the limited liability partnership: (i) the corporate name; (ii) the place of incorporation or registration; (iii) the registration number; (iv) the registered office to which all notices and communications may be addressed; ( f ) all of the following information of each individual who is to be a manager of the limited liability partnership: (i) full name; (ii) identification; (iii) nationality; (iv) residential address and contact address; [Act 21 of 2024 wef 09/12/2024] ( g ) all of the following information of each body corporate which is to be a manager of the limited liability partnership: (i) the corporate name; (ii) the place of incorporation or registration; (iii) the registration number; (iv) the registered office to which all notices and communications may be addressed; ( h ) any other information concerning the proposed limited liability partnership that the Minister may prescribe. [35/2014] (2) The Registrar may, in any particular case, require the statement mentioned in subsection (1) to be verified in any manner that the Registrar considers fit. (3) The General Division of the High Court may, on the application of any person alleged or claiming to be a partner, direct the rectification of the register and decide any question arising under this section. [15 [40/2019]"
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 3 - REGISTRATION",
      "section": "20",
      "title": "Registration",
      "content": "20. —(1) On receiving the statement mentioned in section 19, the Registrar must, subject to the provisions of this Act, register the statement and issue a notice of registration in such form as the Registrar may determine. (2) On and from the date of registration specified in the notice of registration issued under subsection (1), there is a limited liability partnership, by the name specified in the notice, registered under this Act with all the attributes described in Part 2. (3) The notice of registration is conclusive evidence that the requirements of section 19 are complied with and that the limited liability partnership is registered by the name specified in the notice. (4) The Registrar may, upon receipt of the application in the prescribed form of a limited liability partnership registered under subsection (1) and on payment of the prescribed fee, issue to that limited liability partnership a certificate of confirmation of registration in such form as the Registrar may determine. (5) This section must not be construed to require the Registrar to register any limited liability partnership if he or she is not satisfied with the particulars or other information provided under this Act. (6) Any person aggrieved by the refusal of the Registrar to register a limited liability partnership of which the person is to be a partner may, within 30 days of the date of the refusal, appeal to the Minister whose decision is final. (7) The registration of any limited liability partnership does not imply that the requirements of any law in relation to any business carried on by that limited liability partnership have been complied with. [16"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 3 - REGISTRATION",
      "section": "21",
      "title": "Power to refuse registration",
      "content": "21. —(1) Despite any provision in this Act or any other written law, the Registrar must refuse to register a limited liability partnership under this Act where the Registrar is satisfied that — ( a ) the proposed business is likely to be used for an unlawful purpose or for purposes prejudicial to public peace, welfare or good order in Singapore; or ( b ) it would be contrary to the national security or interest for the limited liability partnership to be registered. (2) Any person aggrieved by the decision of the Registrar under subsection (1) may, within 30 days of the date of the decision, appeal to the Minister whose decision is final. (3) For the purposes of this section, a certificate issued by the Minister charged with the responsibility for internal security stating that the Minister is satisfied that it would be contrary to the national security or interest for the limited liability partnership to be registered under this Act is conclusive evidence of the matters so stated. [17"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 3 - REGISTRATION",
      "section": "22",
      "title": "Names of limited liability partnerships",
      "content": "22. —(1) Every limited liability partnership must have either the words “limited liability partnership” or the acronym “LLP” as part of its name. (2) A limited liability partnership that is registered under this Act must not carry on business under a name that is not registered under section 20 or 34. (3) The registration of a name under which a limited liability partnership carries on business is not to be construed as authorising the use of that name if, apart from the registration, the use of that name could be prohibited. (4) Any limited liability partnership which contravenes this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. [18"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 3 - REGISTRATION",
      "section": "23",
      "title": "Reservation of limited liability partnership names",
      "content": "23. —(1) A person may, by lodging an application with the Registrar, apply for the reservation of a name set out in the application as — ( a ) the name of a proposed limited liability partnership; or ( b ) the name to which a limited liability partnership proposes to change its name. [35/2014] (2) The Registrar may approve an application made under subsection (1) only if the Registrar is satisfied that — ( a ) the application is made in good faith; and ( b ) the name to be reserved is one in respect of which a limited liability partnership may be registered having regard to section 24(1), (2) and (3). [35/2014] (3) The Registrar must refuse to approve an application to reserve a name under subsection (1) as the name of a proposed limited liability partnership if the Registrar is satisfied that — ( a ) the name is for a limited liability partnership that is likely to be used for an unlawful purpose or for purposes prejudicial to public peace, welfare or good order in Singapore; or ( b ) it would be contrary to the national security or interest for the limited liability partnership to be registered. [35/2014] (4) Where an application for a reservation of a name is made under subsection (1), the Registrar must reserve the proposed name of the proposed limited liability partnership or limited liability partnership for a period starting at the time the Registrar receives the application and ending — ( a ) if the Registrar approves the application, 60 days after the date on which the Registrar notifies the applicant that the application has been approved, or such further period of 60 days as the Registrar may, on application made in good faith, extend; or ( b ) if the Registrar refuses to approve the application, on the date on which the Registrar notifies the applicant of the refusal. [35/2014] (5) A person aggrieved by a decision of the Registrar — ( a ) refusing to approve an application under subsection (1); or ( b ) refusing an application under subsection (4)( a ) to extend the reservation period, may, within 30 days after being informed of the Registrar’s decision, appeal to the Minister whose decision is final. [19 [35/2014]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 3 - REGISTRATION",
      "section": "24",
      "title": "Restrictions on registration of limited liability partnership names",
      "content": "24. —(1) Except with the consent of the Minister or as provided in subsection (3), the Registrar must refuse to register a limited liability partnership under this Act under a name, or to approve a change of name of a limited liability partnership under section 25 to a name, which, in the opinion of the Registrar — ( a ) is undesirable; ( b ) is identical to the name of any other limited liability partnership, a limited partnership or a corporation, or to a registered business name; ( c ) is identical to a name that is reserved under — (i) section 23; (ii) section 16 of the Business Names Registration Act 2014; (iii) section 17(4) of the Limited Partnerships Act 2008; or (iv) section 27(12B), section 27(12B) as applied by section 357(2), or section 378(15) of the Companies Act 1967; or ( d ) is a name of a kind that the Minister has directed the Registrar, by notification in the Gazette , not to accept for registration. [35/2014; 15/2017] (2) In addition to subsection (1), the Registrar must on or after 3 January 2016, except with the consent of the Minister, refuse to register a limited liability partnership under a name, or allow a limited liability partnership to change its name to a name, if — ( a ) it is identical to the name of a limited liability partnership that was dissolved — (i) unless, in a case where the limited liability partnership was dissolved following its winding up under section 39 and the Fifth Schedule, a period of at least 2 years has passed after the date of dissolution; or (ii) unless, in a case where the limited liability partnership was dissolved following its name being struck off the register under section 63, a period of at least 6 years has passed after the date of dissolution; ( b ) it is identical to the business name of a person whose registration and registration of that business name has been cancelled under the Business Names Registration Act 2014 or whose business has ceased under section 22 of that Act, unless a period of at least one year has passed after the date of cancellation or cessation; ( c ) it is identical to the name of a company that was dissolved — (i) unless, in a case where the company was dissolved following its winding up under Part 8 of the Insolvency, Restructuring and Dissolution Act 2018, a period of at least 2 years has passed after the date of dissolution; or (ii) unless, in a case where the company was dissolved following its name being struck off the register kept under the Companies Act 1967 under section 344 or 344A of that Act, a period of at least 6 years has passed after the date of dissolution; ( d ) it is identical to the name of a foreign company notice of the dissolution of which has been given to the Registrar of Companies under section 377(2) of the Companies Act 1967, unless a period of at least 2 years has passed after the date of dissolution; or ( e ) it is identical to the name of a limited partnership that was cancelled or dissolved — (i) unless, in a case where the registration of the limited partnership was cancelled under section 14(1) or 19(4) of the Limited Partnerships Act 2008, a period of at least one year has passed after the date of cancellation; or (ii) unless, in a case where notice was lodged with the Registrar of Limited Partnerships that the limited partnership was dissolved under section 19(2) of the Limited Partnerships Act 2008, a period of at least one year has passed after the date of dissolution. [35/2014; 40/2018] (3) Despite subsection (1), the Registrar may, on or after 3 January 2016, register a limited liability partnership under — ( a ) a name that is identical to the name of a foreign company registered under Division 2 of Part 11 of the Companies Act 1967 — (i) in respect of which notice was lodged under section 377(1) of the Companies Act 1967 that the foreign company has ceased to have a place of business in Singapore or ceased to carry on business in Singapore, if a period of at least 3 months has passed after the date of cessation; and (ii) the name of which was struck off the register kept under the Companies Act 1967 under section 377(8), (9) or (10) of that Act, if a period of at least 6 years has passed after the date the name was so struck off; or ( b ) a name that is identical to the name of a limited partnership in respect of which notice was lodged under section 19(1) of the Limited Partnerships Act 2008 that the limited partnership ceased to carry on business, if a period of at least one year has passed after the date of cessation. [35/2014] (4) Despite this section and section 25, where the Registrar is satisfied that a limited liability partnership’s name — ( a ) is one that is not permitted to be registered under subsection (1)( a ), ( b ) or ( d ); ( b ) is one that is not permitted to be registered under subsection (2) until the expiry of the relevant period mentioned in that subsection; ( c ) is one that is permitted to be registered under subsection (3) only after the expiry of the relevant period mentioned in that subsection; ( d ) so nearly resembles the name of any other limited liability partnership, any limited partnership or corporation or any registered business name, as to be likely to be mistaken for it; or ( e ) is one the use of which has been restrained by an injunction granted under the Trade Marks Act 1998, the Registrar may direct the limited liability partnership to change its name, and the limited liability partnership must comply with the direction within 6 weeks after the date of the direction or such longer period as the Registrar may allow in any case. [35/2014] (5) The Registrar’s power under subsection (4) to direct a limited liability partnership to change its name applies regardless of — ( a ) whether the limited liability partnership’s name was registered through inadvertence or otherwise; or ( b ) when the limited liability partnership was registered in respect of the name. [35/2014] (6) Any person may apply, in writing, to the Registrar to give a direction to any limited liability partnership, on a ground referred to in subsection (4), to change the limited liability partnership’s name. [35/2014] (7) The Registrar is not to consider any application under subsection (6) to give a direction to a person on the ground referred to in subsection (4)( d ) unless the Registrar receives the application within 12 months after the date the limited liability partnership was registered in respect of the name, or the date the change of the limited liability partnership’s name was approved under section 25. [35/2014] (8) Any limited liability partnership which fails to comply with a direction given under subsection (4) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 and, in the case of a continuing offence, to a further fine not exceeding $200 for every day or part of a day during which the offence continues after conviction. [35/2014] (9) A person aggrieved by — ( a ) a direction of the Registrar under subsection (4); or ( b ) the Registrar’s refusal to give a direction to a person under subsection (4) following an application under subsection (6), may, within 30 days after being informed of the Registrar’s direction or refusal (as the case may be) appeal to the Minister whose decision is final. [35/2014] (10) To avoid doubt, where the Registrar makes a direction under subsection (4) or the Minister makes a decision on an appeal under subsection (9), the Registrar or the Minister (as the case may be) must accept as correct any decision of the General Division of the High Court to grant an injunction mentioned in subsection (4)( e ). [35/2014; 40/2019] (11) In this section, “registered business name” has the meaning given by section 2(1) of the Business Names Registration Act 2014. [19A [35/2014]"
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 3 - REGISTRATION",
      "section": "25",
      "title": "Change of limited liability partnership name",
      "content": "25. —(1) An application by a limited liability partnership to change the name under which it was registered is to be lodged with the Registrar. [35/2014] (2) On approving the application, the Registrar must issue to the limited liability partnership a notice of change of name stating the date of the change. [35/2014] (3) Any application for a change of a limited liability partnership name is subject to section 24. [19B [35/2014]"
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 4 - CONVERSION TO LIMITED LIABILITY PARTNERSHIP",
      "section": "26",
      "title": "Conversion from firm to limited liability partnership",
      "content": "26. —(1) A firm may convert to a limited liability partnership by complying with the requirements as to the conversion set out in the Second Schedule. (2) Upon the conversion, the partners of the firm, the limited liability partnership to which the firm has converted and the partners of that limited liability partnership are bound by the provisions of the Second Schedule that are applicable to them. (3) The Minister may, by order in the Gazette , amend, add to or vary the provisions in the Second Schedule. (4) Any order made under subsection (3) must be presented to Parliament as soon as possible after publication in the Gazette . (5) In this section, “convert”, in relation to a firm converting to a limited liability partnership, means a transfer of the property, assets, interests, rights, privileges, liabilities, obligations and the undertaking of the firm to the limited liability partnership in accordance with the Second Schedule. [20"
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 4 - CONVERSION TO LIMITED LIABILITY PARTNERSHIP",
      "section": "27",
      "title": "Conversion from private company to limited liability partnership",
      "content": "27. —(1) A private company may convert to a limited liability partnership by complying with the requirements as to the conversion set out in the Third Schedule. (2) Upon the conversion, the private company, its shareholders, the limited liability partnership to which the private company has converted and the partners of that limited liability partnership are bound by the provisions of the Third Schedule that are applicable to them. (3) The Minister may, by order in the Gazette , amend, add to or vary the provisions in the Third Schedule. (4) Any order made under subsection (3) must be presented to Parliament as soon as possible after publication in the Gazette . (5) In this section, “convert”, in relation to a private company converting to a limited liability partnership, means a transfer of the property, assets, interests, rights, privileges, liabilities, obligations and the undertaking of the private company to the limited liability partnership in accordance with the Third Schedule. [21"
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "28",
      "title": "Minimum of 2 partners",
      "content": "28. —(1) Every limited liability partnership must have at least 2 partners. (2) If a limited liability partnership carries on business with fewer than 2 partners for a period of more than 2 years, a person is (despite section 12(1) and (2)) personally liable, jointly and severally with the limited liability partnership, for any obligation of the limited liability partnership incurred during the period that the limited liability partnership so carries on business after those 2 years if, at the time the obligation was incurred, the person — ( a ) was a partner of the limited liability partnership; and ( b ) knew that the limited liability partnership was carrying on business with fewer than 2 partners for a period of more than 2 years. [22"
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "29",
      "title": "Manager",
      "content": "29. —(1) Every limited liability partnership must ensure that it has at least one manager who — ( a ) is a natural person; ( b ) has attained 18 years of age and is otherwise of full legal capacity; and ( c ) is ordinarily resident in Singapore. [7/2009] (2) Every limited liability partnership must ensure that the particulars of every person who acts as manager of the limited liability partnership and the person’s consent to act as such are lodged with the Registrar in such medium and form as the Registrar may determine. (3) A manager is — ( a ) answerable for the doing of all acts, matters and things, as are required to be done by the limited liability partnership under sections 30, 33 and 34; and ( b ) personally liable for all penalties imposed on the limited liability partnership for any contravention of those sections unless the manager satisfies the court hearing the matter that the manager should not be so liable. (4) If a limited liability partnership contravenes subsection (1), the limited liability partnership and every partner of the limited liability partnership shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 and, in the case of a continuing offence, to a further fine not exceeding $200 for every day or part of a day during which the offence continues after conviction. (5) Any limited liability partnership which contravenes subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 and, in the case of a continuing offence, to a further fine not exceeding $200 for every day or part of a day during which the offence continues after conviction. [23"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "30",
      "title": "Annual declaration",
      "content": "30. —(1) Every limited liability partnership must lodge with the Registrar a declaration by one of its managers that, in that manager’s opinion, the limited liability partnership either — ( a ) appears as at that date to be able to pay its debts as they become due in the normal course of business; or ( b ) does not appear as at that date to be able to pay its debts as they become due in the normal course of business. [16/2017] (2) The declaration mentioned in subsection (1) must also contain such particulars of, or information concerning, the limited liability partnership as may be prescribed. [16/2017] (3) The declaration mentioned in subsection (1) must be lodged not later than 15 months after the registration of the limited liability partnership and subsequently once in every calendar year at intervals of not more than 15 months. (4) Despite subsection (3), the Registrar may, on application by a limited liability partnership, and if he or she thinks fit, grant an extension of time for the lodging of the declaration mentioned in subsection (1). (5) If a limited liability partnership fails to lodge the declaration mentioned in subsection (1) within the time or extended time referred to in subsections (3) and (4), the limited liability partnership shall be — ( a ) guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000; and ( b ) paragraph 3(2)( d ) of the Fifth Schedule applies. (6) A manager who makes a declaration mentioned in subsection (1)( a ) without having reasonable grounds for the manager’s opinion, shall be guilty of an offence and shall be liable on conviction — ( a ) in the case where the manager is an individual, to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both; or ( b ) in any other case, to a fine not exceeding $5,000. (7) Any person who, in connection with a declaration made under this section, makes a statement or provides information (whether directly or indirectly) to a manager that is false or misleading in a material particular, when the person knows or ought reasonably to have known that the statement or information is false or misleading in a material particular, shall be guilty of an offence and shall be liable on conviction — ( a ) in the case where the person is an individual, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both; or ( b ) in any other case, to a fine not exceeding $10,000. (8) If an offence under this section is committed with intent to defraud creditors of the limited liability partnership or for a fraudulent purpose, the offender shall be liable on conviction — ( a ) in the case where the offender is an individual, to a fine not exceeding $15,000 or to imprisonment for a term not exceeding 3 years or to both; or ( b ) in any other case, to a fine not exceeding $15,000. [24"
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "31",
      "title": "Accounts",
      "content": "31. —(1) Every limited liability partnership must keep such accounting and other records as will sufficiently explain the transactions and financial position of the limited liability partnership and enable profit and loss accounts and balance sheets to be prepared from time to time which give a true and fair view of the state of affairs of the limited liability partnership. (2) The limited liability partnership must retain the records referred to in subsection (1) for a period of at least 5 years from the end of the financial year in which the transactions or operations to which those records relate are completed. [2/2007] (3) The records referred to in subsection (1) must be kept at such place as the partners think fit and must at all times be open to inspection by the partners. (4) The Registrar may, by written notice to the limited liability partnership or any of its partners, require the limited liability partnership or that partner to produce the records referred to in subsection (1) for the Registrar’s inspection within the time and at the place specified in that notice. (5) If a limited liability partnership contravenes subsection (1), (2) or (3), the limited liability partnership and every partner of the limited liability partnership shall be guilty of an offence and shall be liable on conviction — ( a ) in the case where the offender is an individual, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both; or ( b ) in any other case, to a fine not exceeding $10,000. (6) Any person who fails to comply with a requirement under subsection (4) shall be guilty of an offence and shall be liable on conviction — ( a ) in the case where the offender is an individual, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both; or ( b ) in any other case, to a fine not exceeding $10,000. [25"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "32",
      "title": "Registered office",
      "content": "32. —(1) Every limited liability partnership must have a registered office within Singapore to which all communications and notices may be addressed. (2) A document may be served on a limited liability partnership by leaving it at or sending it by registered post to the registered office of the limited liability partnership. (3) A limited liability partnership may change the address of its registered office by lodging with the Registrar notice of the change in such medium and form as the Registrar may determine, and any such change takes effect only upon the lodgment. [26"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "33",
      "title": "Publication of name and limited liability",
      "content": "33. —(1) Every limited liability partnership must ensure that its invoices and official correspondence bear the following: ( a ) the name and registration number of the limited liability partnership; ( b ) a statement that it is registered with limited liability. (2) Any limited liability partnership which contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 and, in the case of a continuing offence, to a further fine not exceeding $200 for every day or part of a day during which the offence continues after conviction. [27"
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "34",
      "title": "Registration of change in particulars",
      "content": "34. —(1) A limited liability partnership must lodge with the Registrar — ( a ) within 14 days after the appointment of a new partner of the limited liability partnership, a statement containing the particulars mentioned in section 19(1)( d ) or ( e ) (as the case may be) of the new partner; ( b ) within 14 days after the appointment of a new manager of the limited liability partnership, a statement containing the particulars mentioned in section 19(1)( f ) or ( g ) (as the case may be) of the manager; ( c ) within 14 days after a partner or manager ceases to be a partner or manager of the limited liability partnership, a statement of that fact; ( d ) within 14 days after any change in the particulars of any partner or manager of the limited liability partnership that have been lodged with the Registrar under this Act, other than the partner’s or manager’s residential address, a statement containing the particulars of the change; or ( e ) within 14 days after any other change that is made or that occurs in any of the particulars registered in respect of any limited liability partnership, a statement specifying the nature and date of the change, and containing any other information that may be prescribed. [35/2014] (2) The Registrar may, on application by the limited liability partnership, extend the period referred to in subsection (1)( a ) to ( e ). [35/2014] (3) Any person who ceases to be a partner or manager of a limited liability partnership may himself, herself or itself lodge with the Registrar the statement mentioned in subsection (1)( c ) if the person has reasonable cause to believe that the limited liability partnership will not lodge the statement with the Registrar. [35/2014] (4) A partner or manager, who is an individual, who changes his or her residential address must lodge with the Registrar a notice of the new residential address within 14 days after the date of change. [35/2014] (5) Where a partner or manager has changed his or her residential address and has made a report of the change under section 10 of the National Registration Act 1965, the partner or manager is to be taken to have informed the Registrar of the change of residential address in compliance with subsection (4). [35/2014] (6) The Registrar may, in any particular case, require a statement lodged under subsection (1) to be rectified in any manner that the Registrar considers fit. [35/2014] (7) Any statement required to be lodged under this section must be in such medium and form as the Registrar may determine. [35/2014] (8) Any — ( a ) limited liability partnership which contravenes subsection (1); or ( b ) partner or manager of a limited liability partnership who contravenes subsection (4), shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 and, in the case of a continuing offence, to a further fine not exceeding $200 for every day or part of a day during which the offence continues after conviction. (9) A statement lodged on or after the date of commencement of section 54 of the ACRA (Registry and Regulatory Enhancements) Act 2024 — ( a ) in relation to the appointment of a new partner (who is an individual) for the purposes of subsection (1)( a ), must contain the particulars mentioned in section 19(1)( d ) as in force when the statement is lodged, despite the new partner having been appointed before that date; and ( b ) in relation to the appointment of a new manager (who is an individual) for the purposes of subsection (1)( b ) must contain the particulars mentioned in section 19(1)( f ) as in force when the statement is lodged, despite the new manager having been appointed before that date. [28 [35/2014] [Act 21 of 2024 wef 09/12/2024]"
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "35",
      "title": "Duty of partners and managers to provide information to limited liability partnership",
      "content": "35. —(1) A partner or manager (as the case may be) must give the limited liability partnership — ( a ) any information the limited liability partnership needs to comply with section 34(1)( a ) or ( b ) (as the case may be) as soon as practicable but not later than 14 days after his, her or its initial appointment as a partner or manager unless the partner or manager has previously given the information to the limited liability partnership in writing; and ( b ) any information the limited liability partnership needs to comply with section 34(1)( d ) as soon as practicable but not later than 14 days after the date of change to the information referred to in that provision. [35/2014] (2) Despite subsection (1), but subject to subsection (3) — ( a ) a partner of a limited liability partnership must, if requested by the limited liability partnership, give the limited liability partnership any information mentioned in section 19(1)( d ) or ( e ); and ( b ) a manager of a limited liability partnership must, if requested by the limited liability partnership, give the limited liability partnership any information mentioned in section 19(1)( f ) or ( g ), for the purpose of enabling the limited liability partnership to confirm its record of the information or reinstate its record of the information where the original record of the information has been destroyed or lost. [35/2014] (3) The partner or manager of a limited liability partnership mentioned in subsection (2) must provide the information to the limited liability partnership as soon as practicable but not later than 14 days after receipt of a written request for the information from the limited liability partnership. [35/2014] (4) A partner or manager of a limited liability partnership who is bound to comply with a requirement under this section and fails to do so shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 and, in the case of a continuing offence, to a further fine not exceeding $200 for every day or part of a day during which the offence continues after conviction. (5) Where a partner or manager (who is an individual) gives information to a limited liability partnership under subsection (1)( a ) or (2) on or after the date of commencement of section 55 of the ACRA (Registry and Regulatory Enhancements) Act 2024 in relation to his or her appointment, the information given must be in accordance with section 19(1)( d ) or ( f ) (as the case may be) as in force when the information is given, despite the appointment having taken place before the date of commencement. [28A [35/2014] [Act 21 of 2024 wef 09/12/2024]"
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "36",
      "title": "Request for copy of notice of registration, etc.",
      "content": "36. —(1) A person may, on payment of such fee as may be prescribed, require a copy of a notice of registration, or a copy of or an extract from any document filed or lodged with the Registrar, to be given or certified by the Registrar. [35/2014] [Act 21 of 2024 wef 09/12/2024] (2) Any copy or extract given under subsection (1) which is certified to be a true copy or extract by the Registrar is, in any proceedings, admissible in evidence as of equal validity as the original document. [35/2014] (3) The Registrar is not required to issue under subsection (1) a copy of or an extract from a document forming part of the register where that document has been destroyed under section 82. (4) Subsection (1) does not apply to any document prescribed as an excluded document for the purposes of this subsection. [Act 21 of 2024 wef 09/12/2024] (5) Where a document is submitted on or after the date of commencement of section 56 of the ACRA (Registry and Regulatory Enhancements) Act 2024 using a form on the electronic transaction system, the reference to the document in subsection (1) excludes the following entries in the form: ( a ) a means of notification provided by a person for the purposes of section 28A(1)( b ) of the Accounting and Corporate Regulatory Authority Act 2004; ( b ) an individual’s date of birth obtained under this Act or section 28(1A) of the Accounting and Corporate Regulatory Authority Act 2004; ( c ) any other prescribed information. [Act 21 of 2024 wef 09/12/2024] (6) Where — ( a ) a document is filed or lodged with the Registrar under this Act by submitting a form on the electronic transaction system on or after the date of commencement of section 56 of the ACRA (Registry and Regulatory Enhancements) Act 2024; and ( b ) an individual’s residential address is entered in that form, the Registrar must cause the individual’s residential address to be excluded from every copy or extract of that document given or certified by the Registrar under subsection (1). [28B [35/2014] [Act 21 of 2024 wef 09/12/2024]"
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 5 - MANAGEMENT AND ADMINISTRATION",
      "section": "37",
      "title": "Transitional provision for contact address",
      "content": "37. —(1) Where an individual maintained an alternate address with the Registrar under this Act immediately before the commencement date, that address is taken to be the individual’s contact address for the purposes of this Act, until notice of a change in the individual’s contact address is lodged under any ACRA administered Act on or after that date. (2) Where an individual did not maintain an alternate address with the Registrar under this Act immediately before the commencement date, the individual’s residential address is taken to be the individual’s contact address for the purposes of this Act, until notice of a change in the individual’s contact address is lodged under any ACRA administered Act on or after that date. (3) An individual’s contact address mentioned in subsection (1) or (2) is deemed, for the purposes of section 34(1)( d ), to have been lodged with the Registrar under this Act. (4) In this section, “commencement date” means the date of commencement of section 57 of the ACRA (Registry and Regulatory Enhancements) Act 2024. [Act 21 of 2024 wef 09/12/2024]"
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 6 - RECEIVERSHIP AND WINDING UP",
      "section": "38",
      "title": "Receivership",
      "content": "38. The provisions of the Fourth Schedule apply to the appointment of a receiver or receiver and manager of the property of a limited liability partnership, and to the receivership of a limited liability partnership. [29"
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 6 - RECEIVERSHIP AND WINDING UP",
      "section": "39",
      "title": "Winding up",
      "content": "39. —(1) The winding up of a limited liability partnership may be either voluntary or by the General Division of the High Court and, unless inconsistent with the context, the provisions of the Fifth Schedule apply to the winding up of a limited liability partnership in either of these modes. [40/2019] (2) The provisions of the Fifth Schedule relating to the remedies against the property of a limited liability partnership and the priorities of debts bind the Government. [30"
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 6 - RECEIVERSHIP AND WINDING UP",
      "section": "40",
      "title": "Amendment of Fourth and Fifth Schedules",
      "content": "40. —(1) Subject to subsections (2) and (3), the Minister may, by order in the Gazette , amend the Fourth or Fifth Schedule. (2) The Minister must not amend the Fourth or Fifth Schedule to increase the maximum penalty for any of the offences in the Schedules. (3) The Minister may amend the Fourth or Fifth Schedule to include a new offence provided that the maximum penalty for the new offence does not exceed a fine of $2,000 or a term of imprisonment of 12 months and, in the case of a continuing offence, the maximum penalty does not exceed a fine of $200 for every day or part of a day during which the offence continues after conviction. (4) Any order made under subsection (1) must be presented to Parliament as soon as possible after publication in the Gazette . [31"
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 6 - RECEIVERSHIP AND WINDING UP",
      "section": "41",
      "title": "Debt owed to partner",
      "content": "41. —(1) Any sum due to a partner of a limited liability partnership (in the partner’s capacity as a partner) is not a debt of the limited liability partnership payable to that partner in a case of competition between that partner and any other creditor who is not a partner, but any such sum may be taken into account for the purpose of the final adjustment of the rights of the partners among themselves. (2) Subsection (1) does not apply to any sum due to a partner as repayment of a loan made in good faith by the partner to the limited liability partnership. [32"
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "42",
      "title": "Application of this Part",
      "content": "42. —(1) This Part applies to all limited liability partnerships other than a limited liability partnership that is set out in the Sixth Schedule. [16/2017] (2) The obligation to comply with this Part extends to all natural persons, whether resident in Singapore or not and whether citizens of Singapore or not, and to all entities, whether formed, constituted or carrying on business in Singapore or not. [16/2017] (3) This Part extends to acts done or omitted to be done outside Singapore. [32A [16/2017]"
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "43",
      "title": "Interpretation of this Part",
      "content": "43. In this Part, unless the context otherwise requires — “approved exchange” has the meaning given by section 2(1) of the Securities and Futures Act 2001; “controller” means an individual controller or a corporate controller; “corporate controller”, in relation to a limited liability partnership, means a legal entity which has a significant interest in, or significant control over, the limited liability partnership; “individual controller”, in relation to a limited liability partnership, means an individual who has a significant interest in, or significant control over, the limited liability partnership; “legal entity” means any body corporate formed or incorporated or existing in Singapore or outside Singapore and includes a foreign company; “register of controllers” or “register”, in relation to a limited liability partnership to which this Part applies, means the register that the limited liability partnership is required to keep of its registrable controllers under section 47(1), (1A), (2) or (3); [Act 23 of 2024 wef 16/06/2025] [ Deleted by Act 22 of 2024 wef 09/06/2025 ] “registered corporate service provider” has the meaning given by section 2(1) of the Corporate Service Providers Act 2024; [Act 22 of 2024 wef 09/06/2025] “significant control”, in relation to a limited liability partnership, has the meaning given to it in the Seventh Schedule; “significant interest”, in relation to a limited liability partnership, has the meaning given to it in the Seventh Schedule. [32B [16/2017]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "44",
      "title": "Meaning of “registrable”",
      "content": "44. For the purposes of this Part, in relation to a limited liability partnership ( X ), a controller ( A ) is registrable unless — ( a ) A ’s significant interest in or significant control over X is only through one or more controllers ( B ) of X ; ( b ) A is a controller of B (or each B if more than one); and ( c ) B (or each B if more than one) is either — (i) a limited liability partnership to which this Part applies and which is required to keep a register of controllers under section 47; (ii) a limited liability partnership set out in the Sixth Schedule; (iii) a company, or a foreign company to which Part 11A of the Companies Act 1967 applies, that is required to keep a register of controllers of companies or foreign companies under that Act; (iv) a company that is set out in the Fourteenth Schedule to the Companies Act 1967; (v) a foreign company that is set out in the Fifteenth Schedule to the Companies Act 1967; (vi) a corporation whose shares are listed for quotation on an approved exchange; or (vii) a trustee of an express trust to which Part 7 of the Trustees Act 1967 applies. [32C [16/2017]"
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "45",
      "title": "State of mind of corporation, unincorporated association, etc.",
      "content": "45. —(1) Where, in a proceeding for an offence under this Part, it is necessary to prove the state of mind of a corporation in relation to a particular conduct, evidence that — ( a ) an officer, employee or agent of the corporation engaged in that conduct within the scope of the officer’s, employee’s or agent’s actual or apparent authority; and ( b ) the officer, employee or agent had that state of mind, is evidence that the corporation had that state of mind. [16/2017] (2) Where, in a proceeding for an offence under this Part, it is necessary to prove the state of mind of an unincorporated association or a partnership in relation to a particular conduct, evidence that — ( a ) an employee or agent of the unincorporated association or the partnership engaged in that conduct within the scope of the employee’s or agent’s actual or apparent authority; and ( b ) the employee or agent had that state of mind, is evidence that the unincorporated association or partnership had that state of mind. [32D [16/2017]"
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "46",
      "title": "Meaning of “legal privilege”",
      "content": "46. —(1) For the purposes of this Part, information or a document is subject to legal privilege if — ( a ) it is a communication made between a lawyer and a client, or between a legal counsel acting as legal counsel and the legal counsel’s employer, in connection with the lawyer giving legal advice to the client or the legal counsel giving legal advice to the employer, as the case may be; ( b ) it is a communication made between 2 or more lawyers acting for a client, or 2 or more legal counsel acting as legal counsel for their employer, in connection with one or more of the lawyers giving legal advice to the client or one or more of the legal counsel giving legal advice to the employer, as the case may be; ( c ) it is a communication made — (i) between a client, or an employer of a legal counsel, and another person; (ii) between a lawyer acting for a client and either the client or another person; or (iii) between a legal counsel acting as such for the legal counsel’s employer and either the employer or another person, in connection with, and for the purposes of, any legal proceedings (including anticipated or pending legal proceedings) in which the client or employer (as the case may be) is or may be, or was or might have been, a party; ( d ) it is an item, or a document (including its contents), that is enclosed with or mentioned in any communication in paragraph ( a ) or ( b ) and that is made or prepared by any person in connection with a lawyer or legal counsel, or one or more of the lawyers or legal counsel, in either paragraph giving legal advice to the client or the employer of the legal counsel, as the case may be; or ( e ) it is an item, or a document (including its contents), that is enclosed with or mentioned in any communication in paragraph ( c ) and that is made or prepared by any person in connection with, and for the purposes of, any legal proceedings (including anticipated or pending legal proceedings) in which the client or the employer of the legal counsel (as the case may be) is or may be, or was or might have been, a party, but it is not any such communication, item or document that is made, prepared or held with the intention of furthering a criminal purpose. [16/2017] (2) In subsection (1) — “client”, in relation to a lawyer, includes an agent of or other person representing a client and, if a client has died, a personal representative of the client; “employer”, in relation to a legal counsel, includes — ( a ) if the employer is one of a number of corporations that are related to each other under section 6 of the Companies Act 1967, every corporation so related as if the legal counsel is also employed by each of the related corporations; ( b ) if the employer is a public agency within the meaning of section 128A(6) of the Evidence Act 1893 and the legal counsel is required as part of the legal counsel’s duties of employment or appointment to provide legal advice or assistance in connection with the application of the law or any form of resolution of legal dispute to any other public agency or agencies, the other public agency or agencies as if the legal counsel is also employed by the other public agency or each of the other public agencies; and ( c ) an employee or officer of the employer; “lawyer” means a solicitor or a professional legal adviser, and includes an interpreter or other person who works under the supervision of a solicitor or a professional legal adviser; “legal counsel” means a legal counsel as defined in section 3(7) of the Evidence Act 1893, and includes an interpreter or other person who works under the supervision of a legal counsel. [32E [16/2017]"
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "47",
      "title": "Register of controllers",
      "content": "47. —(1) A limited liability partnership registered under this Act on or after 31 March 2017 but before the appointed day, must keep a register of its registrable controllers not later than 30 days after the date of the limited liability partnership’s registration. [16/2017] [Act 23 of 2024 wef 16/06/2025] (1A) A limited liability partnership registered under this Act on or after the appointed day must keep a register of its registrable controllers starting on the date of its registration. [Act 23 of 2024 wef 16/06/2025] (2) A limited liability partnership registered under this Act before 31 March 2017 must keep a register of its registrable controllers not later than 60 days after that date. [16/2017] (3) If a limited liability partnership that is not a limited liability partnership to which this Part applies subsequently becomes a limited liability partnership to which this Part applies, the limited liability partnership must keep a register of its registrable controllers not later than 60 days after the date on which this Part applies or re‑applies to the limited liability partnership. [16/2017] (4) A limited liability partnership must ensure that its register — ( a ) contains such particulars of the limited liability partnership’s registrable individual controllers and registrable corporate controllers as may be prescribed; ( aa ) contains the note and prescribed particulars required under section 47A(3), if applicable; [Act 2 of 2022 wef 04/10/2022] ( b ) is updated if any change to the prescribed particulars mentioned in paragraph ( a ) or ( aa ) occurs; and [Act 2 of 2022 wef 04/10/2022] ( c ) is kept in such form and at such place as may be prescribed. [16/2017] (5) A limited liability partnership must enter the particulars in its register and update the register within the prescribed time and in the prescribed manner. [16/2017] (6) A limited liability partnership must — ( a ) enter the particulars of any controller in its register, or update the particulars of that controller in the register, after the particulars of that controller are confirmed by the controller; or ( b ) if the limited liability partnership does not receive the controller’s confirmation, enter or update the particulars with a note indicating that the particulars have not been confirmed by the controller. [16/2017] (7) For the purposes of subsection (6)( a ), the particulars of the controller to be entered, or updated, in a register must be confirmed by the controller in the prescribed manner. [16/2017] (8) Subject to section 53, a limited liability partnership must not disclose, or make available for inspection, a register or any particulars contained in the register to any member of the public. [16/2017] (9) If a limited liability partnership fails to comply with — ( a ) subsection (1), (1A), (2) or (3), whichever is applicable; or [Act 23 of 2024 wef 16/06/2025] ( b ) subsection (4), (5), (6) or (8), the limited liability partnership, and every partner of the limited liability partnership who is in default, shall each be guilty of an offence and shall each be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] (10) In this section, “appointed day” means the date of commencement of section 16 of the Companies and Limited Liability Partnerships (Miscellaneous Amendments) Act 2024. [Act 23 of 2023 wef 16/06/2025] [32F [16/2017]"
    },
    {
      "provision_ref": "s47A",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "47A",
      "title": "Additional particulars",
      "content": "47A. —(1) This section applies where a limited liability partnership knows, or has reasonable grounds to believe — ( a ) that the limited liability partnership has no registrable controller; or ( b ) that the limited liability partnership has a registrable controller but has not been able to identify the registrable controller. (2) Where this section applies, each partner with executive control of the limited liability partnership is, subject to subsection (9), taken to be a registrable controller of the limited liability partnership for the purposes of this Part. (3) Where this section applies, the limited liability partnership must enter the following in its register of controllers: ( a ) a note stating — (i) that the limited liability partnership knows, or has reasonable grounds to believe, as the case may be — (A) that the limited liability partnership has no registrable controller; or (B) that the limited liability partnership has a registrable controller but has not been able to identify the registrable controller; and (ii) that each partner with executive control of the limited liability partnership is taken to be a registrable controller of the limited liability partnership under subsection (2); ( b ) the prescribed particulars of each partner with executive control of the limited liability partnership. (4) A limited liability partnership must enter the matters mentioned in subsection (3) in its register of controllers within the prescribed period after — ( a ) in the case of a limited liability partnership that knows, or has reasonable grounds to believe, that it has no registrable controller — the date on which the limited liability partnership knows, or has reasonable grounds to believe, that the limited liability partnership has no registrable controller; or ( b ) in the case of a limited liability partnership that knows, or has reasonable grounds to believe, that it has a registrable controller but has not been able to identify the registrable controller — the date on which the limited liability partnership, having taken the reasonable steps required by section 48(1), forms the opinion that it is unable to identify the registrable controller. (5) A limited liability partnership must, within the prescribed period after the date on which the limited liability partnership knows, or has reasonable grounds to believe, that any change in the particulars entered in its register of controllers under subsection (3)( b ) has occurred, update its register of controllers to reflect the change. (6) If a limited liability partnership mentioned in subsection (1) enters the particulars of a registrable controller in its register of controllers under section 47(6), the limited liability partnership must, at the same time, enter in its register of controllers a note stating — ( a ) that each partner with executive control of the limited liability partnership is no longer taken to be a registrable controller of the limited liability partnership under subsection (2); and ( b ) the date on which the particulars of the registrable controller were entered in its register of controllers under section 47(6). (7) If a limited liability partnership fails to comply with subsection (3), (4), (5) or (6), the limited liability partnership, and every partner of the limited liability partnership who is in default, shall each be guilty of an offence and shall each be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] (8) In this section, “partner with executive control”, in relation to a limited liability partnership, means a partner of the limited liability partnership who exercises executive control over the daily or regular affairs of the limited liability partnership through a senior management position. (9) Despite anything in this Part, a reference in section 47(6) or (7), 48(1) or (2), 49(1) or (7), 50(1), 50A(1) or (6), 51(1) or 52(1) to a controller or a registrable controller does not include a partner taken to be a registrable controller under subsection (2). [Act 23 of 2024 wef 16/06/2025] [Act 2 of 2022 wef 04/10/2022]"
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "48",
      "title": "Limited liability partnership’s duty to investigate and obtain information",
      "content": "48. —(1) A limited liability partnership must take reasonable steps to find out and identify the registrable controllers of the limited liability partnership. [16/2017] (2) A limited liability partnership ( A ) — ( a ) must give a notice to any person ( B ) whom A knows or has reasonable grounds to believe is a registrable controller in relation to A , requiring B — (i) to state whether B is or is not a registrable controller of A ; (ii) to state whether B knows or has reasonable grounds to believe that any other person ( C ) is a registrable controller of A or is likely to have that knowledge and to give such particulars of C that are within B ’s knowledge; and (iii) to provide such other information as may be prescribed; and ( b ) must give a notice to any person ( D ) whom A knows, or has reasonable grounds to believe knows, the identity of a person who is a registrable controller of A or who is likely to have that knowledge, requiring D — (i) to state whether D knows or has reasonable grounds to believe that any other person ( E ) is a registrable controller of A or is likely to have that knowledge and to give such particulars of E that are within D ’s knowledge; and (ii) to provide such other information as may be prescribed. [16/2017] (3) A notice mentioned in subsection (2) — ( a ) must state that the addressee must comply with the notice not later than the time prescribed for compliance; ( b ) must be in such form, contain such particulars and be sent in such manner, as may be prescribed; and ( c ) must be given within such period as may be prescribed after the limited liability partnership first knows the existence of, or first has reasonable grounds to believe that there exists, a person to whom a notice must be given under that subsection. [16/2017] (4) Subsection (2) does not require a limited liability partnership to give notice to any person in respect of any information that is required to be stated or provided pursuant to the notice if the information was previously provided by that person or by any registered corporate service provider on behalf of that person. [16/2017] [Act 22 of 2024 wef 09/06/2025] (5) If a limited liability partnership fails to comply with subsection (2) or (3), the limited liability partnership, and every partner of the limited liability partnership who is in default, shall each be guilty of an offence and shall each be liable on conviction to a fine not exceeding $25,000. [16/2017] [Act 23 of 2024 wef 16/06/2025] (6) An addressee of a notice under subsection (2) must comply with the notice within the time specified in the notice for compliance except that an addressee is not required to provide any information that is subject to legal privilege. [16/2017] (7) An addressee of a notice under subsection (2) who fails to comply with subsection (6) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [32G [16/2017]"
    },
    {
      "provision_ref": "s49",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "49",
      "title": "Limited liability partnership’s duty to keep information up‑to‑date",
      "content": "49. —(1) If a limited liability partnership knows or has reasonable grounds to believe that a relevant change has occurred in the particulars of a registrable controller that are stated in the limited liability partnership’s register of controllers, the limited liability partnership must give notice to the registrable controller — ( a ) to confirm whether or not the change has occurred; and ( b ) if the change has occurred — (i) to state the date of the change; and (ii) to provide the particulars of the change. [16/2017] (2) A limited liability partnership must give the notice mentioned in subsection (1) within such period as may be prescribed after it first knows of the change or first has reasonable grounds to believe that the change has occurred. [16/2017] (3) Section 48(3)( a ) and ( b ) applies to a notice under this section as it applies to a notice under that section. [16/2017] (4) Subsection (1) does not require a limited liability partnership to give notice to any person in respect of any information that was previously provided by that person or by any registered corporate service provider on behalf of that person. [16/2017] [Act 22 of 2024 wef 09/06/2025] (5) If a limited liability partnership fails to comply with subsection (1) or (2), or section 48(3)( a ) and ( b ) as applied by subsection (3), the limited liability partnership, and every partner of the limited liability partnership who is in default, shall each be guilty of an offence and shall each be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [16/2017] (6) An addressee of a notice under subsection (1) who fails to comply with the notice within the time specified in the notice for compliance shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [16/2017] (7) For the purposes of this section, a relevant change occurs if — ( a ) a person ceases to be a registrable controller in relation to the limited liability partnership; or ( b ) any other change occurs as a result of which the particulars of the registrable controller in the limited liability partnership’s register of controllers are incorrect or incomplete. [32H [16/2017]"
    },
    {
      "provision_ref": "s50",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "50",
      "title": "Limited liability partnership’s duty to correct information",
      "content": "50. —(1) If a limited liability partnership knows or has reasonable grounds to believe that any of the particulars of a registrable controller that are stated in the limited liability partnership’s register is incorrect, the limited liability partnership must give notice to the registrable controller to confirm whether the particulars are correct and, if not, to provide the correct particulars. [16/2017] (2) A limited liability partnership must give the notice mentioned in subsection (1) within such period as may be prescribed after it first knows or first has reasonable grounds to believe that the information is incorrect. [16/2017] (3) Section 48(3)( a ) and ( b ) applies to a notice under this section as it applies to a notice under that section. [16/2017] (4) Subsection (1) does not require a limited liability partnership to give notice to any person in respect of any information that was previously provided by that person or by any registered corporate service provider on behalf of that person. [16/2017] [Act 22 of 2024 wef 09/06/2025] (5) If a limited liability partnership fails to comply with subsection (1) or (2), or section 48(3)( a ) and ( b ) as applied by subsection (3), the limited liability partnership, and every partner of the limited liability partnership who is in default, shall each be guilty of an offence and shall each be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [16/2017] (6) An addressee of a notice under subsection (1) who fails to comply with the notice within the time specified in the notice for compliance shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [32I [16/2017]"
    },
    {
      "provision_ref": "s50A",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "50A",
      "title": "Limited liability partnership’s duty to ensure information in register is up‑to‑date and correct",
      "content": "50A. —(1) A limited liability partnership must, at the prescribed frequency, give a notice to each registrable controller whose particulars are stated in the limited liability partnership’s register of controllers for the following purposes: ( a ) to require the registrable controller to confirm whether or not a relevant change has occurred and, if the change has occurred, to — (i) state the date of the change; and (ii) provide the particulars of the change; ( b ) to require the registrable controller to confirm whether the stated particulars of the registrable controller are correct and, if not, to provide the correct particulars. (2) The notice mentioned in subsection (1) must — ( a ) state that the addressee must comply with the notice not later than the time specified for compliance (which must be the prescribed time); and ( b ) be in such form, contain such particulars and be sent in such manner, as may be prescribed. (3) An addressee of a notice under subsection (1) must comply with the notice no later than the time specified in the notice for compliance. (4) If a limited liability partnership fails to comply with subsection (1) or (2), the limited liability partnership, and every partner of the limited liability partnership who is in default, shall each be guilty of an offence and shall each be liable on conviction to a fine not exceeding $25,000. (5) An addressee of a notice under subsection (1) who fails to comply with subsection (3) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. (6) For the purposes of this section, a relevant change occurs if — ( a ) the registrable controller ceases to be one in relation to the limited liability partnership; or ( b ) any other change occurs as a result of which the particulars of the registrable controller stated in the limited liability partnership’s register of controllers are incorrect or incomplete. [Act 23 of 2024 wef 16/06/2025]"
    },
    {
      "provision_ref": "s51",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "51",
      "title": "Controller’s duty to provide information",
      "content": "51. —(1) A person who knows or ought reasonably to know that the person is a registrable controller in relation to a limited liability partnership must — ( a ) notify the limited liability partnership that the person is a registrable controller in relation to the limited liability partnership; ( b ) state the date, to the best of the person’s knowledge, on which the person became a registrable controller in relation to the limited liability partnership; and ( c ) provide such other information as may be prescribed. [16/2017] (2) The person mentioned in subsection (1) must comply with the requirements of that subsection within such period as may be prescribed after the date on which that person first knew or ought reasonably to have known that that person was a registrable controller. [16/2017] (3) A person need not comply with the requirements of subsection (1) if the person has received a notice from the limited liability partnership under section 48(2) and has complied with the requirements of the notice within the time specified in the notice for compliance. [16/2017] (4) If a person fails to comply with subsection (1) or (2), the person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [32J [16/2017]"
    },
    {
      "provision_ref": "s52",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "52",
      "title": "Controller’s duty to provide change of information",
      "content": "52. —(1) A person who is a registrable controller in relation to a limited liability partnership who knows, or ought reasonably to know, that a relevant change has occurred in the prescribed particulars of the registrable controller must notify the limited liability partnership of the relevant change — ( a ) stating the date that the change occurred; and ( b ) providing the particulars of the change. [16/2017] (2) The person mentioned in subsection (1) must comply with the requirements of that subsection within such period as may be prescribed after the date on which that person first knew or ought reasonably to have known of the relevant change. [16/2017] (3) A person need not comply with the requirements of subsection (1) if the person has received a notice from the limited liability partnership under section 49(1) and has complied with the requirements of the notice within the time specified in the notice for compliance. [16/2017] (4) Any person who fails to comply with subsection (1) or (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [16/2017] (5) For the purposes of this section, a relevant change occurs if — ( a ) a person ceases to be a registrable controller in relation to the limited liability partnership; or ( b ) there is a change in the person’s contact details or such other particulars as may be prescribed. [32K [16/2017]"
    },
    {
      "provision_ref": "s53",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "53",
      "title": "Power to enforce",
      "content": "53. —(1) The Registrar or an officer of the Authority may — ( a ) require a limited liability partnership to which this Part applies to produce its register and any other document relating to that register or the keeping of that register; ( b ) inspect, examine and make copies of the register and any document so produced; and ( c ) make any inquiry that may be necessary to ascertain whether the provisions of this Part are complied with. [16/2017] (2) Where any register or document mentioned in subsection (1) is kept in electronic form — ( a ) the power of the Registrar or an officer of the Authority in subsection (1)( a ) to require the register or any document to be produced includes the power to require a copy of the register or document to be made available in legible form and subsection (1)( b ) applies accordingly in relation to any copy so made available; and ( b ) the power of the Registrar or an officer of the Authority under subsection (1)( b ) to inspect the register or any document includes the power to require any person on the premises in question to give the Registrar or the officer of the Authority any assistance that the Registrar or officer may reasonably require to enable the Registrar or officer to inspect and make copies of the register or document in legible form, and to make records of the information contained in them. [16/2017] (3) The powers conferred on the Registrar or an officer of the Authority under subsections (1) and (2) may be exercised by a public agency to enable the public agency to administer or enforce any written law. [16/2017] (4) Any person who fails to comply with any requirement imposed under subsection (1) or (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] [16/2017] (4A) Despite section 79, a person who, in complying with a requirement imposed, or in answering an inquiry made, under subsection (1) or (2), provides any information that is false or misleading in a material particular to the Registrar or an officer of the Authority, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25,000. [Act 23 of 2024 wef 16/06/2025] (4B) In proceedings for an offence under subsection (4A), it is a defence to the charge for the accused to prove, on a balance of probabilities, that the accused took all reasonable steps and exercised all due diligence to ensure that the information provided was not false or misleading. [Act 23 of 2024 wef 16/06/2025] (5) This section applies in addition to any power of the Registrar or an inspector under section 77 or 78. [16/2017] (6) In this section, “public agency” means a public officer, an Organ of State or a ministry or department of the Government, or a public authority established by or under any public Act for a public purpose or a member, an officer or an employee, or any department, of the public authority. [32L [16/2017]"
    },
    {
      "provision_ref": "s54",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "54",
      "title": "Central register of controllers",
      "content": "54. —(1) This section applies where the Minister, by notification in the Gazette , directs the Registrar to maintain a central register of controllers of limited liability partnerships. [16/2017] (2) Where the Minister has directed the Registrar to maintain a central register of controllers of limited liability partnerships under subsection (1) — ( a ) the Registrar must keep a central register of controllers consisting of the particulars contained in the registers kept by limited liability partnerships to which this Part applies; and ( b ) the Registrar may require any limited liability partnership to which this Part applies to lodge with the Registrar — (i) all particulars contained in the limited liability partnership’s register maintained under section 47 (including the matters mentioned in section 47A(3)); and [Act 2 of 2022 wef 04/10/2022] (ii) all updates to the limited liability partnership’s register that occur after the lodgment of the particulars under sub‑paragraph (i). [16/2017] (3) Where the Registrar requires a limited liability partnership to lodge with the Registrar the particulars, matters and updates mentioned in subsection (2)( b ), the limited liability partnership must lodge the particulars, matters and updates in the prescribed form and manner and within the prescribed time. [Act 2 of 2022 wef 30/05/2022] (4) If a limited liability partnership fails to comply with subsection (3), the limited liability partnership, and every partner of the limited liability partnership who is in default, shall each be guilty of an offence and shall each be liable on conviction to a fine not exceeding $25,000. [16/2017] [Act 2 of 2022 wef 30/05/2022] [Act 23 of 2024 wef 16/06/2025] (5) Subject to subsection (6), the Registrar must not disclose, or make available for inspection, the central register of controllers of limited liability partnerships kept by the Registrar under this section to any member of the public. [Act 23 of 2024 wef 16/06/2025] (6) The Registrar may disclose prescribed information in the central register of controllers of limited liability partnerships to prescribed persons under prescribed circumstances. [Act 23 of 2024 wef 16/06/2025] (7) To avoid doubt, different information and persons may be prescribed under subsection (6) for different prescribed circumstances. [Act 23 of 2024 wef 16/06/2025] [32M [16/2017]"
    },
    {
      "provision_ref": "s55",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "55",
      "title": "Codes of practice, etc.",
      "content": "55. —(1) The Registrar may issue one or more codes, guidance, guidelines, policy statements and practice directions for all or any of the following purposes: ( a ) to provide guidance to limited liability partnerships in relation to the operation or administration of any provision of this Part; ( b ) generally for carrying out the purposes of this Part. [16/2017] (2) The Registrar may publish any such code, guidance, guideline, policy statement or practice direction, in such manner as the Registrar thinks fit. [16/2017] (3) The Registrar may revoke, vary, revise or amend the whole or any part of any code, guidance, guideline, policy statement or practice direction issued under this section in such manner as the Registrar thinks fit. [16/2017] (4) Where amendments are made under subsection (3) — ( a ) the other provisions of this section apply, with the necessary modifications, to the amendments as they apply to the code, guidance, guideline, policy statement and practice direction; and ( b ) any reference in this Act or any other written law to the code, guidance, guideline, policy statement or practice direction however expressed is to be treated, unless the context otherwise requires, as a reference to the code, guidance, guideline, policy statement or practice direction as so amended. [16/2017] (5) The failure by any person to comply with any of the provisions of a code, guidance, guideline, policy statement or practice direction issued under this section that applies to that person does not of itself render that person liable to criminal proceedings but any such failure may, in any proceedings whether civil or criminal, be relied upon by any party to the proceedings as tending to establish or to negate any liability which is in question in the proceedings. [16/2017] (6) Any code, guidance, guideline, policy statement or practice direction issued under this section — ( a ) may be of general or specific application; and ( b ) may specify that different provisions apply to different circumstances or provide for different cases or classes of cases. [16/2017] (7) It is not necessary to publish any code, guidance, guideline, policy statement or practice direction issued under this section in the Gazette . [32N [16/2017]"
    },
    {
      "provision_ref": "s56",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "56",
      "title": "Exemption",
      "content": "56. The Minister may, by order in the Gazette , exempt any person or class of persons from all or any of the provisions of this Part. [32O [16/2017]"
    },
    {
      "provision_ref": "s57",
      "chapter": "PART 6A - REGISTER OF CONTROLLERS",
      "section": "57",
      "title": "Amendment of Sixth and Seventh Schedules",
      "content": "57. —(1) The Minister may, by order in the Gazette , amend — ( a ) the Sixth Schedule in relation to the list of limited liability partnerships to which this Part does not apply; and ( b ) the Seventh Schedule in relation to the meanings of “significant control” and “significant interest”. [16/2017] (2) All orders made under this section must be presented to Parliament as soon as possible after publication in the Gazette . [32P [16/2017]"
    },
    {
      "provision_ref": "s58",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "58",
      "title": "Restriction on undischarged bankrupt being manager of limited liability partnership",
      "content": "58. —(1) Any person who, being an undischarged bankrupt (whether adjudicated bankrupt by a court in Singapore or elsewhere), acts as manager of any limited liability partnership without the permission of the General Division of the High Court or the written permission of the Official Assignee, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [40/2019] [Act 25 of 2021 wef 01/04/2021] (2) On an application by an undischarged bankrupt under subsection (1) to the General Division of the High Court or the Official Assignee, the General Division of the High Court or the Official Assignee (as the case may be) may refuse the application or approve the application subject to any conditions that the General Division of the High Court or the Official Assignee may impose. [40/2019] (3) The permission of the General Division of the High Court for the purpose of this section is not to be given unless notice of intention to apply for permission has been served on the Official Assignee and the Official Assignee is heard on the application. [33 [40/2019] [Act 25 of 2021 wef 01/04/2021]"
    },
    {
      "provision_ref": "s59",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "59",
      "title": "Disqualification of unfit managers of insolvent limited liability partnerships",
      "content": "59. —(1) The General Division of the High Court may — ( a ) on the application of the Minister or the Official Receiver as provided for in subsection (11); and ( b ) on being satisfied as to the matters referred to in subsection (2), make an order disqualifying a person specified in the order from being a manager of a limited liability partnership for a period specified in the order not exceeding 5 years from the date of the making of the order (called in this section a disqualification order). [40/2019] (2) The General Division of the High Court is to make a disqualification order under subsection (1) if it is satisfied that — ( a ) the person against whom the order is sought has been given at least 14 days’ notice of the application for the order; ( b ) the person is or has been a manager of a limited liability partnership which has gone into liquidation (whether while the person was a manager or within 3 years of the person ceasing to be a manager of the limited liability partnership) and which was insolvent at the date of its liquidation; and ( c ) the person’s conduct as a manager of that limited liability partnership taken alone or taken together with the person’s conduct as a manager of any other limited liability partnership or a director of any other corporation makes the person unfit to be a manager of a limited liability partnership. [40/2019] (3) If in the case of a person who is or has been a manager of a limited liability partnership which is — ( a ) being wound up by the General Division of the High Court, it appears to the Official Receiver or to the liquidator, if the liquidator is not the Official Receiver; or ( b ) being wound up otherwise than as mentioned in paragraph ( a ), it appears to the liquidator, that the conditions mentioned in subsection (2)( b ) and ( c ) are satisfied as respects that person, the Official Receiver or the liquidator (as the case may be) must immediately report the matter to the Minister. [40/2019] (4) The Minister may require the Official Receiver or the liquidator or the former liquidator of a limited liability partnership to — ( a ) provide the Minister with any information with respect to any person’s conduct as a manager of the limited liability partnership; and ( b ) produce and permit inspection of any books, papers and other records relevant to that person’s conduct as such a manager, that the Minister may reasonably require for the purpose of exercising or determining whether to exercise any of the Minister’s functions under this section. (5) If any person fails to comply with any requirement under subsection (4), the General Division of the High Court may, on the Minister’s application, make an order requiring that person to make good the default within the time specified in the order. [40/2019] (6) For the purposes of this section — ( a ) the date of liquidation of a limited liability partnership is — (i) if the limited liability partnership is wound up by the General Division of the High Court, the date of the filing of the winding up application; (ii) where a provisional liquidator is appointed under paragraph 37 of the Fifth Schedule, the date the declaration made under that paragraph is lodged with the Registrar; and (iii) in any other case, the date of the passing of the resolution for winding up; ( b ) a limited liability partnership is taken to be insolvent if it is unable to pay its debts, within the meaning of that expression in paragraph 3(2) of the Fifth Schedule; and ( c ) references to a person’s conduct as a manager of any limited liability partnership or director of any corporation include, where any of those entities have become insolvent, references to that person’s conduct in relation to any matter connected with or arising out of the insolvency of that entity. [40/2019] (7) In deciding whether a person’s conduct as a manager of any particular limited liability partnership makes the person unfit to be a manager of a limited liability partnership as is mentioned in subsection (2)( c ), the General Division of the High Court, in relation to the person’s conduct as a manager of that limited liability partnership, is to have regard — ( a ) generally to the matters mentioned in subsection (8); and ( b ) in particular, to the matters mentioned in subsection (9), even though the manager has not been convicted or may not be criminally liable in respect of any of these matters. [40/2019] (8) The matters mentioned in subsection (7)( a ) to which the General Division of the High Court is to have regard generally are — ( a ) whether there has been any misfeasance or breach of any fiduciary or other duty by the manager in relation to the limited liability partnership; ( b ) whether there has been any misapplication or retention by the manager of, or any conduct by the manager giving rise to an obligation to account for, any money or other property of the limited liability partnership; and ( c ) the extent of the manager’s responsibility for any failure by the limited liability partnership to comply with any provision of this Act. [40/2019] (9) The matters mentioned in subsection (7)( b ) to which the General Division of the High Court is to have regard in particular are — ( a ) the extent of the manager’s responsibility for the causes of the limited liability partnership becoming insolvent; ( b ) the extent of the manager’s responsibility for any failure by the limited liability partnership to supply any goods or services which have been paid for (in whole or in part); ( c ) the extent of the manager’s responsibility for the limited liability partnership entering into any transaction liable to be set aside under paragraph 8(1) of the Fifth Schedule; and ( d ) whether the causes of the limited liability partnership becoming insolvent are attributable to its carrying on business in a particular industry where the risk of insolvency is generally recognised to be higher. [40/2019] (10) The Minister may, by order in the Gazette , add to, vary or amend the matters mentioned in subsection (8) or (9) and that order may contain any transitional provisions that appear to the Minister to be necessary or expedient. (11) In the case of a person who is or has been a manager of a limited liability partnership which has gone into liquidation and is being wound up by the General Division of the High Court, an application under this section must be made by the Official Receiver but in any other case an application must be made by the Minister. [40/2019] (12) On a hearing of an application under this section — ( a ) the Minister or the Official Receiver (as the case may be) must appear and call the attention of the General Division of the High Court to any matter which appears to him or her to be relevant (and for this purpose the Minister may be represented) and may give evidence or call witnesses; and ( b ) the person against whom an order is sought may appear and personally give evidence or call witnesses. [40/2019] (13) A person who acts as receiver or receiver and manager is not liable to have a disqualification order made against the person in respect of acts done in the person’s capacity as receiver or receiver and manager, as the case may be. (14) Nothing in this section prevents a person who is disqualified pursuant to an order made under subsection (1) from applying for permission of the General Division of the High Court to be a manager of a limited liability partnership. [40/2019] [Act 25 of 2021 wef 01/04/2021] (15) On the hearing of an application made under subsection (14), the Minister or the Official Receiver must appear (and for this purpose the Minister may be represented) and call the attention of the General Division of the High Court to any matter which appears to him or her to be relevant to the application and may himself or herself give evidence or call witnesses. [40/2019] (16) Any person who contravenes a disqualification order made under this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [34"
    },
    {
      "provision_ref": "s60",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "60",
      "title": "Disqualification of managers of limited liability partnerships wound up on grounds of national security or interest",
      "content": "60. —(1) Subject to subsections (2) and (3), where a limited liability partnership is ordered to be wound up by the General Division of the High Court under paragraph 3(1)( f ) of the Fifth Schedule on the ground that it is being used for purposes against national security or interest, the General Division of the High Court may, on the application of the Minister, make an order (called in this section a disqualification order) disqualifying any person who is a manager of that limited liability partnership from being a manager of any limited liability partnership for a period of 3 years from the date of the making of the winding up order. [40/2019] (2) A disqualification order is not to be made by the General Division of the High Court against any person under subsection (1) unless the General Division of the High Court is satisfied that the person against whom the order is sought has been given at least 14 days’ notice of the Minister’s application for the order. [40/2019] (3) A disqualification order is not to be made by the General Division of the High Court against any person under subsection (1) if the person proves to the satisfaction of the General Division of the High Court that — ( a ) the limited liability partnership had been used for purposes against national security or interest without the person’s consent or connivance; and ( b ) the person had exercised such diligence to prevent the limited liability partnership from being so used as the person ought to have exercised having regard to the nature of the person’s function in that capacity and to all the circumstances. [40/2019] (4) Any person who contravenes a disqualification order made under subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [35"
    },
    {
      "provision_ref": "s61",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "61",
      "title": "Disqualification to act as manager on conviction for certain offences",
      "content": "61. —(1) Where a person is convicted (whether in Singapore or elsewhere) of any offence involving fraud or dishonesty punishable with imprisonment for 3 months or more, the person is subject to the disqualifications provided in subsection (3). (2) Where a person is convicted in Singapore of — ( a ) any offence in connection with the formation or management of a limited liability partnership; or ( b ) any offence under paragraph 93 of the Fifth Schedule, the court may make a disqualification order in addition to any other sentence imposed. [35/2014] (3) Subject to any permission which the General Division of the High Court may give pursuant to an application under subsection (5), a person who — ( a ) is disqualified under subsection (1); or ( b ) has had a disqualification order made against the person under subsection (2), must not act as a manager of a limited liability partnership during the period of the disqualification or disqualification order. [35/2014; 40/2019] [Act 25 of 2021 wef 01/04/2021] (4) Where a disqualified person — ( a ) has not been sentenced to imprisonment, the disqualifications in subsection (3) take effect upon conviction and continue for a period of 5 years or for such shorter period as the court may order under subsection (2); ( b ) has been sentenced to imprisonment, the disqualifications in subsection (3) take effect upon conviction and continue for a period of 5 years after his or her release from prison. (5) A person who — ( a ) is disqualified under subsection (1); or ( b ) has had a disqualification order made against the person under subsection (2), may apply to the General Division of the High Court for permission to act as a manager of a limited liability partnership during the period of the disqualification or disqualification order, upon giving the Minister at least 14 days’ notice of the person’s intention to apply for such permission. [35/2014; 40/2019] [Act 25 of 2021 wef 01/04/2021] (6) On the hearing of any application under subsection (5), the Minister may be represented at the hearing and may oppose the granting of the application. [35/2014] (7) A person who contravenes subsection (3) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [35/2014] (8) Without affecting section 87, a District Court may make a disqualification order under this section. [36"
    },
    {
      "provision_ref": "s62",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "62",
      "title": "Disqualification under Companies Act 1967",
      "content": "62. —(1) Subject to any permission which the General Division of the High Court may give pursuant to an application under subsection (2), a person who is subject to a disqualification or disqualification order under section 149, 149A or 154 of the Companies Act 1967 must not act as manager of a limited liability partnership during the period of the disqualification or disqualification order. [35/2014; 40/2019] [Act 25 of 2021 wef 01/04/2021] (2) A person who is subject to a disqualification or disqualification order under section 149 or 154 of the Companies Act 1967 may apply to the General Division of the High Court for permission to act as a manager of a limited liability partnership during the period of the disqualification or disqualification order, upon giving the Minister at least 14 days’ notice of the person’s intention to apply for such permission. [35/2014; 40/2019] [Act 25 of 2021 wef 01/04/2021] (3) On the hearing of any application under subsection (2), the Minister may be represented at the hearing and may oppose the granting of the application. [35/2014] (4) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [37"
    },
    {
      "provision_ref": "s63",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "63",
      "title": "Power of Registrar to strike defunct limited liability partnership off register",
      "content": "63. —(1) Where the Registrar has reasonable cause to believe that a limited liability partnership is not carrying on business or is not in operation, the Registrar may send to the limited liability partnership and its managers and partners a letter to that effect and stating that, if an answer showing cause to the contrary is not received within 30 days after the date of the letter, a notice will be published in the Gazette with a view to striking the name of the limited liability partnership off the register. [35/2014] (2) Unless the Registrar receives an answer within 30 days after the date of the letter to the effect that the limited liability partnership is carrying on business or is in operation, the Registrar may publish in the Gazette and send to the limited liability partnership by registered post a notice that at the expiry of 60 days after the date of that notice the name of the limited liability partnership mentioned in the notice will, unless cause is shown to the contrary in the form and manner specified in section 66, be struck off the register and the limited liability partnership will be dissolved. [35/2014] (3) If in any case where a limited liability partnership is being wound up the Registrar has reasonable cause to believe that — ( a ) no liquidator is acting; ( b ) the affairs of the limited liability partnership are fully wound up and, for a period of 6 months, the liquidator has been in default in lodging any return required to be made by the liquidator; or ( c ) the affairs of the limited liability partnership have been fully wound up under Part 2 of the Fifth Schedule and there are no assets or the assets available are not sufficient to pay the costs of obtaining an order of the General Division of the High Court dissolving the limited liability partnership, the Registrar may publish in the Gazette and send to the limited liability partnership or the liquidator (if any) a notice to the same effect as that mentioned in subsection (2). [40/2019] (4) At the expiry of the time mentioned in the notice, the Registrar may, unless cause to the contrary is previously shown, strike the name of the limited liability partnership off the register, and must publish notice thereof in the Gazette . (5) On the publication in the Gazette of the notice mentioned in subsection (4), the limited liability partnership is dissolved; but — ( a ) the liability (if any) of every officer and partner of the limited liability partnership shall continue and may be enforced as if the limited liability partnership had not been dissolved; and ( b ) nothing in this subsection affects the power of the General Division of the High Court to wind up a limited liability partnership the name of which has been struck off the register. [40/2019] (6) If any person feels aggrieved by the name of the limited liability partnership having been struck off the register, the General Division of the High Court, on an application made by the person at any time within 6 years after the striking off, may order the name of the limited liability partnership to be restored to the register if the General Division of the High Court is satisfied that — ( a ) the limited liability partnership was, at the time of the striking off, carrying on business or in operation; or ( b ) it is just, that the name of the limited liability partnership be restored to the register. [35/2014; 40/2019] (7) Upon a copy of the order referred to in subsection (6) being lodged with the Registrar, the limited liability partnership is deemed to have continued in existence as if its name had not been struck off, and the General Division of the High Court may by the order give such directions and make such provisions as seem just for placing the limited liability partnership and all other persons in the same position as nearly as may be as if the name of the limited liability partnership had not been struck off. [40/2019] (8) A notice to be sent under this section to a liquidator may be addressed to the liquidator at the liquidator’s last known place of business, and a letter or notice to be sent under this section to a limited liability partnership may be addressed to the limited liability partnership at its registered office or, if no office has been registered, to the care of any officer of the limited liability partnership. (9) The Registrar must ensure that — ( a ) such particulars of the limited liability partnership mentioned in subsection (1) and of his or her belief that the limited liability partnership is not carrying on business or is not in operation, as he or she may determine, is sent to — (i) the Inland Revenue Authority of Singapore established under the Inland Revenue Authority of Singapore Act 1992; and (ii) the Central Provident Fund Board established under the Central Provident Fund Act 1953; and ( b ) the substance of the notices to be published in the Gazette under subsections (2), (3) and (4) is also published on the Authority’s website. [35/2014] (10) The provisions of the Fifth Schedule relating to — ( a ) the dissolution of a limited liability partnership apply to a limited liability partnership struck off the register under this section; and ( b ) the remedies against the property of a limited liability partnership and the priorities of debts bind the Government. [38"
    },
    {
      "provision_ref": "s64",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "64",
      "title": "Striking off on application by limited liability partnership",
      "content": "64. —(1) The Registrar may, on the application by a limited liability partnership, strike the limited liability partnership’s name off the register on such grounds and subject to such conditions as may be prescribed. [35/2014] (2) An application under subsection (1) is to be made on the limited liability partnership’s behalf by its partners or by a majority of them. [35/2014] (3) Upon receipt of the application, the Registrar must, if satisfied that the grounds and conditions (if any) mentioned in subsection (1) are satisfied, send to the limited liability partnership and its partners and managers a letter informing them of the application and stating that if an answer showing cause to the contrary in the form and manner specified in section 66 is not received within 30 days after the date of the letter, a notice, details of which are set out in subsection (4), will be published in the Gazette with a view to striking the name of the limited liability partnership off the register. [35/2014] (4) The Registrar may not strike a limited liability partnership’s name off the register under this section until after the expiry of 60 days after the publication by the Registrar in the Gazette of a notice — ( a ) stating that the Registrar intends to exercise the power under this section in relation to the limited liability partnership; and ( b ) inviting any person to show cause why that should not be done within such period as may be prescribed. [35/2014] (5) If no person shows cause or sufficient cause within the period mentioned in subsection (4)( b ) as to why the name of the limited liability partnership should not be struck off the register, the Registrar must strike off the name of the limited liability partnership from the register and publish a notice in the Gazette of the limited liability partnership’s name having been so struck off. [35/2014] (6) On the publication of the notice in the Gazette under subsection (5), the limited liability partnership is dissolved. [35/2014] (7) Despite the dissolution of the limited liability partnership under subsection (6) — ( a ) the liability (if any) of every officer and partner of the limited liability partnership shall continue and may be enforced as if the limited liability partnership had not been dissolved; and ( b ) nothing in this section affects the power of the General Division of the High Court to wind up a limited liability partnership the name of which has been struck off the register. [35/2014; 40/2019] (8) The Registrar must ensure that — ( a ) such particulars of the limited liability partnership and of the application mentioned in subsection (1), as he or she may determine, is sent to — (i) the Inland Revenue Authority of Singapore established under the Inland Revenue Authority of Singapore Act 1992; and (ii) the Central Provident Fund Board established under the Central Provident Fund Act 1953; and ( b ) the substance of the notices to be published in the Gazette under subsections (4) and (5) is also published on the Authority’s website. [35/2014] (9) The Registrar may, for the purposes of this section, send notices to the limited liability partnership by ordinary post or in any other prescribed manner. [38A [35/2014]"
    },
    {
      "provision_ref": "s65",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "65",
      "title": "Withdrawal of application",
      "content": "65. —(1) The applicant or applicants may, by written notice to the Registrar, withdraw an application to strike a limited liability partnership’s name off the register under section 64 at any time before the limited liability partnership’s name is struck off the register. [35/2014] (2) Upon receipt of the notice mentioned in subsection (1), the Registrar must — ( a ) send to the limited liability partnership by ordinary post a notice that the application to strike the limited liability partnership’s name off the register has been withdrawn; and ( b ) publish a notice on the Authority’s website that the application to strike the limited liability partnership’s name off the register has been withdrawn. [38B [35/2014]"
    },
    {
      "provision_ref": "s66",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "66",
      "title": "Objections to striking off",
      "content": "66. —(1) Where a notice is given or published by the Registrar under section 63(2) or 64(4) of the Registrar’s intention to strike the limited liability partnership’s name off the register, any person may deliver, not later than the date specified in the notice, an objection to the striking off on the ground that there is reasonable cause why the name of the limited liability partnership should not be so struck off, including that the limited liability partnership does not satisfy any of the prescribed grounds for striking off referred to in section 63(1) or 64(1). [35/2014] (2) An objection to the striking off mentioned in subsection (1) must be given to the Registrar by notice in the prescribed form and manner. [35/2014] (3) Upon receipt of a notice of objection, which is made in the prescribed form and manner, within the time referred to in subsection (1), the Registrar must — ( a ) where applicable, give the applicant or applicants of an application for striking the name of the limited liability partnership off the register notice of the objection; and ( b ) in deciding whether to allow the objection, take into account such considerations as may be prescribed. [38C [35/2014]"
    },
    {
      "provision_ref": "s67",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "67",
      "title": "Application for administrative restoration to register",
      "content": "67. —(1) Subject to such conditions as may be prescribed, an application may be made to the Registrar to restore to the register the name of a limited liability partnership whose name has been struck off the register by the Registrar under section 63, if no application has been or is being made to the General Division of the High Court to restore the name of the limited liability partnership to the register under section 63(6). [35/2014; 40/2019] (2) An application under this section may be made whether or not the limited liability partnership has in consequence been dissolved. [35/2014] (3) An application under this section may only be made by a former partner of the limited liability partnership. [35/2014] (4) An application under this section is not valid unless the application is received by the Registrar within 6 years after the date on which the limited liability partnership is dissolved. [38D [35/2014]"
    },
    {
      "provision_ref": "s68",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "68",
      "title": "Registrar’s decision on application for administrative restoration",
      "content": "68. —(1) The Registrar must give notice to the applicant of the decision on an application under section 67. [35/2014] (2) If the Registrar’s decision is that the name of the limited liability partnership should be restored to the register — ( a ) the restoration takes effect as from the date that notice is sent; and ( b ) the Registrar must — (i) enter in the register a note of the date on which the restoration takes effect; and (ii) cause notice of the restoration to be published in the Gazette and on the Authority’s website. [35/2014] (3) The notice under subsection (2)( b )(ii) must state — ( a ) the name of the limited liability partnership or, if the limited liability partnership is restored to the register under a different name, that name and its former name; ( b ) the limited liability partnership’s registration number; and ( c ) the date on which the restoration of the name of the limited liability partnership to the register takes effect. [35/2014] (4) If the Registrar’s decision is that the name of the limited liability partnership should not be restored to the register, the person who made the application under section 67 or any other person aggrieved by the Registrar’s decision may appeal to the General Division of the High Court. [35/2014; 40/2019] (5) On an appeal made under subsection (4), the General Division of the High Court may — ( a ) confirm the Registrar’s decision; or ( b ) restore the name of the limited liability partnership to the register and give any directions and make any orders that the General Division of the High Court is empowered to give and make under section 70(3). [38E [35/2014; 40/2019]"
    },
    {
      "provision_ref": "s69",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "69",
      "title": "Registrar may restore limited liability partnership deregistered by mistake",
      "content": "69. —(1) The Registrar may, on his or her own initiative, restore the name of a limited liability partnership to the register if he or she is satisfied that the name of the limited liability partnership has been struck off the register and the limited liability partnership is dissolved under section 63 or 64 as a result of a mistake of the Registrar. [35/2014] (2) In subsection (1), a reference to a mistake of the Registrar excludes a mistake that is made on the basis of wrong, false or misleading information given by the applicant in connection with the application for striking the name of the limited liability partnership off the register under section 64. [35/2014] (3) The Registrar may restore the name of a limited liability partnership to the register by publishing in the Gazette and on the Authority’s website a notice declaring the restoration, and the restoration takes effect on the date of publication of the notice. [38F [35/2014]"
    },
    {
      "provision_ref": "s70",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "70",
      "title": "Effect of restoration",
      "content": "70. —(1) If the name of a limited liability partnership is restored to the register under section 68(2) or 69, or on appeal to the General Division of the High Court under section 68(5), the limited liability partnership is regarded as having continued in existence as if its name had not been struck off the register. [35/2014; 40/2019] (2) The limited liability partnership is not liable to a penalty under section 30(5) for failing to lodge its annual declaration referred to in section 30(1) within the time or extended time referred to in section 30(3) and (4), if such time or extended time ended — ( a ) after the date of dissolution or striking off; and ( b ) before the restoration of the name of the limited liability partnership to the register. [35/2014] (3) On the application by any person, the General Division of the High Court may give any directions and make any orders that seem just for placing the limited liability partnership and all other persons in the same position (as nearly as may be) as if the limited liability partnership had not been dissolved or its name had not been struck off the register. [35/2014; 40/2019] (4) An application to the General Division of the High Court for such directions or orders may be made any time within 3 years after the date of restoration of the name of the limited liability partnership to the register. [38G [35/2014; 40/2019]"
    },
    {
      "provision_ref": "s71",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "71",
      "title": "Retention of books and papers upon striking off",
      "content": "71. —(1) Where the name of a limited liability partnership has been struck off and the limited liability partnership dissolved under section 63 or 64, a person who was a partner or manager of the limited liability partnership immediately before the limited liability partnership was dissolved must ensure that all books and papers of the limited liability partnership are retained for a period of at least 5 years after the date on which the limited liability partnership was dissolved. [16/2017] (2) A person who breaches subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000. [38H [16/2017]"
    },
    {
      "provision_ref": "s72",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "72",
      "title": "False representation as to registration as limited liability partnership",
      "content": "72. If any person in any way holds out that a business is registered as a limited liability partnership under this Act, that person shall, unless at that time the business was duly registered as a limited liability partnership under this Act, be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [39 [35/2014]"
    },
    {
      "provision_ref": "s73",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "73",
      "title": "Rectification by General Division of High Court",
      "content": "73. —(1) Where it appears to the General Division of the High Court, as a result of evidence adduced before it by an applicant limited liability partnership, that any particular recorded in a register is erroneous or defective, the General Division of the High Court may, by order, direct the Registrar to rectify the register on such terms and conditions as seem to the General Division of the High Court just and expedient and that are specified in the order, and the Registrar must, upon receipt of the order, rectify the register accordingly. [35/2014; 40/2019] (2) An order of the General Division of the High Court made under subsection (1) may require that a fresh document, showing the rectification, be filed by the applicant limited liability partnership with the Registrar, together with a copy of the order of the General Division of the High Court and a copy of the application to the General Division of the High Court. [40 [40/2019]"
    },
    {
      "provision_ref": "s74",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "74",
      "title": "Rectification by Registrar on application",
      "content": "74. —(1) Despite section 73, an officer of a limited liability partnership may lodge a notice with the Registrar of — ( a ) any error contained in any document relating to the limited liability partnership filed or lodged with the Registrar; or ( b ) any error in the filing or lodgment of any document relating to the limited liability partnership with the Registrar. [35/2014] (2) The Registrar may rectify the register on receiving any notice mentioned in subsection (1) and if satisfied that — ( a ) the error mentioned in subsection (1)( a ) is typographical or clerical in nature; or ( b ) the error mentioned in subsection (1)( b ) is, in the Registrar’s opinion, unintended and does not prejudice any person. [35/2014] (3) In rectifying the register under subsection (2), the Registrar must not expunge any document from the register. [35/2014] (4) The decision made by the Registrar on whether to rectify the register under subsection (2) is final. [40A [35/2014]"
    },
    {
      "provision_ref": "s75",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "75",
      "title": "Rectification or updating on Registrar’s initiative",
      "content": "75. —(1) The Registrar may rectify or update any particulars or document contained in a register, if the Registrar is satisfied that — ( a ) there is a defect or an error in the particulars or document arising from any grammatical, typographical or similar mistake; or ( b ) there is evidence of a conflict between the particulars of a limited liability partnership or person and — (i) other information in the register relating to that limited liability partnership or person; or (ii) other information relating to that limited liability partnership or person obtained from such department or Ministry of the Government, or statutory body or other body corporate as may be prescribed. [35/2014] (2) Before the Registrar rectifies or updates the register under subsection (1), the Registrar must, except under prescribed circumstances, give written notice to the limited liability partnership or person whose documents or particulars are to be rectified or updated of the Registrar’s intention to do so, and state in the notice — ( a ) the reasons for and details of the proposed rectification or updating to be made to the register; and ( b ) the date by which any written objection to the proposed rectification or updating must be delivered to the Registrar, being a date at least 30 days after the date of the notice. [35/2014] (3) The limited liability partnership or person notified under subsection (2) may deliver to the Registrar, not later than the date specified under subsection (2)( b ), a written objection to the proposed rectification or updating of the register. [35/2014] (4) The Registrar must not rectify or update the register if the Registrar receives a written objection under subsection (3) to the proposed rectification or updating by the date specified under subsection (2)( b ), unless the Registrar is satisfied that the objection is frivolous or vexatious or has been withdrawn. [35/2014] (5) The Registrar may rectify or update the register if the Registrar does not receive a written objection under subsection (3) by the date specified under subsection (2)( b ). [35/2014] (6) The Registrar may include any notation that the Registrar thinks fit in the register for the purposes of providing information relating to any error or defect in any particulars or document in the register, and may remove the notation if the Registrar is satisfied that it no longer serves any useful purpose. [35/2014] (7) Despite anything in this section, the Registrar may, if the Registrar is satisfied that there is any error or defect in any particulars or document in the register, by written notice, request that the limited liability partnership to which the particulars or document relates, its partners or its officers take such steps within such time as the Registrar may specify to ensure that the error or defect is rectified. [40B [35/2014]"
    },
    {
      "provision_ref": "s76",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "76",
      "title": "Electronic transaction system",
      "content": "76. —(1) The Registrar may — ( a ) require or permit any person to carry out any transaction with the Registrar under this Act; and ( b ) issue any approval, certificate, notice, determination or other document pursuant or connected to a transaction mentioned in paragraph ( a ), using the electronic transaction system established under Part 6A of the Accounting and Corporate Regulatory Authority Act 2004. [18/2014] (2) In this section, “transaction”, in relation to the Registrar, means — ( a ) the filing or lodging of any document with the Registrar, or the submission, production, delivery, provision or sending of any document to the Registrar; ( b ) any making of any application, submission or request to the Registrar; ( c ) any provision of any undertaking or declaration to the Registrar; and ( d ) any extraction, retrieval or accessing of any document, record or information maintained by the Registrar. [41 [18/2014]"
    },
    {
      "provision_ref": "s77",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "77",
      "title": "Inspection",
      "content": "77. —(1) The Registrar may authorise in writing any officer or employee of the Authority or any public officer to be an inspector for the purposes of this Act. (2) For the purposes of ascertaining whether the provisions of this Act are being complied with, the Registrar or any inspector has power at all reasonable times to enter into any premises at which he or she has reason to believe any person is carrying on business and to make any examination and inquiry that may be necessary for those purposes. (3) The Registrar and every inspector when exercising any power under this Act must declare his or her office and produce his or her written authority to any person affected by the exercise of that power. (4) Any person who fails to comply with a request made by the Registrar or an inspector or resists or obstructs the Registrar or an inspector in the performance of his or her duties under this Act shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both. (5) It is not an offence for any person to refuse to comply with any request made by the Registrar or an inspector, or to resist or obstruct the Registrar or an inspector in the performance of any of his or her duties under this Act, if the Registrar or inspector fails to declare his or her office and to produce his or her written authority. [43"
    },
    {
      "provision_ref": "s78",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "78",
      "title": "Power of Registrar to obtain further information",
      "content": "78. —(1) In order to obtain such information as the Registrar may consider necessary for the purposes of carrying out the provisions of this Act, the Registrar may — ( a ) require any past or present partner or manager of a limited liability partnership to answer any question in writing which the Registrar considers necessary to ask for the purposes specified in this subsection; or ( b ) summon that person to appear before him or her or an inspector or any other public officer whom the Registrar may designate to answer any such question orally. (2) The Registrar may further require the person referred to in subsection (1) to make such further declaration or supply such further particulars as the Registrar may require. (3) Any person who, without lawful excuse, fails to comply with any summons or requirement of the Registrar under this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both. [44"
    },
    {
      "provision_ref": "s79",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "79",
      "title": "Penalty for providing false information to Registrar",
      "content": "79. Any person who makes any statement or provides any information to the Registrar under the provisions of this Act which is false in any material particular or by reason of the omission of any material particular and which the person either knows or has reason to believe is false, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [45"
    },
    {
      "provision_ref": "s80",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "80",
      "title": "Composition of offences",
      "content": "80. —(1) The Registrar may compound any offence under this Act that is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum not exceeding one half of the amount of the maximum fine that is prescribed for the offence, or a sum not exceeding $5,000, whichever is lower. (2) The Minister may make regulations to prescribe the offences that may be compounded. (3) All sums collected under this section must be paid to the Authority. [46"
    },
    {
      "provision_ref": "s81",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "81",
      "title": "Officers and inspectors deemed to be public servants",
      "content": "81. All officers and inspectors appointed under this Act are deemed to be public servants for the purposes of the Penal Code 1871. [47"
    },
    {
      "provision_ref": "s82",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "82",
      "title": "Destruction of old records",
      "content": "82. The Registrar may destroy or give to the National Archives of Singapore any document lodged, filed or registered with the Registrar and which has been microfilmed or converted to electronic form if in the Registrar’s opinion it is no longer necessary or desirable to retain the document. [48"
    },
    {
      "provision_ref": "s83",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "83",
      "title": "Enforcement of duty to make returns",
      "content": "83. —(1) If any person is in default in complying with — ( a ) any provision of this Act or of any other law which requires the lodging or filing in any manner with the Registrar of any return, account or other document or the giving of notice to the Registrar of any matter; ( b ) any request of the Registrar to amend or complete and resubmit any document or to submit a fresh document; or ( c ) any request of the Registrar under section 75(7) to rectify any error or defect in any particulars or document in the register, and fails to make good the default within 14 days after the service on the person of a notice requiring it to be done, a District Court or Magistrate’s Court may, on application by the Registrar, make an order directing that person or (if that person is a corporation) any officer of the corporation to make good the default within the time specified in the order. [35/2014] (2) Any such order may provide that all the costs of and incidental to the application must be borne by that person, or by any officer of the corporation who is responsible for the default if that person is a corporation. (3) Nothing in this section limits the operation of any other provision of this Act or any written law imposing penalties (in respect of any default mentioned in this section) on that person, or an officer of a corporation if that person is a corporation. [49"
    },
    {
      "provision_ref": "s84",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "84",
      "title": "Offences by limited liability partnerships",
      "content": "84. Where an offence under this Act committed by a limited liability partnership is proved — ( a ) to have been committed with the consent or connivance of a partner or manager of that limited liability partnership; or ( b ) to be attributable to any neglect on the part of the partner or manager of that limited liability partnership, the partner or manager of that limited liability partnership (as the case may be), as well as that limited liability partnership, shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. [50"
    },
    {
      "provision_ref": "s85",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "85",
      "title": "Offences by other bodies corporate and partnerships, etc.",
      "content": "85. —(1) Where an offence under this Act committed by a body corporate (other than a limited liability partnership) is proved — ( a ) to have been committed with the consent or connivance of an officer of that body corporate; or ( b ) to be attributable to any neglect on the part of the officer of that body corporate, the officer of that body corporate, as well as that body corporate, shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (2) Where the affairs of a body corporate are managed by its members, subsection (1) applies in relation to the acts and defaults of a member in connection with his or her functions of management as if the member were a director of the body corporate. (3) Where an offence under this Act committed by a partnership (other than a limited liability partnership) is proved — ( a ) to have been committed with the consent or connivance of a partner; or ( b ) to be attributable to any neglect on the part of the partner, the partner, as well as the partnership, shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (4) Where an offence under this Act committed by an unincorporated association (other than a partnership) is proved — ( a ) to have been committed with the consent or connivance of an officer of the unincorporated association or a member of its governing body; or ( b ) to be attributable to any neglect on the part of the officer or member, the officer or member (as the case may be), as well as the unincorporated association, shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (5) In this section — “officer” — ( a ) in relation to a body corporate means any director, member of the committee of management, chief executive, manager, secretary or other similar officer of the body corporate and includes any person purporting to act in any such capacity; or ( b ) in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, or any person holding a position analogous to that of president, secretary or member of a committee and includes any person purporting to act in any such capacity; “partner” includes a person purporting to act as a partner. (6) Regulations may provide for the application of any provision of this section, with any modifications that the Minister considers appropriate, to any body corporate or unincorporated association formed or recognised under the law of a territory outside Singapore. [51"
    },
    {
      "provision_ref": "s86",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "86",
      "title": "Authority and its employees not liable to suit",
      "content": "86. —(1) The Registrar, any public officer or any member, officer or employee of the Authority shall not be under any liability in respect of any error or inaccuracy in a register or in respect of any error or inaccuracy (whether in the copying or otherwise) in any certificate, certified extract, copy or other document made or issued under this Act and no court is to entertain any suit or other proceedings or damages in respect of any such matter. (2) Despite anything to the contrary in any written law, the Authority shall not be under any liability or be liable to be sued in respect of any of the matters referred to in subsection (1). [52"
    },
    {
      "provision_ref": "s87",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "87",
      "title": "Jurisdiction of District Court",
      "content": "87. Despite any provision to the contrary in the Criminal Procedure Code 2010, a District Court has jurisdiction to try any offence under this Act and has power to impose the full penalty or punishment in respect of the offence. [53"
    },
    {
      "provision_ref": "s88",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "88",
      "title": "Evidence",
      "content": "88. —(1) Subject to subsection (3), a document or certificate issued by the Registrar in connection with the administration or enforcement of this Act or with an investigation carried out under this Act is admissible as evidence in any proceedings under this Act and is prima facie evidence of the facts stated therein. (2) For the purposes of this section, a document purporting to be a certificate mentioned in subsection (1) on its production by the prosecution is, until the contrary is proved, deemed to be such a certificate. (3) A certificate mentioned in subsection (1) must not be received in evidence under that subsection unless the person charged has been given — ( a ) a copy of the certificate; and ( b ) notice of the intention of the prosecution to produce the certificate as evidence in the proceedings, at least 10 clear days before the commencement of the proceedings. (4) Where a certificate of the Registrar is admitted in evidence under subsection (1), the person charged may require the Registrar to be called as a witness for the prosecution and be cross‑examined as if he or she had given evidence of the matters stated in the certificate. [54"
    },
    {
      "provision_ref": "s89",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "89",
      "title": "General penalties",
      "content": "89. Any person guilty of an offence under this Act for which no penalty is expressly provided shall be liable on conviction to a fine not exceeding $10,000. [55"
    },
    {
      "provision_ref": "s90",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "90",
      "title": "Regulations",
      "content": "90. —(1) The Minister may make regulations for carrying out the purposes and provisions of this Act. (2) Without limiting subsection (1), the Minister may make regulations for or with respect to all or any of the following matters: ( a ) the registration and regulation of foreign limited liability partnerships; ( b ) the powers and duties of the Registrar; ( c ) the forms for the purposes of this Act, including the form of registers to be kept and the places at which the registers are to be kept; ( d ) the translation of documents and records required for the purposes of this Act, and the authentication and lodgment of any such translation; ( e ) all matters connected with or arising from the restrictions as to the business name which may be used by a limited liability partnership registered under this Act; ( f ) the fees to be charged in respect of anything done under or by virtue of this Act, and the method of payment of the fees; ( g ) the persons or classes of persons who are to be exempted from the payment of any fee or part of a fee; ( h ) the penalties for the late lodgment of documents; ( i ) the waiver, refund or remission, whether wholly or in part, of any fee or penalty chargeable under this Act; ( j ) prescribing all matters and things which are required or permitted to be prescribed otherwise than by rules, under or for the purposes of this Act. [35/2014] (3) The Minister may, in making any regulations, provide that any contravention of, or failure or neglect to comply with, any provision of the regulations or any directive issued by the Registrar pursuant to the regulations shall be an offence punishable with a fine not exceeding $5,000 or with imprisonment for a term not exceeding 12 months or with both and, in the case of a continuing offence, with a further fine not exceeding $200 for every day or part of a day during which the offence continues after conviction. (4) In this section, “foreign limited liability partnership” means a partnership formed, registered or incorporated outside Singapore in which the liability of the partners is limited, and having such other features as may be prescribed by the Minister. [56"
    },
    {
      "provision_ref": "s91",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "91",
      "title": "Rules",
      "content": "91. The Rules Committee constituted under section 80 of the Supreme Court of Judicature Act 1969 may make rules — ( a ) with respect to proceedings and the practice and procedure of the General Division of the High Court under this Act; ( b ) with respect to any matter or thing which is by the Fifth Schedule required or permitted to be prescribed by rules; ( c ) without limiting this section, with respect to fees and costs in the General Division of the High Court and with respect to rules as to meetings ordered by the General Division of the High Court; and ( d ) generally with respect to the winding up of limited liability partnerships. [57 [40/2019]"
    },
    {
      "provision_ref": "s92",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "92",
      "title": "Criminal liability of partners and managers of limited liability partnerships under other written laws",
      "content": "92. —(1) A culpable officer provision applies, with the necessary modifications, to a limited liability partnership as if the reference in that provision to a director (or a person purporting to act as a director) were a reference to a partner or manager (or a person purporting to act as a partner or manager, as the case may be) of the limited liability partnership. (2) A culpable officer provision is a provision in any written law to the effect that where a body corporate, corporation or company is guilty of a particular offence, a director of the body corporate, corporation or company is also guilty of that offence in any one or more of the following circumstances: ( a ) if the offence is proved to have been committed with his or her authority; ( b ) if the offence is proved to have been committed with his or her consent or connivance; ( c ) if the offence is proved to be attributable to or to have been facilitated by any neglect on his or her part; ( d ) if the offence is proved to be attributable to any act or default on his or her part; ( e ) if he or she fails to prove that the offence was committed without his or her consent or connivance, and that he or she had exercised such diligence to prevent the commission of the offence as he or she ought to have exercised having regard to the nature of his or her functions in that capacity and to all the circumstances. [58"
    },
    {
      "provision_ref": "s93",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "93",
      "title": "Service of documents on limited liability partnerships under other written laws",
      "content": "93. A provision in any written law for the service of notices, orders or documents on a body corporate, corporation or company applies, with the necessary modifications, to a limited liability partnership as it applies to the body corporate, corporation or company, and a reference in that provision to the secretary or other similar officer of the body corporate, corporation or company is a reference to the manager of the limited liability partnership. [59"
    },
    {
      "provision_ref": "s94",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "94",
      "title": "Service of documents on partner and manager",
      "content": "94. Any document required to be served under this Act on a partner or manager of a limited liability partnership, who is an individual, is sufficiently served if addressed to the partner or manager and left at or sent by post to his or her residential address or contact address. [59A [35/2014] [Act 21 of 2024 wef 09/12/2024]"
    }
  ],
  "definitions": [
    {
      "term": "ACRA administered Act",
      "definition": "“ACRA administered Act” means the Accounting and Corporate Regulatory Authority Act 2004 or any of the written laws specified in the Second Schedule to that Act; [Act 21 of 2024 wef 09/12/2024]",
      "source_provision": "s2"
    },
    {
      "term": "Authority",
      "definition": "“Authority” means the Accounting and Corporate Regulatory Authority established under the Accounting and Corporate Regulatory Authority Act 2004;",
      "source_provision": "s2"
    },
    {
      "term": "Authority’s website",
      "definition": "“Authority’s website” means the Authority’s Internet website;",
      "source_provision": "s2"
    },
    {
      "term": "company",
      "definition": "“company” has the meaning given by section 4(1) of the Companies Act 1967;",
      "source_provision": "s2"
    },
    {
      "term": "contact address",
      "definition": "“contact address” , in relation to an individual, means an address that meets all of the following conditions: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "corporation",
      "definition": "“corporation” means any body corporate formed or incorporated or existing in Singapore or outside Singapore and includes — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "financial year",
      "definition": "“financial year” , in relation to a limited liability partnership, means the period in respect of which any profit and loss account of the limited liability partnership is made up, whether that period is a year or not;",
      "source_provision": "s2"
    },
    {
      "term": "firm",
      "definition": "“firm” has the meaning given by section 2(1) of the Business Names Registration Act 2014;",
      "source_provision": "s2"
    },
    {
      "term": "foreign company",
      "definition": "“foreign company” has the meaning given by section 4(1) of the Companies Act 1967;",
      "source_provision": "s2"
    },
    {
      "term": "full name",
      "definition": "“full name” or “name” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "identification",
      "definition": "“identification” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "limited liability partnership",
      "definition": "“limited liability partnership” has the meaning given by section 4(1);",
      "source_provision": "s2"
    },
    {
      "term": "limited liability partnership agreement",
      "definition": "“limited liability partnership agreement” , in relation to a limited liability partnership, means any agreement expressed or implied between the partners of the limited liability partnership or between the limited liability partnership and its partners which determines the mutual rights and duties of the partners and their rights and duties in relation to the limited liability partnership;",
      "source_provision": "s2"
    },
    {
      "term": "liquidator",
      "definition": "“liquidator” includes the Official Receiver when acting as the liquidator of a corporation;",
      "source_provision": "s2"
    },
    {
      "term": "manager",
      "definition": "“manager” , in relation to a limited liability partnership, means any person (whether or not a partner of the limited liability partnership) who is concerned in or takes part in the management of the limited liability partnership (whether or not the person’s particulars or consent to act are lodged with the Registrar as required under section 29(2));",
      "source_provision": "s2"
    },
    {
      "term": "officer",
      "definition": "“officer” , in relation to a limited liability partnership, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Official Receiver",
      "definition": "“Official Receiver” has the meaning given by section 2(1) of the Insolvency, Restructuring and Dissolution Act 2018;",
      "source_provision": "s2"
    },
    {
      "term": "partner",
      "definition": "“partner” , in relation to a limited liability partnership, means any person who has been admitted as a partner in the limited liability partnership in accordance with the limited liability partnership agreement;",
      "source_provision": "s2"
    },
    {
      "term": "private company",
      "definition": "“private company” has the meaning given by section 4(1) of the Companies Act 1967;",
      "source_provision": "s2"
    },
    {
      "term": "register",
      "definition": "“register” means any register kept and maintained under this Act;",
      "source_provision": "s2"
    },
    {
      "term": "Registrar",
      "definition": "“Registrar” means the Registrar of Limited Liability Partnerships appointed under section 3(2)( a ) and includes any Deputy Registrar or Assistant Registrar appointed under section 3(2)( b );",
      "source_provision": "s2"
    },
    {
      "term": "residential address",
      "definition": "“residential address” , in relation to an individual, means the individual’s usual place of residence;",
      "source_provision": "s2"
    },
    {
      "term": "solicitor",
      "definition": "“solicitor” means an advocate and solicitor of the Supreme Court. [2/2007; 18/2014; 29/2014; 35/2014; 16/2017; 40/2018; 40/2019]",
      "source_provision": "s2"
    },
    {
      "term": "approved exchange",
      "definition": "“approved exchange” has the meaning given by section 2(1) of the Securities and Futures Act 2001;",
      "source_provision": "s43"
    },
    {
      "term": "controller",
      "definition": "“controller” means an individual controller or a corporate controller;",
      "source_provision": "s43"
    },
    {
      "term": "corporate controller",
      "definition": "“corporate controller” , in relation to a limited liability partnership, means a legal entity which has a significant interest in, or significant control over, the limited liability partnership;",
      "source_provision": "s43"
    },
    {
      "term": "individual controller",
      "definition": "“individual controller” , in relation to a limited liability partnership, means an individual who has a significant interest in, or significant control over, the limited liability partnership;",
      "source_provision": "s43"
    },
    {
      "term": "legal entity",
      "definition": "“legal entity” means any body corporate formed or incorporated or existing in Singapore or outside Singapore and includes a foreign company;",
      "source_provision": "s43"
    },
    {
      "term": "register of controllers",
      "definition": "“register of controllers” or “register”, in relation to a limited liability partnership to which this Part applies, means the register that the limited liability partnership is required to keep of its registrable controllers under section 47(1), (1A), (2) or (3); [Act 23 of 2024 wef 16/06/2025]",
      "source_provision": "s43"
    },
    {
      "term": "registered corporate service provider",
      "definition": "“registered corporate service provider” has the meaning given by section 2(1) of the Corporate Service Providers Act 2024; [Act 22 of 2024 wef 09/06/2025]",
      "source_provision": "s43"
    },
    {
      "term": "significant control",
      "definition": "“significant control” , in relation to a limited liability partnership, has the meaning given to it in the Seventh Schedule;",
      "source_provision": "s43"
    },
    {
      "term": "significant interest",
      "definition": "“significant interest” , in relation to a limited liability partnership, has the meaning given to it in the Seventh Schedule. [32B [16/2017]",
      "source_provision": "s43"
    },
    {
      "term": "client",
      "definition": "“client” , in relation to a lawyer, includes an agent of or other person representing a client and, if a client has died, a personal representative of the client;",
      "source_provision": "s46"
    },
    {
      "term": "employer",
      "definition": "“employer” , in relation to a legal counsel, includes — ( a )",
      "source_provision": "s46"
    },
    {
      "term": "lawyer",
      "definition": "“lawyer” means a solicitor or a professional legal adviser, and includes an interpreter or other person who works under the supervision of a solicitor or a professional legal adviser;",
      "source_provision": "s46"
    },
    {
      "term": "legal counsel",
      "definition": "“legal counsel” means a legal counsel as defined in section 3(7) of the Evidence Act 1893, and includes an interpreter or other person who works under the supervision of a legal counsel. [32E [16/2017]",
      "source_provision": "s46"
    }
  ]
}