{
  "id": "ma-1970",
  "type": "statute",
  "title": "Metrication Act 1970",
  "title_en": "Metrication Act 1970",
  "short_name": "MA1970",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/MA1970",
  "description": "An Act to introduce the use of the International System of Units in Singapore, to enable necessary modifications of legislation to be effected and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Metrication Act 1970."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, “International System of Units” — ( a ) means the metric system of units as set out in the First and Second Schedules; and ( b ) includes the units set out in the Fourth Schedule unless there is something in the subject or context thereof inconsistent with such construction or unless it is therein otherwise expressly provided. (2) The abbreviation “SI” is recognised as a legal reference to the International System of Units."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "International System of Units",
      "content": "3. —(1) On and after 15 February 1971, the use of the system of units known as the International System of Units has legal force and validity in Singapore. (2) The International System of Units consists of — ( a ) the basic units set out in the First Schedule; ( b ) the supplementary and derived units set out in the Second Schedule; and ( c ) the units which may be used in conjunction with the basic and supplementary and derived units set out in the Fourth Schedule."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Power to adapt, etc.",
      "content": "4. —(1) The Minister may by order provide for the adaptation, alteration, conversion or modification of any provisions contained in any written law relating to such departments and subjects as may be appropriate for the purpose of replacing references to units other than metric units contained in the written law with references to units of the International System of Units which are either — ( a ) equivalent; or ( b ) such approximations as appear to the Minister desirable for the purpose of securing that the enactments as adapted, altered, converted or modified are expressed in convenient terms. (2) Any order made under subsection (1) must be published in the Gazette ."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Conversion of imperial standard units to metric system units",
      "content": "5. The values expressed in terms of — ( a ) any imperial standard relating to measures of extension whether lineal, superficial or solid, or of weight or capacity; or ( b ) the local customary system of weights and measures, may be converted into the values expressed in terms of the International System of Units in accordance with the Third Schedule."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Power to vary Schedules",
      "content": "6. The Minister may, from time to time by notification in the Gazette , add to, vary or amend the Schedules as the Minister may think fit."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Saving",
      "content": "7. —(1) No act or thing done before the making of any order under section 4 may be challenged only on the ground that the act or thing done was done in a unit other than a unit of the International System of Units. (2) Nothing in this Act affects the legal force and validity of any other system of units lawfully used in Singapore."
    }
  ],
  "definitions": []
}