{
  "id": "mca-2008",
  "type": "statute",
  "title": "Mental Capacity Act 2008",
  "title_en": "Mental Capacity Act 2008",
  "short_name": "MCA2008",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/MCA2008",
  "description": "An Act to make new provision relating to persons who lack capacity and to provide for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Mental Capacity Act 2008."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “appropriate consent” has the meaning given by the Human Biomedical Research Act 2015; “clinical trial” means a clinical trial within the meaning of the Medicines Act 1975 or the Health Products Act 2007; “court” means the General Division of the High Court or a Family Court; “deputy” means a person appointed by the court under section 20(2)( b ) to make decisions on behalf of another person (“P”) in relation to a matter or matters concerning all or any of the following in respect of which P lacks capacity: ( a ) P’s personal welfare; ( b ) P’s property and affairs; [Act 16 of 2021 wef 14/11/2022] “donee” means a person who is conferred authority by a donor (“P”) under a lasting power of attorney to make decisions about all or any of the following when P no longer has capacity to make such decisions: ( a ) P’s personal welfare, or matters concerning P’s personal welfare that are specified in the lasting power of attorney; ( b ) P’s property and affairs, or matters concerning P’s property and affairs that are specified in the lasting power of attorney; [Act 16 of 2021 wef 14/11/2022] “donor” means a person (“P”) who confers authority on a donee (or donees) under a lasting power of attorney to make decisions about all or any of the following when P no longer has capacity to make those decisions: ( a ) P’s personal welfare, or matters concerning P’s personal welfare that are specified in the lasting power of attorney; ( b ) P’s property and affairs, or matters concerning P’s property and affairs that are specified in the lasting power of attorney; [Act 16 of 2021 wef 14/11/2022] “electronic”, “electronic record”, “record”, “secure electronic signature”, “signed” and “signature” have the meanings given by section 2(1) of the Electronic Transactions Act 2010 * ; [Act 16 of 2021 wef 14/11/2022] “electronic instrument” means an electronic record that confers authority of the kind mentioned in section 11(1); [Act 16 of 2021 wef 14/11/2022] “electronic transaction system” means the electronic transaction system established by the Public Guardian under section 10B(1); [Act 16 of 2021 wef 14/11/2022] “lasting power of attorney” has the meaning given by section 11; “life-sustaining treatment”, in relation to a person, means treatment which, in the view of another person providing health care for that person, is necessary to sustain life; “non-electronic lasting power of attorney” means a lasting power of attorney that is created using non-electronic means; [Act 16 of 2021 wef 14/11/2022] “professional deputy” means a person — ( a ) who offers or provides the services of a deputy for remuneration; and ( b ) who is registered with the Public Guardian as a professional deputy; “professional donee” means a person — ( a ) who is a professional deputy or is within a class of persons prescribed as qualified to be a professional donee; and ( b ) who offers or provides the services of a donee for remuneration; “property” includes any thing in action and any interest in real or personal property; “Public Guardian” means the Public Guardian appointed under section 30(1) and, unless the context otherwise requires, includes any Assistant Public Guardian appointed under section 30(1A); “registered medical practitioner” means any person who is registered as a medical practitioner under the Medical Registration Act 1997; “Singapore public sector agency” has the meaning given by section 2(1) of the Public Sector (Governance) Act 2018; [Act 16 of 2021 wef 01/04/2023] “treatment” includes a diagnostic or other procedure; “will” includes codicil. [*Updated to be consistent with the 2020 Revised Edition] [27/2014; 29/2015; 10/2016; 40/2019] (2) In this Act, references to making decisions, in relation to a one of a lasting power of attorney or a deputy appointed by the court, include, where appropriate, acting on decisions made. (3) For the purposes of this Act, a reference to an instrument that confers authority of the kind mentioned in section 11(1) includes an electronic instrument made in accordance with section 11(2)( b )(ii). [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - PERSONS WHO LACK CAPACITY",
      "section": "3",
      "title": "Principles",
      "content": "3. —(1) The following principles apply for the purposes of this Act. (2) A person must be assumed to have capacity unless it is established that the person lacks capacity. (3) A person is not to be treated as unable to make a decision unless all practicable steps to help the person to do so have been taken without success. (4) A person is not to be treated as unable to make a decision merely because the person makes an unwise decision. (5) An act done, or a decision made, under this Act for or on behalf of a person who lacks capacity must be done, or made, in the person’s best interests. (6) Before the act is done, or the decision is made, regard must be had to whether the purpose for which it is needed can be as effectively achieved in a way that is less restrictive of the person’s rights and freedom of action."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - PERSONS WHO LACK CAPACITY",
      "section": "4",
      "title": "Persons who lack capacity",
      "content": "4. —(1) For the purposes of this Act, a person lacks capacity in relation to a matter if at the material time the person is unable to make a decision for himself or herself in relation to the matter because of an impairment of, or a disturbance in the functioning of, the mind or brain. (2) It does not matter whether the impairment or disturbance is permanent or temporary. (3) A lack of capacity cannot be established merely by reference to — ( a ) a person’s age or appearance; or ( b ) a condition of the person, or an aspect of the person’s behaviour, which might lead others to make unjustified assumptions about the person’s capacity. (4) In proceedings under this Act (other than proceedings for offences under this Act), any question whether a person lacks capacity within the meaning of this Act must be decided on the balance of probabilities. (5) Subject to section 21, no power which a person (“D”) may exercise under this Act — ( a ) in relation to a person who lacks capacity; or ( b ) where D reasonably thinks that a person lacks capacity, is exercisable in relation to a person below 21 years of age."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - PERSONS WHO LACK CAPACITY",
      "section": "5",
      "title": "Inability to make decisions",
      "content": "5. —(1) For the purposes of section 4, a person is unable to make a decision for himself or herself if the person is unable — ( a ) to understand the information relevant to the decision; ( b ) to retain that information; ( c ) to use or weigh that information as part of the process of making the decision; or ( d ) to communicate his or her decision (whether by talking, using sign language or any other means). (2) A person is not to be regarded as unable to understand the information relevant to a decision if the person is able to understand an explanation of it given to him or her in a way that is appropriate to his or her circumstances (using simple language, visual aids or any other means). (3) The fact that a person is able to retain the information relevant to a decision for a short period only does not prevent the person from being regarded as able to make the decision. (4) The information relevant to a decision includes information about the reasonably foreseeable consequences of — ( a ) deciding one way or another; or ( b ) failing to make the decision."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - PERSONS WHO LACK CAPACITY",
      "section": "6",
      "title": "Best interests",
      "content": "6. —(1) In determining for the purposes of this Act what is in a person’s best interests, the person making the determination must not make it merely on the basis of — ( a ) the person’s age or appearance; or ( b ) a condition of the person, or an aspect of the person’s behaviour, which might lead others to make unjustified assumptions about what might be in the person’s best interests. (2) The person making the determination must consider all the relevant circumstances and, in particular, take the steps specified in subsections (3) to (9). (3) He or she must consider — ( a ) whether it is likely that the person will at some time have capacity in relation to the matter in question; and ( b ) if it appears likely that the person will, when that is likely to be. (4) He or she must, so far as is reasonably practicable, permit and encourage the person to participate, or to improve the person’s ability to participate, as fully as possible in any act done for the person and any decision affecting the person. (5) Where the determination relates to life-sustaining treatment, he or she must not, in considering whether the treatment is in the best interests of the person concerned, be motivated by a desire to bring about the death of the person concerned. (6) Where the determination relates to the giving, refusal or revocation of — ( a ) appropriate consent of the person concerned under the Human Biomedical Research Act 2015 — he or she must take into account such matters, considerations and procedures as may be prescribed under Part 3 of that Act; or ( b ) consent of the person concerned under any written law relating to a clinical trial — he or she must take into account such matters, considerations and procedures as may be prescribed in such written law. [29/2015] (7) Where the determination relates to the disposition or settlement of the person’s property, he or she must be motivated by a desire to ensure, so far as is reasonably practicable, that the person’s property is preserved for application towards the costs of the person’s maintenance during the person’s life. (8) He or she must consider, so far as is reasonably ascertainable — ( a ) the person’s past and present wishes and feelings (and, in particular, any relevant written statement made by the person when the person had capacity); ( b ) the beliefs and values that would be likely to influence his or her decision if the person had capacity; and ( c ) the other factors that the person would be likely to consider if the person were able to do so. (9) He or she must take into account, if it is practicable and appropriate to consult them, the views of — ( a ) anyone named by the person as someone to be consulted on the matter in question or on matters of that kind; ( b ) anyone engaged in caring for the person or interested in the person’s welfare; ( c ) any one of a lasting power of attorney granted by the person; and ( d ) any deputy appointed for the person by the court, as to what would be in the person’s best interests and, in particular, as to the matters mentioned in subsection (8). (10) The duties imposed by subsections (1) to (9) also apply in relation to the exercise of any powers which — ( a ) are exercisable under a lasting power of attorney; or ( b ) are exercisable by a person under this Act where the person reasonably believes that another person lacks capacity. (11) In the case of an act done, or a decision made, by a person other than the court, there is sufficient compliance with this section if (having complied with the requirements of subsections (1) to (9)) the person reasonably believes that what the person does or decides is in the best interests of the person concerned. (12) In subsection (2), “relevant circumstances” are those — ( a ) of which the person making the determination is aware; and ( b ) which it would be reasonable to regard as relevant."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - ACTS IN CONNECTION WITH CARE OR TREATMENT",
      "section": "7",
      "title": "Acts in connection with care or treatment",
      "content": "7. —(1) If a person (“D”) does an act in connection with the care or treatment of another person (“P”), the act is one to which this section applies if — ( a ) before doing the act, D takes reasonable steps to establish whether P lacks capacity in relation to the matter in question; and ( b ) when doing the act, D reasonably believes — (i) that P lacks capacity in relation to the matter; and (ii) that it will be in P’s best interests for the act to be done. (2) D does not incur any liability in relation to the act that D would not have incurred if P — ( a ) had had capacity to consent in relation to the matter; and ( b ) had consented to D’s doing the act. (3) Nothing in this section — ( a ) excludes a person’s civil liability for loss or damage, or the person’s criminal liability, resulting from the person’s negligence in doing the act; ( b ) affects the operation of the Advance Medical Directive Act 1996; ( c ) applies to the conduct of a clinical trial; or ( d ) applies to the conduct of human biomedical research within the meaning of the Human Biomedical Research Act 2015 or the removal or use of human tissue under that Act. [29/2015]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - ACTS IN CONNECTION WITH CARE OR TREATMENT",
      "section": "8",
      "title": "Section 7 acts: limitations",
      "content": "8. —(1) If D does an act that is intended to restrain P, it is not an act to which section 7 applies unless 2 further conditions are satisfied. (2) The first condition is that D reasonably believes that it is necessary to do the act in order to prevent harm to P. (3) The second condition is that the act is a proportionate response to — ( a ) the likelihood of P’s suffering harm; and ( b ) the seriousness of that harm. (4) For the purposes of this section, D restrains P if D — ( a ) uses, or threatens to use, force to secure the doing of an act which P resists; or ( b ) restricts P’s liberty of movement, whether or not P resists. (5) Section 7 does not authorise a person to do an act which is inconsistent with a decision made, within the scope of the authority of, and in accordance with this Act, by — ( a ) a donee of a lasting power of attorney granted by P; or ( b ) a deputy appointed for P by the court."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - ACTS IN CONNECTION WITH CARE OR TREATMENT",
      "section": "9",
      "title": "Payment for necessary goods and services",
      "content": "9. —(1) If necessary goods or services are supplied to a person who lacks capacity to contract for the supply, the person must pay a reasonable price for them. (2) In subsection (1), “necessary” means suitable to a person’s condition in life and to the person’s actual requirements at the time when the goods or services are supplied."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - ACTS IN CONNECTION WITH CARE OR TREATMENT",
      "section": "10",
      "title": "Expenditure",
      "content": "10. —(1) If an act to which section 7 applies involves expenditure for necessary goods or services within the meaning of section 9, it is lawful for D to apply money in P’s actual possession for meeting the expenditure. (2) If the expenditure is borne for P by D, it is lawful for D — ( a ) to reimburse himself or herself out of money in P’s actual possession; or ( b ) to be otherwise indemnified by P. (3) Subsections (1) and (2) do not affect any power under which (apart from those subsections) a person — ( a ) has lawful control of P’s money or other property; and ( b ) has power to spend money for P’s benefit."
    },
    {
      "provision_ref": "s10A",
      "chapter": "PART 3A - ELECTRONIC TRANSACTION SYSTEM",
      "section": "10A",
      "title": "Interpretation of this Part",
      "content": "10A. In this Part, unless the context otherwise requires — “document” includes a document in electronic form; “malfunction”, in relation to the electronic transaction system, includes any defect or breakdown in that system or in any equipment, software or telecommunication networks used in or in connection with that system; “transaction”, in relation to the Public Guardian, means — ( a ) the filing or lodging of any document with the Public Guardian, or the submission, production, delivery, furnishing or sending of any document to the Public Guardian, under or for the purposes of this Act; ( b ) the making of any application, submission or request to the Public Guardian under or for the purposes of this Act; ( c ) the provision of any undertaking or declaration to the Public Guardian under or for the purposes of this Act; and ( d ) the extraction, retrieval or accessing of any document, record or information maintained by the Public Guardian under or for the purposes of this Act. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s10B",
      "chapter": "PART 3A - ELECTRONIC TRANSACTION SYSTEM",
      "section": "10B",
      "title": "Establishment of electronic transaction system",
      "content": "10B. —(1) The Public Guardian may establish an electronic transaction system — ( a ) to enable any donor to create an electronic instrument with a view to creating a lasting power of attorney; ( b ) to enable any person to carry out any transaction with the Public Guardian; ( c ) to enable a person to give a notice to another person under or for the purposes of this Act; ( d ) to enable the Public Guardian to issue any approval, certification, notice or other document under or for the purposes of this Act; ( e ) to enable the Public Guardian to attach a note to any lasting power of attorney; ( f ) to enable the Public Guardian to provide to persons entitled copies or extracts of documents filed or lodged with, submitted to, or issued by, the Public Guardian; ( g ) to enable the Public Guardian to provide a service for the supply to the public of non-confidential information relating to transactions with the Public Guardian; and ( h ) to enable the Public Guardian to carry out any of the Public Guardian’s functions, or to provide any other service falling within those functions. (2) The non-confidential information that may be provided under the service mentioned in subsection (1)( g ) — ( a ) may include — (i) information extracted from documents filed or lodged with, submitted to, or issued by, the Public Guardian; and (ii) collations, summaries, reports or analyses of documents filed or lodged with, submitted to, or issued by, the Public Guardian; and ( b ) may be derived from documents filed or lodged with, submitted to, or issued by, the Public Guardian other than through the electronic transaction system. (3) Where any transaction with the Public Guardian can be carried out using the electronic transaction system, the Public Guardian may refuse to process the transaction unless — ( a ) the transaction is carried out in accordance with this Part, including the requirements for the use of the electronic transaction system specified in subsection (4); ( b ) the transaction meets the requirements prescribed in this Act or specified by the Public Guardian (as the case may be) for that transaction; and ( c ) the fee payable for the transaction has been paid. (4) Subject to this Part and any regulations made under section 46, the Public Guardian may, from time to time, determine the requirements for the use of the electronic transaction system, which may include — ( a ) conditions of access to, and use of, the electronic transaction system; ( b ) security and authentication requirements for access to, and use of, the electronic transaction system; ( c ) retention and production of documents supporting or authenticating transactions; and ( d ) modes of payment for transactions. (5) The Public Guardian must keep a record, in such form as the Public Guardian may determine, of — ( a ) all transactions with the Public Guardian that are carried out using the electronic transaction system; ( b ) all approvals, certifications, notices and other documents issued by the Public Guardian under or for the purposes of this Act through the electronic transaction system; and ( c ) all notes attached by the Public Guardian to any lasting power of attorney using the electronic transaction system. (6) The Public Guardian must ensure that each of the following documents is kept in such form as the Public Guardian may determine, that ensures the integrity, and enables the retrieval, of the document: ( a ) any lasting power of attorney that is created using the electronic transaction system; ( b ) any electronic copy of a non-electronic lasting power of attorney. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s10C",
      "chapter": "PART 3A - ELECTRONIC TRANSACTION SYSTEM",
      "section": "10C",
      "title": "Requirement to use electronic transaction system",
      "content": "10C. —(1) Except as provided in subsection (2), a person who wishes to carry out a transaction with the Public Guardian — ( a ) must do so using the electronic transaction system if the transaction is an application for the registration of an instrument purporting to create a lasting power of attorney; ( b ) must do so using the electronic transaction system if required by the Public Guardian; or ( c ) may do so using the electronic transaction system if permitted by the Public Guardian. (2) If a transaction with the Public Guardian under or for the purposes of this Act cannot be carried out using the electronic transaction system — ( a ) because the person mentioned in subsection (1) is unable to carry out the transaction using the electronic transaction system due to the person’s physical disability or other circumstance; ( b ) because the electronic transaction system is unavailable; or ( c ) for any other reason, the transaction must be carried out in the form and manner determined by the Public Guardian. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s10D",
      "chapter": "PART 3A - ELECTRONIC TRANSACTION SYSTEM",
      "section": "10D",
      "title": "Electronic transaction system malfunction, errors and omissions",
      "content": "10D. —(1) Despite any other written law or rule of law, the Public Guardian may — ( a ) correct any error or omission in any register kept by the Public Guardian under this Act; ( b ) correct any error or omission in any document filed or lodged with, or submitted to, the Public Guardian; and ( c ) supply entries or records omitted to be made in any register mentioned in paragraph ( a ), if the error or omission has occurred or arisen as a result of any malfunction of the electronic transaction system. (2) The Public Guardian must maintain a record of every correction made under subsection (1). (3) When any error or omission has been corrected under subsection (1), the error or omission is deemed not to have occurred. (4) The Public Guardian, an Assistant Public Guardian, an authorised officer or any person acting under the direction of the Public Guardian or an Assistant Public Guardian is not liable for any loss or damage suffered by any person by reason of any error or omission, if — ( a ) the error or omission had occurred or arisen as a result of any malfunction of the electronic transaction system; and ( b ) the malfunction of the electronic transaction system had occurred despite the Public Guardian having acted in good faith and with reasonable care to prevent such a malfunction from occurring. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "11",
      "title": "Lasting powers of attorney",
      "content": "11. —(1) A lasting power of attorney is a power of attorney under which the donor (“P”) confers on the donee (or donees) authority to make decisions about all or any of the following: ( a ) P’s personal welfare or specified matters concerning P’s personal welfare; ( b ) P’s property and affairs or specified matters concerning P’s property and affairs, when P no longer has capacity to make such decisions. (2) A lasting power of attorney is not created unless — ( a ) section 12 is complied with; ( b ) an instrument conferring authority of the kind mentioned in subsection (1) — (i) being one executed by P before the date of commencement of section 4 of the Mental Capacity (Amendment) Act 2021 — is made and registered in accordance with the First Schedule as in force immediately before that date; or (ii) being one executed by P on or after the date of commencement of section 4 of the Mental Capacity (Amendment) Act 2021 — (A) is made using the electronic transaction system in accordance with section 12A and the First Schedule, or (in a case under subsection (2A)) is made in accordance with the First Schedule; and (B) is registered in accordance with the First Schedule; and [Act 16 of 2021 wef 14/11/2022] ( c ) at the time when P executes the instrument, P has attained the age of 21 years and has capacity to execute it. (2A) The Public Guardian may allow an instrument conferring authority of the kind mentioned in subsection (1) to be made in accordance with the First Schedule, without using the electronic transaction system, in any one or more of the following circumstances: ( a ) the donor is unable to make the instrument using the electronic transaction system due to the donor’s physical disability or other circumstance; ( b ) the donee is unable to sign the instrument using the electronic transaction system due to the donee’s physical disability or other circumstance; ( c ) the electronic transaction system is unavailable; ( d ) any other prescribed circumstances. [Act 16 of 2021 wef 14/11/2022] (3) Subject to section 12B, an instrument which — ( a ) purports to create a lasting power of attorney; but ( b ) does not comply with this section, section 12 or the First Schedule, confers no authority. [Act 15 of 2024 wef 04/05/2024] (4) The authority conferred by a lasting power of attorney is subject to — ( a ) the provisions of this Act and, in particular, sections 3 (principles) and 6 (best interests); and ( b ) any conditions or restrictions specified in the instrument. (5) On or after the date of commencement of section 4 of the Mental Capacity (Amendment) Act 2021, the Public Guardian may return any non-electronic lasting power of attorney that is kept by the Public Guardian (whether registered before, on or after that date) to its donor if — ( a ) the Public Guardian has ensured that an electronic copy of the lasting power of attorney (including all the notes attached to it under this Act), that is free from any relevant error, is made, and kept in the electronic transaction system (called in this section the electronic copy); ( b ) the return of the non-electronic lasting power of attorney is accompanied by a notice to the effect that unless the Public Guardian is notified by the donor of any relevant error in the electronic copy within 90 days (or any longer prescribed period) after the date of the notice, the electronic copy will be treated as being free from any relevant error and as the lasting power of attorney; and ( c ) a notice is sent to the donee of the lasting power of attorney (or if there is more than one donee, each of them) to the effect that where the donor lacks capacity to verify whether there is a relevant error in the electronic copy or to give a notice to the Public Guardian of any relevant error in the electronic copy, then the donee (or if there is more than one donee, any of them) may give a notice to the Public Guardian of any relevant error in the electronic copy within 90 days (or any longer prescribed period) after the date of the notice, and unless this is done the electronic copy will be treated as being free from any relevant error and as the lasting power of attorney. [Act 16 of 2021 wef 14/11/2022] (6) The Public Guardian may also send — ( a ) a notice mentioned in subsection (5)( b ) to the donor of a non-electronic lasting power of attorney that was registered before the date of commencement of section 4 of the Mental Capacity (Amendment) Act 2021; and ( b ) a notice mentioned in subsection (5)( c ) to the donee of such lasting power of attorney (or if there is more than one donee, each of them), where — ( c ) the Public Guardian has, before that date, returned the non-electronic lasting power of attorney to its donor or donee (or if there is more than one donee, any of them); and ( d ) the Public Guardian has before or after such return ensured that an electronic copy of the lasting power of attorney (including all the notes attached to it under this Act), that is free from any relevant error, was made and is kept in the electronic transaction system (also called in this section the electronic copy). [Act 16 of 2021 wef 14/11/2022] (7) The donor of a non-electronic lasting power of attorney who received a notice mentioned in subsection (5)( b ) may within 90 days (or any longer prescribed period) after the date of the notice, give a notice to the Public Guardian of any relevant error in the electronic copy (called in this section a notice of error). [Act 16 of 2021 wef 14/11/2022] (8) A donee of a non-electronic lasting power of attorney who received a notice mentioned in subsection (5)( c ) may, if the donor of the lasting power of attorney lacks capacity to verify whether there is a relevant error in the electronic copy or to give a notice to the Public Guardian of any relevant error in the electronic copy, within 90 days (or any longer prescribed period) after the date of the notice, give a notice to the Public Guardian of any relevant error in the electronic copy (also called in this section a notice of error). [Act 16 of 2021 wef 14/11/2022] (9) A notice of error under subsection (8) must be accompanied by a certificate from a registered medical practitioner verifying the lack of capacity of the donor to carry out any act described in that subsection, or to undertake tasks of a similar nature. [Act 16 of 2021 wef 14/11/2022] (10) On receipt of a notice of error under subsection (7) or (8), the Public Guardian may, if satisfied that there is a relevant error in the electronic copy, rectify the relevant error. [Act 16 of 2021 wef 14/11/2022] (11) The Public Guardian must give a written notice of the Public Guardian’s decision whether or not to rectify the relevant error to the donor and to the donee or (if there is more than one donee) every donee. [Act 16 of 2021 wef 14/11/2022] (12) Subject to sections 15A and 16A, the electronic copy of a non-electronic lasting power of attorney is treated as being free from any relevant error and as the lasting power of attorney — ( a ) if no notice of error is received by the Public Guardian by the last day of the period mentioned in subsection (5)( b ) or ( c ), whichever is the later — on the next day (called in this section the expiry day); or ( b ) if a notice of error is received by the Public Guardian within the period mentioned in subsection (5)( b ) or ( c ) — (i) where the Public Guardian decides to rectify the relevant error — on the later of the following: (A) the expiry day; (B) the day on which the Public Guardian rectifies the relevant error; or (ii) where the Public Guardian decides not to rectify the relevant error — on the later of the following: (A) the expiry day; (B) the day on which the Public Guardian sends the written notice under subsection (11). [Act 16 of 2021 wef 14/11/2022] (13) To avoid doubt, the treatment of the electronic copy of a non-electronic lasting power of attorney as being free from any relevant error and as the lasting power of attorney under subsection (12) does not affect the rights and obligations of any party under the lasting power of attorney, and the date of registration of the lasting power of attorney remains as the date of registration of the non-electronic lasting power of attorney. [Act 16 of 2021 wef 14/11/2022] (14) In this section, “relevant error”, in relation to an electronic copy of a non-electronic lasting power of attorney, means any disparity or inconsistency between the electronic copy and the lasting power of attorney that is registered by the Public Guardian. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "12",
      "title": "Appointment of donees",
      "content": "12. —(1) A donee of a lasting power of attorney must be — ( a ) where the power relates only to P’s property and affairs — (i) an individual who has attained the age of 21 years and provides to P the services of a donee without remuneration; (ii) an individual who is a professional donee and is not related to P by blood or marriage; or (iii) a professional donee who is not an individual; and ( b ) in any other case — (i) an individual who has attained the age of 21 years and provides to P the services of a donee without remuneration; or (ii) an individual who is a professional donee and is not related to P by blood or marriage. [10/2016] (2) A person who is an undischarged bankrupt may not be appointed as donee of a lasting power of attorney in relation to P’s property and affairs. (3) Subsections (4) to (7) apply in relation to an instrument under which 2 or more persons are to act as donees of a lasting power of attorney. (4) The instrument may appoint them to act — ( a ) jointly; ( b ) jointly and severally; or ( c ) jointly in respect of some matters and jointly and severally in respect of others. (5) To the extent to which it does not specify whether they are to act jointly or jointly and severally, the instrument is to be assumed to appoint them to act jointly. (6) If they are to act jointly, a failure, as respects one of them, to comply with the requirements of subsection (1) or (2) or Part 1 or 2 of the First Schedule prevents a lasting power of attorney from being created. [Act 16 of 2021 wef 14/11/2022] (7) If they are to act jointly and severally, a failure, as respects one of them, to comply with the requirements of subsection (1) or (2) or Part 1 or 2 of the First Schedule — ( a ) prevents the appointment taking effect in that person’s case; but ( b ) does not prevent a lasting power of attorney from being created in the case of the other or others. [Act 16 of 2021 wef 14/11/2022] (8) An instrument used to create a lasting power of attorney — ( a ) cannot give the donee (or, if more than one, any of them) power to appoint a substitute or successor; but ( b ) may itself appoint a person (called in subsection (9) the replacement donee) to replace the donee (or, if more than one, any of them) on the occurrence of an event mentioned in section 15(5)( a ) to ( d ) which has the effect of terminating the donee’s appointment. [10/2016] (9) To avoid doubt, an instrument used to create a lasting power of attorney — ( a ) may itself appoint one or more replacement donees in respect of a particular donee; but ( b ) cannot itself appoint a person to replace any replacement donee. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s12A",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "12A",
      "title": "Execution of lasting power of attorney",
      "content": "12A. —(1) On or after the date of commencement of section 6 of the Mental Capacity (Amendment) Act 2021, where a rule of law requires an instrument conferring authority of the kind mentioned in section 11(1) to be a deed, that requirement is met by an electronic record in the electronic transaction system if — ( a ) the electronic record clearly states on its face that it is intended to be a deed by P; ( b ) P signs the electronic record by applying a secure electronic signature to the electronic record in the electronic transaction system; ( c ) P’s signature is attested by a witness who witnesses P’s execution of the electronic record; and ( d ) the executed electronic record is delivered as a deed by P. (2) Without limiting subsection (1)( d ), an executed electronic record is treated as having been delivered as a deed by P on P making an application to the Public Guardian to register it as a lasting power of attorney. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s12B",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "12B",
      "title": "Validation",
      "content": "12B. —(1) Despite anything in section 12A(1), an instrument conferring authority of the kind mentioned in section 11(1) that is in the form of an electronic record in the electronic transaction system is not invalid as a deed by reason only that the electronic record does not state on its face that it is intended to be a deed in accordance with section 12A(1)( a ), if — ( a ) the instrument was made using the electronic transaction system in compliance with section 12A (except subsection (1)( a ) of that section); and ( b ) the instrument was made between 14 November 2022 and 4 January 2024 (both dates inclusive). (2) Despite anything in this Act, a lasting power of attorney is not invalidly created under section 11(2) by reason only that the instrument which purports to create the lasting power of attorney is an instrument mentioned in subsection (1). (3) No legal proceedings may be instituted on or after 6 March 2024 in any court in respect of the validity of a lasting power of attorney mentioned in subsection (2) by reason of the instrument which purports to create the lasting power of attorney not being made in accordance with section 12A(1)( a ). (4) Subsections (1), (2) and (3) do not affect the power of the court under section 17 to determine whether one or more of the requirements for the creation of a lasting power of attorney (not being a requirement under section 12A(1)( a )) have been met. [Act 15 of 2024 wef 04/05/2024]"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "13",
      "title": "Lasting powers of attorney: restrictions",
      "content": "13. —(1) A donee under a lasting power of attorney (or, if more than one, any of them) may only make decisions under the lasting power of attorney where P lacks capacity, or the donee reasonably believes that P lacks capacity. (2) A lasting power of attorney does not authorise the donee (or, if more than one, any of them) to do an act that is intended to restrain P, unless 2 further conditions are satisfied. (3) The first condition is that the donee reasonably believes that it is necessary to do the act in order to prevent harm to P. (4) The second condition is that the act is a proportionate response to — ( a ) the likelihood of P’s suffering harm; and ( b ) the seriousness of that harm. (5) For the purposes of this section, the donee restrains P if the donee — ( a ) uses, or threatens to use, force to secure the doing of an act which P resists; or ( b ) restricts P’s liberty of movement, whether or not P resists, or if the donee authorises another person to do any of those things. (6) Subject to subsection (8), where a lasting power of attorney authorises the donee (or, if more than one, any of them) to make decisions about P’s personal welfare, the authority extends to giving or refusing consent to the carrying out or continuation of a treatment by a person providing health care for P if, and only if, the instrument contains express provision to that effect. (7) For the purposes of subsection (6), treatment, in relation to P, includes the conduct of a clinical trial on P. (7A) Where a lasting power of attorney authorises the donee (or, if more than one, any of them) to make decisions about P’s personal welfare, the authority extends to giving, refusing or revoking appropriate consent involving P under the Human Biomedical Research Act 2015 if, and only if, the instrument contains express provision to that effect. [29/2015] (8) Despite anything in the lasting power of attorney, a donee authorised to make decisions about P’s personal welfare may not make any decision with respect to the carrying out or continuation of — ( a ) life-sustaining treatment on P, whether or not amounting to extraordinary life-sustaining treatment within the meaning of section 2 of the Advance Medical Directive Act 1996; or ( b ) any other treatment on P which a person providing health care reasonably believes is necessary to prevent a serious deterioration in P’s condition. (9) Despite anything in the lasting power of attorney, a donee authorised to make decisions about P’s property and affairs may not — ( a ) make, on P’s behalf, any nomination under section 132(2) or 133(2) of the Insurance Act 1966; ( b ) where any nomination under section 132(2) or 133(2) of the Insurance Act 1966 has been made by P or by the court on P’s behalf, revoke, on P’s behalf, that nomination under section 132(7) or 133(4) (as the case may be) of that Act; or ( c ) execute a will for P. (9A) Despite anything in the lasting power of attorney, a donee authorised to make decisions about P’s property and affairs may not — ( a ) execute under section 15(6A) or 25(1) of the Central Provident Fund Act 1953, on P’s behalf, any memorandum under section 25(1) of that Act; or ( b ) where any such memorandum has been executed, or any nomination has been made under section 25(1) of that Act, by P or by the court on P’s behalf, revoke, on P’s behalf, that memorandum or nomination, as the case may be. (10) Despite any other provision of this Act, a person dealing with a donee in matters relating to P’s personal welfare or property may require the donee to produce a certificate from a registered medical practitioner stating that P’s lack of capacity is likely to be permanent, and if the donee fails to produce the certificate, the person may refuse to accept the donee’s authority to make decisions for P in such matters. [Act 16 of 2021 wef 14/11/2022] (11) This section does not affect any other power conferred on a donee of a lasting power of attorney under any other written law."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "14",
      "title": "Scope of lasting powers of attorney: gifts",
      "content": "14. —(1) Where a lasting power of attorney confers authority to make decisions about P’s property and affairs, it does not authorise a donee (or, if more than one, any of them) to dispose of the donor’s property by making gifts except to the extent permitted under subsections (2) and (3). (2) The donee may make gifts if, and only if, the lasting power of attorney contains express authorisation to that effect. (3) Where the express authorisation in the lasting power of attorney does not specify the value of the gift or gifts to be made, the donee — ( a ) may make a gift or gifts of such value which are not unreasonable having regard to all the circumstances and, in particular, the size of the donor’s estate; and ( b ) must have regard to the principle in section 6(7). (4) Subsection (3) does not affect section 11(4)."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "15",
      "title": "Revocation of lasting powers of attorney, etc.",
      "content": "15. —(1) This section applies if — ( a ) P has executed an instrument with a view to creating a lasting power of attorney; or ( b ) a lasting power of attorney is registered as having been conferred by P, and in this section, references to revoking the power include revoking the instrument. (2) P may, at any time when P has capacity to do so, revoke the power. (3) P’s bankruptcy revokes the power so far as it relates to P’s property and affairs. (4) The occurrence in relation to a donee of an event mentioned in subsection (5) — ( a ) terminates the donee’s appointment; and ( b ) except in the cases given in subsection (6), revokes the power. (5) The events are — ( a ) the disclaimer of the appointment by the donee in accordance with such requirements as may be prescribed for the purposes of this section in regulations made under this Act; ( b ) subject to subsection (7), the death or bankruptcy of the donee or, if the donee is a person other than an individual, its liquidation, winding up, dissolution or being under judicial management; ( c ) subject to subsection (8), the dissolution or annulment of a marriage between the donor and the donee; ( d ) the lack of capacity of the donee. (6) The cases mentioned in subsection (4)( b ) are — ( a ) the donee is replaced under the terms of the instrument; ( b ) the donee is one of 2 or more persons appointed to act as donees jointly and severally in respect of any matter and, after the event, there is at least one remaining donee. (7) The bankruptcy of a donee does not terminate the donee’s appointment, or revoke the power, insofar as the donee’s authority relates to P’s personal welfare. (8) The dissolution or annulment of a marriage between the donor and the donee does not terminate the appointment of a donee, or revoke the power, if the instrument provided that it was not to do so. (9) A donor who revokes a lasting power of attorney must notify all the following persons that the donor has done so: ( a ) the Public Guardian; ( b ) the donee or (if there is more than one donee) every donee. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s15A",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "15A",
      "title": "Rectification by Public Guardian",
      "content": "15A. —(1) The donor or donee (or if there is more than one donee, any of them) of a non-electronic lasting power of attorney may, at any time after the date an electronic copy of it is treated as being free from any relevant error and as the lasting power of attorney under section 11(12), give a notice to the Public Guardian of any relevant error in the electronic copy. (2) The Public Guardian may, upon receipt of any notice mentioned in subsection (1) or on the Public Guardian’s own initiative, rectify a relevant error in an electronic copy of a non-electronic lasting power of attorney. (3) The Public Guardian must give a written notice of any rectification under subsection (2) to the donor and the donee or (if there is more than one donee) every donee of the non-electronic lasting power of attorney. (4) The Public Guardian must maintain a record of every rectification made under subsection (2). (5) In this section — “electronic copy”, in relation to a non-electronic lasting power of attorney, means an electronic copy of the lasting power of attorney caused to be made and kept in the electronic transaction system by the Public Guardian; “relevant error”, in relation to an electronic copy of a non-electronic lasting power of attorney, means any disparity or inconsistency between the electronic copy and the lasting power of attorney that is registered by the Public Guardian. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "16",
      "title": "Protection of donees and others if lasting power of attorney not validly created, revoked or suspended, etc.",
      "content": "16. —(1) This section applies where — ( a ) an instrument purporting to create a lasting power of attorney has been registered under the First Schedule, but a lasting power of attorney was not validly created, whether or not the registration is cancelled at the time of the act or transaction in question; or ( b ) a lasting power of attorney, or a power under a lasting power of attorney, is revoked or suspended. [10/2016] (2) A donee who does an act that would have been within the scope of the lasting power of attorney without knowing of the non‑existence, revocation or suspension of the lasting power of attorney or the power under the lasting power of attorney does not incur any liability to P or any other person, despite the non‑existence, revocation or suspension. [10/2016] (3) If a lasting power of attorney or a power under a lasting power of attorney is non‑existent, revoked or suspended, a person (called in this section a third party) who deals or otherwise transacts in good faith with the donee, without knowing of the non‑existence, revocation or suspension, is entitled to rely on the lasting power of attorney or the power under the lasting power of attorney in relation to that dealing or transaction in the same manner and to the same extent as if the lasting power of attorney or the power under the lasting power of attorney exists or had not been revoked or suspended. [10/2016] (4) It is conclusively presumed in favour of a purchaser from a third party who dealt or otherwise transacted with a donee that the dealing or transaction was valid if — ( a ) the dealing or transaction was completed within 12 months after the date on which the instrument intending to create a lasting power of attorney was registered; or ( b ) the third party makes a statutory declaration, before, on or within 3 months after, the completion of the purchase by the purchaser, that the third party had no reason at the time of the dealing or transaction with the donee to doubt the donee’s authority to deal or transact. [10/2016] (5) In subsection (4), “purchaser” means a person claiming through the third party and who acquires the property in good faith and for valuable consideration. [10/2016] (6) For the purposes of this section, knowledge that a lasting power of attorney or a power under a lasting power of attorney does not exist or has been revoked or suspended includes knowledge of the happening of any event — ( a ) which prevents the lasting power of attorney from being created; or ( b ) which has the effect of revoking or suspending the lasting power of attorney or the power under the lasting power of attorney. [10/2016] (7) In this section, where 2 or more donees are appointed under a lasting power of attorney, a reference to the donee is a reference to all or any of the donees. [10/2016] (8) This section applies only to acts and transactions made on or after 30 June 2016, whether the lasting power of attorney or the power under the lasting power of attorney is created or purported to be created, or revoked or suspended, before, on or after that date. [10/2016]"
    },
    {
      "provision_ref": "s16A",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "16A",
      "title": "Protection of donees and others if electronic copy of lasting power of attorney has relevant error",
      "content": "16A. —(1) If an electronic copy of a non-electronic lasting power of attorney has a relevant error, a donee of the lasting power of attorney who does an act in reliance on the electronic copy without knowing of the relevant error does not incur any liability to P or to any other person, by reason only of the relevant error. (2) If an electronic copy of a non-electronic lasting power of attorney has a relevant error, a person who deals or otherwise transacts in good faith with the donee without knowing of the relevant error is entitled to rely on the electronic copy in relation to that dealing or transaction. (3) In this section, where 2 or more donees are appointed under a non-electronic lasting power of attorney, a reference to the donee is a reference to all or any of the donees. (4) In this section — “electronic copy”, in relation to a non-electronic lasting power of attorney, means — ( a ) an electronic copy of the lasting power of attorney that is treated as being free from any relevant error and as the lasting power of attorney under section 11(12); or ( b ) where the electronic copy mentioned in paragraph ( a ) has been rectified by the Public Guardian under section 15A(2), the electronic copy so rectified; “relevant error”, in relation to an electronic copy of a non-electronic lasting power of attorney, means any disparity or inconsistency between the electronic copy and the lasting power of attorney that is registered by the Public Guardian. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "17",
      "title": "Powers of court in relation to validity of lasting powers of attorney",
      "content": "17. —(1) This section and section 18 apply if — ( a ) a person (“P”) has executed or purported to execute an instrument with a view to creating a lasting power of attorney; or ( b ) an instrument has been registered as a lasting power of attorney conferred by P. (2) The court may determine any question relating to — ( a ) whether one or more of the requirements for the creation of a lasting power of attorney have been met; ( b ) whether the power has been revoked or has otherwise come to an end. (3) Subsection (4) applies if the court is satisfied — ( a ) that fraud or undue pressure was used to induce P — (i) to execute an instrument for the purpose of creating a lasting power of attorney; or (ii) to create a lasting power of attorney; ( b ) that the donee (or any of the donees, if more than one) of a lasting power of attorney — (i) is convicted, on or after 1 September 2018 (but not before the donee’s appointment under the lasting power of attorney), of an offence (whenever committed) of criminal misappropriation, criminal breach of trust, cheating, theft or extortion or any other offence involving fraud or dishonesty, whether as against P or another person; (ii) engages or has engaged in conduct that contravenes the donee’s authority, or that is not in P’s best interests (whether or not the donee is acting under a lasting power of attorney); or (iii) proposes to engage in conduct that would contravene the donee’s authority, or that would not be in P’s best interests (whether or not the donee is acting under a lasting power of attorney); or ( c ) where the donee (or any of the donees, if more than one) of a lasting power of attorney is a professional donee, that — (i) the registration of the donee as a professional deputy is cancelled or the donee is no longer within a class of persons prescribed as qualified to be a professional donee; and (ii) P lacks capacity. [10/2016] (4) The court may — ( a ) direct that an instrument purporting to create the lasting power of attorney is not to be registered; ( b ) if P lacks capacity to do so, revoke the instrument or the lasting power of attorney; or ( c ) in a case referred to in subsection (3)( c ), revoke the instrument or the lasting power of attorney so far as it relates to the donee whose registration as a professional deputy is cancelled or who is no longer within a class of persons prescribed as qualified to be a professional donee. [10/2016] (5) If there is more than one donee, the court may under subsection (4)( b ) revoke the instrument or the lasting power of attorney in respect of all or such of the matters to which the lasting power of attorney relates as the court thinks fit, so far as it relates to any of the donees. [10/2016] (6) The court may under subsection (4)( b ) or ( c ) revoke the instrument or the lasting power of attorney in respect of all or such of the matters to which the lasting power of attorney relates as the court thinks fit. [10/2016] (7) The court may make further orders or give directions as the court thinks necessary or expedient for giving effect to, or otherwise in connection with, the revocation of the instrument or the lasting power of attorney. [10/2016] (8) In this section, “donee” includes an intended donee."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - LASTING POWERS OF ATTORNEY",
      "section": "18",
      "title": "Powers of court in relation to operation of lasting powers of attorney",
      "content": "18. —(1) The court may determine any question as to the meaning or effect of a lasting power of attorney or an instrument purporting to create one. (2) The court may — ( a ) give directions with respect to decisions — (i) which the donee of a lasting power of attorney has authority to make; and (ii) which P lacks capacity to make; ( b ) give any consent or authorisation to act which the donee would have to obtain from P if P had capacity to give it. (3) The court may, if P lacks capacity to do so — ( a ) give directions to the donee with respect to the rendering by the donee of reports or accounts and the production of records kept by the donee for that purpose; ( b ) require the donee to supply information or produce documents or things in the donee’s possession as donee; ( c ) give directions with respect to the remuneration or expenses of the donee; ( d ) relieve the donee wholly or partly from any liability which the donee has or may have incurred on account of a breach of the donee’s duties as donee. (4) The court may authorise the making of gifts which are not within section 14(3). (5) Where 2 or more donees are appointed under a lasting power of attorney, this section applies as if references to the donee were to all or any of them."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "19",
      "title": "Power to make declarations",
      "content": "19. —(1) The court may make declarations as to — ( a ) whether a person has or lacks capacity to make a decision specified in the declaration; ( b ) whether a person has or lacks capacity to make decisions on the matters described in the declaration; ( c ) the lawfulness or otherwise of any act done, or yet to be done, in relation to that person. (2) In subsection (1)( c ), “act” includes an omission and a course of conduct."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "20",
      "title": "Powers to make decisions and appoint deputies: general",
      "content": "20. —(1) This section applies if a person (“P”) lacks capacity in relation to a matter or matters concerning — ( a ) P’s personal welfare; or ( b ) P’s property and affairs. (2) The court may — ( a ) by making an order, make the decision or decisions on P’s behalf in relation to the matter or matters; or ( b ) appoint a person (called in this Act a deputy) to make decisions on P’s behalf in relation to the matter or matters. (3) The powers of the court under this section are subject to the provisions of this Act and, in particular, to sections 3 (principles) and 6 (best interests). (4) When deciding whether it is in P’s best interests to appoint a deputy, the court must have regard (in addition to the matters mentioned in section 6) to the principles that — ( a ) a decision by the court is to be preferred to the appointment of a deputy to make a decision; and ( b ) the powers conferred on a deputy should be as limited in scope and duration as is reasonably practicable in the circumstances. (5) Subject to section 25 (restrictions on deputies), the court may make such further orders or give such directions, and confer on a deputy such powers or impose on the deputy such duties, as it thinks necessary or expedient for giving effect to, or otherwise in connection with, an order or appointment made by it under subsection (2). (6) Without affecting section 6, the court may make the order, give the directions or make the appointment on such terms as it considers are in P’s best interests, even though no application is before the court for an order, directions or an appointment on those terms. (7) An order of the court may be varied or discharged by a subsequent order. (8) The court may, in particular, revoke the appointment of a deputy or vary the powers conferred on the deputy if it is satisfied that — ( a ) the deputy is convicted, on or after 1 September 2018 (but not before the deputy’s appointment by the court), of an offence (whenever committed) of criminal misappropriation, criminal breach of trust, cheating, theft or extortion or any other offence involving fraud or dishonesty, whether as against P or another person; ( b ) the deputy engages or has engaged in conduct that contravenes the deputy’s authority conferred by the court, or that is not in P’s best interests (whether or not the deputy is acting under a court order); ( c ) the deputy proposes to engage in conduct that would contravene the deputy’s authority conferred by the court, or that would not be in P’s best interests (whether or not the deputy is acting under a court order); or ( d ) where the deputy is a professional deputy, the registration of the deputy as a professional deputy is cancelled. [10/2016]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "21",
      "title": "Powers to make decisions and appoint deputies: minors",
      "content": "21. —(1) Subject to subsection (2), the powers under section 20 as respects any matter may be exercised even though P has not attained the age of 21 years, if the court considers it likely that P will still lack capacity to make decisions in respect of that matter when P attains the age of 21 years. (2) When deciding whether it is in P’s best interests to appoint a deputy to make decisions on P’s behalf, the court must have regard (in addition to the matters mentioned in section 20) to the principle that an appointment of the parents or guardian of P as deputy is to be preferred to the appointment of any other person as deputy."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "22",
      "title": "Section 20 powers: personal welfare",
      "content": "22. —(1) The powers under section 20 as respects P’s personal welfare include — ( a ) deciding where P is to live; ( b ) deciding what contact (if any) P is to have with any specified person; ( c ) making an order prohibiting a named person from having contact with P; ( d ) subject to subsection (3), giving or refusing consent to the carrying out or continuation of a treatment (including the conduct of a clinical trial) by a person providing health care for P; ( e ) giving, refusing or revoking of appropriate consent involving P under the Human Biomedical Research Act 2015; and ( f ) giving a direction that a person responsible for P’s health care allow a different person to take over that responsibility. [29/2015] (2) Subsection (1) — ( a ) is subject to section 25 (restrictions on deputies); and ( b ) does not affect any other order or decision which may be made by the court or deputy under any other written law. (3) Nothing in subsection (1)( d ) affects the operation of the Advance Medical Directive Act 1996."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "23",
      "title": "Section 20 powers: property and affairs",
      "content": "23. —(1) Subject to this section, the powers under section 20 as respects P’s property and affairs include — ( a ) the control and management of P’s property; ( b ) the sale, exchange, charging, gift or other disposition of P’s property; ( c ) the acquisition of property in P’s name or on P’s behalf; ( d ) the carrying on, on P’s behalf, of any profession, trade or business; ( e ) the taking of a decision which will have the effect of dissolving a partnership of which P is a member; ( f ) the carrying out of any contract entered into by P; ( g ) the discharge of P’s debts and of any of P’s obligations, whether legally enforceable or not; ( h ) the settlement of any of P’s property by way of trust, whether for P’s benefit or for the benefit of others; ( i ) the making, on P’s behalf, of any nomination under section 132(2) or 133(2) of the Insurance Act 1966; ( j ) where any nomination under section 132(2) or 133(2) of the Insurance Act 1966 has been made by P or on P’s behalf, the revoking, on P’s behalf, of that nomination under section 132(7) or 133(4) (as the case may be) of that Act; ( k ) the execution for P of a will; ( l ) the executing under section 15(6A) or 25(1) of the Central Provident Fund Act 1953, on P’s behalf, of any memorandum under section 25(1) of that Act; ( m ) where any such memorandum has been executed, or any nomination has been made under section 25(1) of that Act, by P or by the court on P’s behalf, the revoking, on P’s behalf, of that memorandum or nomination, as the case may be; ( n ) the maintenance, education, benefit and advancement of P’s spouse, P’s parent, a child of P below 21 years of age or an intellectually disabled child of P; ( o ) the exercise of any power (including a power to consent) vested in P whether beneficially or as trustee under a trust; ( p ) the conduct of legal proceedings in P’s name or on P’s behalf. (2) Without affecting section 20(3), the court, in making an order for the disposition or settlement of P’s property under subsection (1)( b ) or ( h ), must have regard to the principle in section 6(7). (3) No will may be made under subsection (1)( k ) at a time when P has not attained the age of 21 years. (4) The provisions of the Second Schedule supplement the provisions of this section. (5) Section 20(7) is subject to paragraph 6 of the Second Schedule. (6) Subsection (1) is subject to section 25 (restrictions on deputies)."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "24",
      "title": "Appointment of deputies",
      "content": "24. —(1) A deputy appointed by the court must be — ( a ) where the appointment confers powers relating only to P’s property and affairs — (i) an individual who has attained the age of 21 years and provides to P the services of a deputy without remuneration; (ii) an individual who is a professional deputy and is not related to P by blood or marriage; or (iii) a professional deputy who is not an individual; and ( b ) in any other case — (i) an individual who has attained the age of 21 years and provides to P the services of a deputy without remuneration; or (ii) an individual who is a professional deputy and is not related to P by blood or marriage. [10/2016] (2) The court may appoint an individual as a deputy by appointing the holder for the time being of a specified office or position. (3) A person may not be appointed as a deputy without the person’s consent. (4) The court may appoint 2 or more deputies to act — ( a ) jointly; ( b ) jointly and severally; or ( c ) jointly in respect of some matters and jointly and severally in respect of others. (5) When appointing a deputy, the court may at the same time appoint one or more other persons to succeed the deputy (each called in this Act a successor deputy) — ( a ) in such circumstances, or on the happening of such events, as may be specified by the court; and ( b ) for such period as may be specified by the court. (6) In the case of an application to which section 21 applies, the court is to have regard to the wishes of the parents or guardian of P on the choice of the successor deputy. (7) A deputy is to be treated as P’s agent in relation to anything done or decided by the deputy within the scope of the deputy’s appointment and in accordance with this Part. (8) A deputy under subsection (1)( a )(i) or ( b )(i) is entitled to be reimbursed out of P’s property for the deputy’s reasonable expenses in discharging the deputy’s functions, but is not entitled to remuneration. [10/2016] (9) A deputy under subsection (1)( a )(ii) or (iii) or ( b )(ii) is entitled — ( a ) to be reimbursed out of P’s property for the deputy’s reasonable expenses in discharging the deputy’s functions; and ( b ) to such remuneration, as the court determines, out of P’s property for discharging the deputy’s functions. [10/2016] (10) The court may confer on a deputy powers to — ( a ) take possession or control of all or any specified part of P’s property; ( b ) exercise all or any specified powers in respect of it, including such powers of investment as the court may determine. (11) The court may require a deputy — ( a ) to give to the Public Guardian such security as the court thinks fit for the due discharge of the deputy’s functions; and ( b ) to submit to the Public Guardian such reports at such times or at such intervals as the court may direct."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "25",
      "title": "Restrictions on deputies",
      "content": "25. —(1) A deputy does not have power to make a decision on behalf of P in relation to a matter if the deputy knows or has reasonable grounds for believing that P has capacity in relation to the matter. (2) Nothing in section 20(5) or 22 permits a deputy to be given power — ( a ) to prohibit a named person from having contact with P; or ( b ) to direct a person responsible for P’s health care to allow a different person to take over that responsibility. (3) A deputy may not be given powers with respect to — ( a ) the disposition of P’s property by making gifts; ( b ) the making, on P’s behalf, of any nomination under section 132(2) or 133(2) of the Insurance Act 1966; ( c ) where any nomination under section 132(2) or 133(2) of the Insurance Act 1966 has been made by P or by the court on P’s behalf, the revoking, on P’s behalf, of that nomination under section 132(7) or 133(4) (as the case may be) of that Act; ( d ) the execution for P of a will; ( e ) the executing under section 15(6A) or 25(1) of the Central Provident Fund Act 1953, on P’s behalf, of any memorandum under section 25(1) of that Act; ( f ) where any such memorandum has been executed, or any nomination has been made under section 25(1) of that Act, by P or by the court on P’s behalf, the revoking, on P’s behalf, of that memorandum or nomination, as the case may be; or ( g ) the carrying out or continuation of — (i) life-sustaining treatment on P, whether or not amounting to extraordinary life-sustaining treatment within the meaning of section 2 of the Advance Medical Directive Act 1996; or (ii) any other treatment on P which a person providing health care reasonably believes is necessary to prevent a serious deterioration in P’s condition. (4) A deputy may not be given power to make a decision on behalf of P which is inconsistent with a decision made by the donee of a lasting power of attorney granted by P (or, if there is more than one donee, by any of them) that is within the scope of the donee’s authority and in accordance with this Act. (5) The authority conferred on a deputy is subject to the provisions of this Act and, in particular, sections 3 (principles) and 6 (best interests). (6) A deputy may not do an act that is intended to restrain P unless 4 conditions are satisfied. (7) The first condition is that, in doing the act, the deputy is acting within the scope of an authority expressly conferred on the deputy by the court. (8) The second condition is that P lacks, or the deputy reasonably believes that P lacks, capacity in relation to the matter in question. (9) The third condition is that the deputy reasonably believes that it is necessary to do the act in order to prevent harm to P. (10) The fourth condition is that the act is a proportionate response to — ( a ) the likelihood of P’s suffering harm; or ( b ) the seriousness of that harm. (11) For the purposes of this section, a deputy restrains P if the deputy — ( a ) uses, or threatens to use, force to secure the doing of an act which P resists; or ( b ) restricts P’s liberty of movement, whether or not P resists, or if the deputy authorises another person to do any of those things."
    },
    {
      "provision_ref": "s25A",
      "chapter": "PART 5 - GENERAL POWERS OF COURT AND APPOINTMENT OF DEPUTIES",
      "section": "25A",
      "title": "Professional deputies",
      "content": "25A. —(1) Any person who intends to offer and provide the services of a deputy for remuneration must register with the Public Guardian as a professional deputy. [10/2016] (2) The Public Guardian may register a person as a professional deputy upon being satisfied that the person meets all the prescribed criteria. [10/2016] (3) A professional deputy’s registration under this section may be subject to such terms and conditions as the Public Guardian may specify. [10/2016] (4) The Public Guardian may cancel the registration of a professional deputy at the professional deputy’s request or upon the occurrence of any prescribed event. [10/2016] (5) Before cancelling a professional deputy’s registration upon the occurrence of any prescribed event, the Public Guardian must give the professional deputy written notice of the intention to cancel the registration. [10/2016] (6) The professional deputy may make representations to the Public Guardian within the prescribed period after receiving the notice in subsection (5). [10/2016] (7) The Public Guardian must consider any representations made by the professional deputy under subsection (6) before making a decision. [10/2016] (8) The Public Guardian must inform the professional deputy in writing of the decision within the prescribed period after the end of the period in subsection (6) for making representations. [10/2016] (9) Any person who is aggrieved by the Public Guardian’s refusal to register the person as a professional deputy or cancellation of the person’s registration as a professional deputy may within the prescribed period appeal to the Minister, whose decision is final. [10/2016] (10) Where a person’s registration as a professional deputy is cancelled, the Public Guardian must within the prescribed period inform all the following persons of the cancellation: ( a ) where the person has been appointed as a donee in any lasting power of attorney, the donor of the lasting power of attorney; ( b ) the prescribed person or persons, if any. [10/2016]"
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 6 - EXCLUDED DECISIONS AND DECLARATORY PROVISIONS",
      "section": "26",
      "title": "Excluded decisions",
      "content": "26. Nothing in this Act permits a decision on any of the following matters to be made on behalf of a person: ( a ) consenting to marriage; ( b ) consenting to touching of a sexual nature; ( c ) consenting to a decree of divorce being granted on the basis of 3 years’ separation; ( d ) consenting or revoking consent to the making of an adoption order under the Adoption of Children Act 2022 or any corresponding previous written law; [Act 20 of 2022 wef 15/10/2024] ( e ) adopting or renouncing a religion; ( f ) receiving treatment for change of gender; ( g ) consenting or revoking consent to treatment for sexual sterilisation within the meaning of the Voluntary Sterilisation Act 1974; ( h ) consenting or revoking consent to treatment to terminate pregnancy; ( i ) registering or withdrawing an objection under section 8 of the Human Organ Transplant Act 1987 in respect of removal of an organ from the person upon his death; ( j ) making or revoking an advance medical directive under section 3 or 7 of the Advance Medical Directive Act 1996; ( k ) making or revoking a gift of a body or any part thereof under section 3 or 9 of the Medical (Therapy, Education and Research) Act 1972; ( l ) such other matter as may be prescribed."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 6 - EXCLUDED DECISIONS AND DECLARATORY PROVISIONS",
      "section": "27",
      "title": "Mental Health (Care and Treatment) Act 2008 matters",
      "content": "27. —(1) Nothing in this Act authorises anyone — ( a ) to give a patient medical treatment for mental disorder; or ( b ) to consent to a patient’s being given medical treatment for mental disorder, if, at the time when it is proposed to treat the patient, his or her treatment is regulated by the Mental Health (Care and Treatment) Act 2008. (2) In this section, “treatment” and “mental disorder” have the meanings given by the Mental Health (Care and Treatment) Act 2008."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 6 - EXCLUDED DECISIONS AND DECLARATORY PROVISIONS",
      "section": "28",
      "title": "Voting rights",
      "content": "28. Nothing in this Act permits a decision on voting at an election for any public office, or at a national referendum, to be made on behalf of a person."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 6 - EXCLUDED DECISIONS AND DECLARATORY PROVISIONS",
      "section": "29",
      "title": "Scope of Act",
      "content": "29. —(1) To avoid doubt, it is declared that nothing in this Act is to be taken to affect the law relating to murder, culpable homicide not amounting to murder or abetment of suicide. [29/2015] (2) To avoid doubt, it is declared that nothing in this Act is to be taken to affect the giving, refusing or revoking of consent on behalf of a person who lacks mental capacity by a person who is expressly authorised to do so under — ( a ) the Human Biomedical Research Act 2015; or ( b ) any written law relating to a clinical trial. [29/2015]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "30",
      "title": "Public Guardian",
      "content": "30. —(1) For the purposes of this Act, there is to be an officer known as the Public Guardian to be appointed by the Minister. (1A) The Minister may appoint any number of Assistant Public Guardians that the Minister thinks necessary to assist the Public Guardian in the proper discharge of the Public Guardian’s functions. [10/2016] (1B) An Assistant Public Guardian may exercise all the powers of the Public Guardian, except the powers exercisable under subsections (3) and (4). [10/2016] (2) If the Public Guardian is temporarily absent from Singapore or temporarily incapacitated by reason of illness or for any reason temporarily unable to perform his or her duties, the Minister may appoint an Assistant Public Guardian or any other person to act in the place of the Public Guardian during any such period of absence from duty. [10/2016] (3) The Public Guardian may in writing appoint any public officer as an authorised officer for the purposes of this Act. (4) The Public Guardian may delegate to any authorised officer all or any of the functions or powers conferred on the Public Guardian by this Act except the powers conferred by this subsection. (5) The Public Guardian may disclose information obtained in connection with the administration or execution of this Act to any authorised officer if this is necessary to enable the authorised officer to perform his or her official duties under this Act. (6) An authorised officer to whom information under subsection (5) is disclosed may only disclose or use the information to the extent necessary for performing his or her official duties under this Act, but not otherwise. (7) Any person who contravenes subsection (6) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both. (8) Subsections (5) and (6) do not affect any right of disclosure under this Act or any other written law or rule of law. (9) The Public Guardian and every Assistant Public Guardian are deemed to be public servants for the purposes of the Penal Code 1871. [10/2016]"
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "31",
      "title": "Functions of Public Guardian",
      "content": "31. —(1) The Public Guardian has the following functions: ( a ) establishing and maintaining a register of lasting powers of attorney; ( b ) establishing and maintaining a register of orders appointing deputies; ( ba ) establishing and maintaining a register of professional deputies; ( c ) supervising deputies appointed by the court; ( d ) directing a member of the Board of Visitors to visit — (i) a donee of a lasting power of attorney; (ii) a deputy appointed by the court; or (iii) the person granting the lasting power of attorney or for whom the deputy is appointed (“P”), and to make a report to the Public Guardian on such matters as the Public Guardian may direct; ( e ) receiving security which the court requires a person to give for the discharge of the person’s functions; ( f ) receiving reports from donees of lasting powers of attorney and deputies appointed by the court; ( g ) reporting to the court on such matters relating to proceedings under this Act as the court requires; ( h ) dealing with representations (including complaints) about the way in which a donee of a lasting power of attorney or a deputy appointed by the court is exercising the donee’s or the deputy’s powers; ( i ) dealing with representations (including complaints) about any act purportedly carried out under section 10; ( j ) investigating any contravention or alleged contravention of any provision of this Act; ( k ) publishing, in any manner the Public Guardian thinks appropriate, any information he or she thinks appropriate about the discharge of his or her functions; [10/2016] [Act 16 of 2021 wef 14/11/2022] ( l ) establishing and maintaining the electronic transaction system. [Act 16 of 2021 wef 14/11/2022] (2) The functions conferred by subsection (1)( c ), ( h ) and ( i ) may be discharged in cooperation with any other person who has functions relating to the care or treatment or the property and affairs of P. (3) The Minister may, by regulations, make provision — ( a ) conferring on the Public Guardian other functions in connection with this Act; ( b ) in connection with the discharge by the Public Guardian of his or her functions. (4) Regulations made under subsection (3)( b ) may in particular make provision as to — ( a ) the giving of security by deputies appointed by the court and the enforcement and discharge of security so given; ( b ) the fees which the Public Guardian may charge; ( c ) the way in which, and funds from which, such fees are to be paid; ( d ) exemptions from and reductions in such fees; ( e ) remission of such fees in whole or in part; and ( f ) the making of reports to the Public Guardian by deputies appointed by the court and others who are directed by the court to carry out any transaction for a person who lacks capacity."
    },
    {
      "provision_ref": "s31A",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "31A",
      "title": "Public Guardian may interview donor",
      "content": "31A. —(1) If on receiving an application to register an instrument purporting to create a lasting power of attorney, the Public Guardian has reasonable cause to suspect that fraud or undue pressure was used to induce a person (“P”) to — ( a ) execute the instrument; or ( b ) execute the instrument to appoint a particular person as P’s donee, the Public Guardian or an authorised officer mentioned in section 30(3) may require P to appear before the Public Guardian or the authorised officer (as the case may be) at any reasonable time and at any convenient place. (2) The Public Guardian or authorised officer may interview P to ascertain whether any fraud or undue pressure was used to induce P to do either of the acts mentioned in subsection (1)( a ) or ( b ). (3) Where the Public Guardian has reason to suspect that fraud or undue pressure has been used to induce P to execute an instrument to appoint a particular person as P’s donee, the Public Guardian may disclose to P the following information: ( a ) the number of lasting powers of attorney under which that person is appointed as donee; ( b ) the number of applications pending for the registration of an instrument that appoints that person as a donee under the instrument. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "32",
      "title": "Powers of investigation by Public Guardian",
      "content": "32. —(1) The Public Guardian may, for the purpose of discharging his or her functions under this Act — ( a ) require any person who has any information which relates or is reasonably believed to relate to a person who lacks capacity to provide the Public Guardian with the information; ( b ) require any person who has in the person’s custody or under the person’s control any document which relates or is reasonably believed to relate to a person who lacks capacity — (i) to provide the Public Guardian with a copy of or an extract from the document; or (ii) unless the document forms part of the records or other documents of a public authority or any court of competent jurisdiction, to provide the Public Guardian with the document itself for his or her inspection; or ( c ) require any person mentioned in paragraph ( a ) or ( b ) to attend at a specified time and place to provide such information orally or in writing, or such documents or copies or extracts thereof, as the case may be. (2) The Public Guardian is entitled without payment to keep any copy or extract provided under subsection (1). (3) Where a document provided for inspection under subsection (1)( b )(ii) is not held by any person entitled to the custody of the document, the Public Guardian may keep it or deliver it to any other person who may be entitled to the custody of the document. (4) The Public Guardian has at all times full and free access to all buildings, places, books, papers and electronic computing or storage devices for the purpose of discharging his or her functions under this Act, and may, without payment, inspect, copy or make extracts from any such books, papers or electronic computing or storage devices. (5) The Public Guardian may take possession of any book, paper or electronic computing or storage device mentioned in subsection (4), and remove it from any building or place, where in his or her opinion — ( a ) the inspection, copying thereof or extraction therefrom cannot reasonably be performed without taking possession; ( b ) the book, paper or electronic computing or storage device may be interfered with or destroyed unless possession thereof is taken; or ( c ) the book, paper or electronic computing or storage device may be required as evidence in proceedings for an offence under this Act. (6) Any person who fails to comply with any requirement specified under subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $50 for every day or part thereof during which the offence continues after conviction. (7) If a person is charged with an offence for failing to comply with any requirement specified under subsection (1), it is a defence for the person to prove that the person had a reasonable excuse for failing to comply with the requirement. (8) Any person who — ( a ) knowingly or recklessly provides to the Public Guardian or an authorised officer any information or document which is false or misleading in a material particular; or ( b ) wilfully alters, suppresses, conceals or destroys any document or any part of such document which the person is or may be required to provide under this Act, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. (9) Nothing in this section — ( a ) compels a professional legal adviser to disclose or produce a privileged communication, or a document or other material containing a privileged communication, made by or to him or her in that capacity; or ( b ) authorises the taking of any such document or other material which is in his or her possession. (10) Subject to subsection (11), the Public Guardian may disclose to another public officer any information received by him or her under or for the purposes of this Act, where the disclosure is made for any purpose — ( a ) connected with the discharge of the functions of the Public Guardian; and ( b ) of enabling or assisting that other public officer to discharge any of his or her functions. (11) Where any information disclosed to the Public Guardian under this Act is so disclosed subject to any express restriction on the disclosure of the information by the Public Guardian, the Public Guardian’s power of disclosure under subsection (10) is, in relation to the information, exercisable by the Public Guardian subject to any such restriction."
    },
    {
      "provision_ref": "s32A",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "32A",
      "title": "Evidence of transaction with Public Guardian",
      "content": "32A. —(1) Despite any other written law or rule of law, any document prepared by the Public Guardian that — ( a ) consists of information reproduced or extracted from any original document; and ( b ) contains a statement by the Public Guardian that the information is a true reproduction or extract of the original document, is in any proceedings admissible in evidence in place of and to the same extent as the original document, unless evidence to the contrary is adduced. (2) A copy of an instrument certified by the Public Guardian under paragraph 11 of the First Schedule to be a true copy of the original instrument registered to create a lasting power of attorney is — ( a ) evidence of the contents of the original instrument on the date and time specified on that copy; and ( b ) evidence of the registration of the instrument by the Public Guardian on the date and time specified on that copy. (3) In this section, “original document” means a document that is filed or lodged with, submitted to, or issued by, the Public Guardian. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "33",
      "title": "Appointment of auditors",
      "content": "33. —(1) Without affecting the Public Guardian’s functions and powers under this Act, the Public Guardian may appoint in writing an auditor to assist the Public Guardian in examining, either generally or in relation to any particular matter — ( a ) any report of a donee of a lasting power of attorney or of a deputy appointed by the court; and ( b ) any book, document, electronic computing or storage device or information obtained or received by the Public Guardian in the discharge or exercise of the Public Guardian’s functions or powers under this Act. [10/2016] (2) A person is not qualified for appointment as an auditor under subsection (1) unless the person is a public accountant who is registered or deemed to be registered under the Accountants Act 2004. [10/2016] (3) For the purposes of this section, the Public Guardian may disclose to an auditor appointed under subsection (1) any book, document, electronic computing or storage device or information obtained or received by the Public Guardian under this Act, where the disclosure is necessary to enable the auditor to carry out an examination under subsection (1). [10/2016] (4) The auditor must, upon completion of the examination under subsection (1), submit a report to the Public Guardian. [10/2016]"
    },
    {
      "provision_ref": "s33A",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "33A",
      "title": "Rectification or updating on Public Guardian’s initiative",
      "content": "33A. —(1) The Public Guardian may rectify or update any particulars or document in a register kept by the Public Guardian, if the Public Guardian is satisfied that — ( a ) there is an error or a defect in the particulars or document arising from any grammatical, typographical or similar mistake; or ( b ) there is evidence of a conflict between the particulars of a person and — (i) any other information in the register relating to that person; or (ii) any other information relating to that person obtained from any Singapore public sector agency that may be prescribed. (2) Before the Public Guardian rectifies or updates a register under subsection (1), the Public Guardian must, except under prescribed circumstances, give written notice to the person whose particulars or document is to be rectified or updated of the Public Guardian’s intention to do so, and state in the notice — ( a ) the reasons for and details of the proposed rectification or updating to be made to the register; and ( b ) the date by which any written objection to the proposed rectification or updating must be delivered to the Public Guardian, being a date at least 14 days (or any longer prescribed period) after the date of the notice. (3) The person notified under subsection (2) may deliver to the Public Guardian, not later than the date specified under subsection (2)( b ), a written objection to the proposed rectification or updating of the register. (4) The Public Guardian must not rectify or update the register if the Public Guardian receives a written objection under subsection (3) to the proposed rectification or updating of the register by the date specified under subsection (2)( b ), unless the Public Guardian is satisfied that the objection is frivolous or vexatious or has been withdrawn. (5) The Public Guardian may rectify or update the register if the Public Guardian does not receive a written objection under subsection (3) by the date specified under subsection (2)( b ). (6) The Public Guardian may include such notation as the Public Guardian thinks fit on a register for the purposes of providing information relating to any error or defect in any particulars or document in the register, and may remove such notation if the Public Guardian is satisfied that it no longer serves any useful purpose. (7) Despite anything in this section, the Public Guardian may, if the Public Guardian is satisfied that there is any error or defect in any particulars or document in a register, by written notice, request that the person to which the particulars or document relates take such steps within such time as the Public Guardian may specify to ensure that the error or defect is rectified. (8) In this section — “document” does not include a lasting power of attorney; “register” means — ( a ) a register of lasting powers of attorney; ( b ) a register of orders appointing deputies; or ( c ) a register of professional deputies. [Act 16 of 2021 wef 01/04/2023]"
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "34",
      "title": "Protection from personal liability",
      "content": "34. No liability shall lie personally against any of the following individuals who, acting in good faith and with reasonable care, does or omits to do anything in the execution or purported execution of this Act: ( a ) the Public Guardian, any Assistant Public Guardian, any authorised officer or any person acting under the direction of the Public Guardian or an Assistant Public Guardian; ( b ) any member of the Board of Visitors; ( c ) any auditor appointed under section 33. [10/2016]"
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 7 - PUBLIC GUARDIAN AND BOARD OF VISITORS",
      "section": "35",
      "title": "Board of Visitors",
      "content": "35. —(1) The Minister may appoint persons to be members of a Board of Visitors. [Act 5 of 2025 wef 09/03/2025] (1A) An appointment under subsection (1) must be published in the Gazette . [Act 5 of 2025 wef 09/03/2025] (2) The Board of Visitors consists of — ( a ) Special Visitors; and ( b ) General Visitors. (3) A person is not qualified to be a Special Visitor unless he or she — ( a ) is a registered medical practitioner or appears to the Minister to have other suitable qualifications or training; and ( b ) appears to the Minister to have special knowledge of and experience in cases of impairment of or disturbance in the functioning of the mind or brain. (4) A General Visitor need not have a medical qualification. (5) A member of the Board of Visitors — ( a ) may be appointed for such term and subject to such conditions; and ( b ) may be paid such remuneration and allowances, as the Minister may determine. (6) For the purpose of carrying out his or her functions under this Act in relation to a person who lacks capacity (“P”), a member of the Board of Visitors may, at all reasonable times, examine and take copies of — ( a ) any health record; and ( b ) any record held by any person and compiled in connection with a social services function, so far as the record relates to P. (7) A member of the Board of Visitors may also for that purpose interview P in private."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 8 - SUPPLEMENTARY POWERS, PRACTICE AND PROCEDURE OF COURT",
      "section": "36",
      "title": "Interim orders and directions",
      "content": "36. The court may, pending the determination of an application to it in relation to a person (“P”), make an order or give directions in respect of any matter if — ( a ) there is reason to believe that P lacks capacity in relation to the matter; ( b ) the matter is one to which its powers under this Act extend; and ( c ) it is in P’s best interests to make the order, or give the directions, without delay."
    },
    {
      "provision_ref": "s36A",
      "chapter": "PART 8 - SUPPLEMENTARY POWERS, PRACTICE AND PROCEDURE OF COURT",
      "section": "36A",
      "title": "Orders of suspension",
      "content": "36A. —(1) Despite section 36, on the application of a person mentioned in subsection (2), the court may make an order to suspend, for such period as the court thinks fit, all or any of the powers of P’s donee or deputy (called in this section an order of suspension) even where no application has been made to the court in relation to P. [10/2016] (2) The following persons may apply to the court for an order of suspension: ( a ) the Public Guardian; ( b ) a person mentioned in section 38(1)( a ), ( b ) or ( c ); ( c ) any other person, but only with the permission of the court. [10/2016] (3) The court may make an order of suspension under subsection (1) if the court has reason to believe that — ( a ) P lacks capacity; ( b ) the donee or deputy — (i) is charged on or after 30 June 2016 (but not before the donee’s or deputy’s appointment under the lasting power of attorney or by the court, as the case may be) with an offence (whenever committed) of criminal misappropriation, criminal breach of trust, cheating, theft or extortion or any other offence involving fraud or dishonesty, whether as against P or another person; or (ii) engages, proposes to engage or has engaged (whether before, on or after 30 June 2016) in conduct that — (A) affects the suitability of the donee or deputy concerned to act as a donee or deputy; or (B) compromises P’s best interests in relation to P’s personal welfare or P’s property and affairs, whether or not the donee or deputy concerned is acting under a lasting power of attorney or court order, as the case may be; and ( c ) there is a risk of dissipation of P’s property by the donee or deputy concerned if the order of suspension is not made. [10/2016] (4) The court may make further orders or give directions as the court thinks necessary or expedient for giving effect to, or otherwise in connection with, an order of suspension. [10/2016] (5) An order of suspension may be varied or discharged by a subsequent order. [10/2016] (6) In this section, “P” means the person who lacks capacity and — ( a ) before lacking capacity, has conferred a lasting power of attorney on one or more donees; or ( b ) in respect of whom the court has appointed one or more deputies. [10/2016] (7) In this section — ( a ) where 2 or more donees are appointed under a lasting power of attorney, a reference to the donee is a reference to all or any of the donees; and ( b ) where 2 or more deputies are appointed by the court for P, a reference to the deputy is a reference to all or any of the deputies. [10/2016]"
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 8 - SUPPLEMENTARY POWERS, PRACTICE AND PROCEDURE OF COURT",
      "section": "37",
      "title": "Power to call for reports",
      "content": "37. —(1) This section applies where, in proceedings brought in respect of a person (“P”), the court is considering a question relating to P. (2) The court may require a report to be made to it by the Public Guardian or a member of the Board of Visitors. (3) The court may require any person to arrange for a report to be made by one of its officers or employees. (4) The report must deal with such matters relating to P as the court may direct. (5) The Family Justice Rules may specify matters which, unless the court directs otherwise, must also be dealt with in the report. [27/2014] (6) The report may be made in writing or orally as the court may direct. (7) In complying with a requirement, the Public Guardian or a member of the Board of Visitors may, at all reasonable times, examine and take copies of — ( a ) any health record; and ( b ) any record held by any person and compiled in connection with a social services function, so far as the record relates to P. (8) If the Public Guardian or a member of the Board of Visitors is making a visit in the course of complying with a requirement, he or she may interview P in private. (9) If a member of the Board of Visitors who is a Special Visitor is making a visit in the course of complying with a requirement, he or she may if the court so directs carry out in private a medical, psychiatric or psychological examination of P’s capacity and condition."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 8 - SUPPLEMENTARY POWERS, PRACTICE AND PROCEDURE OF COURT",
      "section": "38",
      "title": "Applications to court",
      "content": "38. —(1) No permission is required for an application to the court for the exercise of any of its powers under this Act — ( a ) by a person who lacks, or is alleged to lack, capacity and, if such a person has not attained the age of 21 years, by anyone with parental rights with respect to the person; ( b ) by the donor or a donee of a lasting power of attorney to which the application relates; ( c ) by a deputy appointed by the court for a person to whom the application relates; ( d ) by a person named in an existing order of the court, if the application relates to the order; or ( e ) by the Public Guardian where it appears to him or her that — (i) a person lacks capacity; (ii) no application has been made or is likely to be made for an order under this Act; and (iii) an order under this Act is necessary for the protection of the personal welfare, property or affairs of the person. (2) Subject to the Family Justice Rules, permission is required for any other application to the court. [27/2014] (3) In deciding whether to grant permission the court is to, in particular, have regard to — ( a ) the applicant’s connection with the person to whom the application relates; ( b ) the reasons for the application; ( c ) the benefit to the person to whom the application relates of the proposed order or directions; and ( d ) whether the benefit can be achieved in any other way."
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 8 - SUPPLEMENTARY POWERS, PRACTICE AND PROCEDURE OF COURT",
      "section": "39",
      "title": "Family Justice Rules",
      "content": "39. —(1) The Family Justice Rules Committee constituted under section 46(1) of the Family Justice Act 2014 may make Family Justice Rules — ( a ) to regulate and prescribe the procedure and practice to be followed in respect of proceedings under this Act; and ( b ) to provide for costs and fees of such proceedings, and for regulating any matter relating to the costs of such proceedings. [27/2014] (2) Without limiting subsection (1), the Family Justice Rules may make provision — ( a ) as to the manner and form in which proceedings are to be commenced; ( b ) as to the persons entitled to be notified of, and be made parties to, the proceedings; ( c ) for enabling the court to appoint a suitable person to act in the name of, or on behalf of, or to represent the person to whom the proceedings relate; ( d ) for enabling an application to the court to be disposed of without a hearing; ( e ) for enabling the court to proceed with, or with any part of, a hearing in the absence of the person to whom the proceedings relate; ( f ) for enabling or requiring the proceedings or any part of them to be conducted in private and for enabling the court to determine who is to be admitted when the court sits in private and to exclude specified persons when it sits in public; ( g ) as to what may be received as evidence (whether or not admissible apart from the Family Justice Rules) and the manner in which it is to be presented; ( h ) for the enforcement of orders made and directions given in the proceedings; ( i ) for regulating matters relating to the costs of those proceedings, including prescribing scales of costs to be paid to legal or other representatives; ( j ) as to the way in which, and funds from which, fees and costs are to be paid; ( k ) for charging fees and costs upon the estate of the person to whom the proceedings relate, if such charge does not cause any interest of the person in any property to fail or determine or to be prevented from recommencing; ( l ) for the payment of fees and costs within a specified time of the death of the person to whom the proceedings relate or the conclusion of the proceedings. [27/2014] (3) The Family Justice Rules may, instead of providing for any matter, refer to provision made or to be made about that matter by practice directions issued for the time being by the registrar of the Family Justice Courts. [27/2014]"
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 8 - SUPPLEMENTARY POWERS, PRACTICE AND PROCEDURE OF COURT",
      "section": "40",
      "title": "Costs",
      "content": "40. —(1) Subject to the Family Justice Rules, the costs of and incidental to all proceedings in the court are in its discretion. [27/2014] (2) The court has full power to determine by whom and to what extent the costs are to be paid. (3) The court may, in any proceedings — ( a ) disallow; or ( b ) order the legal or other representatives concerned to meet, the whole of any wasted costs or such part of them as may be determined in accordance with the Family Justice Rules. [27/2014] (4) In subsection (3) — “legal or other representative”, in relation to a party to proceedings, means any person exercising a right of audience or right to conduct litigation on the party’s behalf; “wasted costs” means any costs incurred by a party — ( a ) as a result of any improper, unreasonable or negligent act or omission on the part of any legal or other representative or any employee of such a representative; or ( b ) which, in the light of any such act or omission occurring after they were incurred, the court considers it is unreasonable to expect that party to pay."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "41",
      "title": "Codes of practice",
      "content": "41. —(1) The Minister may issue one or more codes of practice — ( a ) for the guidance of persons assessing whether a person has capacity in relation to any matter; ( b ) for the guidance of persons acting in connection with the care or treatment of another person; ( c ) for the guidance of donees of lasting powers of attorney; ( d ) for the guidance of deputies appointed by the court; and ( e ) with respect to such other matters concerned with this Act as the Minister thinks fit. (2) The Minister may publish any such code of practice, including any revocation, variation, revision or amendment thereto in such manner as the Minister thinks fit. (3) The Minister may revoke, vary, revise or amend the whole or any part of any code of practice issued under this section in such manner as the Minister thinks fit. (4) The Minister may delegate any power under this section so far as he or she considers expedient. (5) It is the duty of a person to have regard to any relevant code if the person is acting in relation to a person who lacks capacity and is doing so in one or more of the following ways: ( a ) as the donee of a lasting power of attorney; ( b ) as a deputy appointed by the court; ( c ) in a professional capacity; ( d ) for remuneration. (6) If it appears to a court conducting any civil or criminal proceedings that — ( a ) a provision of a code of practice; or ( b ) a failure to comply with a code of practice, is relevant to a question arising in the proceedings, the provision or failure must be taken into account in deciding the question. (7) To avoid doubt, any code of practice issued under this section is deemed not to be subsidiary legislation."
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "42",
      "title": "Ill-treatment",
      "content": "42. —(1) Subsection (2) applies if a person (“D”) — ( a ) has the care of a person (“P”) who lacks, or whom D reasonably believes to lack, capacity; ( b ) is the donee of a lasting power of attorney created by P; or ( c ) is a deputy appointed by the court for P, and P is 16 years of age or above. (2) D shall be guilty of an offence if D ill-treats or causes, procures or knowingly permits P to be ill-treated by any other person. (3) For the purposes of this section, D ill-treats P if D — ( a ) subjects P to physical or sexual abuse; ( b ) wilfully or unreasonably does, or causes P to do, any act which endangers or is likely to endanger the safety of P or which causes or is likely to cause P — (i) any unnecessary physical pain, suffering or injury; (ii) any emotional injury; or (iii) any injury to P’s health or development; or ( c ) wilfully or unreasonably neglects, abandons or exposes P with full intention of abandoning P or in circumstances that are likely to endanger the safety of P or to cause P — (i) any unnecessary physical pain, suffering or injury; (ii) any emotional injury; or (iii) any injury to P’s health or development. (4) For the purpose of subsection (3)( c ), D is deemed to have neglected P in circumstances likely to cause P unnecessary physical pain, suffering or injury or emotional injury or injury to P’s health or development if D wilfully or unreasonably neglects to provide adequate food, clothing, medical aid, lodging, care or other necessities of life for P. (5) D may be convicted of an offence under this section notwithstanding — ( a ) that any actual suffering or injury on the part of P or the likelihood of any suffering or injury on the part of P was obviated by the action of another person; or ( b ) the death of P. (6) Subject to subsection (7), any person who is guilty of an offence under this section shall be liable on conviction — ( a ) in the case where death is caused to P, to a fine not exceeding $40,000 or to imprisonment for a term not exceeding 14 years or to both; and ( b ) in any other case, to a fine not exceeding $8,000 or to imprisonment for a term not exceeding 8 years or to both. [15/2019] (7) The court may, in lieu of or in addition to any punishment specified in subsection (6), order the person guilty of an offence under this section to execute a bond, with or without sureties, as the court may determine, to be of good behaviour for such period as the court thinks fit, and may include in such bond a condition requiring the person to undergo such counselling, psychotherapy or other programme as may be specified therein. (8) If a person who is ordered to execute a bond of good behaviour under subsection (7) fails to comply with any of the conditions of the bond, the person shall — ( a ) if the bond is in lieu of a penalty under subsection (6), be liable to the penalty provided for in that subsection; or ( b ) if the bond is in addition to a penalty under subsection (6), be liable to a further fine not exceeding $20,000 or to a further term of imprisonment not exceeding 7 years or to both. (9) In this section, “court” means any court of competent jurisdiction."
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "43",
      "title": "Information relating to persons who lack capacity",
      "content": "43. —(1) Any person who knows or has reason to suspect that a person who lacks capacity is in need of care or protection may make a notification to the Public Guardian of the facts and circumstances on which the person’s knowledge or suspicion is based. (2) Any health care worker who makes a notification under subsection (1) — ( a ) may not, by virtue of doing so, be held in any proceedings before any court or tribunal or in any other respect to have breached any code of professional etiquette or ethics, or to have departed from any accepted form of professional conduct; and ( b ) insofar as he or she has acted in good faith, shall incur no civil or criminal liability in respect of the notification or the provision of any information contained in the notification. (3) In subsection (2), “health care worker” means any registered medical practitioner, dentist registered under the Dental Registration Act 1999, pharmacist registered under the Pharmacists Registration Act 2007, therapist, psychologist, social worker, counsellor, nurse, attendant or other person providing health care services. (4) Any person appearing as a witness in any proceedings in any court or tribunal or before a person authorised by law to hear evidence may not be compelled — ( a ) to disclose the identity of any person who has made a notification under subsection (1), or any information likely to lead to the disclosure of the identity of such a person; or ( b ) to produce any report or document which identifies, or is likely to identify, any person who has made a notification under subsection (1). (5) In this section, “court” means any court of competent jurisdiction."
    },
    {
      "provision_ref": "s43A",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "43A",
      "title": "Notification of change of address",
      "content": "43A. —(1) Subject to subsection (2), every donor and donee of a lasting power of attorney and every deputy appointed by the court must inform the Public Guardian in writing of — ( a ) where the donor, donee or deputy is an individual — any change in the place of residence of the donor, donee or deputy, as the case may be; and ( b ) where the donee or deputy is a person other than an individual — any change in the registered business address of the donee or deputy, as the case may be. [10/2016] (2) If a donor, donee or deputy changes his or her place of residence and reports the change under section 10 of the National Registration Act 1965, that donor, donee or deputy (as the case may be) is taken to have informed the Public Guardian of the change of that place of residence in accordance with subsection (1)( a ). [10/2016] (3) Where a person (“P”) lacks capacity, a donee of a lasting power of attorney created by P or a deputy appointed by the court for P, as the case may be, may on P’s behalf inform the Public Guardian in writing of any change in P’s place of residence. [10/2016]"
    },
    {
      "provision_ref": "s43B",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "43B",
      "title": "General exemption",
      "content": "43B. The Minister may, by order in the Gazette , exempt any person or class of persons from all or any provisions of this Act or the regulations, either generally or in a particular case and subject to such conditions as the Minister may impose. [10/2016]"
    },
    {
      "provision_ref": "s43C",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "43C",
      "title": "Service of documents",
      "content": "43C. —(1) A document that is permitted or required by this Act to be served by the Public Guardian on a person may be served as described in this section. (2) This section does not apply to documents to be served in proceedings in court for an offence or any other matter under this Act. (3) Subject to subsections (2), (6), (7), (8) and (9), a document may be served on an individual — ( a ) by giving it to the individual personally; ( b ) by sending it by prepaid registered post or ordinary post to the address specified by the individual for the service of documents or, if no address is so specified, the individual’s residential address or business address; ( c ) by leaving it at the individual’s residential address with an adult person apparently residing there, or at the individual’s business address with an adult person apparently employed there; ( d ) by affixing a copy of the document in a conspicuous place at the individual’s residential address or business address; ( e ) by sending it by fax to the fax number given by the individual as the fax number for the service of documents under this Act; ( f ) by sending it by email to the individual’s email address; or ( g ) by sending it to the individual’s account with the electronic transaction system and notifying the individual of this fact by — (i) email to the individual’s email address; or (ii) an electronic notice to the individual’s mobile telephone number via short message service. (4) Subject to subsections (2), (6), (7), (8) and (9), a document may be served on a partnership (other than a limited liability partnership) — ( a ) by giving it to any partner or other similar officer of the partnership; ( b ) by leaving it at, or by sending it by prepaid registered post or ordinary post to, the partnership’s business address; ( c ) by sending it by fax to the fax number used at the partnership’s business address; ( d ) by sending it by email to the partnership’s email address; or ( e ) by sending it to the partnership’s account with the electronic transaction system and notifying the partnership of this fact by — (i) email to the partnership’s email address; or (ii) an electronic notice to the partnership’s mobile telephone number via short message service. (5) Subject to subsections (2), (6), (7), (8) and (9), a document may be served on a body corporate (including a limited liability partnership) or an unincorporated association — ( a ) by giving it to the secretary or other similar officer of the body corporate or unincorporated association, or the limited liability partnership’s manager; ( b ) by leaving it at, or by sending it by prepaid registered post or ordinary post to, the body corporate’s or unincorporated association’s registered office or principal office in Singapore; ( c ) by sending it by fax to the fax number used at the body corporate’s or unincorporated association’s registered office or principal office in Singapore; ( d ) by sending it by email to the body corporate’s or unincorporated association’s email address; or ( e ) by sending it to the body corporate’s or unincorporated association’s account with the electronic transaction system and notifying the body corporate or unincorporated association of this fact by — (i) email to the body corporate’s or unincorporated association’s email address; or (ii) an electronic notice to the body corporate’s or unincorporated association’s mobile telephone number via short message service. (6) A document may only be served on a person by sending it to the person’s account with the electronic transaction system and notifying the person of this fact by an electronic notice to the person’s mobile telephone number via short message service under subsection (3)( g )(ii), (4)( e )(ii) or (5)( e )(ii) if the person has — ( a ) given written consent to the Public Guardian to serve any document using that manner of service; and ( b ) provided the person’s mobile telephone number to the Public Guardian for this purpose. (7) Where a person has given the person’s written consent to the Public Guardian under subsection (6)( a ) and provided the person’s mobile telephone number to the Public Guardian under subsection (6)( b ), and there is a change to the person’s mobile telephone number, the person must, as soon as practicable but not later than the prescribed period, give notice to the Public Guardian of such change in any manner and form that the Public Guardian requires. (8) Each of the following notices may not be served by sending it to the person’s account with the electronic transaction system and notifying the person of this fact by an electronic notice to the person’s mobile telephone number via short message service under subsection (3)( g )(ii), (4)( e )(ii) or (5)( e )(ii): ( a ) a notice under section 11(5)( b ) or ( c ); ( b ) a notice under paragraph 5 of the First Schedule; ( c ) a notice of cancellation of registration of an instrument as a lasting power of attorney under paragraph 12(2) of the First Schedule; ( d ) a notice to inform a person of the Public Guardian’s refusal to register the person as a professional deputy under section 25A; ( e ) a notice of intention to cancel the registration of a professional deputy under section 25A(5); ( f ) a notice of intention to rectify a register under section 33A(2). (9) The notices mentioned in subsection (8)( a ) and ( c ) to ( f ) may not be served by ordinary post. (10) Service of a document on a person under this section takes effect — ( a ) if the document is sent by prepaid registered post — on the second day after the day the document was posted (even if it is returned undelivered); ( b ) if the document is sent by fax and a notification of successful transmission is received — on the day of the transmission; ( c ) if the document is sent by email — at the time that the email becomes capable of being retrieved by the person at the email address of the person; or ( d ) if the document is sent to the person’s account with the electronic transaction system — at the time when an electronic record of the document reaches the person’s account. (11) In this section — “business address” means — ( a ) in the case of an individual, the individual’s usual or last known place of business in Singapore; and ( b ) in the case of a partnership (other than a limited liability partnership), the partnership’s principal or last known place of business in Singapore; “email address” means the last email address given by the addressee concerned to the Public Guardian as the email address for the service of documents under this Act; “mobile telephone number” means the last mobile telephone number given by the addressee concerned to the Public Guardian as the mobile telephone number for the service of an electronic notice under subsection (3)( g )(ii), (4)( e )(ii) or (5)( e )(ii); “person”, in respect of which a document may be served, includes a partnership and an unincorporated association; “residential address” means an individual’s usual or last known place of residence in Singapore. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "44",
      "title": "Jurisdiction of District Court",
      "content": "44. Despite any provision to the contrary in the Criminal Procedure Code 2010, a District Court has jurisdiction to try any offence under this Act and has power to impose the full penalty or punishment in respect of the offence."
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "45",
      "title": "Amendment of Schedules",
      "content": "45. The Minister may, by order in the Gazette , amend, add to or vary the First, Second or Third Schedule."
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "46",
      "title": "Regulations",
      "content": "46. —(1) The Minister may make such regulations as may be necessary or expedient for carrying out the purposes and provisions of this Act and for prescribing anything that may be required or authorised to be prescribed by this Act. [10/2016] (2) The regulations made under subsection (1) may, in particular — ( a ) prescribe different classes of professional donees, and provide for matters relating to professional donees; [Act 16 of 2021 wef 14/11/2022] ( b ) provide for matters relating to professional deputies, including but not limited to their duties, the registration of professional deputies by the Public Guardian, applications for registration, exemptions from one or more criteria for registration and cancellation of registration; [10/2016] [Act 16 of 2021 wef 14/11/2022] ( c ) prescribe the form and manner in which any prescribed notice is required to be given by any person to the Public Guardian, or to be given by a donor to a donee or vice versa; [Act 16 of 2021 wef 14/11/2022] ( d ) prescribe the persons who may be given access by the Public Guardian to view a lasting power of attorney on the electronic transaction system or obtain any information on any particular lasting power of attorney, and the requirements that must be satisfied before the Public Guardian may give such access or information, as the case may be; and [Act 16 of 2021 wef 14/11/2022] ( e ) contain such supplementary and incidental provisions as appear to the Minister to be appropriate for carrying out the purposes of Part 3A * . [*Updated to be consistent with the 2020 Revised Edition] [Act 16 of 2021 wef 14/11/2022] (3) For the purposes of subsection (2)( c ), a different form and manner may be prescribed for any notice to be given to the Public Guardian or donor or donee under different circumstances. [Act 16 of 2021 wef 14/11/2022]"
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 9 - MISCELLANEOUS",
      "section": "47",
      "title": "Savings and transitional provisions",
      "content": "47. The provisions of the Third Schedule have effect with respect to transitional matters arising from the repeal of Part I of the Mental Disorders and Treatment Act (Cap. 178, 1985 Revised Edition)."
    }
  ],
  "definitions": [
    {
      "term": "appropriate consent",
      "definition": "“appropriate consent” has the meaning given by the Human Biomedical Research Act 2015;",
      "source_provision": "s2"
    },
    {
      "term": "clinical trial",
      "definition": "“clinical trial” means a clinical trial within the meaning of the Medicines Act 1975 or the Health Products Act 2007;",
      "source_provision": "s2"
    },
    {
      "term": "court",
      "definition": "“court” means the General Division of the High Court or a Family Court;",
      "source_provision": "s2"
    },
    {
      "term": "deputy",
      "definition": "“deputy” means a person appointed by the court under section 20(2)( b ) to make decisions on behalf of another person (“P”) in relation to a matter or matters concerning all or any of the following in respect of which P lacks capacity: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "donee",
      "definition": "“donee” means a person who is conferred authority by a donor (“P”) under a lasting power of attorney to make decisions about all or any of the following when P no longer has capacity to make such decisions: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "donor",
      "definition": "“donor” means a person (“P”) who confers authority on a donee (or donees) under a lasting power of attorney to make decisions about all or any of the following when P no longer has capacity to make those decisions: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "electronic",
      "definition": "“electronic” , “electronic record”, “record”, “secure electronic signature”, “signed” and “signature” have the meanings given by section 2(1) of the Electronic Transactions Act 2010 * ; [Act 16 of 2021 wef 14/11/2022]",
      "source_provision": "s2"
    },
    {
      "term": "electronic instrument",
      "definition": "“electronic instrument” means an electronic record that confers authority of the kind mentioned in section 11(1); [Act 16 of 2021 wef 14/11/2022]",
      "source_provision": "s2"
    },
    {
      "term": "electronic transaction system",
      "definition": "“electronic transaction system” means the electronic transaction system established by the Public Guardian under section 10B(1); [Act 16 of 2021 wef 14/11/2022]",
      "source_provision": "s2"
    },
    {
      "term": "lasting power of attorney",
      "definition": "“lasting power of attorney” has the meaning given by section 11;",
      "source_provision": "s2"
    },
    {
      "term": "life-sustaining treatment",
      "definition": "“life-sustaining treatment” , in relation to a person, means treatment which, in the view of another person providing health care for that person, is necessary to sustain life;",
      "source_provision": "s2"
    },
    {
      "term": "non-electronic lasting power of attorney",
      "definition": "“non-electronic lasting power of attorney” means a lasting power of attorney that is created using non-electronic means; [Act 16 of 2021 wef 14/11/2022]",
      "source_provision": "s2"
    },
    {
      "term": "professional deputy",
      "definition": "“professional deputy” means a person — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "professional donee",
      "definition": "“professional donee” means a person — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "property",
      "definition": "“property” includes any thing in action and any interest in real or personal property;",
      "source_provision": "s2"
    },
    {
      "term": "Public Guardian",
      "definition": "“Public Guardian” means the Public Guardian appointed under section 30(1) and, unless the context otherwise requires, includes any Assistant Public Guardian appointed under section 30(1A);",
      "source_provision": "s2"
    },
    {
      "term": "registered medical practitioner",
      "definition": "“registered medical practitioner” means any person who is registered as a medical practitioner under the Medical Registration Act 1997;",
      "source_provision": "s2"
    },
    {
      "term": "Singapore public sector agency",
      "definition": "“Singapore public sector agency” has the meaning given by section 2(1) of the Public Sector (Governance) Act 2018; [Act 16 of 2021 wef 01/04/2023]",
      "source_provision": "s2"
    },
    {
      "term": "treatment",
      "definition": "“treatment” includes a diagnostic or other procedure;",
      "source_provision": "s2"
    },
    {
      "term": "will",
      "definition": "“will” includes codicil. [*Updated to be consistent with the 2020 Revised Edition] [27/2014; 29/2015; 10/2016; 40/2019]",
      "source_provision": "s2"
    },
    {
      "term": "document",
      "definition": "“document” does not include a lasting power of attorney;",
      "source_provision": "s33A"
    },
    {
      "term": "malfunction",
      "definition": "“malfunction” , in relation to the electronic transaction system, includes any defect or breakdown in that system or in any equipment, software or telecommunication networks used in or in connection with that system;",
      "source_provision": "s10A"
    },
    {
      "term": "transaction",
      "definition": "“transaction” , in relation to the Public Guardian, means — ( a )",
      "source_provision": "s10A"
    },
    {
      "term": "electronic copy",
      "definition": "“electronic copy” , in relation to a non-electronic lasting power of attorney, means an electronic copy of the lasting power of attorney caused to be made and kept in the electronic transaction system by the Public Guardian;",
      "source_provision": "s15A"
    },
    {
      "term": "relevant error",
      "definition": "“relevant error” , in relation to an electronic copy of a non-electronic lasting power of attorney, means any disparity or inconsistency between the electronic copy and the lasting power of attorney that is registered by the Public Guardian. [Act 16 of 2021 wef 14/11/2022]",
      "source_provision": "s15A"
    },
    {
      "term": "register",
      "definition": "“register” means — ( a )",
      "source_provision": "s33A"
    },
    {
      "term": "legal or other representative",
      "definition": "“legal or other representative” , in relation to a party to proceedings, means any person exercising a right of audience or right to conduct litigation on the party’s behalf;",
      "source_provision": "s40"
    },
    {
      "term": "wasted costs",
      "definition": "“wasted costs” means any costs incurred by a party — ( a )",
      "source_provision": "s40"
    },
    {
      "term": "business address",
      "definition": "“business address” means — ( a )",
      "source_provision": "s43C"
    },
    {
      "term": "email address",
      "definition": "“email address” means the last email address given by the addressee concerned to the Public Guardian as the email address for the service of documents under this Act;",
      "source_provision": "s43C"
    },
    {
      "term": "mobile telephone number",
      "definition": "“mobile telephone number” means the last mobile telephone number given by the addressee concerned to the Public Guardian as the mobile telephone number for the service of an electronic notice under subsection (3)( g )(ii), (4)( e )(ii) or (5)( e )(ii);",
      "source_provision": "s43C"
    },
    {
      "term": "person",
      "definition": "“person” , in respect of which a document may be served, includes a partnership and an unincorporated association;",
      "source_provision": "s43C"
    },
    {
      "term": "residential address",
      "definition": "“residential address” means an individual’s usual or last known place of residence in Singapore. [Act 16 of 2021 wef 14/11/2022]",
      "source_provision": "s43C"
    }
  ]
}