{
  "id": "mfia-1959",
  "type": "statute",
  "title": "Minister for Finance (Incorporation) Act 1959",
  "title_en": "Minister for Finance (Incorporation) Act 1959",
  "short_name": "MFIA1959",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/MFIA1959",
  "description": "An Act to incorporate the Minister for Finance and to provide for the vesting in such corporation of properties vested in the Chief Secretary.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Minister for Finance (Incorporation) Act 1959."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Constitution of body corporate",
      "content": "2. —(1) The Minister for the time being charged with the responsibility for finance shall be a body corporate under the name of “Minister for Finance” (referred to in this Act as the Corporation). (2) The Corporation may sue and be sued in its name and shall have perpetual succession and a corporate seal, and that seal may from time to time be broken, changed, altered and made anew as to the Corporation seems fit and until a seal is provided under this section, a stamp bearing the inscription “Minister for Finance” may be used as the corporate seal."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Powers",
      "content": "3. The Corporation may acquire, purchase, take, hold and enjoy movable and immovable property of every description, and may convey, assign, surrender and yield up, mortgage, demise, reassign, transfer or otherwise dispose of, or deal with, any movable or immovable property vested in the Corporation upon such terms as to the Corporation seem fit."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Execution of documents",
      "content": "4. —(1) All deeds, documents or other instruments requiring the seal of the Corporation shall be sealed with the seal of the Corporation in the presence of the Minister for the time being charged with the responsibility for finance, and the Minister shall sign every such deed, document or other instrument to which the corporate seal is affixed, and such signing shall be sufficient evidence that the seal was duly and properly affixed and that the seal is the lawful seal of the Corporation. (2) Section 11 of the Registration of Deeds Act 1988 shall not apply to any instrument purporting to be executed under subsection (1)."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Vesting of property",
      "content": "5. —(1) All property, movable and immovable, which immediately before 3 June 1959 was vested in the Chief Secretary, Colony of Singapore, under the provisions of the Chief Secretary Incorporation Ordinance (Cap. 54, 1955 Revised Edition) shall, on 3 June 1959 and without any conveyance, assignment or transfer whatever, vest in the Corporation for the like title, estate or interest and on the like tenure and for the like purposes as the same was vested or held immediately before 3 June 1959. (2) The President may, by order, vest in the Corporation any property, movable or immovable, which is for the time being vested in any public officer or authority, and upon the coming into operation of any such order, the property to which the order relates shall, without any conveyance, assignment or transfer whatever, vest in the Corporation for the like title, estate or interest and on the like tenure and for the like purposes as the same was vested or held immediately before the coming into operation of the order. (3) The President may, by order, vest in any public officer or authority any property, movable or immovable, for the time being vested in the Corporation and upon the coming into operation of any such order, the property to which the order relates shall, without any conveyance, assignment or transfer whatever vest in such officer or authority for the like title, estate or interest and on the like tenure and for the like purposes as the same was vested or held immediately before the coming into operation of the order."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Vesting of rights and liabilities of Chief Secretary",
      "content": "6. All rights and liabilities which were, immediately before 3 June 1959, vested in or imposed on the Chief Secretary, Colony of Singapore, by virtue of the Chief Secretary Incorporation Ordinance (Cap. 54, 1955 Revised Edition) or otherwise shall, on 3 June 1959, be vested in or imposed on the Corporation."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Notification to be conclusive evidence",
      "content": "7. A notification in the Gazette that a Minister has been charged with the responsibility for finance shall be conclusive evidence that the Minister has been so charged."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Saving of rights of Government and others",
      "content": "8. Nothing in this Act shall affect the rights of the Government or of any bodies politic or corporate or other persons except such as are mentioned in this Act and those claiming by, from or under them."
    }
  ],
  "definitions": []
}