{
  "id": "mlmpspa-1973",
  "type": "statute",
  "title": "Multi-Level Marketing and Pyramid Selling (Prohibition) Act 1973",
  "title_en": "Multi-Level Marketing and Pyramid Selling (Prohibition) Act 1973",
  "short_name": "MLMPSPA1973",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/MLMPSPA1973",
  "description": "An Act to prohibit the registration of businesses that are designed to promote multi-level marketing schemes or arrangements or pyramid selling schemes or arrangements in relation to the distribution and sale of commodities; to prohibit the incorporation or registration of companies which propose to promote multi-level marketing schemes or arrangements or pyramid selling schemes or arrangements in relation to the distribution and sale of commodities and to make it unlawful for any person to promote such schemes or arrangements and to provide for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Multi-Level Marketing and Pyramid Selling (Prohibition) Act 1973."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “benefit” includes any gratuity, commission, cross commission, bonus, refund, discount, dividend and any other payment, service or advantage of whatever description, but does not include — ( a ) the purchase of a sample of a commodity furnished at a price not exceeding the cost of the sample and which is not for resale; and ( b ) time and effort spent in pursuit of sales, distribution or recruiting activities; “commodity” means any goods, service, right or other property, whether tangible or intangible, capable of being the subject of a sale, lease or licence; “company” means a company as defined in the Companies Act 1967 and includes a corporation as defined in that Act; “multi-level marketing scheme or arrangement” has the same meaning as “pyramid selling scheme or arrangement” in this Act; “promote” includes to manage, form, operate, carry on, engage in or otherwise to organise; “pyramid selling scheme or arrangement” means any scheme or arrangement for the distribution or the purported distribution of a commodity by which — ( a ) a person may in any manner acquire a commodity or a right or a licence to acquire the commodity for sale, lease, licence or other distribution; ( b ) that person receives any benefit, directly or indirectly, as a result of — (i) the recruitment, acquisition, action or performance of one or more additional participants in the scheme or arrangement; or (ii) the sale, lease, licence or other distribution of the commodity by one or more additional participants in the scheme or arrangement; and ( c ) any benefit is or may be received by any other person who promotes, or participates in, the scheme or arrangement (other than a person referred to in paragraph ( a ) or an additional participant referred to in paragraph ( b )). (2) In this Act, “pyramid selling scheme or arrangement” does not include any schemes or arrangements for the sale, lease, licence or other distribution of a commodity, or any class of such schemes or arrangements, that the Minister may by order prescribe, subject to any terms or conditions specified in the order. (3) Any reference in this Act to the winding up of a company includes, in the case of a foreign company, a reference to the winding up of the affairs of a foreign company so far as the assets of the foreign company within Singapore are concerned."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Unlawful to promote or participate in, or hold out that person is promoting or participating in, pyramid selling scheme or arrangement",
      "content": "3. —(1) It is unlawful for any person to promote or participate in a multi‑level marketing scheme or arrangement or a pyramid selling scheme or arrangement or to hold out that the person is promoting or participating in such a scheme or arrangement. (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $200,000 or to imprisonment for a term not exceeding 5 years or to both."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Registration of business designed to promote pyramid selling scheme or arrangement prohibited",
      "content": "4. —(1) A person must not apply to be registered under the Business Names Registration Act 2014 under any business name in respect of any business that is designed to promote a multi‑level marketing scheme or arrangement or a pyramid selling scheme or arrangement. [29/2014] (2) A person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $200,000 or to imprisonment for a term not exceeding 5 years or to both. [29/2014]"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Registration of company which proposes to promote pyramid selling scheme or arrangement prohibited",
      "content": "5. —(1) No company which proposes to promote a multi-level marketing scheme or arrangement or a pyramid selling scheme or arrangement is to be incorporated or registered under the Companies Act 1967. (2) Where a company which is designed to promote a multi-level marketing scheme or arrangement or a pyramid selling scheme or arrangement contravenes subsection (1) by obtaining incorporation or registration under the Companies Act 1967, that company and every officer of that company shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $200,000 or to imprisonment for a term not exceeding 5 years or to both."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Offences by bodies corporate",
      "content": "6. —(1) If the person committing an offence under this Act is a company, every individual who at the time the offence was committed was a director, general manager, manager, secretary or other officer of the company concerned in the management of the company or who was purporting to act in any such capacity, as well as the company, shall be deemed to be guilty of that offence and shall be liable to be proceeded against and punished accordingly. (2) It is a defence for the individual mentioned in subsection (1) if he or she proves that the offence was committed without his or her consent or connivance and that he or she exercised such diligence to prevent the commission of the offence as he or she ought to have exercised having regard to the nature of his or her functions and to all other circumstances. (3) For the purpose of this section, “company” includes — ( a ) any body corporate; and ( b ) a firm or other association of individuals. (4) This section is in addition to and not in derogation of any other provisions of this Act."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Penalty to be imposed in addition to other punishment",
      "content": "7. —(1) Where a court convicts any person of committing an offence of promoting or participating in a multi-level marketing scheme or arrangement or a pyramid selling scheme or arrangement under section 3(2) then — ( a ) if the person has received any benefit, directly or indirectly, as a result of committing the offence; and ( b ) if the benefit received by the person is a sum of money or if the value of the benefit can be assessed, the court is, in addition to imposing on that person any other punishment, to order that person to pay as a penalty, within the time that may be specified in the order, a sum not exceeding the amount of or, in the opinion of the court, the value of the benefit received by the person, and any such penalty is recoverable as a fine. (2) In determining the amount of the penalty that a person, being a participant, is required to pay under subsection (1), the court may take into account any benefit that the person may have given for the right to participate in the multi-level marketing scheme or arrangement or the pyramid selling scheme or arrangement (as the case may be) or any loss that the person may have incurred as a result of such participation. (3) Where a person charged with any offence under section 3(2) is convicted of one or more offences under any other written law, and the outstanding offences are taken into consideration by the court under section 148 of the Criminal Procedure Code 2010 for the purpose of passing sentence, the court may impose the penalty mentioned in subsection (1) for any offence under this Act so taken into consideration. [15/2010] (4) Nothing in subsection (1) affects any right which any person may have under any written law or rule of law to recover damages from the person mentioned in subsection (1)."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Jurisdiction of District Courts",
      "content": "8. Despite the Criminal Procedure Code 2010, a District Court has jurisdiction to try any offence under this Act or any regulations made under this Act and may impose the full penalty or punishment in respect of such offence."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Act to prevail",
      "content": "9. The provisions of this Act do not affect the Business Names Registration Act 2014 or the Companies Act 1967 but where there is a conflict between the Business Names Registration Act 2014 and the Companies Act 1967 and this Act, the provisions of this Act prevail. [29/2014]"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Regulations",
      "content": "10. The Minister may make regulations for carrying into effect the objects and purposes of this Act."
    }
  ],
  "definitions": [
    {
      "term": "benefit",
      "definition": "“benefit” includes any gratuity, commission, cross commission, bonus, refund, discount, dividend and any other payment, service or advantage of whatever description, but does not include — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "commodity",
      "definition": "“commodity” means any goods, service, right or other property, whether tangible or intangible, capable of being the subject of a sale, lease or licence;",
      "source_provision": "s2"
    },
    {
      "term": "company",
      "definition": "“company” means a company as defined in the Companies Act 1967 and includes a corporation as defined in that Act;",
      "source_provision": "s2"
    },
    {
      "term": "multi-level marketing scheme or arrangement",
      "definition": "“multi-level marketing scheme or arrangement” has the same meaning as “pyramid selling scheme or arrangement” in this Act;",
      "source_provision": "s2"
    },
    {
      "term": "promote",
      "definition": "“promote” includes to manage, form, operate, carry on, engage in or otherwise to organise;",
      "source_provision": "s2"
    },
    {
      "term": "pyramid selling scheme or arrangement",
      "definition": "“pyramid selling scheme or arrangement” means any scheme or arrangement for the distribution or the purported distribution of a commodity by which — ( a )",
      "source_provision": "s2"
    }
  ]
}