{
  "id": "moa-2003",
  "type": "statute",
  "title": "Maritime Offences Act 2003",
  "title_en": "Maritime Offences Act 2003",
  "short_name": "MOA2003",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/MOA2003",
  "description": "An Act to give effect to the provisions of the Convention for the Suppression of Unlawful Acts against the Safety of Maritime Navigation done in Rome on 10 March 1988, and the provisions of the Protocol for the Suppression of Unlawful Acts against the Safety of Fixed Platforms located on the Continental Shelf done in Rome on 10 March 1988, and for purposes connected therewith. [22/2015]",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Maritime Offences Act 2003."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “act of violence” means — ( a ) any act done in Singapore which constitutes the offence of murder, attempted murder, culpable homicide not amounting to murder, voluntarily causing grievous hurt, voluntarily causing hurt by dangerous weapons or means, or which constitutes an offence under — (i) section 4 of the Arms Offences Act 1973; (ii) section 3 or 4 of the Corrosive and Explosive Substances and Offensive Weapons Act 1958; or [Act 3 of 2021 wef 01/07/2025] (iii) [ Deleted by Act 3 of 2021 wef 01/07/2025 ] (iv) section 3 of the Kidnapping Act 1961; or ( b ) any act done outside Singapore which, if done in Singapore, would constitute an offence mentioned in paragraph ( a ); “Convention” means the Convention for the Suppression of Unlawful Acts against the Safety of Maritime Navigation done in Rome on 10 March 1988; “Convention country” means a country in respect of which the Convention is in force; “country” includes any territory; “fixed platform” means any artificial island, installation or structure permanently attached to the seabed for the purpose of exploration or exploitation of resources or for any other economic purpose; “naval service” includes military and air force services; “Protocol” means the Protocol for the Suppression of Unlawful Acts against the Safety of Fixed Platforms located on the Continental Shelf done in Rome on 10 March 1988; “Protocol country” means a Convention country in respect of which the Protocol is in force; “relevant fixed platform offence” means — ( a ) an offence under section 8, 9 or 10; ( b ) conspiracy to commit any of those offences; ( c ) inciting another to commit any of those offences; ( d ) attempting to commit any of those offences; or ( e ) aiding, abetting, counselling or procuring the commission of any of those offences; “relevant maritime offence” means — ( a ) an offence under section 3, 4, 5 or 6; ( b ) conspiracy to commit any of those offences; ( c ) inciting another to commit any of those offences; ( d ) attempting to commit any of those offences; or ( e ) aiding, abetting, counselling or procuring the commission of any of those offences; “ship” means any vessel (including hovercraft, submersible craft and other floating craft) other than one which — ( a ) permanently rests on, or is permanently attached to, the seabed; or ( b ) has been withdrawn from navigation or laid up; “unlawfully” means, in relation to the commission of an act — ( a ) in Singapore — so as to constitute an offence under any written law (apart from this Act) in force in Singapore; and ( b ) outside Singapore — so that the commission of the act, if it had been committed in Singapore, would have been an offence under any written law (apart from this Act) in force in Singapore if it had been committed in Singapore. [22/2015]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Hijacking of ships",
      "content": "3. —(1) Subject to subsection (2), any person who unlawfully, by the use of force or by threats of any kind, seizes a ship or exercises control of a ship shall be guilty of an offence, whatever his or her nationality or citizenship, whatever the state in which the ship is registered and whether the ship is in Singapore or elsewhere. (2) Subsection (1) does not apply to any act committed in relation to a warship, or any other ship used as a naval auxiliary or in customs or law enforcement service, unless — ( a ) the person seizing or exercising control of the ship is a citizen of Singapore; ( b ) the act is committed in Singapore; or ( c ) the ship is used in the naval, customs or law enforcement service of Singapore."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Destroying or damaging ships, etc.",
      "content": "4. —(1) Subject to subsection (5), any person who unlawfully and intentionally — ( a ) destroys a ship; ( b ) damages a ship or its cargo so as to endanger, or to be likely to endanger, the safe navigation of the ship; or ( c ) commits on board a ship an act of violence which is likely to endanger the safe navigation of the ship, shall be guilty of an offence. (2) Subject to subsection (5), any person who unlawfully and intentionally places, or causes to be placed, on a ship any device or substance which is likely to destroy the ship or is likely to so damage it or its cargo as to endanger its safe navigation shall be guilty of an offence. (3) Nothing in subsection (2) is to be construed as limiting the circumstances in which the commission of any act may — ( a ) constitute an offence under subsection (1); or ( b ) constitute attempting or conspiring to commit or aiding, abetting, counselling, procuring or inciting the commission of the offence. (4) Except as provided in subsection (5), subsections (1) and (2) apply whether any act mentioned in those subsections is committed in Singapore or elsewhere, whatever the nationality or citizenship of the person committing the act and whatever the state in which the ship is registered. (5) Subsections (1) and (2) do not apply to any act committed in relation to a warship, or any other ship used as a naval auxiliary or in customs or law enforcement service, unless — ( a ) the person committing the act is a citizen of Singapore; ( b ) the act is committed in Singapore; or ( c ) the ship is used in the naval, customs or law enforcement service of Singapore."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Other acts endangering or likely to endanger safe navigation",
      "content": "5. —(1) Subject to subsection (6), any person who unlawfully and intentionally — ( a ) destroys or damages any property to which this section applies; or ( b ) seriously interferes with the operation of that property, where the destruction, damage or interference is likely to endanger the safe navigation of a ship, shall be guilty of an offence. (2) Subsection (1) applies to any property used for the provision of maritime navigation facilities, including any land, building or ship so used, and including any apparatus or equipment so used, whether the property is on board a ship or elsewhere. (3) Subject to subsection (6), any person who intentionally communicates any information which is false in a material particular, where the communication of the information endangers the safe navigation of a ship, shall be guilty of an offence. (4) It is a defence for a person charged with an offence under subsection (3) to prove that — ( a ) he or she believed, and had reasonable grounds for believing, that the information was true; or ( b ) when he or she communicated the information, he or she was lawfully employed to perform duties which consisted of or included the communication of information and that he or she communicated the information in good faith in the performance of those duties. (5) Except as provided in subsection (6), subsections (1) and (3) apply whether any act mentioned in those subsections is committed in Singapore or elsewhere, whatever the nationality or citizenship of the person committing the act and whatever the state in which the ship is registered. (6) Subsections (1) and (3) do not apply to any act committed in relation to a warship, or any other ship used as a naval auxiliary or in customs or law enforcement service, unless — ( a ) the person committing the act is a citizen of Singapore; ( b ) the act is committed in Singapore; or ( c ) the ship is used in the naval, customs or law enforcement service of Singapore."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Offences involving threats in relation to ships or safe navigation",
      "content": "6. —(1) A person shall be guilty of an offence if — ( a ) in order to compel any other person to do or abstain from doing any act, the person threatens that he or she or some other person will do in relation to any ship an act which is an offence under section 4(1); and ( b ) the making of that threat is likely to endanger the safe navigation of the ship. [22/2015] (2) Subject to subsection (4), a person shall be guilty of an offence if — ( a ) in order to compel any other person to do or abstain from doing any act, the person threatens that he or she or some other person will do an act which is an offence under section 5(1); and ( b ) the making of that threat is likely to endanger the safe navigation of any ship. (3) Except as provided in subsection (4), subsections (1) and (2) apply whether any act mentioned in those subsections is committed in Singapore or elsewhere, whatever the nationality or citizenship of the person committing the act and whatever the state in which the ship is registered. (4) Section 4(5) applies for the purposes of subsection (1) as it applies for the purposes of section 4(1); and section 5(6) applies for the purposes of subsection (2) as it applies for the purposes of section 5(1)."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Ancillary offences in relation to ships or safe navigation",
      "content": "7. —(1) Any act of violence done by any person in connection with an offence under section 3, 4 or 5 committed or attempted to be committed by him or her is deemed to have been committed in Singapore and constitutes an offence punishable under the law in force in Singapore applicable to it, wherever the act of violence was committed, whatever the state in which the ship concerned is registered (if any), and whatever the nationality or citizenship of the person committing or attempting to commit the act. [22/2015] (2) Subsection (1) is without prejudice to section 180 of the Merchant Shipping Act 1995. (3) Any person in Singapore who abets the commission elsewhere of any act which would — ( a ) but for section 3(2), be an offence under that section; ( b ) but for section 4(5), be an offence under that section; ( c ) but for section 5(6), be an offence under that section; or ( d ) but for section 6(4), be an offence under that section, shall be guilty of an offence. (4) Any person (whether in Singapore or elsewhere) who abets the commission (whether in Singapore or elsewhere) of any act which is an offence under section 3, 4, 5 or 6 shall be guilty of an offence. [22/2015] (5) Any person (whether in Singapore or elsewhere) who attempts to commit an offence under section 3, 4, 5 or 6, and in such attempt does any act towards the commission of the offence, shall be guilty of an offence and shall be punished with imprisonment for a term not exceeding 15 years. [22/2015]"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Hijacking of fixed platforms",
      "content": "8. —(1) Subject to subsection (2), any person who unlawfully, by the use of force or by threats of any kind, seizes a fixed platform or exercises control of a fixed platform, shall be guilty of an offence, whatever the nationality or citizenship of that person, and whether the fixed platform is in Singapore or elsewhere. [22/2015] (2) Subsection (1) does not apply to any act committed in relation to a fixed platform used as a naval auxiliary or in customs or law enforcement service, unless — ( a ) the person seizing or exercising control of the fixed platform is a citizen of Singapore; ( b ) the act is committed in Singapore; or ( c ) the fixed platform is used in the naval, customs or law enforcement service of Singapore. [7A [22/2015]"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Destroying or damaging fixed platforms, etc.",
      "content": "9. —(1) Subject to subsection (5), any person who unlawfully and intentionally does any of the following shall be guilty of an offence: ( a ) destroys a fixed platform; ( b ) damages a fixed platform so as to endanger, or to be likely to endanger, the safety of the fixed platform; ( c ) commits on board a fixed platform an act of violence which is likely to endanger the safety of the fixed platform. [22/2015] (2) Subject to subsection (5), any person who unlawfully and intentionally places, or causes to be placed, on a fixed platform any device or substance which is likely to destroy the fixed platform or is likely so to damage the fixed platform as to endanger the safety of the fixed platform shall be guilty of an offence. [22/2015] (3) Nothing in subsection (2) is to be construed as limiting the circumstances in which the commission of any act may — ( a ) constitute an offence under subsection (1); or ( b ) constitute attempting or conspiring to commit or aiding, abetting, counselling, procuring or inciting the commission of the offence. [22/2015] (4) Except as provided in subsection (5), subsections (1) and (2) apply whether any act mentioned in those subsections is committed in Singapore or elsewhere, and whatever the nationality or citizenship of the person committing the act. [22/2015] (5) Subsections (1) and (2) do not apply to any act committed in relation to a fixed platform used as a naval auxiliary or in customs or law enforcement service, unless — ( a ) the person committing the act is a citizen of Singapore; ( b ) the act is committed in Singapore; or ( c ) the fixed platform is used in the naval, customs or law enforcement service of Singapore. [7B [22/2015]"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Offences involving threats in relation to fixed platforms",
      "content": "10. —(1) A person ( A ) shall be guilty of an offence if — ( a ) in order to compel any other person to do or abstain from doing any act, A threatens that A or some other person will do in relation to any fixed platform an act which is an offence under section 9(1); and ( b ) the making of that threat is likely to endanger the safety of the fixed platform. [22/2015] (2) Except as provided in subsection (3), subsection (1) applies whether any act mentioned in subsection (1) is committed in Singapore or elsewhere, and whatever the nationality or citizenship of the person committing the act. [22/2015] (3) Section 9(5) applies for the purposes of subsection (1) as it applies for the purposes of section 9(1). [7C [22/2015]"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Ancillary offences in relation to fixed platforms",
      "content": "11. —(1) Any act of violence done by any person in connection with an offence under section 8 or 9 committed or attempted to be committed by that person is deemed to have been committed in Singapore and constitutes an offence punishable under the law in force in Singapore applicable to it, wherever the act of violence was committed, and whatever the nationality or citizenship of the person committing or attempting to commit the act. [22/2015] (2) A person in Singapore shall be guilty of an offence if the person abets the commission elsewhere of any act which would — ( a ) but for section 8(2), be an offence under section 8; ( b ) but for section 9(5), be an offence under section 9; or ( c ) but for section 10(3), be an offence under section 10. [22/2015] (3) Any person (whether in Singapore or elsewhere) who abets the commission (whether in Singapore or elsewhere) of any act which is an offence under section 8, 9 or 10 shall be guilty of an offence. [22/2015] (4) Any person (whether in Singapore or elsewhere) who attempts to commit an offence under section 8, 9 or 10, and in such attempt does any act towards the commission of the offence, shall be guilty of an offence and shall be punished with imprisonment for a term not exceeding 15 years. [7D [22/2015]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Master’s power of delivery",
      "content": "12. —(1) This section has effect for the purposes of any proceedings before any court in Singapore. (2) If the master of a ship, wherever that ship may be, and whatever the state in which it is registered, has reasonable grounds to believe that any person on board the ship has committed any relevant maritime offence in relation to any ship other than a warship or other ship used as a naval auxiliary or in customs or law enforcement service, he or she may deliver that person to an appropriate officer in Singapore. (3) The master of a ship registered in Singapore may, in the circumstances mentioned in subsection (2), also deliver the person concerned to an appropriate officer of any other Convention country. (4) Where the master of a ship intends to deliver any person under subsection (2) or (3), he or she must give notification in the prescribed form to an appropriate officer in that country — ( a ) of his or her intention to deliver that person to an appropriate officer in that country; and ( b ) of his or her reasons for intending to do so. (5) Any notification under subsection (4) must be given — ( a ) before the ship in question enters the territorial waters of that country; or ( b ) if in the circumstances it is not reasonably practicable to comply with paragraph ( a ), as soon as reasonably practicable after the ship has entered the territorial waters of that country. (6) Where the master of a ship delivers any person to an appropriate officer in Singapore under subsection (2) or any other Convention country under subsection (3), he or she must — ( a ) make to an appropriate officer in that country such oral or written statements relating to the alleged offence as that officer may reasonably require; and ( b ) deliver to an appropriate officer in that country such other evidence relating to the alleged offence as is in the master’s possession. (7) The master of a ship who, without reasonable excuse, contravenes subsection (4) or (6) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. (8) It is a defence for the master of a ship charged with an offence under subsection (7) for a contravention of subsection (4) to show that — ( a ) he or she believed on reasonable grounds that the giving of a notification would endanger the safety of the ship; and ( b ) except where the country concerned is Singapore — (i) he or she had notified some other competent authority in the country concerned within the time required by subsection (5); or (ii) he or she had believed on reasonable grounds that the giving of a notification to any competent authority in that country would endanger the safety of the ship. (9) In this section — “appropriate officer” means — ( a ) in relation to Singapore — (i) for the purpose of subsection (2) or (6), such public officer as the Minister may by order prescribe; or (ii) for the purpose of receiving a notification mentioned in subsection (4), the Port Master within the meaning of the Maritime and Port Authority of Singapore Act 1996; or ( b ) in relation to any other Convention country, an officer designated by that country to carry out the relevant duty of an appropriate officer under this section; “master” has the meaning given by the Merchant Shipping Act 1995. [8"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "General penalties",
      "content": "13. —(1) Any person guilty of an offence under this Act for which no penalty is expressly provided shall be liable on conviction to be punished with imprisonment for life. (2) To avoid doubt, subsection (1) does not apply to any act which constitutes an offence punishable under the law in force in Singapore applicable to it by virtue of section 7(1) or 11(1). [9 [22/2015]"
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Consent for prosecution",
      "content": "14. —(1) No prosecution is to be instituted under this Act without the written consent of the Public Prosecutor. (2) Even though consent has not been given in relation to the offence in accordance with subsection (1) — ( a ) a person may be arrested for an offence under this Act; ( b ) a warrant for the arrest of any person in respect of any offence under this Act may be issued and executed; ( c ) a person may be charged with an offence under this Act; and ( d ) a person charged with any offence under this Act may be remanded in custody or granted bail, but no further steps in the proceedings relating to the offence are to be taken until the consent of the Public Prosecutor has been obtained. [10"
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Extradition",
      "content": "15. —(1) Every relevant maritime offence and every relevant fixed platform offence are deemed to be extradition offences under the Extradition Act 1968. [Act 17 of 2022 wef 01/07/2022] (2) Where no extradition treaty is in force between Singapore and a Protocol country — ( a ) a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act as if there were an extradition treaty between Singapore and that Protocol country; but ( b ) subject to subsection (4), where the Extradition Act 1968 is applied under paragraph ( a ), that Act has effect as if the only extradition offences within the meaning of that Act were relevant maritime offences and relevant fixed platform offences. [22/2015] [Act 17 of 2022 wef 01/07/2022] (3) Where no extradition treaty is in force between Singapore and a Convention country that is not a Protocol country — ( a ) a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act as if there were an extradition treaty between Singapore and that Convention country; but ( b ) subject to subsection (4), where the Extradition Act 1968 is applied under paragraph ( a ), that Act has effect as if the only extradition offences within the meaning of that Act were relevant maritime offences. [22/2015] [Act 17 of 2022 wef 01/07/2022] (4) Subsections (2) and (3) are without prejudice to any other notification made under section 4 of the Extradition Act 1968. [22/2015] (5) For the purposes of the Extradition Act 1968 — ( a ) any act, wherever committed, is deemed to be an offence within the jurisdiction of a Protocol country in relation to which the Extradition Act 1968 has been applied by a notification in the Gazette made under section 4 of that Act, if that act — (i) is a relevant maritime offence or relevant fixed platform offence, or would be such an offence but for section 3(2), 4(5), 5(6), 6(4), 8(2), 9(5) or 10(3) of this Act; and (ii) is an offence against the law of that Protocol country; and ( b ) any act, wherever committed, is deemed to be an offence within the jurisdiction of a Convention country that is not a Protocol country in relation to which the Extradition Act 1968 has been applied by a notification in the Gazette made under section 4 of that Act, if that act — (i) is a relevant maritime offence, or would be such an offence but for section 3(2), 4(5), 5(6) or 6(4) of this Act; and (ii) is an offence against the law of that Convention country. [11 [22/2015]"
    }
  ],
  "definitions": [
    {
      "term": "act of violence",
      "definition": "“act of violence” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Convention",
      "definition": "“Convention” means the Convention for the Suppression of Unlawful Acts against the Safety of Maritime Navigation done in Rome on 10 March 1988;",
      "source_provision": "s2"
    },
    {
      "term": "Convention country",
      "definition": "“Convention country” means a country in respect of which the Convention is in force;",
      "source_provision": "s2"
    },
    {
      "term": "country",
      "definition": "“country” includes any territory;",
      "source_provision": "s2"
    },
    {
      "term": "fixed platform",
      "definition": "“fixed platform” means any artificial island, installation or structure permanently attached to the seabed for the purpose of exploration or exploitation of resources or for any other economic purpose;",
      "source_provision": "s2"
    },
    {
      "term": "naval service",
      "definition": "“naval service” includes military and air force services;",
      "source_provision": "s2"
    },
    {
      "term": "Protocol",
      "definition": "“Protocol” means the Protocol for the Suppression of Unlawful Acts against the Safety of Fixed Platforms located on the Continental Shelf done in Rome on 10 March 1988;",
      "source_provision": "s2"
    },
    {
      "term": "Protocol country",
      "definition": "“Protocol country” means a Convention country in respect of which the Protocol is in force;",
      "source_provision": "s2"
    },
    {
      "term": "relevant fixed platform offence",
      "definition": "“relevant fixed platform offence” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "relevant maritime offence",
      "definition": "“relevant maritime offence” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "ship",
      "definition": "“ship” means any vessel (including hovercraft, submersible craft and other floating craft) other than one which — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "unlawfully",
      "definition": "“unlawfully” means, in relation to the commission of an act — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "appropriate officer",
      "definition": "“appropriate officer” means — ( a )",
      "source_provision": "s12"
    },
    {
      "term": "master",
      "definition": "“master” has the meaning given by the Merchant Shipping Act 1995. [8",
      "source_provision": "s12"
    }
  ]
}