{
  "id": "mopona-1906",
  "type": "statute",
  "title": "Miscellaneous Offences (Public Order and Nuisance) Act 1906",
  "title_en": "Miscellaneous Offences (Public Order and Nuisance) Act 1906",
  "short_name": "MOPONA1906",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/MOPONA1906",
  "description": "An Act relating to offences against public order, nuisance and property.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Miscellaneous Offences (Public Order and Nuisance) Act 1906."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “cattle” includes bulls, cows, bullocks and buffaloes; “horse” includes mules and asses; “in or near any public road” includes all places in the public road, and all places within 9 metres of it not being effectually separated from and hidden from the road by a wall or otherwise; “public place” means any place or premises to which at the material time the public or any section of the public has access, on payment or otherwise, as of right or by virtue of express or implied permission; “public road” includes every road, street, passage, footway or square over which the public has a right of way."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Verandah public roads",
      "content": "3. The open verandahs of houses abutting on the public roads are public roads for foot passengers subject to all rights of property of the owners of those houses."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "4",
      "title": "Offences how punishable",
      "content": "4. All offences under this Act are to be tried by a Magistrate’s Court or a District Court; and despite the provisions of any other written law, a Magistrate’s Court or a District Court has the power to impose the maximum penalty prescribed for any such offence."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "6",
      "title": "Burning material or discharging firearm in public road",
      "content": "6. —(1) Any person who sets fire to or burns any material to the annoyance, inconvenience or danger of the public, or negligently or wilfully discharges any firearm or airgun, or throws or discharges any stone or other missile, or sends up any fire balloon or rocket in or near any public road shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000. (2) It is not an offence under subsection (1) for any person to discharge a firearm or airgun in or near a public road in the exercise of the person’s duty under any written law relating to the destruction of dogs."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "7",
      "title": "Duty of police officers as to dangerous animals",
      "content": "7. —(1) Every police officer must secure any animal reasonably suspected to be mad or dangerous, and any wild animal found at large in or near any public road under circumstances of danger to the public. (2) If there is reasonable ground to believe that any such mad, dangerous or wild animal cannot be secured without risk of personal injury to the police officer attempting to secure the animal, the police officer may shoot or otherwise destroy the animal."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "8",
      "title": "Dog running at persons, etc.",
      "content": "8. If it is proved to the satisfaction of a Magistrate’s Court that any dog is in the habit of running at persons or at vehicles or bicycles passing along a public road, the owner of the dog shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "9",
      "title": "Ferocious dog at large",
      "content": "9. Any person who negligently suffers to be at large any ferocious dog without a muzzle shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000, and if the dog has bitten, or attempted to bite any person, the dog may be killed by order of a Magistrate’s Court."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "10",
      "title": "Liability of dog owner",
      "content": "10. —(1) Any owner of a dog which causes injury to any person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. (2) In addition to any fine imposed under subsection (1), compensation not exceeding $2,000 is payable to the person injured in respect of any such injury. (3) Such compensation is to be assessed by the Magistrate’s Court and is recoverable from the owner of the dog in the manner provided by law for the recovery of fines before Magistrates’ Courts. (4) In any prosecution relating to any dog under subsection (1), it is not necessary to show a previous vicious propensity in the dog or the owner’s knowledge of such previous propensity or that the injury was attributable to neglect on the part of the owner. (5) The occupier of any house or premises where any dog was kept or permitted to live or remain at the time of causing any such injury mentioned in subsection (1) is deemed to be the owner of the dog and shall be liable as such unless the occupier can prove that — ( a ) he or she was not the owner of the dog at the time the injury complained of was committed; and ( b ) the dog was kept or permitted to live or remain in the house or premises without his or her sanction or knowledge. (6) Where there are 2 or more occupiers in any house or premises let in separate apartments or lodgings or otherwise, the occupier of that particular part of the premises in which the dog was kept or permitted to live or remain at the time of the injury is deemed to be the owner of the dog. (7) No compensation is payable to any person under this section in respect of injury sustained in any house or premises except upon proof that the person entered the house or premises in the ordinary course of the person’s duties or with the express or implied permission of the occupier. (8) No criminal liability arises under this section in respect of any injury sustained by any person in any house or premises unless the person entered the house or premises in the ordinary course of the person’s duties or with the express or implied permission of the occupier. (9) The owner shall not be liable under this section for any injury sustained by any person where the injury was attributable to any wrongful act of that person."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "11",
      "title": "Nuisances",
      "content": "11. —(1) Any person who commits any of the following offences shall be liable on conviction to a fine not exceeding $1,000: ( a ) without authority in the case of public property, or without the consent of the owner or occupier in the case of private property, affixes or causes to be affixed any advertisement, bill or notice, or any paper against or upon any building, wall or fence, or writes upon, defaces or marks any such building, wall or fence with chalk or paint, or in any other way; ( b ) bathes or washes himself or herself, or any other person, animal or thing on any public road, or in, upon or by the side of any public tank, reservoir, watercourse or stream; ( c ) obstructs or causes trouble or inconvenience to a person bathing at any place set apart as a bathing place by wilful intrusion, or by washing any animal at or near that place, or in any other way; ( d ) being the owner or person in charge of any animal does not, if the animal dies, dispose of its carcase in such a way as not to be a common nuisance; ( e ) places any dead animal on or near any public road; ( f ) spits in any coffee shop, market, eating house, school house, theatre or public building, or in any omnibus, railway carriage or other public conveyance, or on any wharf or jetty, or in any public road, or on any five‑foot way or sidewalk of any public road, or in any other place to which the public has or may have access; ( g ) suffers to be at large any unmuzzled ferocious dog or other animal, or sets on or urges any dog or other animal to attack, worry or put in fear any person or animal. (2) Any person who commits an offence under subsection (1)( f ), after having been previously convicted for an offence under that subsection, shall be liable on conviction to a fine not exceeding $2,000."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "12",
      "title": "Offences relating to animals",
      "content": "12. —(1) Any person who commits any of the following offences shall be liable on conviction to a fine not exceeding $1,000: ( a ) being the owner or person in charge of any animal allows the animal to injure any tree or plant, or fence round any tree or plant, in or at the side of any public road, or to graze on the side of any public road; ( b ) allows any horse, cattle, goat, sheep or pig to stray upon, or tethers or pickets any such animal upon, any public road or State land or land in the possession of any local authority or public institution or land in the possession of any private person, without the permission of the owner or lawful occupier thereof; ( c ) leads or drives any horse, cattle, goat, sheep or pig in or near any public road without having them under proper control. (2) All damage done by an animal mentioned in subsection (1)( a ) is to be assessed by a Magistrate’s Court and is recoverable in the manner provided by law for the recovery of fines before Magistrates’ Courts from the owner of the animal, together with any amounts to be levied as fines."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "13",
      "title": "Other offences relating to public road",
      "content": "13. —(1) Any person who commits any of the following offences shall be liable on conviction to a fine not exceeding $5,000: ( a ) lays any stone, brick or other article on any public road so as to cause an obstruction thereto, or so as to make the use of the road less convenient; ( b ) allows to remain on any public road any article which has fallen from any vehicle of which the person is in charge; ( c ) deposits or causes or allows any article or thing to be deposited on any public road or otherwise causes or allows that article or thing to create obstruction or inconvenience to the passage of the public for a longer period than is absolutely necessary for loading or unloading the article or thing; ( d ) causes or permits any cart, wheelbarrow, bicycle, tricycle or other vehicle to stand on any public road so as to create or to be likely to create obstruction or inconvenience to the passage of the public in that public road; ( e ) flies any kite, or plays at any game, or does any act which obstructs or interferes with the traffic in any public road, or the use of the wires of any telephone; ( f ) places any blind, shade, covering, awning or other projection over or along any public road if any part thereof is less than 2&#189; metres above the surface of that public road. (2) If it is proved that any article or thing has been deposited on any public road from any building or land in contravention of subsection (1)( c ), it is presumed, until the contrary is proved, that the occupier of the building or land has caused or allowed it to be so deposited."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "14",
      "title": "Excessive noise",
      "content": "14. —(1) Any person who makes any noise by any instrument or other means in such a manner as to cause or be likely to cause annoyance or inconvenience to the occupier of any premises in the vicinity or to any person lawfully using any public road or in any public place shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000. (2) Any police officer, on any complaint that any person in any premises or in any public place is making such noise as to cause annoyance or inconvenience to the complainant, may enter upon the premises or proceed to the public place and, after warning the person reasonably suspected of making the noise, stop the making of such noise whether by the removal of any instrument or object or in some other appropriate manner."
    },
    {
      "provision_ref": "s14A",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "14A",
      "title": "Making of harassing or obscene telephone calls to emergency telephone numbers",
      "content": "14A. —(1) Any person who makes a telephone call to an emergency telephone number with intent to annoy, abuse, threaten or harass any person who answers the telephone call shall be guilty of an offence and, subject to subsection (3), shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding one year or to both. (2) Any person who makes a telephone call to an emergency telephone number and, upon the call being answered, makes or solicits any comment, request, suggestion, proposal or other comment, request, suggestion, proposal or other communication or sound which is obscene, lewd, lascivious, filthy or indecent, shall be guilty of an offence and, subject to subsection (3), shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both. (3) Any person who uses a public telephone to commit an offence — ( a ) under subsection (1) shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both; and ( b ) under subsection (2) shall be liable on conviction to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 5 years or to both. (4) For the purposes of this section — ( a ) “emergency telephone number” means any telephone number which the Minister may, by order in the Gazette , declare to be an emergency telephone number; and ( b ) a person who makes a telephone call to an emergency telephone number and, upon the telephone call being answered, refuses to speak or immediately hangs up is presumed until the contrary is proved to have intent to annoy any person answering the telephone call. (5) In this section and section 14B, “public telephone” means a telephone which is available for use by any member of the public with or without payment."
    },
    {
      "provision_ref": "s14B",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "14B",
      "title": "Liability of subscriber",
      "content": "14B. —(1) Any person being the subscriber to a telephone service which has been used to commit an offence under section 14A shall, unless the person proves to the satisfaction of the court that the person had exercised due diligence to prevent the commission of the offence, be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. (2) Subsection (1) does not apply to the subscriber of a public telephone service."
    },
    {
      "provision_ref": "s14C",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "14C",
      "title": "Providing of information",
      "content": "14C. —(1) A police officer may, for the purpose of investigating into an offence under section 14A or 14B, by written notice require any person to provide, within such period as may be specified in the notice, any document or information as may be — ( a ) required by the police officer for the purpose of the investigation; and ( b ) within the knowledge, or in the custody or under the control, of such person. (2) No action, suit or proceedings lies against any person who has provided any document or information to a police officer pursuant to subsection (1). (3) Any person who, on being required by a notice under subsection (1) to provide any document or information, fails to comply with the notice shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s14D",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "14D",
      "title": "Communicating false message",
      "content": "14D. —(1) Any person who transmits or causes to be transmitted a message which the person knows to be false or fabricated shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both. [15/2019] (1A) However, a person is not guilty of an offence under subsection (1) if the person proves, on a balance of probabilities, that the transmission of the message has a legitimate purpose related to public order, public safety or national security, or the prevention, investigation or prosecution of offences. Illustration As part of a campaign to raise public awareness against phishing scams, a government agency sends an email to various members of the public which contains a false message that entices its recipient to click on a link which would purportedly give free shopping vouchers. The link leads to a pop‑up message informing the recipient that the message was a simulated phishing attempt, and had it been genuine, the recipient could have activated malware to allow a fraudster to steal money from his or her online account. The sending of the false message has a legitimate purpose related to the prevention of offences. [Act 16 of 2024 wef 17/06/2024] (2) In subsection (1) — “message” means any sign, signal, writing, image, sound, intelligence or information of any nature transmitted by telecommunications; “telecommunications” means a transmission, emission or reception of signs, signals, writing, images, sounds or intelligence of any nature by wire, radio, optical or other electromagnetic systems whether or not such signs, signals, writing, images, sounds or intelligence have been subjected to rearrangement, computation or other processes by any means in the course of their transmission, emission or reception. [15/2019]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "15",
      "title": "Relief for occupier of premises from nuisance",
      "content": "15. —(1) A Magistrate’s Court may act under this section on a complaint made by the occupier of any premises on the ground that the occupier of the premises is aggrieved by noise amounting to a nuisance. (2) If the Magistrate’s Court is satisfied that the alleged nuisance exists, or that although abated it is likely to recur on the same premises, the Court is to make an order for either or both of the following purposes: ( a ) requiring the defendant to abate the nuisance, within a time specified in the order and to execute any works necessary for that purpose; ( b ) prohibiting a recurrence of the nuisance, and requiring the defendant, within a time specified in the order, to execute any works necessary to prevent the recurrence. (3) Proceedings under this section are to be brought against the person responsible for the nuisance or, if that person cannot be found, against the owner or occupier of the premises from which the noise is emitted or would be emitted. (4) A person who without reasonable excuse contravenes any requirement of an order under subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000. (5) In any proceedings for an offence under this section in respect of noise caused in the course of a trade or business, it is a defence to prove that the best practicable means have been used for preventing, or for counteracting the effect of, the noise. (6) In this section — “noise” includes vibration; “person responsible”, in relation to the emission of noise, means the person to whose act, default or sufferance the noise is attributable; and where more than one person is responsible for the noise, this section applies to each of those persons whether or not what any one of them is responsible for would by itself amount to a nuisance, or would result in a level of noise justifying any proceedings under this section; “practicable” means reasonably practicable having regard among other things to local conditions and circumstances, to the current state of technical knowledge and to the financial implications."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "16",
      "title": "Obstruction in canals, etc.",
      "content": "16. —(1) Any person who in any river or canal in which the public has a right of navigation, without the written permission of the Deputy Commissioner of Police, the Director of Marine or the Deputy Director of Marine — ( a ) leaves any boat or vessel at any place for a longer time than is necessary for loading and unloading; ( b ) refuses to move the person’s boat or vessel away from that place when so directed by any police officer; ( c ) leaves any raft or log or piece of timber or plank in any such river or canal more than one day after its arrival therein; or ( d ) erects in any such river or canal any stage or scaffolding, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $25. (2) Such boat, vessel, raft, timber or plank may be removed by the police. (3) The expense of such removal is recoverable as a fine from the owner or person in charge of the same, and if not paid by the owner or person may be recovered by distress and sale of the property of such owner or person and of such boat, vessel, raft, timber or plank."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 2 - OFFENCES AGAINST PUBLIC ORDER AND NUISANCE",
      "section": "17",
      "title": "Penalty for depositing corpse or dying person",
      "content": "17. Any person who deposits or causes to be deposited any corpse or any dying person in any public place or in any private place without the consent of the owner shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 3 - OTHER OFFENCES",
      "section": "19",
      "title": "Soliciting in public place",
      "content": "19. Every person who in any public road or public place persistently loiters or solicits for the purpose of prostitution or for any other immoral purpose shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 and, in the case of a second or subsequent conviction, to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 3 - OTHER OFFENCES",
      "section": "20",
      "title": "Riotous, disorderly or indecent behaviour in, or in immediate vicinity of, certain places",
      "content": "20. Any person who is found guilty of any riotous, disorderly or indecent behaviour in any public road or in any public place or place of public amusement or resort, or in the immediate vicinity of, or in, any court, public office, police station or place of worship, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 6 months or to both and, in the case of a second or subsequent conviction, to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both. [5/2015]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 3 - OTHER OFFENCES",
      "section": "21",
      "title": "Wilful trespass on property",
      "content": "21. —(1) Any person who without satisfactory excuse wilfully trespasses on any ground belonging to the Government or appropriated to public purposes, or in or on any dwelling house or premises or any land or ground attached thereto, or on any boat or vessel, not thereby in any of such cases causing any actual damage, or not causing in the opinion of the Magistrate’s Court more than nominal damage, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000. (2) Any officer or non-commissioned officer of the Singapore Armed Forces or of any visiting forces lawfully present in Singapore may, with or without warrant, arrest any person offending in his or her view against the provisions of this section, and that person may be brought before a Magistrate’s Court to be dealt with according to law. [Act 24 of 2022 wef 28/10/2022]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 3 - OTHER OFFENCES",
      "section": "22",
      "title": "Loitering in place, vessel, etc., without satisfactory explanation",
      "content": "22. —(1) Any person who — ( a ) is a reputed thief, is found on board any vessel or boat, or loitering in any street, road, yard or other place and does not give a satisfactory account of himself or herself; or ( b ) is found in any dwelling house or other building without being able satisfactorily to account for his or her presence therein, shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 6 months. [15/2019] (2) Any offence under this section is deemed to be an arrestable offence within the meaning of the Criminal Procedure Code 2010. [15/2019]"
    },
    {
      "provision_ref": "s22A",
      "chapter": "PART 3 - OTHER OFFENCES",
      "section": "22A",
      "title": "Carrying truncheons, etc., in public places",
      "content": "22A. —(1) Except as provided in this section or any other written law, a person must not, in any public place, carry or have in his or her possession or under his or her control (whether or not in the performance of his or her functions as a private investigator, security officer or security service provider licensed under the Private Security Industry Act 2007) any truncheon, handcuffs, or such other weapon or equipment as may from time to time be specified by the Minister by notification in the Gazette . [38/2007; 2/2012] (1A) A gun, an explosive or a weapon within the meaning of the Guns, Explosives and Weapons Control Act 2021 must not be specified under subsection (1). [Act 3 of 2021 wef 01/07/2025] (2) Any private investigator, security officer or security service provider licensed under the Private Security Industry Act 2007, or any other person, who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding one month or to both. [38/2007; 2/2012] (3) Nothing in this section prohibits or prevents the carrying of any truncheon, handcuffs or specified weapon or equipment by a police officer, an auxiliary police officer or a forensic specialist acting in the course of his or her duty as such in accordance with the Police Force Act 2004, or a member of the Singapore Armed Forces or of any visiting force lawfully present in Singapore under any law relating to visiting forces. [38/2007; 2/2012; 10/2015] [Act 43 of 2024 wef 24/03/2025] (4) A private investigator, security officer or security service provider who is licensed under the Private Security Industry Act 2007 may be authorised to carry or have in his or her possession in any public place any truncheon, handcuffs or specified weapon or equipment if, and only if — ( a ) the licensing officer under that Act is satisfied that it is necessary for the performance of his or her functions as a private investigator, security officer or security service provider, and it is appropriate for permission to be given for such carrying or possession; ( b ) the private investigator’s licence, the security officer’s licence or the security service provider’s licence (as the case may be) is endorsed (with or without conditions) by the licensing officer to permit such carrying or possession; and ( c ) the truncheon, handcuffs, weapon or equipment is of the type approved by that licensing officer. [38/2007; 2/2012] (5) The Commissioner of Police may authorise, subject to such conditions of authorisation as he or she thinks fit to impose, any person, or every person belonging to a class of persons, to carry or have in the person’s possession or under the person’s control in any public place any truncheon, handcuffs or specified weapon or equipment, if — ( a ) the Commissioner of Police is satisfied that such carrying, possession or control is necessary in the circumstances, and it is appropriate for permission to be given for such carrying, possession or control; and ( b ) the truncheon, handcuffs, weapon or equipment is of the type approved by the Commissioner of Police. [2/2012] (6) The Commissioner of Police may at any time — ( a ) revoke any authorisation under subsection (5); or ( b ) add to, vary or revoke any condition of authorisation imposed under subsection (5). [2/2012] (7) In this section — “public place” includes any premises or place to which the public has or is permitted to have access, whether on the invitation of the owners or occupiers thereof or on payment or otherwise; “specified weapon or equipment” means any weapon or equipment specified by the Minister under subsection (1). [2/2012]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 3 - OTHER OFFENCES",
      "section": "23",
      "title": "Penalty for taking intoxicant, etc., into public hospital",
      "content": "23. Any person who takes or attempts to take without due permission into any public hospital any intoxicating liquor, drug or preparation shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding 2 months, and such liquor, drug or preparation and the vessels containing the same are to be forfeited."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 3 - OTHER OFFENCES",
      "section": "24",
      "title": "Improper management of house of public resort",
      "content": "24. Any person who being the keeper of any house licensed under any written law as a public house or as a retail liquor shop or which is used as a place of public entertainment or public resort — ( a ) knowingly permits any unlawful games or gaming therein; ( b ) knowingly permits prostitutes or persons of notoriously bad character or drunken and disorderly persons to assemble or continue in or upon the person’s premises; ( c ) knowingly allows the deposit therein of goods having reasonable cause to believe them to be stolen; or ( d ) does or permits any act in contravention of the person’s licence, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 3 months, and to the forfeiture of the person’s licence, if any."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 4 - VAGRANCY",
      "section": "25",
      "title": "Interpretation of this Part",
      "content": "25. For the purposes of this Part, “place of public resort”, “public place” and expressions of similar meaning are deemed to include every estate, factory or place in which 10 or more workmen are employed."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 4 - VAGRANCY",
      "section": "26",
      "title": "Disorderly or indecent behaviour by prostitutes",
      "content": "26. Every common prostitute wandering in any public road or place of public resort and behaving in a disorderly or indecent manner is deemed to be an idle and disorderly person within the meaning of this Part and shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding one month."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 4 - VAGRANCY",
      "section": "27",
      "title": "Rogues and vagabonds",
      "content": "27. —(1) Every person — ( a ) committing an offence under section 26, after having been previously convicted as an idle and disorderly person; ( b ) pretending or professing to tell fortunes in any manner which causes or is likely to cause a public nuisance, or using any subtle craft, means or device, by palmistry or otherwise, to deceive and impose upon any person; ( c ) wilfully exposing to view, in any street, road, highway or public place, any obscene print, picture or other indecent exhibition; ( d ) wilfully, openly, lewdly and obscenely exposing his or her person in any street, road or public highway, or in the view thereof, or in any place of public resort, with intent to insult any female; ( e ) going about as a gatherer or collector of alms, or endeavouring to procure charitable contributions of any nature or kind, under any false or fraudulent pretence; ( f ) having in his or her possession without lawful excuse any instrument or material with intent to commit any offence; ( g ) being found in or upon any dwelling house, or premises for the custody of property, or in any enclosed yard, garden or area, for any unlawful purpose; or ( h ) arrested as an idle and disorderly person who violently resists arrest and being subsequently convicted of the offence for which he or she was arrested, is deemed to be a rogue and vagabond within the meaning of this Part and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 3 months or to both. (2) Every suspected person or reputed thief, frequenting or loitering in or about any river, canal or navigable stream, dock or basin, or any quay, wharf or warehouse near or adjoining thereto, or any street, highway or avenue leading thereto, or any place of public resort, or any avenue leading thereto, or any street, highway or place adjacent thereto, or in any highway or any place adjacent to a street or highway, with intent to commit an arrestable and non‑bailable offence, is deemed to be a rogue and vagabond within the meaning of this Part and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 3 months or to both. (3) In proving the intent mentioned in subsection (2), it is not necessary to show that the person suspected was guilty of any particular act or acts tending to show his or her purpose or intent, and the person may be convicted if, from the circumstances of the case, and from his or her known character as proved to the court, it appears that his or her intent was to commit an arrestable and non‑bailable offence."
    },
    {
      "provision_ref": "s27A",
      "chapter": "PART 4 - VAGRANCY",
      "section": "27A",
      "title": "Appearing nude in public or private place",
      "content": "27A. —(1) Any person who appears nude — ( a ) in a public place; or ( b ) in a private place and is exposed to public view, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 3 months or to both. (2) For the purpose of this section, the reference to a person appearing nude includes a person who is clad in such a manner as to offend against public decency or order. (3) Where an offence under this section is committed in a private place, it is lawful for a police officer to enter the private place without the authority of the owner or occupier of the private place to effect the arrest of the offender. (4) In effecting entry under subsection (3), it is lawful for a police officer to use such force as may be necessary to enter the private place."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 4 - VAGRANCY",
      "section": "28",
      "title": "Any person may arrest offender",
      "content": "28. It is lawful for any person whatsoever to arrest any person found offending against this Part and to deliver him or her to any police officer."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 4 - VAGRANCY",
      "section": "29",
      "title": "Search of conveyance or goods of person arrested",
      "content": "29. Any police officer or other person arresting any person charged with being an idle and disorderly person, or a rogue and vagabond, may take any vehicle or goods in the possession of that person as well as that person before a police officer to be searched in the presence of the police officer."
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 4 - VAGRANCY",
      "section": "30",
      "title": "Search of premises for idle and disorderly person and rogue and vagabond",
      "content": "30. A Magistrate before whom information has been duly sworn that any person described to be an idle and disorderly person, or a rogue and vagabond, is or is reasonably suspected to be harboured or concealed in any hotel, boarding house, lodging house or eating house, may authorise any police officer to enter at any time into any such hotel, boarding house, lodging house or eating house and to arrest every such idle and disorderly person, rogue and vagabond found therein."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 4 - VAGRANCY",
      "section": "31",
      "title": "Magistrate may take recognisances for good behaviour in certain cases",
      "content": "31. It is lawful for any Magistrate before whom any person is convicted under this Part to call upon the person convicted to execute a bond with sureties for the person’s good behaviour in lieu of being punished but the Magistrate must not so call upon any person who has been convicted for the second time of being a rogue and vagabond."
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 5 - TOUTING",
      "section": "32",
      "title": "Touting for business",
      "content": "32. Any person in any public road, public place, place of public resort or vehicle on a public road who, in connection with any trade or business (whether or not carried on by that person), solicits any other person persistently or in any manner as to cause or be likely to cause annoyance to that other person shall be guilty of an offence and shall be liable on conviction to a fine of not less than $1,000 and not more than $5,000 or to imprisonment for a term not exceeding 6 months or to both and, in the case of a second or subsequent conviction, to a fine of not less than $2,000 and not more than $10,000 or to imprisonment for a term not exceeding one year or to both."
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 5 - TOUTING",
      "section": "33",
      "title": "Touting in public offices",
      "content": "33. —(1) Any person who in any public office, or in the vicinity thereof, solicits to offer or loiters for the purpose of offering in connection with the public office his or her services to any one or more persons having business at that public office or any other public office (whether or not the services so offered relate to the business) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 6 months or to both. (2) Subsection (1) does not apply to — ( a ) any officer specifically appointed to advise the public on the business carried on in a public office; and ( b ) any person who is licensed under any written law or is otherwise authorised to act as a petition writer. (3) In this section, “public office” means any court and Government office or department."
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 5 - TOUTING",
      "section": "34",
      "title": "Arrestable offence",
      "content": "34. Every offence under this Part is deemed to be an arrestable offence within the meaning of the Criminal Procedure Code 2010."
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 6 - FRAUDULENT POSSESSION OF PROPERTY",
      "section": "35",
      "title": "Fraudulent possession of property",
      "content": "35. —(1) Any person who has in his or her possession or conveys in any manner anything which may be reasonably suspected of being stolen or fraudulently obtained shall, if the person fails to account satisfactorily how he or she came by the same, be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000 or to imprisonment for a term not exceeding one year or to both. (2) If any person charged with having or conveying anything stolen or fraudulently obtained declares that he or she received the same from some other person, or that he or she was employed as a carrier, agent or servant to convey the same for some other person, the court may cause every such other person, and also (if necessary) every former or pretended purchaser or other person through whose possession the same has passed (if such other person is alleged to have had possession of the same within the jurisdiction of that court) to be brought before it and examined, and is to examine witnesses upon oath touching the same. (3) If it appears to the court that any person so brought before it had possession of such thing and had reasonable cause to believe the same to have been stolen or fraudulently obtained, that person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding one year or to both. (4) In this section, “possession” includes possession in a house, building, ship, vessel, boat or other place as well as possession in a public road or place. (5) Any person who — ( a ) having been convicted of an offence punishable under this section or under Chapter 12 or 17 of the Penal Code 1871; or ( b ) having been convicted in Malaysia or in Brunei Darussalam of an offence of a nature similar to any of those offences, is subsequently convicted of an offence punishable under this section shall be liable to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 2 years or to both. (6) If information is given on oath to a Magistrate’s Court that there is cause to suspect that any property which may be reasonably suspected of being stolen or fraudulently obtained is within any house, building, ship, vessel, boat or other place, the Court may, by warrant directed to any police officer, cause the house, building, ship, vessel, boat or other place to be entered and searched at any hour of the day or night. (7) The information mentioned in subsection (6) must describe the property which it is reasonably suspected has been stolen or fraudulently obtained, and must also describe the house, building, ship, vessel, boat or other place in which the property is suspected to be. (8) If upon the making of the search any property, such as that described in the information, is found in the house, building, ship, vessel, boat or other place, the police officer making the search or some other police officer must convey the property before a Magistrate’s Court or guard the property on the spot or otherwise dispose thereof in some place of safety. (9) The police officer making the search or some other police officer must also take into custody and bring before a Magistrate’s Court every person in such house, building, ship, vessel, boat or other place in whose possession or under whose control such property is found. (10) Sections 31 and 37 of the Criminal Procedure Code 2010 apply to searches made under subsections (6), (7), (8) and (9). [15/2010]"
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 6 - FRAUDULENT POSSESSION OF PROPERTY",
      "section": "36",
      "title": "Secondhand dealers and money changers to report property stolen or fraudulently obtained",
      "content": "36. —(1) When any property has been stolen or fraudulently obtained, and a written description of the property has been given by any police officer to any dealer in secondhand goods or money changer, and property answering the description of the property is in the possession of such dealer or money changer or afterwards comes into the dealer’s or money changer’s possession or is offered to the dealer or money changer for sale or exchange, the dealer or money changer must without undue delay give information of the property to any police officer or at a police station, and must at the same time state the name and address given by the person from whom the dealer or money changer received that property or by whom it was offered to the dealer or money changer for sale or exchange. (2) Any person who fails to give such information as the person is required to give by this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000. (3) When, in the opinion of the court, the property is of such a nature as to be difficult to identify no fine is to be imposed under this section unless the court is of the opinion that the property has been wilfully concealed by the accused."
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 6 - FRAUDULENT POSSESSION OF PROPERTY",
      "section": "37",
      "title": "Melting or defacing metals, etc., within 3 days of receipt",
      "content": "37. If any pawnbroker or any dealer in secondhand goods or any worker in platinum, gold or silver, or any dealer in platinum, gold or silver articles, within 3 days of receipt of any goods or any such metals or articles, or after receiving information from a police officer that any specified goods, metals or articles, have been stolen or fraudulently obtained, melts, alters, defaces, or puts away the same or causes the same to be melted, altered, defaced, or put away, without the previous permission of the Director, Criminal Investigation Department, and it is found that such goods, metals or articles were stolen or fraudulently obtained, such pawnbroker, secondhand dealer, worker or dealer shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 6 - FRAUDULENT POSSESSION OF PROPERTY",
      "section": "38",
      "title": "Register of workers and dealers in metals",
      "content": "38. Every worker in platinum, gold or silver and every dealer in platinum, gold or silver articles must be registered by the Director, Criminal Investigation Department in a register to be maintained by him or her for the purpose and any such worker or dealer who carries on business as such without being so registered shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 3 months or to both."
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 6 - FRAUDULENT POSSESSION OF PROPERTY",
      "section": "39",
      "title": "Employees not affected",
      "content": "39. Nothing in sections 37 and 38 applies to any person employed by any worker in platinum, gold or silver, or by any dealer in platinum, gold or silver articles, for the purposes of the person’s business on the premises in respect of which the worker or dealer is registered under section 38."
    },
    {
      "provision_ref": "s39A",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39A",
      "title": "Interpretation of this Part",
      "content": "39A. —(1) In this Part — “compromised SIM card” means a SIM card that has been used either — ( a ) to commit, or to facilitate the commission of, a criminal offence; or ( b ) to cause, or to facilitate the causing of, wrongful gain or wrongful loss to any person; “personal information” means any information, whether true or not, about a person of a type that is commonly used alone or in combination with other information to identify or purport to identify a person, including (but not limited to) biometric data, name, address, date of birth, unique identification number, a written, electronic or digital signature, user authentication code, credit card or debit card number, and password; “retailer” means a person who, in the course of trade or business, provides the service of registering SIM cards for consumers; “scam offence” means any offence specified in the Schedule; [Act 21 of 2025 wef 30/12/2025] “SIM card” means a prepaid or postpaid subscriber identification module (SIM) card (whether in physical or digital form) issued with a Singapore telephone number, but does not include a SIM card that is expired or that has been terminated; “telecommunication licensee” has the meaning given by section 2 of the Telecommunications Act 1999; “unique identification number” means — ( a ) in relation to an individual — an identity card number, passport number or the number of any other similar document of identity issued by a government authority as evidence of the individual’s nationality or place of residence, and includes a foreign identification number; and ( b ) in relation to an entity — (i) if incorporated or registered in Singapore, its Unique Entity Number (UEN); or (ii) if not incorporated or registered in Singapore, its foreign incorporation or registration number; “unregistered SIM card” means a SIM card that has not been registered with a telecommunication licensee using a person’s personal information. (2) In this Part, a reference to a person doing an act for any gain is a reference to the person doing the act for any gain — ( a ) whether or not the gain is a wrongful gain; ( b ) whether or not the gain is realised; and ( c ) whether the gain is to that person or to another person. (3) For the purposes of this Part — ( a ) a reference to a person ( A ) buying, renting, borrowing or receiving a SIM card from another person ( B ) includes a reference to A buying, renting, borrowing or receiving from B — (i) a mobile telephone or any other device containing the SIM card; or (ii) a means (such as an application, a code or a link) through which the SIM card in digital form can be downloaded; and ( b ) a reference to A providing, selling, renting, lending or supplying a SIM card to B includes a reference to A providing, selling, renting, lending or supplying to B — (i) a mobile telephone or any other device containing the SIM card; or (ii) a means (such as an application, a code or a link) through which the SIM card in digital form can be downloaded. Illustration A registers for an eSIM using A ’s personal information, and obtains a QR code which A can use to download the eSIM onto A ’s phone. A provides the QR code to B for B to download the eSIM onto B ’s phone. A has provided the eSIM to B . [Act 16 of 2024 wef 01/01/2025]"
    },
    {
      "provision_ref": "s39B",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39B",
      "title": "Unlawful provision of SIM card registered using person’s personal information",
      "content": "39B. —(1) A person shall be guilty of an offence if the person — ( a ) provides, or offers to provide, a SIM card registered using the person’s personal information to another person; and ( b ) does so knowing, or having reasonable grounds to believe, that the provision of the SIM card is for any person — (i) to commit, or to facilitate the commission by any person of, any offence under any written law; or (ii) to cause, or to facilitate the causing by any person of, wrongful gain or wrongful loss to any person. (2) In proceedings for an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i), a person ( A ) who does an act mentioned in subsection (1)( a ) is presumed, until the contrary is proved, to have reasonable grounds to believe that the purpose of the provision of the SIM card is for a person to commit, or to facilitate the commission by a person of, an offence under any written law, if — ( a ) A does the act for any gain; or ( b ) at the time A does the act, A fails to take reasonable steps to ascertain — (i) the identity and physical location of the person to whom the SIM card is provided; or (ii) the purpose for which the person obtains the SIM card from A . (3) For the purpose of proving a person’s state of mind under subsection (1)( b ), it is not necessary for the prosecution to prove that the SIM card was used to commit, or to facilitate the commission of, a specific offence. (4) Subject to subsection (5), a person who is guilty of an offence under subsection (1) shall be liable on conviction — ( a ) in the case of an individual, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both; or ( b ) in any other case, to a fine not exceeding $20,000. [Act 21 of 2025 wef 30/12/2025] (5) Where an individual is convicted of an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i), the individual shall, in addition to the punishment under subsection (4)( a ), be liable to caning of not more than 12 strokes — ( a ) if the individual knew that the provision or offer of the SIM card was for any person to commit, or to facilitate the commission by any person of, any scam offence; or ( b ) if — (i) it is proved, to the satisfaction of the court, that the SIM card was used to commit, or to facilitate the commission of, a scam offence; and (ii) the individual is not able to prove, to the satisfaction of the court, that he or she had, at any time, taken reasonable steps to ensure that the SIM card would not be used to commit, or to facilitate the commission of, a scam offence. [Act 21 of 2025 wef 30/12/2025] (6) For the purposes of subsection (5)( a ), it is not necessary for the prosecution to prove that the commission, or facilitation of the commission, of a scam offence was carried out. [Act 21 of 2025 wef 30/12/2025] (7) For the purposes of subsection (5)( b )(i), it is not necessary for the prosecution to prove that any person was convicted of the scam offence. [Act 16 of 2024 wef 01/01/2025] [Act 21 of 2025 wef 30/12/2025]"
    },
    {
      "provision_ref": "s39C",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39C",
      "title": "Unlawful provision, etc., of person’s personal information for purpose of registering SIM card",
      "content": "39C. —(1) A person shall be guilty of an offence if — ( a ) the person — (i) provides, or offers to provide, the person’s personal information to be used by another person; or (ii) consents to, or offers to consent to, the person’s personal information being used by another person; and ( b ) the person does so knowing, or having reasonable grounds to believe — (i) that the person’s personal information will be used to register a SIM card; and (ii) that the SIM card will be used — (A) to commit, or to facilitate the commission by any person of, any offence under any written law; or (B) to cause, or to facilitate the causing by any person of, wrongful gain or wrongful loss to any person. (2) In proceedings for an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(ii)(A), a person ( A ) who does an act mentioned in subsection (1)( a ) is presumed, until the contrary is proved, to have reasonable grounds to believe that the SIM card will be used to commit, or to facilitate the commission by a person of, an offence under any written law, if — ( a ) A does the act for any gain; or ( b ) at the time A does the act, A fails to take reasonable steps to ascertain — (i) the identity and physical location of the person who uses A ’s personal information to register the SIM card; or (ii) the purpose for which the person uses A ’s personal information to register the SIM card. (3) For the purpose of proving a person’s state of mind under subsection (1)( b ), it is not necessary for the prosecution to prove that the SIM card was used to commit, or to facilitate the commission of, a specific offence. (4) Subject to subsection (5), a person who is guilty of an offence under subsection (1) shall be liable on conviction — ( a ) in the case of an individual, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both; or ( b ) in any other case, to a fine not exceeding $20,000. [Act 21 of 2025 wef 30/12/2025] (5) Where an individual is convicted of an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(ii)(A), the individual shall, in addition to the punishment under subsection (4)( a ), be liable to caning of not more than 12 strokes — ( a ) if the individual knew that the personal information will be used to register a SIM card that will be used to commit, or to facilitate the commission by any person of, any scam offence; or ( b ) if — (i) it is proved, to the satisfaction of the court, that a SIM card registered using the personal information was used to commit, or to facilitate the commission of, a scam offence; and (ii) the individual is not able to prove, to the satisfaction of the court, that he or she had, at any time, taken reasonable steps to ensure that, the SIM card would not be used to commit, or to facilitate the commission of, a scam offence. [Act 21 of 2025 wef 30/12/2025] (6) For the purposes of subsection (5)( a ), it is not necessary for the prosecution to prove that the commission, or facilitation of the commission, of a scam offence was carried out. [Act 21 of 2025 wef 30/12/2025] (7) For the purposes of subsection (5)( b )(i), it is not necessary for the prosecution to prove that any person was convicted of the scam offence. [Act 16 of 2024 wef 01/01/2025] [Act 21 of 2025 wef 30/12/2025]"
    },
    {
      "provision_ref": "s39D",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39D",
      "title": "Transacting of SIM card registered using another person’s personal information for criminal activity",
      "content": "39D. —(1) A person shall be guilty of an offence if — ( a ) the person buys, rents, borrows or otherwise receives, or offers to buy, rent, borrow or otherwise receive — (i) a SIM card registered using another person’s personal information; or (ii) an unregistered SIM card; and ( b ) the person does so intending to use the SIM card, or to supply the SIM card to any other person — (i) to commit, or to facilitate the commission by any person of, any offence under any written law; or (ii) to cause, or to facilitate the causing by any person of, wrongful gain or wrongful loss to any person. (2) A person shall be guilty of an offence if — ( a ) the person sells, rents, lends or otherwise supplies, or offers to sell, rent, lend or otherwise supply, to another person — (i) a SIM card registered using any other person’s personal information; or (ii) an unregistered SIM card; and ( b ) the person does so knowing, or having reasonable grounds to believe, that the SIM card will be used — (i) to commit, or to facilitate the commission by any person of, any offence under any written law; or (ii) to cause, or to facilitate the causing by any person of, wrongful gain or wrongful loss to any person. (3) In proceedings for an offence under subsection (1) or (2) involving a SIM card registered using another person’s personal information, it is a defence for the accused to prove that the accused did not know, and had no reason to believe, that the SIM card was registered using another person’s personal information. (4) In proceedings for an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i), a person ( A ) who does an act mentioned in subsection (1)( a ) is presumed, until the contrary is proved, to have the intent to use or supply (as the case may be) the SIM card to commit, or to facilitate the commission by a person of, an offence under any written law, if — ( a ) where the SIM card is a SIM card registered using another person’s personal information — A does the act for any gain; or ( b ) it is proved that the SIM card is a compromised SIM card at the time A does the act. (5) In proceedings for an offence under subsection (2) involving the fault element mentioned in subsection (2)( b )(i), a person ( A ) who does an act mentioned in subsection (2)( a ) is presumed, until the contrary is proved, to have reasonable grounds to believe that the SIM card will be used to commit, or to facilitate the commission by a person of, an offence under any written law, if — ( a ) where the SIM card is a SIM card registered using another person’s personal information — A does the act for any gain; ( b ) it is proved that the SIM card is a compromised SIM card at the time A does the act; or ( c ) where the SIM card is registered using another person’s personal information — at the time A does the act, A fails to take reasonable steps to ascertain — (i) the identity and physical location of the person to whom the SIM card is supplied; or (ii) the purpose for which the person receives the SIM card from A . (6) In addition to subsection (4), in proceedings for an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i) where the charge is amalgamated or involves more than one SIM card, a person ( A ) who does an act mentioned in subsection (1)( a ) is presumed, until the contrary is proved, to have the intent to use or supply (as the case may be) the SIM card to commit, or to facilitate the commission by a person of, an offence under any written law, if the act concerns more than a total of 10 SIM cards registered using another person’s personal information or unregistered SIM cards, or a combination of both. (7) In addition to subsection (5), in proceedings for an offence under subsection (2) involving the fault element mentioned in subsection (2)( b )(i) where the charge is amalgamated or involves more than one SIM card, a person ( A ) who does an act mentioned in subsection (2)( a ) is presumed, until the contrary is proved, to have reasonable grounds to believe that the SIM card will be used to commit, or to facilitate the commission by a person of, an offence under any written law, if the act concerns more than a total of 10 SIM cards registered using another person’s personal information or unregistered SIM cards, or a combination of both. (8) For the purpose of proving whether a SIM card was used to commit, or to facilitate the commission of, an offence, it is not necessary for the prosecution to prove that a specific offence occurred. (9) Subject to subsections (10) and (11), a person who is guilty of an offence under subsection (1) or (2) shall be liable on conviction — ( a ) in the case of an individual — (i) to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 5 years or to both; or ( b ) in any other case — (i) to a fine not exceeding $20,000; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $40,000. [Act 21 of 2025 wef 30/12/2025] (10) Where an individual is convicted of an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i), the individual shall, in addition to the punishment under subsection (9)( a ), be liable to caning of not more than 12 strokes — ( a ) if the individual intended to use the SIM card or to supply the SIM card to any other person, to commit, or to facilitate the commission by any person of, any scam offence; or ( b ) if — (i) it is proved, to the satisfaction of the court, that the SIM card was used, or was supplied to another person, to commit, or to facilitate the commission of, a scam offence; and (ii) the individual is not able to prove, to the satisfaction of the court, that he or she had, at any time, taken reasonable steps to ensure that, the SIM card would not be used to commit, or to facilitate the commission of, a scam offence. [Act 21 of 2025 wef 30/12/2025] (11) Where an individual is convicted of an offence under subsection (2) involving the fault element mentioned in subsection (2)( b )(i), the individual shall, in addition to the punishment under subsection (9)( a ), be liable to caning of not more than 12 strokes — ( a ) if the individual knew that the SIM card will be used to commit, or to facilitate the commission by any person of, any scam offence; or ( b ) if — (i) it is proved, to the satisfaction of the court, that the SIM card was used to commit, or to facilitate the commission of, a scam offence; and (ii) the individual is not able to prove, to the satisfaction of the court, that he or she had, at any time, taken reasonable steps to ensure that the SIM card would not be used to commit, or to facilitate the commission of, a scam offence. [Act 21 of 2025 wef 30/12/2025] (12) For the purposes of subsections (10)( a ) and (11)( a ), it is not necessary for the prosecution to prove that the commission, or facilitation of the commission, of a scam offence was carried out. [Act 21 of 2025 wef 30/12/2025] (13) For the purposes of subsections (10)( b )(i) and (11)( b )(i), it is not necessary for the prosecution to prove that any person was convicted of the scam offence. [Act 16 of 2024 wef 01/01/2025] [Act 21 of 2025 wef 30/12/2025]"
    },
    {
      "provision_ref": "s39E",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39E",
      "title": "Transacting of SIM card registered using another person’s personal information for consideration",
      "content": "39E. —(1) A person shall be guilty of an offence if the person, in exchange for any consideration — ( a ) buys or rents, or offers to buy or rent, a SIM card registered using another person’s personal information; or ( b ) sells or rents, or offers to sell or rent, a SIM card registered using another person’s personal information to any other person. (2) However, a person is not guilty of an offence under subsection (1) if the person proves, on a balance of probabilities, that — ( a ) the person did not know, and had no reason to believe, that the SIM card was registered using another person’s personal information; ( b ) in the case of an offence under subsection (1)( a ), the person bought or rented the SIM card for a lawful purpose; or ( c ) in the case of an offence under subsection (1)( b ), the person did not know, and had no reason to believe, that the SIM card would be used to commit, or to facilitate the commission of, any offence. (3) A person who is guilty of an offence under subsection (1) shall be liable on conviction — ( a ) in the case of an individual — (i) to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 5 years or to both; or ( b ) in any other case — (i) to a fine not exceeding $20,000; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $40,000. [Act 16 of 2024 wef 01/01/2025]"
    },
    {
      "provision_ref": "s39F",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39F",
      "title": "Possession of SIM card registered using another person’s personal information for criminal activity",
      "content": "39F. —(1) A person shall be guilty of an offence if — ( a ) the person possesses — (i) a SIM card registered using another person’s personal information; or (ii) an unregistered SIM card; and ( b ) the person intends to use the SIM card, or to supply the SIM card to any other person — (i) to commit, or to facilitate the commission by any person of, any offence under any written law; or (ii) to cause, or to facilitate the causing by any person of, wrongful gain or wrongful loss to any person. (2) In proceedings for an offence under subsection (1) involving a SIM card registered using another person’s personal information, it is a defence for the accused to prove that the accused did not know, and had no reason to believe, that the SIM card was registered using another person’s personal information. (3) In proceedings for an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i), a person ( A ) who does an act mentioned in subsection (1)( a ) is presumed, until the contrary is proved, to have the intent to use or supply (as the case may be) a SIM card for the purpose of committing, or facilitating the commission by a person of, an offence under any written law, if it is proved that the SIM card in A ’s possession is a compromised SIM card. (4) In addition to subsection (3), in proceedings for an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i) where the charge is amalgamated or involves more than one SIM card, a person ( A ) who does an act mentioned in subsection (1)( a ) is presumed, until the contrary is proved, to have the intent to use or supply (as the case may be) a SIM card for the purpose of committing, or facilitating the commission by a person of, an offence under any written law, if A has in A ’s possession more than a total of 10 SIM cards registered using another person’s personal information or unregistered SIM cards, or a combination of both. (5) For the purpose of proving whether a SIM card was used to commit, or to facilitate the commission of, an offence, it is not necessary for the prosecution to prove that a specific offence occurred. (6) Subject to subsection (7), a person who is guilty of an offence under subsection (1) shall be liable on conviction — ( a ) in the case of an individual — (i) to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 5 years or to both; or ( b ) in any other case — (i) to a fine not exceeding $20,000; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $40,000. [Act 21 of 2025 wef 30/12/2025] (7) Where an individual is convicted of an offence under subsection (1) involving the fault element mentioned in subsection (1)( b )(i), the individual shall, in addition to the punishment under subsection (6)( a ), be liable to caning of not more than 12 strokes — ( a ) if the individual intended to use the SIM card, or to supply the SIM card to any other person, to commit, or to facilitate the commission by any person of, any scam offence; or ( b ) if — (i) it is proved, to the satisfaction of the court, that the SIM card was used, or was supplied to another person, to commit, or to facilitate the commission of, a scam offence; and (ii) the individual is not able to prove, to the satisfaction of the court, that he or she had, at any time, taken reasonable steps to ensure that the SIM card would not be used to commit, or to facilitate the commission of, a scam offence. [Act 21 of 2025 wef 30/12/2025] (8) For the purposes of subsection (7)( a ), it is not necessary for the prosecution to prove that the commission, or facilitation of the commission, of a scam offence was carried out. [Act 21 of 2025 wef 30/12/2025] (9) For the purposes of subsection (7)( b ), it is not necessary for the prosecution to prove that any person was convicted of the scam offence. [Act 16 of 2024 wef 01/01/2025] [Act 21 of 2025 wef 30/12/2025]"
    },
    {
      "provision_ref": "s39G",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39G",
      "title": "Facilitation of fraudulent registration of SIM card that facilitates criminal activity",
      "content": "39G. —(1) A retailer or telecommunication licensee shall be guilty of an offence if — ( a ) the retailer or telecommunication licensee registers a SIM card using any person’s personal information; ( b ) the retailer or telecommunication licensee does so knowing, or having reasonable grounds to believe — (i) that there was no authorisation given by the person whose personal information is being used to register the SIM card; or (ii) that the personal information given by the person seeking to register the SIM card is false or misleading; and ( c ) either of the following applies: (i) the retailer or telecommunication licensee does the act mentioned in paragraph ( a ) knowing, or having reasonable grounds to believe, that the SIM card will be used — (A) to commit, or to facilitate the commission by any person of, any offence under any written law; or (B) to cause, or to facilitate the causing by any person of, wrongful gain or wrongful loss to any person; (ii) the SIM card is used by any person — (A) to commit, or to facilitate the commission by any person of, any offence under any written law; or (B) to cause, or to facilitate the causing by any person of, wrongful gain or wrongful loss to any person. (2) Subject to subsection (3), a person who is guilty of an offence under subsection (1) shall be liable on conviction — ( a ) in the case of an individual — (i) to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 5 years or to both; or ( b ) in any other case — (i) to a fine not exceeding $20,000; and (ii) in the case of a second or subsequent conviction, to a fine not exceeding $40,000. [Act 21 of 2025 wef 30/12/2025] (3) Where an individual is convicted of an offence under subsection (1) involving the fault element mentioned in subsection (1)( c )(i)(A), the individual shall, in addition to the punishment under subsection (2)( a ), be liable to caning of not more than 12 strokes — ( a ) if the individual knew that the SIM card will be used to commit, or to facilitate the commission by any person of, any scam offence; or ( b ) if — (i) it is proved, to the satisfaction of the court, that the SIM card was used to commit, or to facilitate the commission of, a scam offence; and (ii) the individual is not able to prove, to the satisfaction of the court, that he or she had, at any time, taken reasonable steps to ensure that the SIM card would not be used to commit, or to facilitate the commission of, a scam offence. [Act 21 of 2025 wef 30/12/2025] (4) For the purposes of subsection (3)( a ), it is not necessary for the prosecution to prove that the commission, or facilitation of the commission, of a scam offence was carried out. [Act 21 of 2025 wef 30/12/2025] (5) For the purposes of subsection (3)( b )(i), it is not necessary for the prosecution to prove that any person was convicted of the scam offence. [Act 21 of 2025 wef 30/12/2025] (6) For the purposes of this section, a reference to a retailer or telecommunication licensee includes a reference to an employee of the retailer or telecommunication licensee (as the case may be) acting in the course of the employee’s employment. [Act 16 of 2024 wef 01/01/2025] [Act 21 of 2025 wef 30/12/2025]"
    },
    {
      "provision_ref": "s39H",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39H",
      "title": "Offences under this Part committed outside Singapore",
      "content": "39H. An offence under section 39B(1), 39C(1), 39D(1) or (2), 39F(1) or 39G(1) committed wholly or partly outside Singapore may be dealt with as if the offence had been committed wholly within Singapore, if — ( a ) the accused was in Singapore at the time the offence was committed; or ( b ) the offence causes, or creates a significant risk of, direct and reasonably foreseeable harm in Singapore. [Act 16 of 2024 wef 01/01/2025]"
    },
    {
      "provision_ref": "s39I",
      "chapter": "PART 6A - OFFENCES RELATING TO MISUSE OF SIM CARDS",
      "section": "39I",
      "title": "Arrestable offence",
      "content": "39I. Every offence under this Part is deemed to be an arrestable offence within the meaning of the Criminal Procedure Code 2010. [Act 16 of 2024 wef 01/01/2025]"
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "40",
      "title": "Power of arrest",
      "content": "40. —(1) Subject to the provisions of this Act, any police officer may arrest without warrant any person offending in the police officer’s view against any of the provisions of this Act, and take the person before a Magistrate’s Court to be dealt with according to law. (2) Any animal, conveyance or article concerning by or for which an offence has been committed may be seized and taken to a pound or police station unless given up sooner by order of a Magistrate’s Court, until the charge is decided in due course of law."
    },
    {
      "provision_ref": "s40A",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "40A",
      "title": "Offences by corporations",
      "content": "40A. —(1) Where, in a proceeding for an offence under this Act, it is necessary to prove the state of mind of a corporation in relation to a particular conduct, evidence that — ( a ) an officer, employee or agent of the corporation engaged in that conduct within the scope of his or her actual or apparent authority; and ( b ) the officer, employee or agent had that state of mind, is evidence that the corporation had that state of mind. (2) Where a corporation commits an offence under this Act, a person — ( a ) who is — (i) an officer of the corporation; or (ii) an individual involved in the management of the corporation and in a position to influence the conduct of the corporation in relation to the commission of the offence; and ( b ) who — (i) consented or connived, or conspired with others, to effect the commission of the offence; (ii) is in any other way, whether by act or omission, knowingly concerned in, or is party to, the commission of the offence by the corporation; or (iii) knew or ought reasonably to have known that the offence by the corporation (or an offence of the same type) would be or is being committed, and failed to take all reasonable steps to prevent or stop the commission of that offence, shall be guilty of the same offence as is the corporation, and shall be liable on conviction to be punished accordingly. (3) A person mentioned in subsection (2) may rely on a defence that would be available to the corporation if it were charged with the offence with which the person is charged and, in doing so, the person bears the same burden of proof that the corporation would bear. (4) To avoid doubt, this section does not affect the application of — ( a ) Chapters 5 and 5A of the Penal Code 1871; ( b ) the Evidence Act 1893 or any other law or practice regarding the admissibility of evidence; or ( c ) section 39. (5) To avoid doubt, subsection (2) also does not affect the liability of the corporation for an offence under this Act, and applies whether or not the corporation is convicted of the offence. (6) In this section — “corporation” includes a limited liability partnership; “officer”, in relation to a corporation, means any director, partner, chief executive, manager, secretary or other similar officer of the corporation, and includes — ( a ) any person purporting to act in any such capacity; and ( b ) for a corporation whose affairs are managed by its members, any of those members as if the member were a director of the corporation; “state of mind” of a person includes — ( a ) the knowledge, intention, opinion, belief or purpose of the person; and ( b ) the person’s reasons for the intention, opinion, belief or purpose. [Act 16 of 2024 wef 17/06/2024]"
    },
    {
      "provision_ref": "s40B",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "40B",
      "title": "Offences by unincorporated associations or partnerships",
      "content": "40B. —(1) Where, in a proceeding for an offence under this Act, it is necessary to prove the state of mind of an unincorporated association or a partnership in relation to a particular conduct, evidence that — ( a ) an employee or agent of the unincorporated association or partnership engaged in that conduct within the scope of his or her actual or apparent authority; and ( b ) the employee or agent had that state of mind, is evidence that the unincorporated association or partnership (as the case may be) had that state of mind. (2) Where an unincorporated association or a partnership commits an offence under this Act, a person — ( a ) who is — (i) an officer of the unincorporated association or a member of its governing body; (ii) a partner in the partnership; or (iii) an individual involved in the management of the unincorporated association or partnership and in a position to influence the conduct of the unincorporated association or partnership in relation to the commission of the offence; and ( b ) who — (i) consented or connived, or conspired with others, to effect the commission of the offence; (ii) is in any other way, whether by act or omission, knowingly concerned in, or is party to, the commission of the offence by the unincorporated association or partnership; or (iii) knew or ought reasonably to have known that the offence by the unincorporated association or partnership (or an offence of the same type) would be or is being committed, and failed to take all reasonable steps to prevent or stop the commission of that offence, shall be guilty of the same offence as is the unincorporated association or partnership (as the case may be), and shall be liable on conviction to be punished accordingly. (3) A person mentioned in subsection (2) may rely on a defence that would be available to the unincorporated association or partnership if it were charged with the offence with which the person is charged and, in doing so, the person bears the same burden of proof that the unincorporated association or partnership would bear. (4) To avoid doubt, this section does not affect the application of — ( a ) Chapters 5 and 5A of the Penal Code 1871; ( b ) the Evidence Act 1893 or any other law or practice regarding the admissibility of evidence; or ( c ) section 39. (5) To avoid doubt, subsection (2) does not affect the liability of an unincorporated association or a partnership for an offence under this Act, and applies whether or not the unincorporated association or partnership is convicted of the offence. (6) In this section — “officer”, in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, and includes — ( a ) any person holding a position analogous to that of president, secretary or member of a committee of the unincorporated association; and ( b ) any person purporting to act in any such capacity; “partner” includes a person purporting to act as a partner; “state of mind” of a person includes — ( a ) the knowledge, intention, opinion, belief or purpose of the person; and ( b ) the person’s reasons for the intention, opinion, belief or purpose. [Act 16 of 2024 wef 17/06/2024]"
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "41",
      "title": "Regulations",
      "content": "41. The Minister may make regulations for anything that is required, permitted, expedient or necessary for carrying out the purposes and provisions of this Act, including prescribing any offences under this Act as offences that may be compounded if not so prescribed by section 241 of the Criminal Procedure Code 2010. [10/2015]"
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "42",
      "title": "Amendment of Schedule",
      "content": "42. The Minister may, by order in the Gazette , amend the Schedule. [Act 21 of 2025 wef 30/12/2025]"
    }
  ],
  "definitions": [
    {
      "term": "cattle",
      "definition": "“cattle” includes bulls, cows, bullocks and buffaloes;",
      "source_provision": "s2"
    },
    {
      "term": "horse",
      "definition": "“horse” includes mules and asses;",
      "source_provision": "s2"
    },
    {
      "term": "in or near any public road",
      "definition": "“in or near any public road” includes all places in the public road, and all places within 9 metres of it not being effectually separated from and hidden from the road by a wall or otherwise;",
      "source_provision": "s2"
    },
    {
      "term": "public place",
      "definition": "“public place” means any place or premises to which at the material time the public or any section of the public has access, on payment or otherwise, as of right or by virtue of express or implied permission;",
      "source_provision": "s2"
    },
    {
      "term": "public road",
      "definition": "“public road” includes every road, street, passage, footway or square over which the public has a right of way.",
      "source_provision": "s2"
    },
    {
      "term": "message",
      "definition": "“message” means any sign, signal, writing, image, sound, intelligence or information of any nature transmitted by telecommunications;",
      "source_provision": "s14D"
    },
    {
      "term": "telecommunications",
      "definition": "“telecommunications” means a transmission, emission or reception of signs, signals, writing, images, sounds or intelligence of any nature by wire, radio, optical or other electromagnetic systems whether or not such signs, signals, writing, images, sounds or intelligence have been subjected to rearrangement, computation or other processes by any means in the course of their transmission, emission or reception. [15/2019]",
      "source_provision": "s14D"
    },
    {
      "term": "noise",
      "definition": "“noise” includes vibration;",
      "source_provision": "s15"
    },
    {
      "term": "person responsible",
      "definition": "“person responsible” , in relation to the emission of noise, means the person to whose act, default or sufferance the noise is attributable; and where more than one person is responsible for the noise, this section applies to each of those persons whether or not what any one of them is responsible for would by itself amount to a nuisance, or would result in a level of noise justifying any proceedings under this section;",
      "source_provision": "s15"
    },
    {
      "term": "practicable",
      "definition": "“practicable” means reasonably practicable having regard among other things to local conditions and circumstances, to the current state of technical knowledge and to the financial implications.",
      "source_provision": "s15"
    },
    {
      "term": "specified weapon or equipment",
      "definition": "“specified weapon or equipment” means any weapon or equipment specified by the Minister under subsection (1). [2/2012]",
      "source_provision": "s22A"
    },
    {
      "term": "compromised SIM card",
      "definition": "“compromised SIM card” means a SIM card that has been used either — ( a )",
      "source_provision": "s39A"
    },
    {
      "term": "personal information",
      "definition": "“personal information” means any information, whether true or not, about a person of a type that is commonly used alone or in combination with other information to identify or purport to identify a person, including (but not limited to) biometric data, name, address, date of birth, unique identification number, a written, electronic or digital signature, user authentication code, credit card or debit card number, and password;",
      "source_provision": "s39A"
    },
    {
      "term": "retailer",
      "definition": "“retailer” means a person who, in the course of trade or business, provides the service of registering SIM cards for consumers;",
      "source_provision": "s39A"
    },
    {
      "term": "scam offence",
      "definition": "“scam offence” means any offence specified in the Schedule; [Act 21 of 2025 wef 30/12/2025]",
      "source_provision": "s39A"
    },
    {
      "term": "SIM card",
      "definition": "“SIM card” means a prepaid or postpaid subscriber identification module (SIM) card (whether in physical or digital form) issued with a Singapore telephone number, but does not include a SIM card that is expired or that has been terminated;",
      "source_provision": "s39A"
    },
    {
      "term": "telecommunication licensee",
      "definition": "“telecommunication licensee” has the meaning given by section 2 of the Telecommunications Act 1999;",
      "source_provision": "s39A"
    },
    {
      "term": "unique identification number",
      "definition": "“unique identification number” means — ( a )",
      "source_provision": "s39A"
    },
    {
      "term": "unregistered SIM card",
      "definition": "“unregistered SIM card” means a SIM card that has not been registered with a telecommunication licensee using a person’s personal information.",
      "source_provision": "s39A"
    },
    {
      "term": "corporation",
      "definition": "“corporation” includes a limited liability partnership;",
      "source_provision": "s40A"
    },
    {
      "term": "officer",
      "definition": "“officer” , in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, and includes — ( a )",
      "source_provision": "s40B"
    },
    {
      "term": "state of mind",
      "definition": "“state of mind” of a person includes — ( a )",
      "source_provision": "s40A"
    },
    {
      "term": "partner",
      "definition": "“partner” includes a person purporting to act as a partner;",
      "source_provision": "s40B"
    }
  ]
}