{
  "id": "mtera-1972",
  "type": "statute",
  "title": "Medical (Therapy, Education and Research) Act 1972",
  "title_en": "Medical (Therapy, Education and Research) Act 1972",
  "short_name": "MTERA1972",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/MTERA1972",
  "description": "An Act to make provision for the use of the bodies of deceased persons or parts thereof for purposes of medical or dental education, research, advancement of medical or dental science, therapy and transplantation, and for other purposes connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Medical (Therapy, Education and Research) Act 1972."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “deceased person” includes a stillborn infant or foetus; “designated officer”, in relation to an approved hospital for the purposes of this Act, means a person appointed under section 2A to be the designated officer of the approved hospital; [ Deleted by Act 11 of 2023 wef 01/05/2023 ] “Director‑General” means the Director‑General of Health, and includes the Deputy Director‑General of Health and such designated officer of an approved hospital or such public officer as is authorised by the Director‑General of Health in writing to act on behalf of the Director‑General of Health; [Act 11 of 2023 wef 01/05/2023] “donor” means an individual who makes a gift of all or any part of his or her body; “part”, in relation to a human body, includes organs, tissues, eyes, bones, arteries, blood, other fluids and other portions of a human body."
    },
    {
      "provision_ref": "s2A",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2A",
      "title": "Appointment of designated officers",
      "content": "2A. The Director‑General may appoint, in writing, any senior official of the Ministry of Health or senior executive of an approved hospital for the purposes of this Act, to be the designated officer of any approved hospital for the purposes of this Act. [Act 11 of 2023 wef 01/05/2023]"
    },
    {
      "provision_ref": "s2B",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2B",
      "title": "Approved hospitals, etc.",
      "content": "2B. The Minister may, by notification in the Gazette , declare a hospital, medical or dental school, college or university to be an approved hospital, medical or dental school, college or university for the purposes of this Act."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "3",
      "title": "Person may donate his or her body",
      "content": "3. Any person who is not mentally disordered and who is 18 years of age or above may give all or any part of his or her body for any of the purposes specified in section 7, the gift to take effect upon death."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "4",
      "title": "Relatives may donate body of deceased person",
      "content": "4. —(1) Any of the persons specified in the Schedule, in the order of priority stated, when persons in prior classes are not available at the time of death, and in the absence of actual notice of contrary indications by the deceased person, or actual notice of opposition of a member of the same class or a prior class, may give all or any part of the body of the deceased person for the purposes specified in section 7. (2) The persons authorised by subsection (1) may make the gift after death or immediately before death."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "5",
      "title": "When donee should not accept gift",
      "content": "5. The donee of a gift of a body or any part of a body must not accept the gift if the donee has actual notice of contrary indications by the deceased person or that a gift by a member of a class is opposed by a member of the same class or a prior class."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "6",
      "title": "Medical examination of body",
      "content": "6. A gift of all or any part of a body authorises any examination necessary to assure medical acceptability of the gift for the purposes intended."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "7",
      "title": "Purposes of anatomical gifts, etc.",
      "content": "7. The following persons may become donees of gifts of bodies or parts of bodies for the purposes stated: ( a ) any approved hospital for medical or dental education, research, advancement of medical or dental science, therapy or transplantation; ( b ) any approved medical or dental school, college or university for medical or dental education, research, advancement of medical or dental science, therapy or transplantation; ( c ) any specified individual for therapy or transplantation needed by the individual."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "8",
      "title": "Mode of executing gift",
      "content": "8. A gift of all or any part of a body under section 3 may be made by the donor either in writing at any time or orally in the presence of 2 or more witnesses during a last illness."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "9",
      "title": "Revocation of gift",
      "content": "9. A gift of a body or any part of a body may be revoked by the donor at any time — ( a ) by a signed statement in writing delivered to the donee; ( b ) by an oral statement made in the presence of 2 or more persons and communicated to the donee; or ( c ) by a written document to that effect found on his or her person or in his or her effects."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "10",
      "title": "Donee need not be specified",
      "content": "10. —(1) A gift of all or any part of the body of a deceased person may be made to a specified donee or without specifying a donee. (2) If the gift is made without specifying a donee, the designated officer of the approved hospital in which the death of the deceased person has taken place or to which the body of the deceased person has been removed may accept the gift as donee upon or following the death for the purposes of section 7( a ) or ( b ), as the case may be."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "11",
      "title": "Rights and duties of donee",
      "content": "11. —(1) A donee may accept or reject a gift of a body or part of a body. (2) If the gift is of a part of the body of a deceased person, the donee must cause the part to be removed without unnecessary mutilation. (3) After removal of the part of the body under subsection (2), custody of the remainder of the body vests in the surviving spouse, next‑of‑kin or other person under obligation to dispose of the body."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - ANATOMICAL GIFTS",
      "section": "12",
      "title": "Authority to remove parts of unclaimed bodies",
      "content": "12. Where the body of a deceased person has not been claimed from an approved hospital or from an institution maintained on public funds, for more than 24 hours after death, the Director‑General may authorise in writing the use of the body or any specified part for the purposes of medical or dental education, research, advancement of medical or dental science, therapy or transplantation. [Act 11 of 2023 wef 01/05/2023]"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - POST-MORTEM EXAMINATION",
      "section": "13",
      "title": "Person may authorise post-mortem examination",
      "content": "13. —(1) Any person who is not mentally disordered and who is 18 years of age or above may either in writing at any time or orally in the presence of 2 or more witnesses during his or her last illness authorise the post‑mortem examination of his or her body for the purpose of establishing or confirming the cause of death or of investigating the existence or nature of abnormal conditions. (2) Such authority is effective upon the death of that person."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - POST-MORTEM EXAMINATION",
      "section": "14",
      "title": "Relatives may authorise post-mortem examination",
      "content": "14. —(1) Any of the persons specified in the Schedule, in the order of priority stated, when persons in prior classes are not available at the time of death, and in the absence of actual notice of contrary indications by the deceased person, or actual notice of opposition of a member of the same class or a prior class, may authorise the post‑mortem examination of the body of the deceased person for the purpose of establishing or confirming the cause of death or of investigating the existence or nature of abnormal conditions. (2) The persons authorised by subsection (1) may give the authority after death or immediately before death."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - POST-MORTEM EXAMINATION",
      "section": "15",
      "title": "Post-mortem examination of unclaimed body",
      "content": "15. Where the body of a deceased person has not been claimed from an approved hospital or from an institution maintained on public funds, for more than 24 hours after death, the Director‑General may authorise in writing the post‑mortem examination of the body for the purpose of establishing or confirming the cause of death or of investigating the existence or nature of abnormal conditions. [Act 11 of 2023 wef 01/05/2023]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - SUPPLEMENTARY PROVISIONS",
      "section": "16",
      "title": "Removal and use of body to be lawful",
      "content": "16. —(1) Subject to subsection (2), the removal and use of any part of a body in accordance with section 3, 4 or 12 (as the case may be) or the post-mortem examination of a body in accordance with the provisions of Part 3, is lawful. (2) No such removal or post-mortem examination may be effected except — ( a ) by a registered medical practitioner, who must have satisfied himself or herself that the death of the deceased person has been determined and certified in accordance with section 2A of the Interpretation Act 1965; or ( b ) where the Coroner has ordered the release of the body under section 22(3)( c ) of the Coroners Act 2010, in a case where an inquiry is to be held in respect of the death of any person."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - SUPPLEMENTARY PROVISIONS",
      "section": "17",
      "title": "Power of Coroner unaffected",
      "content": "17. Sections 3, 4, 13, 14 and 15 do not affect the authority of the Coroner to direct the post‑mortem examination of a body of a deceased person under the provisions of the Coroners Act 2010. [14/2010]"
    }
  ],
  "definitions": [
    {
      "term": "deceased person",
      "definition": "“deceased person” includes a stillborn infant or foetus;",
      "source_provision": "s2"
    },
    {
      "term": "designated officer",
      "definition": "“designated officer” , in relation to an approved hospital for the purposes of this Act, means a person appointed under section 2A to be the designated officer of the approved hospital;",
      "source_provision": "s2"
    },
    {
      "term": "Director‑General",
      "definition": "“Director‑General” means the Director‑General of Health, and includes the Deputy Director‑General of Health and such designated officer of an approved hospital or such public officer as is authorised by the Director‑General of Health in writing to act on behalf of the Director‑General of Health; [Act 11 of 2023 wef 01/05/2023]",
      "source_provision": "s2"
    },
    {
      "term": "donor",
      "definition": "“donor” means an individual who makes a gift of all or any part of his or her body;",
      "source_provision": "s2"
    },
    {
      "term": "part",
      "definition": "“part” , in relation to a human body, includes organs, tissues, eyes, bones, arteries, blood, other fluids and other portions of a human body.",
      "source_provision": "s2"
    }
  ]
}