{
  "id": "naca-1991",
  "type": "statute",
  "title": "National Arts Council Act 1991",
  "title_en": "National Arts Council Act 1991",
  "short_name": "NACA1991",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/NACA1991",
  "description": "An Act to establish the National Arts Council and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the National Arts Council Act 1991."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Chairperson” means a member of the Council who is appointed under paragraph 3(1) of the First Schedule as the Chairperson of the Council, and includes any person appointed under that Schedule to act as the Chairperson; “Chief Executive” means the Chief Executive of the Council, and includes any individual acting in that capacity; “Council” means the National Arts Council established under section 3; “Deputy Chairperson” means a member of the Council who is appointed under paragraph 3(1) of the First Schedule as the Deputy Chairperson of the Council, and includes any person appointed under that Schedule to act as the Deputy Chairperson; “Fund” means the Singapore Arts Endowment Fund established under section 13; “member” means a member of the Council and includes the Chairperson and the Deputy Chairperson; “National Theatre Trust” means the National Theatre Trust constituted under section 3 of the repealed National Theatre Trust Act (Cap. 203, 1985 Revised Edition); “National Theatre Trust Board” means the Board of Trustees constituted under section 4 of the repealed National Theatre Trust Act (Cap. 203, 1985 Revised Edition); “National Theatre Trust Fund” means the National Theatre Trust Fund established under the repealed National Theatre Trust Act (Cap. 203, 1985 Revised Edition) and includes all subscriptions, donations, bequests, interest and dividends and all other property real and personal received or acquired for the purposes of that Act by the National Theatre Trust Board; “the arts” includes literary, performing and visual arts. [5/2018; 2/2020]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT, CONSTITUTION, FUNCTIONS AND POWERS OF COUNCIL",
      "section": "3",
      "title": "Establishment of National Arts Council",
      "content": "3. A body called the National Arts Council is established, which is a body corporate with perpetual succession and a common seal and is by that name capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding, developing and disposing of property, both movable and immovable; and ( c ) doing and suffering all such acts or things as bodies corporate may lawfully do or suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT, CONSTITUTION, FUNCTIONS AND POWERS OF COUNCIL",
      "section": "4",
      "title": "Constitution of Council",
      "content": "4. —(1) The Council consists of not less than 11 but not more than 27 members. [2/2020] (2) The First Schedule applies to the Council, its members and proceedings."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT, CONSTITUTION, FUNCTIONS AND POWERS OF COUNCIL",
      "section": "5",
      "title": "Functions of Council",
      "content": "5. The functions of the Council are — ( a ) to promote excellence in the arts; ( b ) to promote conditions conducive to the advancement of artistic activities in Singapore; ( c ) to promote the appreciation, understanding and enjoyment of the arts; ( d ) to support and assist in the establishment and development of arts organisations; ( e ) to encourage the support of the arts by any persons, bodies or organisations; ( f ) to organise and promote artistic activities in Singapore; ( g ) to provide, and encourage the provision of, opportunities for persons to practise the arts and to receive training in the arts and arts administration; ( h ) to promote incentives for, and recognition of, achievement in the practice of the arts; ( i ) to establish and maintain arts facilities including performing arts centres, galleries, theatres, concert halls and rehearsal facilities, and other facilities and conveniences connected with such arts facilities; ( j ) to promote the arts of Singapore overseas through artistic exchange and other activities; and ( k ) to advise the Government, either of its own motion or upon request made to it by the Minister, on matters connected with the promotion of the arts or otherwise related to the performance of its functions."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - ESTABLISHMENT, CONSTITUTION, FUNCTIONS AND POWERS OF COUNCIL",
      "section": "6",
      "title": "Powers of Council",
      "content": "6. —(1) The Council may do all things that are necessary for or incidental to the purpose of discharging its functions under this Act. (2) Without limiting subsection (1), the Council may, for the purpose referred to in that subsection — ( a ) appoint advisory committees consisting of persons, local or foreign, who have made significant contributions to the arts, to advise the Council on matters relating to the arts; ( b ) appoint committees consisting of persons who may or may not be members of the Council and delegate to such committees such of its functions as the Council may determine; ( c ) raise funds by all lawful means and receive gifts and donations, whether on trust or otherwise; ( d ) extend grants, contributions, loans or scholarships to any person or organisation connected with the arts, subject to such conditions as the Council thinks fit; ( e ) enter into contracts and establish trusts; ( f ) enter into joint ventures with any person or organisation, or form or participate in the formation of an incorporated company or companies; ( g ) provide or undertake publicity in any form; and ( h ) charge fees, commissions or rent for any goods, services or facilities provided by the Council."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - ESTABLISHMENT, CONSTITUTION, FUNCTIONS AND POWERS OF COUNCIL",
      "section": "7",
      "title": "Patrons of Council",
      "content": "7. The Council may appoint — ( a ) a patron-in-chief of the Council; and ( b ) other patrons of the Council, not exceeding such number as the Minister may determine. 8. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - ESTABLISHMENT, CONSTITUTION, FUNCTIONS AND POWERS OF COUNCIL",
      "section": "9",
      "title": "Directions by Minister",
      "content": "9. —(1) The Minister may give to the Council any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (2) The Council must give the Minister such information with regard to its property and activities as the Minister may require."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - PROVISIONS RELATING TO STAFF",
      "section": "10",
      "title": "Chief Executive",
      "content": "10. —(1) There must be a Chief Executive of the Council, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Council may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive during any period, or during all periods, when the Chief Executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - PROVISIONS RELATING TO STAFF",
      "section": "11",
      "title": "Other officers and employees, etc.",
      "content": "11. The Council may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on such terms and conditions as it may determine, such other officers, employees, consultants and agents as may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s11A",
      "chapter": "PART 3 - PROVISIONS RELATING TO STAFF",
      "section": "11A",
      "title": "Secretary of Council",
      "content": "11A. —(1) The Council may appoint an employee of the Council to be the secretary of the Council. [16/2016] (2) The secretary of the Council — ( a ) is responsible for the following matters: (i) arranging the business, and keeping the minutes, of each meeting of the Council; (ii) conveying any decision of the Council to the appropriate person; ( b ) is to perform such other functions as the Chairperson may direct; and ( c ) must act in accordance with such instructions as the Chairperson may give. [16/2016]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 4 - FUNDS AND PROPERTY OF COUNCIL",
      "section": "12",
      "title": "Funds and property of Council",
      "content": "12. —(1) The funds and property of the Council include — ( a ) all moneys and property transferred to the Council under section 15; ( b ) all gifts, donations and contributions to the Council; ( c ) contributions from moneys provided by Parliament; and ( d ) all fees, commissions, rents, interests, dividends and other income accruing to the Council. (2) The Council may open and maintain an account or accounts with any bank or banks as the Council thinks fit. (3) The Council may invest its funds in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. (4) Subject to the terms of any trust or endowment, the funds and property of the Council must be applied solely for the purposes of or in connection with the performance of the functions, powers and duties of the Council under this Act, and no portion thereof may be paid or transferred, directly or indirectly, by way of dividend, bonus or otherwise by way of profit to its members. (5) Nothing in this section prevents the payment in good faith of remuneration to any employees of the Council."
    },
    {
      "provision_ref": "s12A",
      "chapter": "PART 4 - FUNDS AND PROPERTY OF COUNCIL",
      "section": "12A",
      "title": "Issue of shares, etc.",
      "content": "12A. As a consequence of the vesting of any property, rights or liabilities of the Government in the Council under this Act, or of any capital injection or other investment by the Government in the Council in accordance with any written law, the Council must issue such shares or other securities to the Minister for Finance as that Minister may direct."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 4 - FUNDS AND PROPERTY OF COUNCIL",
      "section": "13",
      "title": "Establishment of Singapore Arts Endowment Fund",
      "content": "13. —(1) A fund called the Singapore Arts Endowment Fund is established, which vests in the Council and consists of — ( a ) all moneys transferred to the Council under section 15( a ); ( b ) all donations and gifts accepted by the Council for the Fund; ( c ) such contributions to the Fund as the Minister may specify from moneys provided by Parliament; and ( d ) any other moneys that the Council may decide to transfer to the Fund. (2) Any interest, dividends and other income derived from the Fund must be credited to the general funds of the Council. (3) In this section, “general funds of the Council” means the funds of the Council other than the Fund. (4) The Fund must not, except with the prior written approval of the Minister, be applied, disposed of or alienated otherwise than as specified in section 12(2) and (3)."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 4 - FUNDS AND PROPERTY OF COUNCIL",
      "section": "14",
      "title": "Financial provisions",
      "content": "14. The financial provisions set out in the Second Schedule apply to the Council."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "15",
      "title": "Transfer of assets and liabilities",
      "content": "15. As from 15 October 1991 — ( a ) the National Theatre Trust Fund and all property, movable and immovable, vested in the National Theatre Trust immediately before that date, and all assets, rights and interests vested in, and all outstanding debts, liabilities and obligations incurred by, the National Theatre Trust in connection therewith; and ( b ) such movable property vested in the Government immediately before that date used to carry out any functions and services of the Arts Division in the Ministry of Information and the Arts which are similar to any functions vested in the Council by this Act, as the Minister for Finance may, by warrant, direct, must be transferred to and vest in the Council without further assurance."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "16",
      "title": "Existing agreements, etc.",
      "content": "16. All deeds, bonds, agreements, instruments and working arrangements, subsisting immediately before 15 October 1991, affecting any of the property, rights, interests, liabilities and obligations transferred to or vested in the Council under section 15( a ) continue in force on and after that date and are enforceable by or against the Council as if, instead of the National Theatre Trust or a person acting on behalf of the National Theatre Trust, the Council had been named therein or had been a party thereto."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "17",
      "title": "Pending legal proceedings",
      "content": "17. Any proceedings or cause of action pending or existing immediately before 15 October 1991 by or against the National Theatre Trust or any person acting on behalf of the National Theatre Trust may be continued and is to be enforced by or against the Council."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "18",
      "title": "Transfer of employees",
      "content": "18. —(1) As from 15 October 1991, such persons who immediately before that date — ( a ) are employed by the National Theatre Trust; or ( b ) are employed by the Government for the purpose of carrying out any of the functions and services of the Arts Division in the Ministry of Information and the Arts which are similar to any functions vested in the Council by this Act, as the Minister may determine, must be transferred to the service of the Council on terms not less favourable than those the person would have enjoyed had the person remained in the service of the National Theatre Trust or the Government, as the case may be. (2) Despite subsection (1), such persons transferred to the service of the Council from the service of the Government, as the Minister may determine, must before 15 October 1991 be given the option of remaining in the service of the Government."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "19",
      "title": "Conditions of service",
      "content": "19. —(1) Until such time as terms and conditions of service are drawn up by the Council — ( a ) every person transferred from the service of the Government under section 18 is to continue under the schemes and terms and conditions of service in the Government which the person would have enjoyed had the person remained in the service of the Government; and ( b ) every person transferred from the service of the National Theatre Trust under section 18 is to continue under the schemes and terms and conditions of service enjoyed by the person immediately prior to the person’s transfer. (2) The terms and conditions of service of persons transferred to the service of the Council under section 18 must take into account the salaries and terms and conditions of service, including any accrued rights to leave, enjoyed by such persons while in the employment of the Government or the National Theatre Trust (as the case may be) and any such term or condition relating to the length of service with the Council must provide for the recognition of service under the Government or the National Theatre Trust by persons so transferred to be service by them under the Council. (3) Nothing in the terms and conditions of service to be drawn up by the Council adversely affects the conditions that would have been applicable to persons transferred to the service of the Council as regards any pension, gratuity or allowance payable under the Pensions Act 1956. (4) The terms and conditions of service, in the case of persons transferred to the service of the Council under section 18(1)( b ), must be agreed upon by the Government, the Council and the officer concerned."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "20",
      "title": "Pension schemes, provident fund, etc.",
      "content": "20. —(1) Persons transferred under section 18 from the service of the Government who are eligible for any pension, gratuity or allowance payable under the Pensions Act 1956 must, before 15 October 1991, be given the option of continuing on any pension scheme established under this section. (2) If any person exercises his or her option given under subsection (1) to continue on a pension scheme, the Council may, with the approval of the Minister, make rules for the establishment of a scheme or schemes for the payment of pensions, gratuities, provident fund or other superannuation benefits to such employees or classes of employees of the Council as it may determine, or to their legal personal representatives or dependants, on the death or retirement of such employees from the service of the Council or on their otherwise leaving the service of the Council and the Third Schedule applies to any scheme or schemes so established. (3) In every case where a person employed by the Government has been transferred to the service of the Council under section 18, the Government is to be liable to pay the Council such portion of any gratuity, pension or allowance payable to such person on the person’s retirement or otherwise leaving the service of the Council as the same is to bear to the proportion which the aggregate amount of the person’s pensionable emoluments during the person’s service with the Government bears to the aggregate amount of his or her pensionable emoluments during his or her service under both the Government and the Council. (4) Where any person who is transferred to the service of the Council under section 18 is a contributor under the Widows’ and Orphans’ Pension Act 1904, the person must, for the purposes of that Act, continue to make contributions under that Act as if the person had not been transferred to the service of the Council and, for the purposes of that Act, the person’s service with the Council is deemed to be service with the Government."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "21",
      "title": "No benefits in respect of abolition or reorganisation of office",
      "content": "21. Despite the provisions of the Pensions Act 1956, a person who is transferred to the service of the Council under section 18 must not be entitled to claim any benefit under the Pensions Act 1956 on the ground that the person has been retired from the service of the Government on account of abolition or reorganisation of office in consequence of the establishment and incorporation of the Council."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "22",
      "title": "Continuation and completion of disciplinary proceedings",
      "content": "22. —(1) Where on 15 October 1991, any disciplinary proceedings are pending against any employee of the Government transferred to the service of the Council under section 18, any committee acting under due authority to hear or investigate the matter continues to exist, despite this Act, for the purpose of completing the hearing or investigation and the making of an order or rendering a decision (as the case may be), and the Government or committee must complete the hearing or investigation in accordance with the authority vested in the Government or committee immediately before that date and make such order, rule or direction as the Government or committee could have made under the authority vested in it immediately before that date. (2) Any order, rule or direction made or given by the Government or committee under this section is treated as an order, rule or direction of the Council and has the same force or effect as if it had been made or given by the Council pursuant to the authority vested in the Council under this Act."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - TRANSFER OF ASSETS, LIABILITIES AND EMPLOYEES",
      "section": "23",
      "title": "Misconduct or neglect of duty by employee before transfer",
      "content": "23. The Council may reprimand, reduce in rank, retire, dismiss or punish in some other manner a person transferred to the service of the Council under section 18 for any misconduct or neglect of duty committed prior to 15 October 1991 which would have rendered the person liable to be reprimanded, reduced in rank, retired, dismissed or punished in some other manner by the Government or the National Theatre Trust (as the case may be), as if this Act had not been enacted."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 6 - MISCELLANEOUS PROVISIONS",
      "section": "24",
      "title": "Protection from personal liability",
      "content": "24. —(1) No suit or other legal proceedings shall lie against any member or employee of the Council or other person acting under the directions of the Council for anything which is in good faith done or intended to be done in the execution or purported execution of this Act. (2) Any expenses incurred by the Council or any member, employee or person acting under the direction of the Council must be borne by and repaid out of the funds of the Council."
    }
  ],
  "definitions": [
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means a member of the Council who is appointed under paragraph 3(1) of the First Schedule as the Chairperson of the Council, and includes any person appointed under that Schedule to act as the Chairperson;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive",
      "definition": "“Chief Executive” means the Chief Executive of the Council, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Council",
      "definition": "“Council” means the National Arts Council established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means a member of the Council who is appointed under paragraph 3(1) of the First Schedule as the Deputy Chairperson of the Council, and includes any person appointed under that Schedule to act as the Deputy Chairperson;",
      "source_provision": "s2"
    },
    {
      "term": "Fund",
      "definition": "“Fund” means the Singapore Arts Endowment Fund established under section 13;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means a member of the Council and includes the Chairperson and the Deputy Chairperson;",
      "source_provision": "s2"
    },
    {
      "term": "National Theatre Trust",
      "definition": "“National Theatre Trust” means the National Theatre Trust constituted under section 3 of the repealed National Theatre Trust Act (Cap. 203, 1985 Revised Edition);",
      "source_provision": "s2"
    },
    {
      "term": "National Theatre Trust Board",
      "definition": "“National Theatre Trust Board” means the Board of Trustees constituted under section 4 of the repealed National Theatre Trust Act (Cap. 203, 1985 Revised Edition);",
      "source_provision": "s2"
    },
    {
      "term": "National Theatre Trust Fund",
      "definition": "“National Theatre Trust Fund” means the National Theatre Trust Fund established under the repealed National Theatre Trust Act (Cap. 203, 1985 Revised Edition) and includes all subscriptions, donations, bequests, interest and dividends and all other property real and personal received or acquired for the purposes of that Act by the National Theatre Trust Board;",
      "source_provision": "s2"
    },
    {
      "term": "the arts",
      "definition": "“the arts” includes literary, performing and visual arts. [5/2018; 2/2020]",
      "source_provision": "s2"
    }
  ]
}