{
  "id": "nakio-1933",
  "type": "statute",
  "title": "Ngee Ann Kongsi (Incorporation) Ordinance 1933",
  "title_en": "Ngee Ann Kongsi (Incorporation) Ordinance 1933",
  "short_name": "NAKIO1933",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/NAKIO1933",
  "description": "An Ordinance to incorporate the Ngee Ann Kongsi.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Ordinance may be cited as the Ngee Ann Kongsi (Incorporation) Ordinance 1933."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Incorporation",
      "content": "2. The persons whose names are from time to time inscribed in the Register of Members hereinafter mentioned shall be a body corporate (hereinafter called “the Corporation”) and shall have perpetual succession under the name of “The Ngee Ann Kongsi”."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Membership",
      "content": "3. —(1) The Committee of Management hereinafter mentioned shall within one month after 10 March 1933 cause to be inserted for not less than 2 consecutive weeks in at least 2 of the Chinese daily newspapers circulating in Singapore notices inviting persons eligible to become members of the Corporation to apply for registration as members of the Corporation, and when and as often as application for membership shall be received or within a reasonable time thereafter the Committee of Management shall consider the same and shall elect to be members of the Corporation such applicants for membership as it shall in its absolute discretion consider desirable to elect. (2) No person shall be eligible for membership of the Corporation unless at the time of his application for membership — ( a ) he has attained the age of 21 years and has ordinarily resided in Singapore for not less than 2 years and is a member of the Teochew Community of or originating from one of the said Eight Districts; and ( b ) he fills up and signs a declaration in the form set forth in the First Schedule. (3) If any applicant for membership whose application shall be rejected by the Committee of Management shall enquire the reasons for such rejection, the Committee of Management may, but shall not be bound to, state such reasons. (4) No applicant for membership whose application shall be rejected by the Committee of Management shall be entitled again to apply for membership of the Corporation until the expiration of 6 months from the date of his previous application. (5) The Committee of Management shall within one month after 10 March 1933 cause to be kept a Register of Members of the Corporation and to be inscribed therein the name, address and occupation of every person elected to be a member of the Corporation and the date of his election."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Rights on incorporation",
      "content": "4. —(1) The Corporation shall have and may use a corporate seal which may from time to time be broken, changed, altered and made anew as to the Corporation shall seem fit. (2) The Corporation may sue and be sued in respect of its property and otherwise in all Courts of Justice. (3) The Corporation may acquire, purchase, lease, take, hold and enjoy movable and immovable property of every description and subject as hereinafter provided may sell, exchange, convey, assign, surrender and yield up, mortgage, demise, re‑assign, transfer or otherwise dispose of and deal with any movable and immovable property vested in the Corporation upon such terms as to the Corporation shall seem fit."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Office",
      "content": "5. The Corporation shall have an office at the Teochew Temple in Phillip Street, Singapore, or at such other place as may from time to time be decided."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Objects and purposes",
      "content": "6. The objects and general purposes of the Corporation shall be — ( a ) the promotion, propagation and observance of the doctrines, ceremonies, rites and customs of the religion or religions (other than the Christian religion) commonly professed or maintained in Singapore by members of the Teochew Community of the said Eight Districts; ( b ) the maintenance, administration and improvement of and, if necessary, enlargement and rebuilding of the Teochew Temple and the maintenance, administration and improvement and, if necessary, the enlargement or rebuilding of any other temple which may belong to or be acquired by the Corporation; ( c ) the maintenance, administration and improvement and, if necessary, the enlargement and development of all burial grounds and other property belonging to or acquired by the Corporation, and the Corporation shall be at liberty to develop for building or other purposes any land belonging to or acquired by the Corporation which is not required for use as a burial ground; ( d ) the establishment, maintenance, administration and improvement in Singapore of any school or schools for the advancement of the moral, intellectual and physical education and wellbeing of scholars thereat and the general promotion and advancement of education of scholars from any school or schools in Singapore which is, are or may be regulated, conducted, maintained or controlled from time to time by members of the Teochew Community of the said Eight Districts or by any person; ( e ) the support or assistance towards the support of poor Teochew students below the age of 20 years who desire to prosecute higher studies in Singapore or abroad and who shall be considered deserving of such support or assistance; and ( f ) such other charitable purposes for the benefit of the Teochew Community in Singapore of the said Eight Districts, or any community in Singapore, as shall be considered desirable. [37/2007]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Management",
      "content": "7. —(1) The affairs of the Corporation shall be managed by a Committee of Management. [37/2007] (2) Each of the following persons shall ex‑officio be and be entitled to act as a member of the Committee of Management (referred to in this Act as an ex‑officio member) if he is eligible for membership of the Corporation, whether or not he is a member of the Corporation: ( a ) every Chinese Member of Parliament who is a Teochew; ( b ) a representative of the Singapore Chinese Chamber of Commerce and Industry who is a Teochew and is the President or a Vice‑President of the Singapore Chinese Chamber of Commerce and Industry; ( c ) a representative of the Singapore Teochew Poit Ip Huay Kuan who is the President or a Vice‑President of the Singapore Teochew Poit Ip Huay Kuan; and ( d ) a representative of the family of the late Seah Eu Chin who is nominated by his descendants. [37/2007] (3) The members of the Committee of Management (other than the ex‑officio members and the first members of the Committee of Management referred to in section 8) shall comprise — ( a ) 20 persons elected from the members of the Corporation (each referred to in this Act as an elected member); and ( b ) not more than 5 persons co‑opted by the Committee of Management from the members of the Corporation (each referred to in this Act as a co‑opted member). [37/2007] (4) If any person entitled to act as an ex‑officio member shall hold more than one of the public appointments specified in subsection (2), such person shall specify in writing the public appointment in respect of which he desires to exercise his right to act, and shall exercise such right in respect only of the public appointment held by him so specified. (5) If any person entitled to act as an ex‑officio member ceases to hold the public appointment or appointments specified in subsection (2) entitling him so to act — ( a ) he shall cease to be a member of the Committee of Management; and ( b ) any vacancy in the Committee of Management thereby created may be filled by another person who holds that public appointment, is eligible for membership of the Corporation and is elected by the Committee of Management. [37/2007] (5A) If any person entitled to act as an ex‑officio member is unable or refuses to accept appointment or to act as an ex‑officio member — ( a ) he shall cease to be a member of the Committee of Management, notwithstanding that he may continue to hold any public appointment specified in subsection (2); and ( b ) any vacancy in the Committee of Management thereby created may be filled by another person who holds that public appointment, is eligible for membership of the Corporation and is elected by the Committee of Management. [37/2007] (6) Every elected member of the Committee of Management — ( a ) shall retire from office at the second annual general meeting of the Corporation held next after he became a member of the Committee of Management; but ( b ) shall be eligible for re‑election, or to be co‑opted by the Committee of Management appointed, at the annual general meeting of the Corporation at which he retires. [37/2007] (6A) Every co‑opted member of the Committee of Management — ( a ) shall retire from office at the annual general meeting of the Corporation at which the elected members of the Committee of Management which co‑opted him retire from office under subsection (6)( a ); but ( b ) shall be eligible for election, or to be co‑opted by the Committee of Management appointed, at the annual general meeting of the Corporation at which he retires. [37/2007] (7) The members of the Committee of Management appointed at any annual general meeting of the Corporation shall take over the duties of the members of the outgoing Committee of Management on or before the 15th day of the third lunar month in each year according to the old Chinese calendar. (8) If any member of the Committee of Management desires to retire from acting as such he shall give to the Corporation one month’s notice in writing of such his desire, and his resignation shall take effect from the date of the expiration of such notice or its earlier acceptance by the remaining members of the Committee of Management. (9) Subject to subsections (5) and (5A), if for any cause any casual vacancy shall occur in the Committee of Management such vacancy may be filled by a member of the Corporation elected by the Committee of Management, and any person so elected shall (unless otherwise arranged at the time of his election) hold office for the remainder of the period during which the member in whose place he shall be elected would have held office had such vacancy not occurred. (10) For the purposes of an election under the provisions of subsection (9) the Committee of Management shall take into consideration such one or more, not exceeding 10 of those persons who at the last previous election of members of the Committee of Management at an annual general meeting was or were proposed for election but did not then receive sufficient votes. [37/2007] (11) No person shall be eligible for election as a member of the Committee of Management unless — ( a ) he shall have attained the age of 22 years and is a person professing the religions (other than the Christian religion) professed by members or some of the members in Singapore of the Teochew Community of the said Eight Districts; ( b ) he shall have been a member of the Corporation for at least 6 months prior to the date of the annual general meeting of the Corporation or other date at which his election is proposed. (12) If any member of the Committee of Management becomes bankrupt he shall ipso facto vacate office. (13) If in the opinion of the Committee of Management any member thereof shall misconduct himself or his affairs, or otherwise be or become unfit to continue to act, he may, by the vote of two‑thirds of the members of the Committee of Management attending at a meeting specially called to consider the matter, be expelled from the Committee of Management but he shall at the said meeting be given an opportunity of explaining his conduct, or the matters giving rise to the calling of the meeting, and no vote shall be passed at such meeting unless such opportunity aforesaid shall have been given."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "First Committee of Management",
      "content": "8. The first members of the Committee of Management shall be the following:— ( a ) Lim Nee Soon of Chop Thong Mui of Nos. 112/114, Robinson Road, Singapore; ( b ) Lee Wee Nam of Chop Chye Hua Seng of No. 17, New Bridge Road, Singapore; ( c ) Goh Yang Pheng of Chop Siang Hua of No. 58, Boat Quay, Singapore; ( d ) Yeo Choo Tian of Chop Long Huat of No. 35, Circular Road, Singapore; ( e ) Chew Swee Lin of Chop Nam Heng Hak Kee of Nos. 4/5, Fish Street, Singapore; ( f ) Tan Lip Sek of Chop Tan Guan Lee of No. 79, Boat Quay, Singapore; ( g ) Quek Theng Thong of Chop Teo Siang Guan Kee of No. 65, Circular Road, Singapore; ( h ) Lim Woo Ngam of Chop Seng Moh of No. 754, North Bridge Road, Singapore; ( i ) Nah Wee Liat of Chop Wee Heng of No. 81, Boat Quay, Singapore; ( j ) Tan Guan Chua of Chop Chua Seng Heng of No. 20‑14, Armenian Street, Singapore; ( k ) Low Chia Heng of Chop Low Hong Thye of No. 30, Circular Road, Singapore; ( l ) Low Peng Soy of Chop Yong Hong of No. 57, Boat Quay, Singapore; ( m ) Kwek Liang Choon of Chop Quek Khye Seng of No. 30, Boat Quay, Singapore; ( n ) Liau Chia Heng of Chop Buan Mui Seng of No. 5, Cumming Street, Singapore; ( o ) Yeo Chan Boon of Chop Yong Guan Seng of No. 60, Circular Road, Singapore; ( p ) Tan Chew Char of Chop Sin Heng of No. 1167, Serangoon Road, Singapore; ( q ) Goh Teck Chng of Chop Yong Buan Long of No. 51, Circular Road, Singapore; ( r ) Tan Miang Long of Chop Liang Seng of No. 326, Thomson Road, Singapore; ( s ) Sim Ka Siew of Chop Kheng Soon Seng of No. 57, Boat Quay, Singapore; ( t ) Quek Soo Kow of Chop Kow Hak of No. 12, North Canal Road, Singapore; ( u ) Lim Soo Siam of Chop Yong Swee Seng of No. 66, Canal Road, Singapore; ( v ) Low Peng Soo of Chop Low Joon Hong of No. 31, Boat Quay, Singapore; ( w ) Lee Kim Soo of Chop Kwang Moh of No. 89, High Street, Singapore; ( x ) Lim Chong Pang of Chop Thong Yak of Nos. 112/114, Robinson Road, Singapore; ( y ) Seah Eng Tong of Chop Chin Heng of No. 4, North Bridge Road, Singapore, and the first members of the Committee of Management shall be entitled to hold office until 25 January 1933, or until the second annual general meeting of the Corporation, whichever shall be the later date."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Officers",
      "content": "9. —(1) The Committee of Management shall in such manner as they think fit elect from their number a President, 2 Vice‑Presidents, an Honorary Secretary and an Honorary Treasurer, and in addition shall appoint an Assistant to the Honorary Secretary and an auditor or auditors, and such persons are hereinafter referred to as “the officers” of the Corporation. (2) No person shall be elected or appointed to be an officer of the Corporation unless he shall have attained the age of 25 years. (3) If any officer of the Corporation shall during his term of office be absent from Singapore or incapacitated from acting as such officer the remaining elected members of the Committee of Management may appoint one of their number or some other proper person to act in the place of the officer absent or incapacitated from acting, and any person so appointed shall hold office only during the absence or incapacity of the officer in whose place he shall have been appointed and in any event shall cease to hold office at the next annual general meeting of the Corporation. (4) Any person elected to be the President or Honorary Treasurer of the Corporation for 2 years shall not be entitled to hold office as such for the next ensuing 2 years. [37/2007]"
    },
    {
      "provision_ref": "s9A",
      "section": "9A",
      "title": "Honorary Past Presidents",
      "content": "9A. —(1) The Committee of Management may appoint one or more Honorary Past Presidents to serve as advisers to the Committee of Management. [37/2007] (2) No person shall be eligible for appointment as an Honorary Past President unless he is — ( a ) a member of the Corporation; and ( b ) a former President of the Corporation. [37/2007] (3) The term of office of an Honorary Past President shall end on the date on which the members of the Committee of Management (other than ex‑officio members) which appointed him retire from office under section 7(6)( a ) and (6A)( a ). [37/2007] (4) Every person who has been appointed as an Honorary Past President shall be eligible for re‑appointment. [37/2007]"
    },
    {
      "provision_ref": "s9B",
      "section": "9B",
      "title": "Publication and advertisement of appointments",
      "content": "9B. The particulars of every appointment of an officer of the Corporation, a member of the Committee of Management, or an Honorary Past President, including the name, address and occupation of the person appointed, the date of the appointment, and the office to which the person was appointed, shall be — ( a ) published in the Gazette within 21 days after the date of the appointment; and ( b ) advertised in at least 2 issues of one Chinese daily newspaper circulating in Singapore. [37/2007]"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Proceedings of Committee of Management",
      "content": "10. —(1) The Committee of Management shall meet together at least once in every 3 months to discuss the management and affairs of the Corporation and 7 members shall form a quorum. (2) The President, or in his absence one of the Vice‑Presidents of the Corporation, shall preside at all meetings of the Committee of Management, but if at the time appointed for the meeting the President and both Vice‑Presidents shall be absent the members present shall appoint one of their number to preside. (3) All questions arising at any meeting of the Committee of Management shall be decided by a majority of votes on a show of hands or on a ballot if a ballot be demanded by at least 3 members, and each member present shall be entitled to one vote, and in the case of an equality of votes the member presiding at the meeting shall have a second or casting vote. (4) The Honorary Secretary shall cause to be kept minutes of the proceedings of all meetings of the Committee of Management and such minutes shall be submitted for confirmation at such meeting or at the next succeeding meeting of the Committee of Management and if then confirmed shall be signed by the Chairman of the meeting at which such confirmation is made and thereafter shall be prima facie evidence of all proceedings evidenced thereby."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Accounts, etc.",
      "content": "11. —(1) The Honorary Treasurer shall cause proper books of account to be kept and therein to be entered full particulars of all assets and liabilities and of all receipts and disbursements on account of the Corporation and of all other matters and things relative thereto and necessary to explain such entries. (2) Not later than the last day of the first lunar month in each year according to the old Chinese calendar the Honorary Treasurer shall cause to be prepared a statement in the form of a balance sheet containing particulars of all assets and liabilities of the Corporation and an account of the receipts and disbursements during the Chinese year preceding. (3) The accounts kept by the Honorary Treasurer and the annual statement prepared by him in accordance with the provisions of the preceding subsections shall be audited by the auditor or auditors as and when requested by the Committee of Management, and the auditor or auditors shall certify in writing the result of his or their audit. (4) When and as soon as the annual statement above referred to shall have been audited as aforesaid a copy thereof shall be posted in a conspicuous place in the office of the Corporation for at least 7 days prior to the holding of the next annual meeting of the Corporation."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Annual meeting",
      "content": "12. —(1) The Corporation shall once every year on or before the last day of the second lunar month according to the old Chinese calendar hold an annual meeting of members. (2) The business to be transacted at each annual meeting shall be the consideration of the annual statement and accounts of the Corporation for the preceding year and the consideration of any question raised as to the management of the affairs of the Corporation, and at every alternate annual general meeting the business shall also include the election of the members of the Committee of Management to take the place of those retiring."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Extraordinary general meetings",
      "content": "13. —(1) Upon receipt of a requisition by at least 5 members of the Committee of Management or by at least 10 members of the Corporation the Committee of Management shall proceed to convene an extraordinary general meeting of the Corporation. (2) The requisition shall state the objects of the meeting and shall be signed by the requisitionists and deposited at the office of the Corporation. The requisition may consist of more documents than one provided the same are duly signed and specify the same or similar objects. (3) The Committee of Management shall within 10 days from the receipt of the requisition aforesaid cause an acknowledgment thereof to be sent to the requisitionists and shall within 20 days from the receipt of such requisition cause an extraordinary general meeting to be held to discuss the objects specified in the requisition. (4) If the Committee of Management does not within the time aforesaid cause an extraordinary general meeting of the Corporation to be held in the manner aforesaid the requisitionists or a majority of them may themselves convene the meeting, and any meeting convened by requisitionists shall be convened in the same manner as nearly as possible as that in which such meetings ought to be convened by the Committee of Management."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "General meetings and notice thereof",
      "content": "14. —(1) The annual general meeting and all extraordinary general meetings are hereinafter referred to as general meetings. (2) The Committee of Management shall serve a written notice of every general meeting not less than 7 clear days before the day on which the general meeting is to be held. [37/2007] (3) The notice under subsection (2) shall be served on every member of the Corporation, and on every ex‑officio member (not being a member of the Corporation), who has provided to the Corporation an address for service — ( a ) personally; ( b ) by post addressed to him at his address for service; or ( c ) by delivering the notice to his address for service. [37/2007] (4) Where the notice under subsection (2) is sent by post, it shall be deemed to be served at the time when the notice would, in the ordinary course of post, be delivered. [37/2007] (5) In proving service of the notice under subsection (2) by post, it shall be sufficient to prove that the cover containing the notice was properly addressed, stamped and posted. [37/2007] (6) Notwithstanding subsections (2) and (3), the proceedings at a general meeting are not invalidated by reason only of — ( a ) any accidental omission to give the notice under subsection (2) to any person; or ( b ) the non‑receipt by any person of the notice under subsection (2). [37/2007] (7) The Committee of Management shall cause a notice of every general meeting to be advertised in one Chinese daily newspaper circulating in Singapore not less than 7 clear days before the day on which the general meeting is to be held. [37/2007] (8) The notice under subsection (7) shall specify — ( a ) the date, time and place of the general meeting; ( b ) the general nature of the business to be transacted at the general meeting; and ( c ) in the case of any special business, concise particulars of that business. [37/2007]"
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Place of meeting",
      "content": "15. Every general meeting of the Corporation shall be held at the office of the Corporation or at such other place as may be specified by the Committee of Management or if called under the provisions of section 13 by the requisitionists in the notice calling such meeting."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Proceedings at general meetings",
      "content": "16. —(1) Subject to subsection (1A), 20 members of the Corporation shall form a quorum at any general meeting. [37/2007] (1A) If, after 30 minutes from the time appointed for a general meeting, there are fewer than 20 members of the Corporation present at the place of the general meeting, any 10 or more members of the Corporation present at that place shall form a quorum for the general meeting. [37/2007] (2) The President of the Corporation or in his absence one of the Vice‑Presidents shall be entitled to take the chair at every general meeting, but in the absence of the President and Vice‑Presidents at the time appointed for any general meeting the members present may elect a member of the Committee of Management to take the chair. (3) Every question arising at a general meeting shall unless otherwise decided be decided by a majority of votes on a ballot, and every member present shall be entitled to one vote, and in case of an equality of votes the member presiding at the meeting shall have a second or casting vote. (4) The Honorary Secretary (or some other person appointed for the purpose by the Chairman of the Meeting) shall cause minutes to be kept of all proceedings at every general meeting of the Corporation."
    },
    {
      "provision_ref": "s16A",
      "section": "16A",
      "title": "Amendment of Ordinance",
      "content": "16A. The Committee of Management shall not propose any amendment to this Ordinance without the prior approval of a majority of the members of the Corporation present at a general meeting. [37/2007]"
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Where records, etc., to be kept",
      "content": "17. —(1) The Register of Members, the minutes of proceedings at all general meetings of the Corporation and at all meetings of the members of the Committee of Management, and the books of account of the Corporation, shall be kept at the office of the Corporation and shall at all reasonable times be open to inspection by any member of the Corporation, provided that the written permission of the President or a Vice‑President be obtained prior to such inspection. (2) The title deeds and securities of the Corporation shall be kept at such place and in such custody as the President of the Corporation with the approval of the Committee of Management shall decide, and the President of the Corporation shall be responsible for their safe custody."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "The seal",
      "content": "18. —(1) The seal of the Corporation shall be kept at the office of the Corporation and shall not be used except by the authority of a resolution of the Committee of Management, and all deeds and other documents requiring to be sealed shall be sealed with such seal in the presence of and shall be signed by the President of the Corporation or one of the Vice‑Presidents and by the Honorary Secretary and one other member of the Committee of Management. (2) The signatures of the President or Vice‑President and the Honorary Secretary and one member of the Committee of Management shall for all purposes be accepted as sufficient evidence of the due sealing of all deeds, documents and other instruments sealed on behalf of the Corporation."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Vesting of property",
      "content": "19. —(1) The several persons mentioned in the third column of the Second Schedule or the survivors or survivor of them or the personal representative or representatives of the last survivor of them, being the persons or person in whom are vested the respective estates and interests mentioned in the second column of the said Schedule in the lands, hereditaments and premises specified in the first column of the said Schedule, are hereby divested of such estates and interests, and such estates and interests are hereby vested in the Corporation as trustee for the members in Singapore of the Teochew Community of the said Eight Districts subject nevertheless to all conditions of tenure incident thereto and to any trusts affecting the same but with full power subject as aforesaid for the Corporation as such trustee to deal with the property so vested in accordance with the provisions of this Ordinance. (2) All moneys and movable property held by any person on behalf of the said Society and all moneys subscribed for the purposes of the Corporation and all property movable or immovable purchased or agreed to be purchased with such moneys shall be vested in the Corporation and the same and all subscriptions and donations to the Corporation shall be held by the Corporation in trust for the purposes in this Ordinance declared. (3) Within 3 months after 10 March 1933, the persons who prior to 10 March 1933, have been or have been acting as Trustees of the said Society, and who are not members of the Committee of Management referred to in section 8, shall deliver to the first members of the Committee of Management all deeds, documents of title, securities, moneys and other movable property of the said Society in their possession or under their control, and thereafter the Committee of Management shall be responsible therefor, and all debts due to the said Society on 10 March 1933, shall be payable to the Corporation, and the Committee of Management shall out of the funds of the Corporation pay all debts payable by the said Society."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Immovable property of Corporation",
      "content": "20. —(1) The Corporation shall not sell, exchange, mortgage, lease (otherwise than upon a tenancy not exceeding 3 years) or otherwise alienate or encumber any immovable property belonging to the Corporation without the permission of the General Division of the High Court, and the Corporation shall not purchase any immovable property out of the funds of the Corporation without such permission, and no application to the General Division of the High Court for such permission shall be made without a resolution being first passed at a general meeting of members held for such purpose. [Act 25 of 2021 wef 01/04/2022] [37/2007; 40/2019] (2) An application for such permission shall be made to the Court by originating application supported by an affidavit setting out the facts and reasons for which the Corporation desires to sell, exchange, mortgage or otherwise alienate or encumber or purchase the immovable property, and the application shall seek a decree of the court as in a suit relating to charities. [Act 25 of 2021 wef 01/04/2022] [42/2005] (3) A copy of every such application shall be served on the Attorney‑General a reasonable time before the hearing of the application. [42/2005] (4) The Attorney‑General may oppose the application, and if, after hearing him, the General Division of the High Court is of opinion that it will be for the general advantage of the Corporation and the members of the Teochew Community for whose benefit the Corporation is maintained to grant the application the General Division of the High Court may make a decree to that effect. [42/2005; 40/2019] (5) The application to the General Division of the High Court and the decree of the General Division of the High Court shall be recited in the conveyance, assignment, mortgage, lease or other assurance of the immovable property to be given to the purchaser, mortgagee, lessee or other person or taken by the Corporation. [40/2019] (6) Any immovable property so sold, exchanged, leased or otherwise alienated, except by way of mortgage, shall be held by the purchaser or person exchanging or otherwise taking the same free from the trusts imposed under this Ordinance."
    },
    {
      "provision_ref": "s20A",
      "section": "20A",
      "title": "Moneys received by Corporation",
      "content": "20A. —(1) The Committee of Management shall, in each accounting period of the Corporation, set apart 75% of the net income of the Corporation in that accounting period, and shall, by the end of the next accounting period, donate — ( a ) 25% of the net income to the Ngee Ann Polytechnic constituted under the Ngee Ann Polytechnic Act 1967; ( b ) 40% of the net income to such other educational institutions and in such manner as the Minister may approve; and ( c ) 10% of the net income to other charitable purposes in Singapore. [37/2007] (2) For the purposes of subsection (1), the net income of the Corporation in any accounting period of the Corporation shall be the amount determined in accordance with the following formula: where A is the amount of all moneys received by the Corporation in that accounting period by way of income from any source other than — ( a ) the sale, disposition or compulsory acquisition of any relevant asset or immovable property belonging to the Corporation; and ( b ) the withdrawal of any relevant deposit belonging to the Corporation; B is the amount which is the total of — ( a ) all operating expenses reasonably incurred by the Corporation during that accounting period; and ( b ) any depreciation in the value of the fixed assets of the Corporation during that accounting period; and C is the amount of all moneys received by the Corporation, whether by way of income or otherwise, in the accounting period immediately preceding that accounting period from — ( a ) the sale, disposition or compulsory acquisition of any relevant asset or immovable property belonging to the Corporation; and ( b ) the withdrawal of any relevant deposit belonging to the Corporation, which at the end of the accounting period second‑mentioned in this definition were not utilised for the purchase of any relevant asset or immovable property, or the making of any relevant deposit, by the Corporation. [37/2007] (3) Subject to subsections (1) and (2), no moneys received by the Corporation, whether by way of income or otherwise, from — ( a ) the sale, disposition or compulsory acquisition of any relevant asset or immovable property belonging to the Corporation; or ( b ) the withdrawal of any relevant deposit belonging to the Corporation, shall be utilised otherwise than for the purchase of any relevant asset or immovable property, or the making of any relevant deposit, by the Corporation. [37/2007] (4) All moneys received by the Corporation, whether by way of income or otherwise, shall, as soon as practicable, be deposited in a relevant bank account pending the utilisation of those moneys. [37/2007] (5) Subject to subsections (1), (2) and (3), no moneys deposited in any relevant bank account shall be utilised otherwise than for — ( a ) the purchase of any relevant asset or immovable property, or the making of any relevant deposit, by the Corporation; ( b ) the payment of any operating expenses reasonably incurred by the Corporation; ( c ) the making of any donation referred to in subsection (1); or ( d ) the making of any donation for any purpose consistent with the objects and general purposes of the Corporation referred to in section 6. [37/2007] (6) The Minister, or any person authorised by the Minister, may require the Honorary Treasurer or the Committee of Management to furnish him with — ( a ) all accounting and other records relating, directly or indirectly, to the financial transactions of the Corporation; and ( b ) such other information in the possession of the Honorary Treasurer or the Committee of Management, or to which the Honorary Treasurer or the Committee of Management has access, as he considers necessary for ascertaining whether subsections (1), (3), (4) and (5) have been complied with, and the Honorary Treasurer or Committee of Management, as the case may be, shall comply with that requirement. [37/2007] (7) The Minister may institute such proceedings as he considers necessary for ensuring compliance with this section and section 20B. [37/2007] (8) In this section — “charitable purposes” has the same meaning as in section 2(1) of the Charities Act 1994; “Minister” means the Minister charged with the responsibility for education; “relevant asset” means any asset held or to be held for the purposes of investment; “relevant bank account” means any bank account maintained and operated by the Corporation in the ordinary course of business for the purpose of depositing moneys received by the Corporation pending the utilisation of those moneys; “relevant deposit” means any deposit made or to be made, as an investment, with — ( a ) any bank licensed under the Banking Act 1970; ( b ) any finance company licensed under the Finance Companies Act 1967; or ( c ) any merchant bank licensed under the Banking Act 1970, but does not include any deposit in any relevant bank account. [37/2007; 1/2020]"
    },
    {
      "provision_ref": "s20B",
      "section": "20B",
      "title": "Subsidiaries of Corporation",
      "content": "20B. —(1) The Corporation shall not act in any manner which is prejudicial to the interests of the educational institutions referred to in section 20A(1)( a ) and ( b ) when exercising the voting rights attached to its shares in any of its subsidiaries in relation to any significant proposal affecting the subsidiary concerned. [37/2007] (2) Where the Corporation contravenes subsection (1) in relation to any significant proposal affecting any subsidiary of the Corporation, any resolution passed in relation to the significant proposal at a general meeting of the subsidiary, and anything done pursuant to any such resolution, shall be invalid and of no effect. [37/2007] (3) Notwithstanding section 157 of the Companies Act 1967, a relevant director of any subsidiary of the Corporation shall not act in any manner which is prejudicial to the interests of the educational institutions referred to in section 20A(1)( a ) and ( b ) when exercising his voting rights as a director of the subsidiary in relation to any significant proposal affecting the subsidiary. [37/2007] (4) Where any relevant director of any subsidiary of the Corporation contravenes subsection (3) in relation to any significant proposal affecting the subsidiary, any resolution passed in relation to the significant proposal by the board of directors of the subsidiary, and anything done pursuant to any such resolution, shall be invalid and of no effect. [37/2007] (5) A relevant director of any subsidiary of the Corporation does not — ( a ) commit any breach of any provision of section 157 of the Companies Act 1967; or ( b ) breach any duty under any other written law or rule of law relating to the duty or liability of directors or officers of a company, merely because he has complied with subsection (3). [37/2007] (6) In this section — “relevant director”, in relation to any subsidiary of the Corporation, means — ( a ) any director of the subsidiary who is appointed, nominated or proposed by the Corporation or the Committee of Management; ( b ) any director of the subsidiary who is a member of, or whose appointment as a director follows necessarily from his being a member of, the Committee of Management, regardless of whether he was appointed, nominated or proposed by the Corporation or the Committee of Management; ( c ) any director of the subsidiary who is accustomed or under an obligation, whether formal or informal, to act in accordance with the directions, instructions or wishes of the Corporation or the Committee of Management, regardless of whether he was appointed, nominated or proposed by the Corporation or the Committee of Management; ( d ) any director of the subsidiary appointed by the board of directors of the subsidiary who was nominated or proposed by any director of the subsidiary referred to in this paragraph or paragraph ( a ), ( b ) or ( c ); or ( e ) any alternate director of the subsidiary appointed by any director of the subsidiary referred to in paragraph ( a ), ( b ), ( c ) or ( d ); “significant proposal”, in relation to any subsidiary of the Corporation, means — ( a ) a proposal to dispose of the whole or substantially the whole of the undertaking or property of the subsidiary; ( b ) a proposal to voluntarily wind up the subsidiary; ( c ) a proposal to add, delete or alter any provision of the memorandum or articles of association of the subsidiary; or ( d ) a proposal to appoint, remove or replace any director of the subsidiary. [37/2007]"
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Rules",
      "content": "21. The Committee of Management may make rules not inconsistent with the provisions of this Ordinance — ( a ) to prescribe the conditions relating to eligibility for membership of the Corporation and the method of election; ( b ) to prescribe the conditions requisite to be complied with to entitle a student to support or assistance under section 6( e ); ( c ) to regulate the election of officers of the Corporation; ( d ) to regulate the calling and conduct of meetings of the Committee of Management and their procedure in transacting business; ( e ) for the appointment of subcommittees to whom may be delegated powers to manage the Teochew Temple at Phillip Street and any other temple and any burial ground or other property of the Corporation; ( f ) to allocate duties to and to regulate the exercise of executive powers by the President, the officers, the Committee of Management, and subcommittees of the Corporation; ( g ) to regulate the collection of subscriptions for the purposes of the Corporation; ( h ) to regulate the keeping and presentation of accounts; ( i ) to regulate the appointment, conduct and dismissal of servants of the Corporation; ( j ) for any other purpose necessary or expedient, and a copy certified under the hand of the President of the Corporation of all such rules shall be published in the Gazette and shall not be effective until the expiration of one month from the date of such publication."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "Saving of Government and other rights",
      "content": "22. Nothing in this Ordinance shall affect the rights of the Government or of any bodies politic or corporate or of any other persons except such as are mentioned in this Ordinance and those claiming by, through, from or under them. [7/97]"
    }
  ],
  "definitions": [
    {
      "term": "charitable purposes",
      "definition": "“charitable purposes” has the same meaning as in section 2(1) of the Charities Act 1994;",
      "source_provision": "s20A"
    },
    {
      "term": "Minister",
      "definition": "“Minister” means the Minister charged with the responsibility for education;",
      "source_provision": "s20A"
    },
    {
      "term": "relevant asset",
      "definition": "“relevant asset” means any asset held or to be held for the purposes of investment;",
      "source_provision": "s20A"
    },
    {
      "term": "relevant bank account",
      "definition": "“relevant bank account” means any bank account maintained and operated by the Corporation in the ordinary course of business for the purpose of depositing moneys received by the Corporation pending the utilisation of those moneys;",
      "source_provision": "s20A"
    },
    {
      "term": "relevant deposit",
      "definition": "“relevant deposit” means any deposit made or to be made, as an investment, with — ( a )",
      "source_provision": "s20A"
    },
    {
      "term": "relevant director",
      "definition": "“relevant director” , in relation to any subsidiary of the Corporation, means — ( a )",
      "source_provision": "s20B"
    },
    {
      "term": "significant proposal",
      "definition": "“significant proposal” , in relation to any subsidiary of the Corporation, means — ( a )",
      "source_provision": "s20B"
    }
  ]
}