{
  "id": "npfa-2010",
  "type": "statute",
  "title": "National Productivity Fund Act 2010",
  "title_en": "National Productivity Fund Act 2010",
  "short_name": "NPFA2010",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/NPFA2010",
  "description": "An Act to establish the National Productivity Fund and to establish the Productivity Fund Administration Board for its proper administration.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the National Productivity Fund Act 2010."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Board” means the Productivity Fund Administration Board established under section 7; “Chairperson” means the Chairperson of the Board; “Executive Secretary” means any Executive Secretary of the Board appointed under section 14(1) and includes any person acting in that capacity; “Fund” means the National Productivity Fund established under section 3; “invest” includes entering into a transaction or an arrangement for the protection of investments; “matters relating to productivity enhancement and continuing education” includes legislative or administrative action taken, or to be taken, by the Government or any public authority that affects or might affect the productivity performance of industry, industry development or the productivity performance of the Singapore economy as a whole; “member” means any member of the Board and includes any temporary member of the Board; “property” means any legal or equitable estate or interest (whether present or future and whether vested or contingent) in real or personal property of any description; “public authority” means any board, authority or agency established by or under any public Act to perform or discharge any public function."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - NATIONAL PRODUCTIVITY FUND",
      "section": "3",
      "title": "Establishment of National Productivity Fund",
      "content": "3. —(1) A fund called the National Productivity Fund is established, into which must be paid — ( a ) all moneys from time to time appropriated from the Consolidated Fund and authorised to be paid into the Fund by this Act or any other written law; ( b ) all investments out of moneys in the Fund authorised to be made by this Act and the proceeds of any of those investments, including the net income from those investments; ( ba ) all moneys paid to or recovered by the Board (whether pursuant to any contract entered into, any legal action taken, or otherwise) in connection with the provision of any financing, incentive or grant from the Fund; [Act 29 of 2023 wef 18/09/2023] ( c ) all composition sums paid under section 28; and ( d ) all moneys received by the Board by way of charges and fees for services rendered by the Board to any person. (2) For the purposes of subsection (1)( b ), the net income from investments is the amount ascertained by adding to, or deducting from, the income received from investments of moneys in the Fund any profit derived or loss sustained (as the case may be) from the realisation of those investments."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - NATIONAL PRODUCTIVITY FUND",
      "section": "4",
      "title": "Purposes of Fund",
      "content": "4. —(1) The moneys in the Fund may be withdrawn and applied for all or any of the following purposes only: ( a ) the provision (whether directly or through an intermediary) of financing (but not loans) or incentives (including grants and scholarships) to any public authority, enterprise, educational institution or other person (whether in Singapore or elsewhere) undertaking or facilitating any programme on matters relating to productivity enhancement and continuing education; [Act 29 of 2023 wef 18/09/2023] ( aa ) the provision of grants (whether directly or through an intermediary) to any enterprise, for the purpose of — (i) making investments in Singapore; or (ii) carrying out economic activities in Singapore, in order to develop the Singapore economy or any part thereof; [Act 29 of 2023 wef 18/09/2023] ( b ) the payment of expenses incurred by the Board in the performance of its functions and the discharge of its duties under this Act, including any remuneration or allowances payable to the members of the Board who are not public officers; ( c ) the payment of all expenses incidental to or arising from the administration, investment and management of moneys in the Fund. (2) Except as otherwise provided by this section, a payment must not be made out of the Fund unless the payment is authorised by the Board."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - NATIONAL PRODUCTIVITY FUND",
      "section": "5",
      "title": "Withdrawals",
      "content": "5. Moneys must not be withdrawn from the Fund unless they are charged upon the Fund or are authorised to be withdrawn under this Act."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - NATIONAL PRODUCTIVITY FUND",
      "section": "6",
      "title": "Transfer of money upon dissolution",
      "content": "6. Upon dissolution of the Fund during any term of office of the Government (within the meaning of the Constitution), the balance of the moneys remaining in that Fund must be transferred to the Consolidated Fund and be added to the reserves of the Government not accumulated by it during that term of office."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - ESTABLISHMENT, INCORPORATION AND",
      "section": "7",
      "title": "Establishment and incorporation of Productivity Fund Administration Board",
      "content": "7. A body called the Productivity Fund Administration Board is established, which is a body corporate with perpetual succession and is, by that name, capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing or disposing of property, both movable and immovable; and ( c ) doing and suffering any other acts or things that bodies corporate may lawfully do and suffer."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - ESTABLISHMENT, INCORPORATION AND",
      "section": "8",
      "title": "Common seal",
      "content": "8. —(1) The Board must have a common seal and the seal may be broken, changed, altered or made anew as the Board thinks fit. (2) All deeds, documents and other instruments requiring the seal of the Board must be sealed with the common seal of the Board in the presence of any 2 officers of the Board duly authorised by the Board to act in that behalf and must be signed by those officers. (3) All courts, judges and persons acting judicially are to take judicial notice of the common seal of the Board affixed to any document and presume that it was duly affixed. (4) The Board may by resolution or otherwise appoint an employee of the Board or any other agent, either generally or in a particular case, to execute or sign on behalf of the Board any agreement or other instrument not under seal in relation to any matter coming within the powers of the Board."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - ESTABLISHMENT, INCORPORATION AND",
      "section": "9",
      "title": "Constitution of Board",
      "content": "9. —(1) The Board consists of the following members: ( a ) a Chairperson; and ( b ) not less than 3 but not more than 6 other members as the Minister may determine. (2) The First Schedule has effect with respect to the Board, its members and proceedings."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - ESTABLISHMENT, INCORPORATION AND",
      "section": "10",
      "title": "Functions and duties of Board",
      "content": "10. —(1) Subject to the provisions of this Act, the functions and duties of the Board are — ( a ) to evaluate and review the proposals relating to the usage of the moneys in the Fund; ( b ) to approve the payment of money from the Fund for the purposes set out in section 4; ( c ) to manage and administer the Fund in accordance with this Act; and ( d ) to carry out any other functions imposed upon the Board by or under this Act or any other written law. (2) The Board may undertake any other functions that the Minister may assign to the Board and in so doing, the Board is deemed to be fulfilling the purposes of this Act, and the provisions of this Act apply to the Board in respect of those functions. (3) Nothing in this section imposes on the Board, directly or indirectly, any form of duty or liability enforceable by proceedings before any court to which it would not otherwise be subject."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - ESTABLISHMENT, INCORPORATION AND",
      "section": "11",
      "title": "Powers of Board",
      "content": "11. —(1) Subject to the provisions of this Act, the Board may carry on any activities that appear to the Board to be advantageous, necessary or convenient for it to carry on for or in connection with the performance of its functions and the discharge of its duties under this Act or any other written law and, in particular, the Board may exercise any of the powers specified in the Second Schedule. (2) Despite subsection (1), the Board may, with the Minister’s approval, carry on such other activities incidental to the performance of its functions and the discharge of its duties under this Act or any other written law as the Board may, from time to time, consider expedient. (3) The Board must provide the Minister with information with respect to its property and activities in such manner and at such times as the Minister may require. (4) This section does not limit any power of the Board conferred by or under any other written law."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - ESTABLISHMENT, INCORPORATION AND",
      "section": "12",
      "title": "Appointment of committees and delegation of powers",
      "content": "12. —(1) The Board may appoint from among its members or from other persons who are not members any number of committees that it thinks fit for purposes which, in the opinion of the Board, would be better regulated and managed by means of those committees, including but not limited to providing advice and guidance to the Board on the evaluation and review of the proposals relating to the usage of the moneys in the Fund. (2) The Board may, subject to any conditions or restrictions that it thinks fit, delegate to any committee appointed under subsection (1) or to the Chairperson or any Executive Secretary or to any other member, officer or employee of the Board, any of the functions, duties or powers of the Board under this Act or any other written law, except — ( a ) the power of delegation conferred by this section; ( b ) the power to make any subsidiary legislation; and ( c ) the power to borrow money. (3) Any function, duty or power delegated under subsection (2) to any committee or person may be performed, discharged or exercised by the committee or person to whom it has been delegated in the name and on behalf of the Board. (4) No delegation under this section prevents the performance, discharge or exercise of any function, duty or power by the Board."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - ESTABLISHMENT, INCORPORATION AND",
      "section": "13",
      "title": "Symbol or representation of Board",
      "content": "13. —(1) The Board has the exclusive right to the use of any symbol or representation that the Board may select or devise and to display or exhibit that symbol or representation in connection with its activities or affairs. (2) Any person who uses a symbol or representation which — ( a ) is identical with that of the Board; or ( b ) so resembles the Board’s symbol or representation as to deceive or cause confusion, or to be likely to deceive or cause confusion, shall be guilty of an offence and shall be liable on conviction to — ( c ) a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both; and ( d ) in the case of a continuing offence, to a further fine not exceeding $250 for every day or part of a day during which the offence continues after conviction."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "14",
      "title": "Appointment of Executive Secretaries and other employees",
      "content": "14. —(1) The Board must appoint one or more Executive Secretaries on such terms and conditions as the Board may determine. (2) Each Executive Secretary — ( a ) is known by such designation as the Board may determine; and ( b ) is responsible to the Board for the proper administration and management of the functions and affairs of the Board in accordance with the policy laid down by the Board. (3) If any Executive Secretary is temporarily absent from Singapore or temporarily incapacitated by reason of illness or for any other reason temporarily unable to perform his or her duties, another person may be appointed by the Board to act in the place of the Executive Secretary during that period of absence from duty. (4) The Board may, from time to time, appoint and employ on such terms and conditions as the Board may determine such officers and employees as may be necessary for the effective performance of its functions and discharge of its duties under this Act or any other written law."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "15",
      "title": "Protection from personal liability",
      "content": "15. —(1) No suit or other legal proceedings shall lie personally against any member, officer or employee of the Board or any other person acting under the direction of the Board for anything which is in good faith done or intended to be done in the execution or purported execution of this Act or any other written law conferring or imposing a function or power or imposing a duty on the Board. (2) Where the Board provides a service to the public by which information is supplied to the public pursuant to any written law, neither the members of the Board nor any of its officers or employees involved in the supply of the information shall be liable for any loss or damage suffered by any member of the public by reason of any error or omission of any nature appearing therein or however caused if made in good faith and in the ordinary course of the discharge of the duties of such member, officer or employee."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "16",
      "title": "Public servants",
      "content": "16. All members, officers and employees of the Board are deemed to be public servants for the purposes of the Penal Code 1871."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "17",
      "title": "Preservation of secrecy",
      "content": "17. —(1) Except for the purpose of the performance of his or her duties or the exercise of his or her functions or when lawfully required to do so by any court or under the provisions of any written law, a person who is or has been — ( a ) a member, or an officer, employee, adviser or agent, of the Board; or ( b ) a member of a committee of the Board, must not disclose any information relating to the affairs of the Board or of any other person which has been obtained by the person in the performance of his or her duties or the exercise of his or her functions under this Act. (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "18",
      "title": "Bank accounts",
      "content": "18. —(1) The Board must open and maintain one or more accounts with any bank or banks that the Board thinks fit. (2) Every such account must be operated by such person or persons authorised to do so by the Board."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "19",
      "title": "Annual estimates",
      "content": "19. —(1) The Board must, in every financial year, prepare or cause to be prepared and must adopt annual estimates of income and expenditure of the Board for the ensuing financial year. (2) Supplementary estimates may be adopted by the Board at any of its meetings. (3) A copy of all annual estimates and supplementary estimates must, upon their adoption by the Board, be sent immediately to the Minister. (4) The Minister may approve or disallow any item or portion of any item shown in the estimates, and must return the estimates as amended by him or her to the Board, and the Board is bound thereby."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "20",
      "title": "Investments",
      "content": "20. The Board may — ( a ) invest the Fund in any manner that it thinks fit; and ( b ) engage in any financial activity or participate in any financial arrangement for the purpose of managing or hedging against any financial risk that arises or is likely to arise from the investment."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "21",
      "title": "Financial provisions",
      "content": "21. The financial provisions set out in the Third Schedule have effect with respect to the Board."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "22",
      "title": "Annual financial statements, etc.",
      "content": "22. —(1) The Board must, as soon as its accounts and financial statements have been audited in accordance with the provisions of this Act, send to the Minister a copy of the audited financial statements, signed by the Chairperson and an Executive Secretary, together with a copy of the auditor’s report. (2) Where the Auditor‑General is not the auditor of the Board, a copy of the audited financial statements and any report made by the auditor must be forwarded to the Auditor‑General at the same time they are submitted to the Board. (3) The Minister must, as soon as practicable, cause a copy of the audited financial statements and of the auditor’s report mentioned in subsection (1) to be presented to Parliament."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 4 - STAFF AND FINANCIAL PROVISIONS",
      "section": "23",
      "title": "Annual report",
      "content": "23. —(1) The Board must, as soon as practicable after the end of each financial year, cause to be prepared and transmitted to the Minister a report dealing generally with the activities of the Board during the preceding financial year and containing any information relating to the proceedings and policy of the Board that the Minister may direct. (2) The Minister must, as soon as practicable, cause a copy of every such report to be presented to Parliament."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "24",
      "title": "Powers to obtain information and call for return",
      "content": "24. —(1) The Board or any officer, employee or agent of the Board authorised by the Board in that behalf may by written notice require any person to provide, within the time specified in the notice, any information or document that may be required by the Board or the officer, employee or agent of the Board (as the case may be) for the purpose of inquiring into or ascertaining — ( a ) the truth or correctness of any statement which has been made, or of any information which has been given, by a person who has applied for any financing, incentive or grant from the Board; or [Act 29 of 2023 wef 18/09/2023] ( b ) whether any financing, incentive or grant from the Board has been properly applied by the person to whom it was provided. [Act 29 of 2023 wef 18/09/2023] (2) The Board or any officer, employee or agent of the Board authorised by the Board in that behalf has at all times full and free access to all lands, buildings, places, books, documents and other papers for any of the purposes of this Act and may for any such purpose inspect, make copies of or take extracts from those books, documents or papers, or take possession of any of those books, documents or papers, if, in the opinion of the Board or the person so authorised — ( a ) the inspection or copying of or extraction from the books, documents or papers cannot reasonably be performed without taking possession of them; ( b ) the books, documents or papers may be interfered with or destroyed unless possession of them is taken; or ( c ) the books, documents or papers may be required as evidence in any proceedings instituted or commenced for any of the purposes of, or in connection with, this Act."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "25",
      "title": "Penalty for obstructing Board in carrying out duties",
      "content": "25. Any person who at any time hinders or obstructs the Board or any officer, employee or agent of the Board acting in the discharge of their duties under this Act shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "26",
      "title": "Forgery of certificates, false or misleading information, statement or document",
      "content": "26. If any person — ( a ) forges or counterfeits any document or certificate required by the Board for the purposes of this Act; ( b ) gives any information required by the Board for the purposes of this Act knowing it to be false in any material particular; or ( c ) obtains any financing, incentive or grant from the Fund under this Act by means of any false or misleading statement or any document that is false or misleading in any material particular, [Act 29 of 2023 wef 18/09/2023] the person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "27",
      "title": "Offences by bodies corporate, etc.",
      "content": "27. —(1) Where an offence under this Act committed by a body corporate is proved — ( a ) to have been committed with the consent or connivance of an officer; or ( b ) to be attributable to any act or default on the officer’s part, the officer as well as the body corporate shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (2) Where the affairs of a body corporate are managed by its members, subsection (1) applies in relation to the acts and defaults of a member in connection with the member’s functions of management as if the member were a director of the body corporate. (3) Where an offence under this Act committed by a partnership is proved — ( a ) to have been committed with the consent or connivance of a partner; or ( b ) to be attributable to any act or default on the partner’s part, the partner as well as the partnership shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (4) Where an offence under this Act committed by a limited liability partnership is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of, a partner or manager of the limited liability partnership, the partner or manager (as the case may be) as well as the partnership shall be guilty of that offence and shall be liable to be proceeded against and punished accordingly. (5) Where an offence under this Act committed by an unincorporated association (other than a partnership) is proved — ( a ) to have been committed with the consent or connivance of an officer of the unincorporated association or a member of its governing body; or ( b ) to be attributable to any act or default on the part of such an officer or member, the officer or member as well as the unincorporated association shall be guilty of the offence and shall be liable to be proceeded against and punished accordingly. (6) In this section — “body corporate” and “partnership” exclude a limited liability partnership within the meaning of the Limited Liability Partnerships Act 2005; “officer” — ( a ) in relation to a body corporate, means any director, member of the committee of management, chief executive officer, manager, secretary or other similar officer of the body corporate and includes any person purporting to act in any such capacity; and ( b ) in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, or any person holding a position analogous to that of the president, secretary or member of such a committee and includes any person purporting to act in any such capacity; “partner” includes a person purporting to act as a partner. (7) The Minister may make rules to provide for the application of any provision of this section, with any modifications that the Minister considers appropriate, to any body corporate, limited liability partnership or unincorporated association formed or recognised under the law of a territory outside Singapore."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "28",
      "title": "Composition of offences",
      "content": "28. —(1) An Executive Secretary or any officer authorised by an Executive Secretary may compound any offence under this Act which is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum not exceeding the lower of the following: ( a ) one half of the amount of the maximum fine that is prescribed for the offence; or ( b ) $2,000. (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence. (3) The Board may, with the approval of the Minister, make regulations to prescribe the offences which may be compounded. (4) All sums collected under this section must be paid into the Fund."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "29",
      "title": "Regulations",
      "content": "29. The Board may, with the approval of the Minister, make regulations for carrying out the purposes and provisions of this Act."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Productivity Fund Administration Board established under section 7;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Board;",
      "source_provision": "s2"
    },
    {
      "term": "Executive Secretary",
      "definition": "“Executive Secretary” means any Executive Secretary of the Board appointed under section 14(1) and includes any person acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Fund",
      "definition": "“Fund” means the National Productivity Fund established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "invest",
      "definition": "“invest” includes entering into a transaction or an arrangement for the protection of investments;",
      "source_provision": "s2"
    },
    {
      "term": "matters relating to productivity enhancement and continuing education",
      "definition": "“matters relating to productivity enhancement and continuing education” includes legislative or administrative action taken, or to be taken, by the Government or any public authority that affects or might affect the productivity performance of industry, industry development or the productivity performance of the Singapore economy as a whole;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means any member of the Board and includes any temporary member of the Board;",
      "source_provision": "s2"
    },
    {
      "term": "property",
      "definition": "“property” means any legal or equitable estate or interest (whether present or future and whether vested or contingent) in real or personal property of any description;",
      "source_provision": "s2"
    },
    {
      "term": "public authority",
      "definition": "“public authority” means any board, authority or agency established by or under any public Act to perform or discharge any public function.",
      "source_provision": "s2"
    },
    {
      "term": "body corporate",
      "definition": "“body corporate” and “partnership” exclude a limited liability partnership within the meaning of the Limited Liability Partnerships Act 2005;",
      "source_provision": "s27"
    },
    {
      "term": "officer",
      "definition": "“officer” — ( a )",
      "source_provision": "s27"
    },
    {
      "term": "partner",
      "definition": "“partner” includes a person purporting to act as a partner.",
      "source_provision": "s27"
    }
  ]
}