{
  "id": "nsa-2022",
  "type": "statute",
  "title": "National Symbols Act 2022",
  "title_en": "National Symbols Act 2022",
  "short_name": "NSA2022",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/NSA2022",
  "description": "An Act to set out and declare the national symbols and presidential symbols of Singapore and to regulate their use, to repeal the Singapore Arms and Flag and National Anthem Act 1959, and to make related amendments to certain other Acts.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title and commencement",
      "content": "1. This Act is the National Symbols Act 2022 and comes into operation on a date that the Minister appoints by notification in the Gazette ."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “canton”, in relation to a flag, means the top left quarter of the obverse of the flag; “national symbol” means a national symbol of Singapore declared by Part 2; “presidential symbol” means a presidential symbol of Singapore declared by Part 3."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - NATIONAL SYMBOLS OF SINGAPORE",
      "section": "3",
      "title": "National Flag",
      "content": "3. —(1) The design and description of the National Flag of Singapore are set out in Part 1 of the First Schedule. (2) The National Flag of Singapore is declared to be a national symbol of Singapore."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - NATIONAL SYMBOLS OF SINGAPORE",
      "section": "4",
      "title": "National Anthem",
      "content": "4. —(1) The lyrics and music of the National Anthem of Singapore are set out in Part 2 of the First Schedule. (2) The National Anthem of Singapore is declared to be a national symbol of Singapore."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - NATIONAL SYMBOLS OF SINGAPORE",
      "section": "5",
      "title": "National Pledge",
      "content": "5. —(1) The words of the National Pledge of Singapore are set out, in each of the 4 official languages, in Part 3 of the First Schedule. (2) The National Pledge of Singapore is declared to be a national symbol of Singapore."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - NATIONAL SYMBOLS OF SINGAPORE",
      "section": "6",
      "title": "National Coat of Arms",
      "content": "6. —(1) The design and description of the National Coat of Arms of Singapore are set out in Part 4 of the First Schedule. (2) The National Coat of Arms of Singapore is declared to be a national symbol of Singapore. (3) The National Coat of Arms of Singapore may also be called the State Crest of Singapore."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - NATIONAL SYMBOLS OF SINGAPORE",
      "section": "7",
      "title": "Public seal",
      "content": "7. —(1) The design and description of the public seal of Singapore are set out in Part 5 of the First Schedule. (2) The public seal of Singapore is declared to be a national symbol of Singapore. (3) The public seal of Singapore is to be kept by the President."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - NATIONAL SYMBOLS OF SINGAPORE",
      "section": "8",
      "title": "Lion Head symbol",
      "content": "8. The Lion Head symbol, as depicted in Part 6 of the First Schedule, is declared to be a national symbol of Singapore."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - NATIONAL SYMBOLS OF SINGAPORE",
      "section": "9",
      "title": "National flower",
      "content": "9. —(1) The national flower of Singapore is specified in Part 7 of the First Schedule. (2) The national flower of Singapore is declared to be a national symbol of Singapore."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - PRESIDENTIAL SYMBOLS OF SINGAPORE",
      "section": "10",
      "title": "Presidential Standard",
      "content": "10. —(1) The design and description of the Presidential Standard are set out in Part 1 of the Second Schedule. (2) The Presidential Standard is declared to be a presidential symbol of Singapore."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - PRESIDENTIAL SYMBOLS OF SINGAPORE",
      "section": "11",
      "title": "Presidential Coat of Arms",
      "content": "11. —(1) The design and description of the Presidential Coat of Arms are set out in Part 2 of the Second Schedule. (2) The Presidential Coat of Arms is declared to be a presidential symbol of Singapore. (3) The Presidential Coat of Arms may also be called the Presidential Crest."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - PRESIDENTIAL SYMBOLS OF SINGAPORE",
      "section": "12",
      "title": "Seal of President",
      "content": "12. —(1) The design and description of the seal of the President are set out in Part 3 of the Second Schedule. (2) The seal of the President is declared to be a presidential symbol of Singapore. (3) The seal of the President is to be kept by the President."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 4 - GENERAL PROVISIONS",
      "section": "13",
      "title": "Amendment of Schedules",
      "content": "13. The President may, by Proclamation in the Gazette , amend any of the Schedules in relation to any aspect or description of a national symbol or presidential symbol."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 4 - GENERAL PROVISIONS",
      "section": "14",
      "title": "Regulations",
      "content": "14. —(1) The President may make regulations for the purposes of this Act. (2) Without limiting subsection (1), the regulations may — ( a ) regulate the circumstances and manner in which a national symbol or presidential symbol may be used; ( b ) enable a prescribed person to permit or prohibit the use of a national symbol or presidential symbol, and provide for appeals against the prescribed person’s decisions; ( c ) provide that the contravention of a regulation is an offence; and ( d ) prescribe the penalty for an offence under the regulations, which penalty must not exceed a fine of $30,000 or imprisonment for a term not exceeding 6 months or both."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - GENERAL PROVISIONS",
      "section": "15",
      "title": "Consent of Public Prosecutor",
      "content": "15. A prosecution under this Act may only be instituted by or with the consent of the Public Prosecutor."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 5 - REPEAL AND RELATED AMENDMENTS",
      "section": "16",
      "title": "Repeal of Singapore Arms and Flag and National Anthem Act 1959",
      "content": "16. The Singapore Arms and Flag and National Anthem Act 1959 is repealed."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 5 - REPEAL AND RELATED AMENDMENTS",
      "section": "17",
      "title": "Related amendment to Evidence Act 1893",
      "content": "17. Section 59(1) of the Evidence Act 1893 is amended by deleting paragraph ( f ) and substituting the following paragraph: “ ( f ) the public seal, the seal of the President, the seals of all the courts in Singapore, the seals of notaries public, all seals that any person is authorised to use by any law in force for the time being in Singapore, and all seals of which English courts take judicial notice; ”."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 5 - REPEAL AND RELATED AMENDMENTS",
      "section": "18",
      "title": "Related amendment to Foreign Interference (Countermeasures) Act 2021",
      "content": "18. Section 117(1) of the Foreign Interference (Countermeasures) Act 2021 is amended by deleting the words “National Emblems” in paragraph ( b )(iv) and substituting the words “Foreign National Emblems”."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - REPEAL AND RELATED AMENDMENTS",
      "section": "19",
      "title": "Related amendments to National Emblems (Control of Display) Act 1949",
      "content": "19. The National Emblems (Control of Display) Act 1949 is amended — ( a ) by deleting the words “national emblems” in the following provisions and substituting in each case the words “foreign national emblems”: Long title Section 3 (section heading); ( b ) by deleting the words “National Emblems” in section 1 and substituting the words “Foreign National Emblems”; ( c ) by deleting the definition of “national emblem” in section 2 and substituting the following definition: “ “foreign national emblem” means any flag, banner or other emblem being or purporting to be the flag, banner or other emblem of any state, or the flag, banner or other emblem of any political organisation claiming to be a national movement in any state or any likeness or resemblance however reproduced of any national leader or former national leader of any state or the leader or former leader of any such political organisation; ”; and ( d ) by deleting the words “national emblem” in the following provisions and substituting in each case the words “foreign national emblem”: Section 3(1) Section 4( a ) and ( b ) Section 5 Section 7 Section 8(1)( a ) and ( b )."
    }
  ],
  "definitions": [
    {
      "term": "canton",
      "definition": "“canton” , in relation to a flag, means the top left quarter of the obverse of the flag;",
      "source_provision": "s2"
    },
    {
      "term": "national symbol",
      "definition": "“national symbol” means a national symbol of Singapore declared by Part 2;",
      "source_provision": "s2"
    },
    {
      "term": "presidential symbol",
      "definition": "“presidential symbol” means a presidential symbol of Singapore declared by Part 3.",
      "source_provision": "s2"
    }
  ]
}