{
  "id": "ntuca-2005",
  "type": "statute",
  "title": "Nanyang Technological University (Corporatisation) Act 2005",
  "title_en": "Nanyang Technological University (Corporatisation) Act 2005",
  "short_name": "NTUCA2005",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/NTUCA2005",
  "description": "An Act to provide for the corporatisation of the Nanyang Technological University and for the transfer of its property, rights and liabilities to a successor company, and to provide for certain matters relating to that company.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Nanyang Technological University (Corporatisation) Act 2005."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “Board” means the Board of Trustees of the university company mentioned in its constituent documents; “constituent documents”, in relation to the university company, means the memorandum of association and articles of association of the university company; “predecessor university” means the Nanyang Technological University established under the repealed Nanyang Technological University Act (Cap. 192, 1992 Revised Edition); “university company” means the company limited by guarantee incorporated under the Companies Act 1967 under the name “Nanyang Technological University”. (2) To avoid doubt — ( a ) any reference in this Act to property vested in the predecessor university is a reference to such property, whether situated in Singapore or elsewhere; and ( b ) any reference in this Act to rights or liabilities of the predecessor university is a reference to such rights to which the predecessor university is entitled or such liabilities to which the predecessor university is subject (as the case may be) whether under the laws of Singapore or of any country outside Singapore, and includes such rights or liabilities arising under loans raised by the predecessor university."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "3",
      "title": "Function of university company",
      "content": "3. The function of the university company is to pursue, within the limits of the financial resources available to it, the objects provided by its constituent documents and, in particular, to confer and award degrees, diplomas and certificates, including honorary degrees and other distinctions."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "4",
      "title": "Accountability and evaluation",
      "content": "4. —(1) The university company must comply with the accountability framework set out by way of any written agreement between the university company and the Minister or any person authorised by the Minister. (2) The university company must evaluate the performance of its activities in accordance with such quality assurance framework as the Minister may determine. (3) The university company must participate in the evaluation of its activities by any external review panel that the Minister may commission from time to time."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "5",
      "title": "Directions in respect of policies on higher education in Singapore",
      "content": "5. —(1) The Minister may, in consultation with the university company, establish any policies on higher education in Singapore that the Minister thinks fit and may direct the university company to implement those policies. (2) The university company must comply with any direction given by the Minister under subsection (1)."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "6",
      "title": "Appointment to Board",
      "content": "6. —(1) The Board consists of such number of trustees as the Minister may appoint. (2) The Minister may, at any time, remove or replace any trustee, or appoint new or additional trustees to the Board."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "7",
      "title": "Consent of Minister",
      "content": "7. —(1) The prior written consent of the Minister is required for — ( a ) the admission of any person as a member of the university company and the removal of any such member; ( b ) the disposal of the whole or substantially the whole of the university company’s undertaking or property; ( c ) the voluntary winding up of the university company; ( d ) the addition, deletion or alteration of any provision of the constituent documents of the university company; and ( e ) the removal of any trustee from the Board. (2) The requirements under subsection (1) apply in addition to the requirements prescribed by the Companies Act 1967 and the Insolvency, Restructuring and Dissolution Act 2018 in respect of the matters referred to in subsection (1)( a ) to ( e ). [40/2018] (3) Any act done or agreement made in contravention of subsection (1) has no effect and is unenforceable at law."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "8",
      "title": "Provision of funds",
      "content": "8. —(1) The Minister must pay to the university company such moneys as Parliament may provide from time to time for the funding of the university company. (2) All moneys paid to the university company under subsection (1) may only be applied or expended by the university company for such objects provided by its constituent documents as the Minister may allow."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "9",
      "title": "Access to accounts and summary of financial statements",
      "content": "9. —(1) The Minister or a person authorised by the Minister (called in this section an authorised person) is entitled, at all reasonable times, to full and free access to all accounting and other records relating, directly or indirectly, to the financial transactions of the university company. (2) The Minister or an authorised person may require any person to provide any information in that person’s possession, or to which that person has access, that the Minister or authorised person considers necessary for ascertaining — ( a ) whether moneys paid to the university company under section 8 were applied or expended in accordance with that section; or ( b ) any other matters that the Minister or authorised person considers necessary. (3) The university company must make available to the public, at such frequency and in such manner as the Minister may determine, a summary of the financial statements of the university company which must be in such form and contain such information as the Minister may determine. (4) Any person who, without reasonable excuse, fails to comply with any requirement of the Minister or an authorised person under subsection (2), or who otherwise hinders, obstructs or delays the Minister or an authorised person in the performance of his or her duties or in the exercise of his or her powers under this section, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "10",
      "title": "Application of Societies Act 1966 to student bodies",
      "content": "10. —(1) Despite anything to the contrary in the Societies Act 1966, the provisions of that Act have effect in relation to any student body constituted pursuant to the provisions of the constituent documents of the university company. (2) The Minister charged with the responsibility for societies may, by order in the Gazette , exempt any student body mentioned in subsection (1) from all or any of the provisions of the Societies Act 1966 subject to any conditions specified in the order."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - PROVISIONS RELATING TO UNIVERSITY COMPANY",
      "section": "11",
      "title": "Act to prevail over constituent documents, etc.",
      "content": "11. —(1) Any provision of the constituent documents, or any regulation of the university company made pursuant to any provision of the constituent documents, that is inconsistent with any provision of this Act is, to the extent of the inconsistency, void. (2) Nothing in this Act is to be construed as excusing or exempting the university company from complying with any written law that, apart from this Act, would apply to the university company."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - TRANSFER OF PROPERTY, RIGHTS, LIABILITIES,",
      "section": "12",
      "title": "Transfer to university company of property, rights and liabilities",
      "content": "12. —(1) On 1 April 2006, such property, rights and liabilities comprised in the undertaking of the predecessor university determined by the Minister and agreed to by the Minister for Finance are, by virtue of this section and without further assurance, act or deed, transferred to and vested in the university company. (2) Any property which by any scheme, will or other instrument or otherwise was held upon trust for any specific foundation or object of the predecessor university and which has been transferred to or vests in the university company by virtue of subsection (1) must, after the transfer or vesting, be held upon trust for and applied as far as possible to the like foundation or object of the university company. (3) Any property which was held upon any trust and which has been transferred to or vests in the university company by virtue of subsection (1) must, after the transfer or vesting, be held upon the same trust. (4) If any question arises as to whether any particular property, right or liability has been transferred to or vested in the university company under subsection (1), a certificate under the hand of the Minister for Finance is conclusive evidence that the property, right or liability was or was not so transferred or vested. (5) Any immovable property to be transferred to and vested in the university company under subsection (1) must be held by the university company upon the tenure and subject to the terms and conditions determined by the President. (6) All proceedings by or against the predecessor university which were commenced before 1 April 2006 and which are pending on that date may be continued, completed and enforced by or against the university company on and after that date. (7) Every agreement relating to any of the transferred properties to which the predecessor university was a party immediately before 1 April 2006, whether or not of a nature that the rights and liabilities under the agreement can be assigned, has effect on and after that date as if — ( a ) the university company had been a party to the agreement; and ( b ) every reference in the agreement to the predecessor university were substituted in respect of anything to be done on or after that date with a reference to the university company."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - TRANSFER OF PROPERTY, RIGHTS, LIABILITIES,",
      "section": "13",
      "title": "Transfer of employees",
      "content": "13. —(1) On and after 1 April 2006, all persons employed immediately before that date by the predecessor university must be transferred to the service of the university company on terms no less favourable than those enjoyed by them immediately prior to their transfer. (2) Until the terms and conditions of service are drawn up by the university company, the scheme and terms and conditions of service in the predecessor university continue to apply to every person transferred to the service of the university company under subsection (1) as if the person were still in the service of the predecessor university."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - TRANSFER OF PROPERTY, RIGHTS, LIABILITIES,",
      "section": "14",
      "title": "Service rights, etc., of transferred employees",
      "content": "14. —(1) The university company must, in drawing up the terms and conditions of service of any person transferred to the service of the university company under section 13, consider the terms and conditions of service, including any accrued rights to leave, enjoyed by that person while in the employment of the predecessor university. (2) The university company must, in drawing up any term or condition relating to the length of service of any person with the university company, provide for the recognition of service under the predecessor university by that person to be service under the university company."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - TRANSFER OF PROPERTY, RIGHTS, LIABILITIES,",
      "section": "15",
      "title": "Existing contracts",
      "content": "15. All deeds, contracts, schemes, bonds, agreements, instruments and arrangements subsisting immediately before 1 April 2006 to which the predecessor university is a party continue in force on and after that date and are enforceable by or against the university company as if the university company had been named in them or had been a party to them instead of the predecessor university."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - TRANSFER OF PROPERTY, RIGHTS, LIABILITIES,",
      "section": "16",
      "title": "Continuation and completion of disciplinary proceedings",
      "content": "16. —(1) Where any disciplinary proceedings commenced before 1 April 2006 against — ( a ) any employee of the predecessor university transferred to the service of the university company under section 13; or ( b ) any student of the predecessor university, are pending on that date, the proceedings must, on and after that date, be carried on and completed by the university company. (2) Where any hearing or investigation by a duly authorised committee of the predecessor university has commenced before 1 April 2006, but no order, ruling or direction has been made immediately before that date, the committee must, on or after that date, complete the hearing or investigation and may make such order, ruling or direction as it could have made under the authority vested in it before that date. (3) Any order, ruling or direction made by a committee under subsection (2) is to be treated as an order, ruling or direction of the university company and has the same force and effect as if it had been made by a duly authorised committee of the university company."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - TRANSFER OF PROPERTY, RIGHTS, LIABILITIES,",
      "section": "17",
      "title": "Misconduct or neglect of duty by employee before transfer",
      "content": "17. The university company may reprimand, reduce in rank, retire, dismiss or punish in any other manner a person who had, while the person was in the employment of the predecessor university, been guilty of any misconduct or neglect of duty which would have rendered the person liable to be reprimanded, reduced in rank, retired, dismissed or punished in any other manner if the person had continued to be in the employment of the predecessor university, and if this Act had not been enacted."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "18",
      "title": "Students’ Union",
      "content": "18. On 1 April 2006, the students’ association known as the Nanyang Technological University Students’ Union and its constituent bodies are deemed to be constituted pursuant to the provisions of the constituent documents of the university company."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "19",
      "title": "Register of Guild of Graduates",
      "content": "19. The provisions of the Schedule apply to all persons whose names are on the register of the Guild of Graduates of the predecessor university."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Board of Trustees of the university company mentioned in its constituent documents;",
      "source_provision": "s2"
    },
    {
      "term": "constituent documents",
      "definition": "“constituent documents” , in relation to the university company, means the memorandum of association and articles of association of the university company;",
      "source_provision": "s2"
    },
    {
      "term": "predecessor university",
      "definition": "“predecessor university” means the Nanyang Technological University established under the repealed Nanyang Technological University Act (Cap. 192, 1992 Revised Edition);",
      "source_provision": "s2"
    },
    {
      "term": "university company",
      "definition": "“university company” means the company limited by guarantee incorporated under the Companies Act 1967 under the name “Nanyang Technological University”.",
      "source_provision": "s2"
    }
  ]
}