{
  "id": "pa-1938",
  "type": "statute",
  "title": "Poisons Act 1938",
  "title_en": "Poisons Act 1938",
  "short_name": "PA1938",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PA1938",
  "description": "An Act to regulate the importation, possession, manufacture, compounding, storage, transport and sale of poisons.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Poisons Act 1938."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act and in any rules made thereunder unless there is something repugnant in the subject or context — “Authority” means the Health Sciences Authority established under the Health Sciences Authority Act 2001; “Chief Executive of the Authority” means the person appointed under section 15 of the Health Sciences Authority Act 2001 to be the Chief Executive of the Authority; “licensed pharmacist” means a pharmacist licensed under this Act; “licensing officer” means a person empowered by section 4 to issue licences for the purposes of this Act; “medical practitioner” means a medical practitioner registered under any written law for the time being in force relating to the registration of medical practitioners and includes a medical officer exempted by that written law from registration thereunder; “pharmacist” means a person who is registered as a pharmacist under the Pharmacists Registration Act 2007 and has in force a valid practising certificate issued under that Act; “poison” means any substance deemed to be a poison within the meaning of this Act; “Poisons List” means the Poisons List in the Schedule; “registered dentist” has the same meaning as in the Dental Registration Act 1999; “sale by way of wholesale dealing” means sale to a person who buys for the purpose of selling again; “veterinary surgeon” means a person who holds the diploma of membership of the Royal College of Veterinary Surgeons of England, or the diploma of a British or foreign veterinary institution or examining body approved by the Minister. [4/2001; 22/2007; 48/2007]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Description of poisons",
      "content": "3. —(1) The substances specified in the Poisons List shall be deemed to be poisons within the meaning of this Act. (2) The Minister may, by notification in the Gazette , add to, remove from or reinstate in the Poisons List any substance which he may consider fit and proper."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Licensing officers",
      "content": "4. The Chief Executive of the Authority or any officer of the Authority authorised by him in writing may issue licences for the purposes of this Act. [4/2001]"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "General prohibition with respect to importation and sale of poisons",
      "content": "5. No person shall without a licence from a licensing officer import, possess for sale, sell or offer for sale any poison."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Prohibitions and regulations with respect to sale of poisons",
      "content": "6. —(1) It shall not be lawful — ( a ) for any person to sell any poison unless — (i) he is licensed under this Act to sell poisons; (ii) the sale is effected in accordance with the provisions of the licence and with any conditions specified therein; (iii) the sale is effected on the premises specified in the licence; (iv) the sale is effected by or under the personal supervision of the person named in the licence; and (v) the sale is effected by or under the personal supervision of a pharmacist; or ( b ) for any person to sell any poison by way of wholesale dealing except to a person licensed under this Act to sell that poison. (2) It shall not be lawful for a person to sell any poison unless the container of the poison is labelled — ( a ) with the name of the poison; ( b ) in the case of a preparation which contains a poison as one of the ingredients thereof, with particulars as to the proportion which the poison contained in the preparation bears to the total ingredients; ( c ) with the word “Poison” or other prescribed indication of the character of the substance; and ( d ) with the name of the seller of the poison and the address of the premises on which it was sold. (3) Subject to any rules made under this Act dispensing with or relaxing any of the requirements of this subsection — ( a ) it shall not be lawful to sell any poison to any person unless that person is known to the seller or to some pharmacist in the employment of the seller at the premises where the sale is effected, or is introduced by some person known to the seller as a person to whom the poison may properly be sold; and ( b ) the seller of any poison shall not deliver it until — (i) he has made or caused to be made an entry in a book to be kept for that purpose stating the date of the sale, the name and address of the purchaser and of the person, if any, introducing him, the name and quantity of the substance sold and the purpose for which it is stated by the purchaser to be required; and (ii) the purchaser and the person introducing him, if any, have affixed their signatures to that entry."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Exemptions in respect of medicines supplied by medical practitioners, etc.",
      "content": "7. —(1) Except as provided in any rules made under this Act, nothing in section 6 shall apply — ( a ) to a medicine which is supplied by a medical practitioner for the purposes of medical treatment of his own patients; ( b ) to a medicine which is supplied by a registered dentist for the purposes of dental treatment of his own patients; ( c ) to a medicine which is supplied by a veterinary surgeon for the purposes of animal treatment; ( d ) to a medicine which is dispensed by a licensed pharmacist on the premises specified in his licence; or ( e ) to a poison forming part of the ingredients of a medicine, except a patent or proprietary medicine, which is supplied by a licensed pharmacist on the premises specified in his licence, if the requirements contained in subsections (2), (3) and (4) are satisfied in relation thereto. (2) The medicine shall be distinctly labelled with the name and address of the firm or person by whom it is supplied or dispensed and with a serial or other identification number or mark. (3) On the day on which the medicine is supplied or dispensed or, if that is not reasonably practicable, on the day next following that day, there shall be entered in a book which is kept and used regularly for the purpose of this provision but which need not be used exclusively for that purpose the following particulars: ( a ) the date on which the medicine was supplied or dispensed and the serial or other identification number or mark relating to the medicine; ( b ) the ingredients of the medicine or if the medicine is a proprietary medicine, the name of the medicine, and the quantity thereof supplied; ( c ) if the medicine was dispensed by a licensed pharmacist, the name or initials and, if it is known, the address of the person by whom the prescription was signed, and the name and address of the person to whom, and the date on which, the prescription was given; ( d ) if the medicine was not so dispensed, the name and address of the person to whom it was supplied. (4) Subsection (3) shall, in the case of a medicine supplied on a prescription on which such medicine had been supplied by the seller on a previous occasion, be deemed to be complied with if the date on which the medicine is supplied and the quantity thereof supplied are entered in the book or in a book kept for the purpose of this subsection on that day or, if that is not reasonably practicable, on the day next following that day, together with a sufficient reference to any entry in the book duly recording the dispensing of the medicine by the seller on the first occasion. (5) In the case of a medicine which is supplied or dispensed by a pharmacist or medical practitioner the medicine must have been compounded by or under the direct and personal supervision of the pharmacist or medical practitioner."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Exemptions in respect of poisons sold or exported",
      "content": "8. Except as provided in any rules made under this Act, nothing in section 6(1)( a )(v), (2) and (3) shall extend to or affect — ( a ) the sale of poisons by way of wholesale dealing; ( b ) the sale of poisons to be exported from Singapore to a place other than Malaysia; ( c ) the sale of poisons to a medical practitioner, registered dentist or veterinary surgeon for the purposes of his profession; ( d ) the sale of poisons for use in or in connection with any hospital, dispensary or similar institution approved by an order, whether general or special, of the Chief Executive of the Authority; ( e ) the sale of poisons for use by a Government department requiring the poison for the purposes of the public service or by any local authority requiring the poison in connection with the exercise by the authority of any statutory powers; ( f ) the sale of poisons to a person or institution concerned with scientific education or research, if the poison is required for the purpose of education or research; or ( g ) the sale of poisons by persons licensed under this Act, either by way of wholesale dealing or for use by the purchasers thereof in their trade or business, to a person who requires the poison — (i) for the purpose of his trade or business; or (ii) for the purpose of enabling him to comply with any requirements made by or in pursuance of any written law with respect to the medical treatment of persons employed by that person in any trade or business carried on by him. [4/2001]"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Possession of poisons",
      "content": "9. —(1) No person whether licensed under this Act or not shall knowingly keep or have in his possession or under his control any poison otherwise than — ( a ) in an unbroken case or package as received from the manufacturer; or ( b ) in a bottle, vessel, box, package or other receptacle distinctly labelled with the name of the substance contained therein and bearing some distinction or mark indicating that it contains poison. (2) In any proceedings under this section if any person is proved to have kept or had in his possession or under his control any poison he shall be deemed to have done so knowingly unless the contrary is proved by him. (3) No person shall keep any poison for sale or for dispensing purposes except — ( a ) as provided in subsection (1)( a ); ( b ) in a bottle or other vessel tied over, capped, locked or otherwise safely secured in a manner different from that in which bottles or vessels containing non-poisonous substances are secured in the same warehouse, shop or dispensary; ( c ) in a bottle or other vessel readily distinguishable by touch from the bottles or vessels in which non-poisonous substances are kept in the same warehouse, shop or dispensary; or ( d ) in a bottle, vessel, box or package kept in a room or cupboard under lock and key set apart for the keeping or storage of dangerous substances."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Issue of licences",
      "content": "10. —(1) A licensing officer may issue to any person, subject to such terms and conditions as the licensing officer may think fit, any licence authorising the person to import, possess for sale, sell or offer for sale any poison or for any purpose for which a licence may be prescribed. (2) No licence shall be issued to a medical practitioner other than a licence authorising him to import, possess and sell poisons by retail in connection with his own practice or with a practice or partnership in which every member is a medical practitioner. (3) A licensing officer, if it appears expedient to him to do so, may cancel any licence issued under subsection (1). (4) Every licence shall, unless previously cancelled, remain in force for such period as may be prescribed. (5) Such fees as may be prescribed shall be charged on the issue of each licence. (6) Any person to whom a licensing officer refuses to issue a licence or whose licence is cancelled under subsection (3) may appeal to the Minister whose decision shall be final and conclusive."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Terms of licences",
      "content": "11. —(1) There shall be implied in every licence issued under this Act the condition that the licensee is bound to comply with all the provisions of this Act and any rules made thereunder. (2) Every licence issued under this Act shall be personal to the licensee named therein and shall not in any case be transferable to another person and no licence shall authorise the sale of any poison by any person other than the person named therein. (3) A licensing officer may, if he sees fit, amend the description in a licence of the premises at which the person licensed carries on the business or profession in connection with which he is licensed."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Licences to be numbered and registered",
      "content": "12. —(1) All licences issued shall be numbered consecutively in the year in respect of which they are issued, commencing each year with the number one. (2) The Chief Executive of the Authority shall keep a register of licences showing all the particulars of each licence issued under this Act. [4/2001] (3) The entries in the register shall be numbered to correspond with the serial numbers of the licences and there shall be noted in the register in the event of cancellation of any licence the date of such cancellation. (4) Any extract from or copy of an entry in a register kept under this section shall be prima facie evidence of the facts stated therein if the extract or copy is certified under the hand of a licensing officer to be a true extract or copy. (5) The register of licences kept under this section shall be kept at such office as may be designated by the Chief Executive of the Authority and shall be available for inspection by any person without charge at all reasonable hours. [4/2001]"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Forms of licences",
      "content": "13. Licences issued under this Act shall be substantially in the forms prescribed with such variations as circumstances may require."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Search and search warrants",
      "content": "14. —(1) A licensing officer or any public officer authorised in writing by a licensing officer or any police officer not below the rank of sergeant may enter at all reasonable times upon any premises in which poisons are reasonably believed by that officer to be kept or stored and by himself or by some other person accompanying him and acting under his instructions and in his presence may search the premises and take possession of any substances found therein and reasonably believed to be or to contain a poison. (2) Any officer referred to in subsection (1) may in like manner inspect and take extracts from any book or record relating or reasonably believed to relate to any dealing in or with poisons wherever and by whomsoever kept and whether kept under the provisions of this Act or of any rules made thereunder or otherwise and for the purpose of such inspections or taking of extracts may enter at all reasonable times upon any place whatsoever. (3) In any case in which it appears to any magistrate upon the oath of any person that there is reasonable cause to believe that in any premises there is concealed or deposited any substance in respect of which an offence has been committed under this Act, the magistrate may, by warrant addressed to any police officer not below the rank of sergeant or to any senior officer of customs within the meaning of the Customs Act 1960, empower the officer to enter upon and search by day or night any premises and to take possession of any substance and to arrest any person being in the premises in whose possession the substance may be found or who is reasonably suspected by the officer to have concealed or deposited the substance therein. (4) Any officer to whom the warrant may be directed may in case of obstruction or resistance break open any outer or inner door of the premises and any cupboard, chest, trunk or package or other receptacle and by force, if necessary, enter upon any part of the premises and remove any obstruction to such entry, search or seizure and detain any person found in the premises until the search has been completed."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Powers of exemption",
      "content": "15. —(1) The Minister may by order published in the Gazette exempt from the operation of this Act or of any specific provision thereof — ( a ) any specified person or class of persons; or ( b ) any chemical commonly used for any process in connection with a trade, manufacture or industry. (2) Every such exemption shall be subject to such instructions and conditions as the Minister may think fit to impose either generally or in any particular case."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Penalties",
      "content": "16. —(1) Any person who acts in contravention of any of the provisions of this Act shall, except insofar as his act comes within one of the exemptions made by sections 7 and 8, be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. (2) Any poison in respect of which an offence has been committed in contravention of any provision of this Act or of any rules made thereunder by any unlicensed person shall, upon that person being convicted of that offence, be forfeited and shall be handed over to the Chief Executive of the Authority for disposal. [4/2001] (3) Every penalty or forfeiture imposed under this Act shall be in addition to and not in substitution for any other penalty to which the accused may be liable under any other written law and no conviction under this Act shall be pleaded in any civil proceedings in mitigation of damages claimed against the person convicted. (4) Where an agent or employee, in the course of his employment, does, or omits to do, an act the doing of which or omission to do which by his principal or employer would be an offence under this Act or any rules made thereunder he shall be guilty of that offence, and, where it is proved that the act or omission was committed with the consent or connivance of, or is attributable to any neglect on the part of, his principal or employer, the principal or employer shall be deemed to be guilty of that offence and shall be liable to be proceeded against and punished accordingly. (5) Where an offence committed by a body corporate under this Act or any rules made thereunder is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of, any director, manager, secretary or other similar officer of the body corporate or any person purporting to act in any such capacity, he, as well as the body corporate, shall be deemed to be guilty of that offence and shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Jurisdiction",
      "content": "17. A District Court or a Magistrate’s Court shall have jurisdiction to hear and determine all prosecutions under this Act and, notwithstanding anything to the contrary in the Criminal Procedure Code 2010, a District Court shall have power to impose the full penalty or punishment provided by this Act."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Consent to prosecute",
      "content": "18. —(1) No prosecution shall be instituted under this Act without the consent of the Public Prosecutor or any person authorised thereto by him in writing to grant such consents. [15/2010] (2) In any prosecution under this Act the burden of proving that any poison found in the possession of the accused was not kept for sale shall be upon the accused."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Prohibition of sale to persons below 18 years",
      "content": "19. —(1) No poison shall be sold to any person below 18 years of age. (2) Any person contravening this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding 6 months or to both. (3) It shall be a sufficient defence to any charge under subsection (2) that the person charged had reasonable cause to believe that the person to whom the sale was made was above the age of 18 years."
    },
    {
      "provision_ref": "s19A",
      "section": "19A",
      "title": "Composition of offences",
      "content": "19A. —(1) The Chief Executive of the Authority or any employee of the Authority authorised by him in writing may, in his discretion, compound any offence under this Act or any rules made thereunder which is prescribed as a compoundable offence by collecting from the person reasonably suspected of committing an offence a sum not exceeding $2,000. [4/2001] (2) The Minister may make rules prescribing the offences which may be compounded under this section. [4/2001]"
    },
    {
      "provision_ref": "s19B",
      "section": "19B",
      "title": "Fees, charges, etc., collected by licensing officer to be paid to Authority",
      "content": "19B. All fees, charges and other moneys recovered or collected by a licensing officer under this Act or any rules made thereunder shall be paid to the Authority. [4/2001]"
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Rules",
      "content": "20. —(1) The Minister may make rules to carry out the purposes of this Act and, in particular but without prejudice to the generality of the foregoing powers, may make rules with respect to any of the following matters or for any of the following purposes: ( a ) the importation, use and control of poisons, and any precautionary measures relating thereto; ( b ) the manufacture of preparations containing poisons; ( c ) the sale, whether by wholesale or retail, or the supply of poisons, by or to any person or class of persons including — (i) regulating or restricting the sale or supply of poisons by persons licensed under this Act and prohibiting the sale of any specified poison or class of poisons by any class of such persons; (ii) prohibiting the sale by retail of poisons included in the Poisons List except on a prescription duly signed by a medical practitioner, registered dentist or registered veterinary surgeon, and prescribing the form and regulating the use of prescriptions given for the purpose of rules made under this paragraph; and (iii) dispensing with or relaxing with respect to any specified poison any of the provisions contained in this Act or in any rules made thereunder relating to the sale of poisons; ( d ) the storage, transport and labelling of poisons; ( e ) the containers in which poisons may be sold or supplied; ( f ) the addition to poisons of specified ingredients for the purpose of rendering them readily distinguishable as poisons; ( g ) the compounding and dispensing of poisons; ( h ) the period for which any books required to be kept for the purposes of this Act are to be preserved; ( i ) requiring persons in control of the manufacture of pharmaceutical preparations containing poisons to be pharmacists or persons possessing the prescribed qualification in chemistry; ( j ) prescribing the coverings, stoppers and fastenings of and the marks to be placed or made on, or on the coverings of, or on the labels affixed to, any vessel, bottle, case, package, box or other receptacle or container whatsoever in which any poison is kept, stored, sold or in any way dealt with; ( k ) providing exemption from the operation of this Act or of any rules made thereunder of such persons or classes of persons as may seem expedient; ( l ) prescribing the form of licences, registers and returns; ( m ) fixing fees and exempting any person or body of persons from the payment of such fees; ( n ) prescribing that any act or omission in contravention of any rule shall be an offence punishable by a fine not exceeding $5,000 or imprisonment for a term not exceeding 2 years or both. [48/2007] (2) All rules made under this Act shall be published in the Gazette and shall be presented to Parliament as soon as possible after publication. (3) If a resolution is passed pursuant to a motion notice whereof has been given for a sitting day not later than the first available sitting day of Parliament next after the expiry of 3 months from the date when the rules are so presented annulling the rules or any part thereof as from a specified date, the rules or such part thereof, as the case may be, shall thereupon become void as from the date but without prejudice to the validity of anything previously done thereunder or to the making of new rules."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "“Authority” means the Health Sciences Authority established under the Health Sciences Authority Act 2001;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive of the Authority",
      "definition": "“Chief Executive of the Authority” means the person appointed under section 15 of the Health Sciences Authority Act 2001 to be the Chief Executive of the Authority;",
      "source_provision": "s2"
    },
    {
      "term": "licensed pharmacist",
      "definition": "“licensed pharmacist” means a pharmacist licensed under this Act;",
      "source_provision": "s2"
    },
    {
      "term": "licensing officer",
      "definition": "“licensing officer” means a person empowered by section 4 to issue licences for the purposes of this Act;",
      "source_provision": "s2"
    },
    {
      "term": "medical practitioner",
      "definition": "“medical practitioner” means a medical practitioner registered under any written law for the time being in force relating to the registration of medical practitioners and includes a medical officer exempted by that written law from registration thereunder;",
      "source_provision": "s2"
    },
    {
      "term": "pharmacist",
      "definition": "“pharmacist” means a person who is registered as a pharmacist under the Pharmacists Registration Act 2007 and has in force a valid practising certificate issued under that Act;",
      "source_provision": "s2"
    },
    {
      "term": "poison",
      "definition": "“poison” means any substance deemed to be a poison within the meaning of this Act;",
      "source_provision": "s2"
    },
    {
      "term": "Poisons List",
      "definition": "“Poisons List” means the Poisons List in the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "registered dentist",
      "definition": "“registered dentist” has the same meaning as in the Dental Registration Act 1999;",
      "source_provision": "s2"
    },
    {
      "term": "sale by way of wholesale dealing",
      "definition": "“sale by way of wholesale dealing” means sale to a person who buys for the purpose of selling again;",
      "source_provision": "s2"
    },
    {
      "term": "veterinary surgeon",
      "definition": "“veterinary surgeon” means a person who holds the diploma of membership of the Royal College of Veterinary Surgeons of England, or the diploma of a British or foreign veterinary institution or examining body approved by the Minister. [4/2001; 22/2007; 48/2007]",
      "source_provision": "s2"
    }
  ]
}