{
  "id": "pco-1876",
  "type": "statute",
  "title": "Presbyterian Church Ordinance 1876",
  "title_en": "Presbyterian Church Ordinance 1876",
  "short_name": "PCO1876",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PCO1876",
  "description": "An Ordinance to empower the Trustees of the Presbyterian Church in Singapore to sell certain property, and for other purposes.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Ordinance may be cited as the Presbyterian Church Ordinance 1876."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Power to sell land comprised in Indenture No. 215",
      "content": "2. The said trustees, William Jeffrey, John James Greenshields, Matthew Little, Robert Jamie, John Anderson, Robert Little, M.D., and John Stowe Young, or the survivors of them, or any 2 or more of such surviving trustees who are for the time being resident within the Colony may sell and dispose of the said piece or parcel of land comprised in and demised by the hereinbefore recited indenture of lease, No. 215, made between the said United Company of Merchants of England trading to the East Indies, of the one part, and the said C. H. Thompson, of the other part, dated 25 January 1827, and also all erections and buildings which have been erected and are now standing on the said premises, with power also to execute assurances, give effectual receipts for the purchase money, and do all other acts and things for completing such sale as they, or the survivors of them, or any 2 or more of such survivors, think proper."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Application of proceeds of sale",
      "content": "3. —(1) The moneys to arise from such sale, after deducting the costs and expenses attending the sale or otherwise incurred in relation thereto, shall be paid to the trustees, or continuing acting trustees for the time being, of the said piece or parcel of land so granted by Her Majesty the Queen as hereinbefore mentioned for the purpose of erecting and building on such land or any part thereof a new church or chapel or other place of worship for the use of the members and congregation of the said Presbyterian Church in Singapore, and shall be applied by such trustees to the building of such church or chapel only. (2) The building when erected shall be held subject to the trusts set out in the grant above recited, and dated 6 May 1875. (3) The receipts for the purchase money given by the persons exercising the power of sale hereby conferred shall be sufficient discharges to the purchasers, who shall not be bound to see to the application of such purchase money."
    }
  ],
  "definitions": []
}