{
  "id": "pea-1958",
  "type": "statute",
  "title": "Public Entertainments Act 1958",
  "title_en": "Public Entertainments Act 1958",
  "short_name": "PEA1958",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PEA1958",
  "description": "An Act to provide for the regulation of public entertainments. [28/2017]",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Public Entertainments Act 1958. [28/2017]"
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “appropriate Licensing Officer” means — ( a ) in the case of an arts entertainment provided or to be provided, solely or in combination with one or more forms of arts entertainment only, in any place other than a specified establishment — the Arts Entertainment Licensing Officer; and ( b ) in any other case — the Public Entertainment Licensing Officer; “appropriate Minister” means — ( a ) in the case of an arts entertainment provided or to be provided, solely or in combination with one or more forms of arts entertainment only, in any place other than a specified establishment — the Minister charged with the responsibility for the licensing of arts entertainments; and ( b ) in any other case — the Minister charged with the responsibility for public entertainments; “approved place” means a building, tent, street or place, or any part of that, whether open or enclosed, which is approved by the appropriate Licensing Officer for the purposes of this Act; “arts entertainment” has the meaning given in the First Schedule; “Arts Entertainment Licensing Officer” means the Licensing Officer appointed under section 3 by the Minister charged with the responsibility for the licensing of arts entertainments, and includes an Assistant Licensing Officer appointed by that Minister under that section; “authorised person” means an individual appointed as an authorised person under section 3(2); “licence” means a public entertainment licence issued or renewed under this Act; “licensee” means a person who is the holder of a licence; “Licensing Officer” means — ( a ) in sections 24, 25, 26, 27 and 31 — (i) where a power under any of those sections is exercised in connection with section 16, 17 or 18 — the Arts Entertainment Licensing Officer; and (ii) where a power under any of those sections is exercised in connection with any other provision of this Act — the appropriate Licensing Officer; and ( b ) in any other provision of this Act, the Public Entertainment Licensing Officer or the Arts Entertainment Licensing Officer, as the case may be; “public entertainment” has the meaning given in the First Schedule; “Public Entertainment Appeal Board” means the Public Entertainment Appeal Board established by section 20; “Public Entertainment Licensing Officer” means the Licensing Officer appointed under section 3 by the Minister charged with the responsibility for public entertainments, and includes an Assistant Licensing Officer appointed by that Minister under that section; “responsible officer”, in relation to an applicant or a licensee, means — ( a ) where the applicant or licensee is a body corporate — a director of the body corporate; ( b ) where the applicant or licensee is a partnership (including a limited partnership and limited liability partnership) — a partner of the partnership; and ( c ) where the applicant or licensee is an unincorporated association registered under the Societies Act 1966 — an officer of the unincorporated association; “specified establishment” means — ( a ) any place or premises in respect of which a liquor licence that may be prescribed is granted under the Liquor Control (Supply and Consumption) Act 2015; or ( b ) an amusement centre, a billiard saloon, a computer games centre or any other similar establishment. [32/2014; 5/2015; 28/2017] (2) For the purposes of the definitions of “appropriate Licensing Officer” and “appropriate Minister” in subsection (1), section 16(7), and the First Schedule, a public entertainment is provided or to be provided in combination with another public entertainment if — ( a ) they are combined such that they are provided or to be provided as a single or an integrated public entertainment; or ( b ) they remain distinct but are provided or to be provided in or as part of the same event. [32/2014; 28/2017] (3) In determining any approved place for the purposes of this Act, the appropriate Licensing Officer — ( a ) must act in conformity with the provisions of the Master Plan and any Certified Interpretation Plan under the Planning Act 1998 and any authorisation under section 21(6) of that Act; and ( b ) may approve an approved place, subject to written permission being obtained under the Planning Act 1998 for any development of or works on the land that constitutes the approved place, if required. [28/2017] (4) Unless the context otherwise requires, any reference in this Act to the issue of a licence includes a reference to the renewal of the licence. [32/2014] (5) The Schedules may, by order in the Gazette , be amended, added to or varied — ( a ) in any case — by the Minister charged with the responsibility for public entertainments; and ( b ) in the case where the amendment, addition or variation relates to an arts entertainment — by the Minister charged with the responsibility for the licensing of arts entertainments. [32/2014; 28/2017] (6) Any order made under subsection (5) must be presented to Parliament as soon as possible after publication in the Gazette . [32/2014]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Appointment of officers",
      "content": "3. —(1) The Minister charged with the responsibility for public entertainments and the Minister charged with the responsibility for the licensing of arts entertainments may each appoint a Licensing Officer and such number of Assistant Licensing Officers as may be necessary for the purposes of this Act. [32/2014; 28/2017] [Act 5 of 2025 wef 09/03/2025] (1A) An appointment under subsection (1) must be published in the Gazette . [Act 5 of 2025 wef 09/03/2025] (2) The appropriate Licensing Officer may, in relation to any provision of this Act, appoint a suitably trained individual as an authorised person for the purposes of that provision, subject to such conditions or limitations as set out in this Act or as the Licensing Officer may specify. [28/2017] (3) An authorised person who, in the course of duty as an authorised person, exercises any power as such, is deemed to be a public servant for the purposes of the Penal Code 1871 when exercising the power. [4 [28/2017]"
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "4",
      "title": "Prohibition",
      "content": "4. A public entertainment must not be provided except — ( a ) in an approved place; and ( b ) in accordance with a licence issued by the appropriate Licensing Officer. [3 [32/2014]"
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "5",
      "title": "Application for licence",
      "content": "5. —(1) Any person who desires to apply for or renew a licence must apply to the appropriate Licensing Officer in such form and manner, and within such time, as the appropriate Licensing Officer may require. [32/2014] (2) An application under subsection (1) must be accompanied by such documents as the appropriate Licensing Officer may require. [32/2014] (3) For the purposes of subsection (1), the appropriate Licensing Officer — ( a ) may require an applicant to satisfy such criteria and requirements as the appropriate Licensing Officer may publish on a prescribed website (including criteria and requirements relating to any responsible officer of the applicant and any person having substantial interest in, or control or direction over, the business of the applicant); and ( b ) may publish different criteria and requirements for different classes of public entertainments or public entertainment licences. [32/2014; 28/2017]"
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "6",
      "title": "Applicants may be joined",
      "content": "6. If the appropriate Licensing Officer is satisfied that the responsibility for the observance of the conditions of a licence is intended to be shared between 2 or more persons, the appropriate Licensing Officer may require the application under section 5 in respect of the licence to be made jointly in the names of as many of those persons as the appropriate Licensing Officer thinks fit. [32/2014]"
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "7",
      "title": "Additional information",
      "content": "7. On receipt of an application under section 5, the appropriate Licensing Officer may require the applicant to provide him or her with any additional information or document that the appropriate Licensing Officer may require. [32/2014]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "8",
      "title": "Public entertainment licence",
      "content": "8. Every public entertainment licence issued or renewed by the appropriate Licensing Officer — ( a ) is subject to the conditions; and ( b ) is valid for the period or expires on the date, that may be specified in the licence. [32/2014]"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "9",
      "title": "Licence not renewable as of right",
      "content": "9. A licence is not renewable as of right."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "10",
      "title": "Conditions",
      "content": "10. —(1) When issuing or renewing a licence, the appropriate Licensing Officer may impose such conditions as he or she thinks fit. [32/2014] (2) The appropriate Licensing Officer may, at any time, impose any additional condition on, or vary or revoke any condition of, the licence. [32/2014] (3) In deciding whether to add, vary or revoke any condition of a licence under subsection (2), the appropriate Licensing Officer may take into consideration the total number of demerit points awarded against the licensee under section 15 in respect of the licence. [32/2014] (4) The appropriate Licensing Officer must, before adding, varying or revoking any condition of a licence under subsection (2), give the licensee — ( a ) written notice of the intention to do so; and ( b ) an opportunity to be heard, within the time specified in the notice, as to why the condition should not be added, varied or revoked. [32/2014]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "11",
      "title": "Security",
      "content": "11. —(1) In respect of any classes of public entertainment that the appropriate Minister may prescribe by notification in the Gazette and subject to any limits that may be prescribed in the notification, the appropriate Licensing Officer may, before issuing or renewing a licence, require — ( a ) the applicant; or ( b ) if there are 2 or more applicants, each applicant named by the appropriate Licensing Officer for the purpose, to give security, in the form and manner that the appropriate Licensing Officer may determine, that the provisions of this Act and the conditions of the licence will be duly observed. [32/2014] (2) Where a licensee has been awarded such number of demerit points as may be prescribed under section 15(1), the appropriate Licensing Officer may require the licensee to give security, in the form and manner that the appropriate Licensing Officer may determine, that the provisions of this Act and the conditions of the licence will be duly observed. [32/2014] (3) Where an applicant is required under subsection (1), or a licensee is required under subsection (2), to enter into a bond, the appropriate Licensing Officer may require not more than 2 sureties to enter into the bond with the applicant or the licensee, as the case may be. [32/2014] (4) Any security given under subsection (1) or (2) is liable to forfeiture in whole or in part at the discretion of the appropriate Licensing Officer where — ( a ) the licence is suspended or cancelled; ( b ) the licensee has been awarded such number of demerit points as may be prescribed under section 15(1); or ( c ) the appropriate Licensing Officer is satisfied that the public entertainment has been provided in contravention of this Act. [32/2014] (5) The appropriate Licensing Officer must, before proceeding under subsection (4), give the licensee or the person whose licence is cancelled, as the case may be — ( a ) written notice of the intention to do so; and ( b ) an opportunity to be heard, within the time specified in the notice, as to why the security should not be forfeited. [32/2014]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "12",
      "title": "Licence to be displayed, etc.",
      "content": "12. At all times while the public entertainment described in a licence is being provided, the licence must — ( a ) where the public entertainment is provided in a building or tent, be prominently displayed at the building or tent; and ( b ) in all other cases, be kept in the licensee’s possession."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "13",
      "title": "Refusal of licence",
      "content": "13. —(1) The appropriate Licensing Officer may refuse to issue or renew any licence. [32/2014] (2) The appropriate Licensing Officer must, before refusing to renew a licence, give the licensee — ( a ) written notice of the intention to do so; and ( b ) an opportunity to submit reasons, within the period specified in the notice, as to why the application to renew the licence should not be refused. [32/2014] (3) The appropriate Licensing Officer must, if so required by the applicant or the licensee (as the case may be), provide the applicant or the licensee within 7 days of being so required with the grounds of such refusal in writing. [32/2014]"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "14",
      "title": "Suspension or cancellation of licence",
      "content": "14. —(1) The appropriate Licensing Officer may suspend or cancel a licence (as the case may be) if the appropriate Licensing Officer is satisfied that the public entertainment for which the licence was issued — ( a ) has been the cause or is likely to be the cause of a breach of the peace; ( b ) has been or is likely to be wholly or in part of an indecent, immoral, offensive, subversive or improper nature; ( c ) has caused or is likely to cause unnecessary suffering or any injury to any person or animal taking part in it, or to any member of the audience; ( d ) has been or is likely to be provided in contravention of any provision of this Act; ( e ) has been or is likely to be provided in contravention of any condition of the licence; or ( f ) is contrary to public interest. [32/2014] (2) The appropriate Licensing Officer may suspend or cancel a licence (as the case may be) if the appropriate Licensing Officer is satisfied that the licensee is not a fit and proper person to hold the licence, having regard to the criteria and requirements mentioned in section 5(3)( a ). [32/2014; 28/2017] (3) Despite subsection (5), the appropriate Licensing Officer may immediately suspend a licence if proceedings have commenced against the licensee, a responsible officer of the licensee or a person having substantial interest in, or control or direction over, the business of the licensee, for any offence — ( a ) specified in the Second Schedule; and ( b ) arising out of or in connection with any activity at an approved place specified in the licence, until the conclusion of those proceedings. [28/2017] (4) Where any rules made under section 15(1) apply to a licence, the appropriate Licensing Officer must not suspend or cancel the licence under subsection (1)( e ) unless the licensee has accumulated such number of demerit points as prescribed in those rules. [32/2014] (5) Before suspending or cancelling a licence, the appropriate Licensing Officer must, unless it is not practicable or desirable to do so in the circumstances of the case, give the licensee — ( a ) written notice of the intention to do so; and ( b ) an opportunity to submit reasons, within the period specified in the notice, as to why the licence should not be suspended or cancelled. [32/2014] (6) If required by a licensee to provide the grounds of the suspension or cancellation of a licence, the appropriate Licensing Officer must provide written grounds of the suspension or cancellation to the licensee within 7 days of being so required. [32/2014]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 2 - PUBLIC ENTERTAINMENT LICENCES",
      "section": "15",
      "title": "Demerit points",
      "content": "15. —(1) The appropriate Minister may, for the purposes of sections 10, 11 and 14(4), make rules to establish a system of awarding demerit points against a licensee for the commission of an offence under section 28(1)( c ). [32/2014] (2) For the purposes of this section, demerit points may be awarded against a licensee even though the licensee — ( a ) has consented to have an offence under section 28(1)( c ) taken into consideration by a court in determining and passing sentence for any other offence; or ( b ) has accepted an offer by the appropriate Licensing Officer to compound the offence concerned. [32/2014; 28/2017] (3) Where a licence is cancelled under section 14, every demerit point awarded against the licensee in respect of the licence is cancelled."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - CLASSIFICATION OF ARTS ENTERTAINMENTS",
      "section": "16",
      "title": "Classification of content of arts entertainment",
      "content": "16. —(1) The Arts Entertainment Licensing Officer may issue one or more codes for the classification of the content of arts entertainments or classes of arts entertainments. [32/2014] (2) A licensee must not provide any arts entertainment unless its content has been classified by the Arts Entertainment Licensing Officer. [32/2014] (3) When classifying the content of any arts entertainment, the Arts Entertainment Licensing Officer may impose such conditions as he or she thinks fit. [28/2017] (4) The Arts Entertainment Licensing Officer may, at any time, impose any additional condition on, or vary or revoke any condition of, the classification. (5) The Arts Entertainment Licensing Officer must, before adding, varying or revoking any condition of a classification under subsection (4), give the licensee — ( a ) written notice of the intention to do so; and ( b ) an opportunity to be heard, within the time specified in the notice, as to why the condition should not be added, varied or revoked. [28/2017] (6) A licensee must not provide any classified arts entertainment unless — ( a ) its form and content are the same as that which have been classified by the Arts Entertainment Licensing Officer; and ( b ) its provision is in accordance with the conditions of the classification, if any. [32/2014; 28/2017] (7) In this section and sections 17 and 18, a reference to an arts entertainment includes a reference to — ( a ) an arts entertainment licensed by the Public Entertainment Licensing Officer; and ( b ) an arts entertainment which is provided or to be provided in combination with any other public entertainment. [15A [32/2014]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - CLASSIFICATION OF ARTS ENTERTAINMENTS",
      "section": "17",
      "title": "Duties of licensee providing arts entertainment",
      "content": "17. —(1) A licensee must — ( a ) provide to the Arts Entertainment Licensing Officer all relevant information and documents that the Arts Entertainment Licensing Officer requires for the purpose of determining the classification of the content of an arts entertainment; ( b ) comply with such procedures and requirements as the Arts Entertainment Licensing Officer may direct in relation to the classification of the content of the arts entertainment; and ( c ) pay to the Arts Entertainment Licensing Officer the prescribed fee, within the time specified by the Arts Entertainment Licensing Officer, for the classification of the content of the arts entertainment. [32/2014] (2) The Arts Entertainment Licensing Officer may refuse to classify the content of an arts entertainment if — ( a ) the licensee does not comply with subsection (1); ( b ) any information or document provided to the Arts Entertainment Licensing Officer under subsection (1)( a ) is incomplete or inaccurate; or ( c ) the content of the arts entertainment does not fall within any of the classifications of arts entertainment determined by the Arts Entertainment Licensing Officer under section 16. [15B [32/2014; 28/2017]"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - CLASSIFICATION OF ARTS ENTERTAINMENTS",
      "section": "18",
      "title": "Directions by Arts Entertainment Licensing Officer",
      "content": "18. —(1) Where the Arts Entertainment Licensing Officer is of the opinion that an arts entertainment is being provided or is likely to be provided by a licensee in contravention of section 16(2) or (6), the Arts Entertainment Licensing Officer may direct the licensee — ( a ) to remove such content from the arts entertainment as the Arts Entertainment Licensing Officer determines; or ( b ) to refrain from or cease providing the arts entertainment either for the duration of the licence or for such shorter period as the Arts Entertainment Licensing Officer determines, and the licensee must comply with the direction. [32/2014] (2) Before issuing any direction to a licensee under subsection (1), the Arts Entertainment Licensing Officer must, unless it is not practicable or desirable to do so in the circumstances of the case, give the licensee — ( a ) written notice of the intention to do so; and ( b ) an opportunity to submit reasons, within the period specified in the notice, as to why the direction should not be issued. [15C [32/2014]"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - APPEALS",
      "section": "19",
      "title": "Appeal authority and appealable decisions",
      "content": "19. In this section and sections 20, 21 and 22 — “appeal authority” means — ( a ) in relation to an appealable decision of the Public Entertainment Licensing Officer — (i) the Public Entertainment Appeal Board established under section 20, where the appellant is — (A) an applicant for a licence, or a licensee, in respect of a specified establishment or one of a class of specified establishments, prescribed by the Minister charged with the responsibility for public entertainments; or (B) one of a class of applicants or licensees prescribed by the Minister charged with the responsibility for public entertainments; or (ii) in any other case, the Minister charged with the responsibility for public entertainments; or ( b ) in relation to an appealable decision of the Arts Entertainment Licensing Officer, the Minister charged with the responsibility for the licensing of arts entertainments; “appealable decision”, in relation to the appropriate Licensing Officer, means any of the following decisions or directions: ( a ) a decision under section 10(1) or (2) imposing, adding, varying, refusing to vary, or revoking any condition of a licence; ( b ) a decision under section 11(4) forfeiting the whole or part of a security mentioned in that provision; ( c ) a decision under section 13(1) refusing to issue or renew a licence; ( d ) a decision under section 14(1) or (2) suspending or cancelling a licence; ( e ) a decision under section 16(2) classifying the content of any arts entertainment, or under section 16(3) or (4) imposing, adding, varying, refusing to vary, or revoking any condition of classification of any arts entertainment; ( f ) a refusal to classify the content of an arts entertainment under section 17(2); ( g ) a direction by the Arts Entertainment Licensing Officer under section 18(1). [16 [28/2017]"
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 4 - APPEALS",
      "section": "20",
      "title": "Public Entertainment Appeal Board",
      "content": "20. —(1) A Public Entertainment Appeal Board is established, comprising a chairperson, a vice‑chairperson and 5 other members, all of whom are appointed by the Minister charged with the responsibility for public entertainments. [28/2017] (2) An individual must not be appointed to the Public Entertainment Appeal Board if the individual is directly or indirectly involved in the provision of public entertainment or arts entertainment. [28/2017] (3) The Minister must appoint a public officer as a secretary to the Public Entertainment Appeal Board. [28/2017] (4) All members of the Public Entertainment Appeal Board are deemed to be public servants for the purposes of the Penal Code 1871. [16AA [28/2017]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 4 - APPEALS",
      "section": "21",
      "title": "Appeal to appeal authority",
      "content": "21. —(1) An applicant or a licensee aggrieved by an appealable decision may appeal against the decision to the appeal authority for that decision. [28/2017] (2) Any appeal to the appeal authority must be made in writing — ( a ) within 14 days after the applicant or licensee is notified of the appealable decision, or such extended period as the appeal authority may allow in any particular case; and ( b ) in accordance with any rules made under section 33 for the appeal. [28/2017] (3) An appealable decision takes effect despite an appeal against that decision being made to the appeal authority under subsection (1), unless the appeal authority otherwise specifies. [28/2017] (4) In granting an appeal, the appeal authority may impose such restrictions or conditions as the appeal authority thinks fit on the licence that is the subject of the appeal. [28/2017] (5) The appeal authority may determine an appeal made to it under subsection (1) by — ( a ) confirming, varying or reversing the decision or direction; or ( b ) requiring the appropriate Licensing Officer to reconsider the decision or direction. [28/2017] (6) The appeal authority’s decision on the appeal is final. [16AB [28/2017]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 4 - APPEALS",
      "section": "22",
      "title": "Minister may designate others to hear appeals",
      "content": "22. A Minister may designate any of the following persons to hear and determine, in the Minister’s place, any appeal to the Minister under section 21: ( a ) the Second Minister (if any) for his or her Ministry; ( b ) any Minister of State, including a Senior Minister of State, for his or her Ministry; ( c ) any Parliamentary Secretary, including a Senior Parliamentary Secretary, to his or her Ministry. [16AC [28/2017]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - GENERAL",
      "section": "23",
      "title": "Exemption",
      "content": "23. —(1) The Minister may, by order in the Gazette , exempt any person or class of persons, or any public entertainment or series or class of public entertainments, from all or any of the provisions of this Act, subject to such conditions or restrictions as may be specified in the order. [32/2014] (2) In this section, “Minister” means — ( a ) in relation to section 16, 17 or 18 — the Minister charged with the responsibility for the licensing of arts entertainments; and ( b ) in relation to any other provision of this Act — (i) in any case — the Minister charged with the responsibility for public entertainments; and (ii) in the case of an exemption relating to an arts entertainment provided or to be provided, solely or in combination with one or more forms of arts entertainment only, in any place other than a specified establishment — the Minister charged with the responsibility for the licensing of arts entertainments. [16A [28/2017]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - GENERAL",
      "section": "24",
      "title": "Powers of entry and inspection",
      "content": "24. —(1) The Licensing Officer, a police officer or an authorised person (each called in this section an inspecting officer) may exercise all or any of the powers in this section for the purpose of ascertaining whether the conditions of any licence, the conditions of any classification under this Act or the provisions of this Act are being complied with. [28/2017] (2) An inspecting officer may — ( a ) enter and inspect any premises where public entertainment is provided, or that the inspecting officer believes on reasonable grounds is used for the provision of public entertainment; ( b ) photograph or film, or make a record or sketches of, any part of the premises, or any person or thing at the premises; ( c ) require any person on those premises to produce or grant access to, without charge, any document, information or article reasonably required for any purpose in subsection (1), which is in the possession or under the control of that person; ( d ) inspect and make copies of or take extracts from any document or article mentioned in paragraph ( c ); and ( e ) subject to section 25(6), take possession of a document or article mentioned in paragraph ( c ) if, in the inspecting officer’s opinion — (i) the inspection or copying of or extraction from the document or article cannot reasonably be performed without taking possession; (ii) the document or article may be interfered with or destroyed unless possession is taken; or (iii) the document or article may be required as evidence in any proceedings instituted or commenced under this Act. [28/2017] (3) The power to require a person to provide any document, information or article under subsection (2)( c ) includes the power — ( a ) to require the person, or any person who is or was an officer or employee of that person, to provide an explanation of the document, information or article; ( b ) if the document, information or article is not provided, to require the person to state, to the best of the person’s knowledge and belief, where it is; and ( c ) if the document, information or article is recorded otherwise than in legible form, to require the document, information or article to be made available to the inspecting officer in legible form. [28/2017] (4) For the purposes of subsection (2), if any document or information required by the inspecting officer is kept in electronic form — ( a ) the power of the inspecting officer to inspect the document or to obtain the information includes the power to — (i) access any computer or other equipment (including a mobile telephone) in which the document or information is stored; and (ii) require any person having charge of, or otherwise concerned with the operation of, the computer or equipment to provide assistance in gaining such access; and ( b ) the power of the inspecting officer to seize the document includes the power — (i) to make copies of the document in legible or electronic form; and (ii) to transfer the information from the document to a disk, tape or other storage device. [28/2017] (5) If the inspecting officer under subsection (4)( b ) is unable to make copies of the document or transfer the information from the document, the Licensing Officer or a police officer (who may not be the inspecting officer) may — ( a ) subject to section 25(6), seize the computer or other equipment (including a mobile telephone) in which the document or information is stored, as evidence in proceedings for an offence under this Act; and ( b ) require any person having charge of, or otherwise concerned with the operation of, the computer or equipment to disclose any password or access code for gaining access to the document or information held in the computer or equipment. [28/2017] (6) Nothing in this section or section 25, 26 or 27 derogates from the powers of a police officer under the Criminal Procedure Code 2010. [17 [32/2014]"
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 5 - GENERAL",
      "section": "25",
      "title": "Powers of investigation",
      "content": "25. —(1) The Licensing Officer may, for the purposes of investigating an offence under this Act or the contravention of any provision of this Act, in addition to exercising any of the powers in section 24, do all or any of the following: ( a ) require any person whom the Licensing Officer reasonably believes to have committed the offence or contravention to provide evidence of that person’s identity; ( b ) require any person whom the Licensing Officer reasonably believes has — (i) any information; or (ii) any document or article in the person’s possession, custody or control, relevant to the investigation to provide that information, or produce that document or article; ( c ) issue a written notice requiring any person within the limits of Singapore, who appears to be acquainted with the facts or circumstances of the matter, to attend before the Licensing Officer; ( d ) examine orally any person who appears to be acquainted with the facts or circumstances of the matter — (i) whether before or after that person or anyone else is charged with an offence in connection with the matter; and (ii) whether or not that person is to be called as a witness in any inquiry, trial or other proceeding in connection with the matter; ( e ) without a warrant enter and search any place or premises in which the Licensing Officer reasonably suspects that an offence under this Act is being or has been committed; ( f ) if free entry or access to the place or premises cannot be obtained under paragraph ( e ), break open any door, window, lock or fastener, or use any other reasonable means in order to gain entry or access into the place or premises with such assistance as the Licensing Officer considers necessary. [32/2014; 28/2017] (2) Any person examined under this section is bound to state truly what the person knows of the facts and circumstances of the matter, except that the person need not say anything that might expose the person to a criminal charge, penalty or forfeiture. [32/2014] (3) A statement made by any person examined under this section must — ( a ) be reduced to writing; ( b ) be read over to the person; ( c ) if the person does not understand English, be interpreted in a language that the person understands; and ( d ) after correction (if necessary), be signed by the person. [32/2014] (4) If any person fails to comply with a written notice issued to the person under subsection (1)( c ), the Licensing Officer may report the failure to a Magistrate, and the Magistrate may then issue a warrant ordering that person to comply with the written notice. [32/2014] (5) Subject to subsection (6), the Licensing Officer may take possession or make copies of any document or article produced under subsection (1)( b ), for further investigation. [32/2014] (6) Anything taken possession of by the Licensing Officer under subsection (5) or section 24(2)( e ) or (5) — ( a ) must be placed in safe custody by the Licensing Officer; and ( b ) unless ordered otherwise by the court, may be retained until the completion of the investigation or any proceedings (including proceedings on appeal) in which it may be in evidence. [32/2014] (7) Any person who, without reasonable excuse, refuses or fails — ( a ) to provide any information, or produce any document or article, required of the person by the Licensing Officer under subsection (1); or ( b ) to comply with any notice issued to the person under subsection (1)( c ), shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. [32/2014] (8) In this section, a reference to the Licensing Officer includes a police officer. [17A [32/2014; 28/2017]"
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 5 - GENERAL",
      "section": "26",
      "title": "Disposal and forfeiture of documents and articles",
      "content": "26. —(1) Any document or article retained under section 25(6) — ( a ) where the document or article is produced in any criminal trial — must be dealt with in accordance with section 364 of the Criminal Procedure Code 2010; or ( b ) in any other case — must be returned to the owner or, if the owner is not known, reported to a Magistrate. [32/2014; 28/2017] (2) Where the report of any document or article is made to a Magistrate under subsection (1)( b ), the Magistrate may order the document or article to be forfeited or to be disposed of in the manner that the Magistrate thinks fit. [32/2014] (3) This section does not prejudice any right to retain or dispose of any property which may exist in law apart from this section. [17B [32/2014]"
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 5 - GENERAL",
      "section": "27",
      "title": "Powers of arrest",
      "content": "27. —(1) The Licensing Officer or any police officer may arrest without warrant any person — ( a ) whom the Licensing Officer or police officer reasonably suspects of committing or attempting to commit, or abetting any person to commit, any offence under this Act; and ( b ) who refuses to provide his or her name and address, or who provides a name and an address reasonably suspected of being false or who provides an address outside Singapore, or who is reasonably suspected of being likely to abscond. [32/2014] (2) Every person so arrested must be taken to a police station and after that be dealt with as if the person had been arrested under section 65 of the Criminal Procedure Code 2010. [18 [15/2010]"
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 5 - GENERAL",
      "section": "28",
      "title": "General offences",
      "content": "28. —(1) Any person who provides or assists in providing any public entertainment — ( a ) without a licence issued under this Act; ( b ) while the licence is suspended; ( c ) in contravention of any condition of a licence; or ( d ) in contravention of this Act, shall be guilty of an offence and shall be liable on conviction — ( e ) in the case of an offence under paragraph ( a ) or ( b ), to a fine not exceeding $20,000; and ( f ) in the case of an offence under paragraph ( c ) or ( d ), to a fine not exceeding $10,000. [32/2014; 28/2017] (2) For the purposes of subsection (1), no person is deemed to have provided or assisted in providing any public entertainment merely by reason of the person having taken part in the public entertainment provided. [32/2014] (3) Any person who, being required to make any statement or provide any information or document under this Act — ( a ) makes any statement or provides any information or document which is false or misleading in a material particular; and ( b ) knows or ought reasonably to know that, or is reckless as to whether, it is false or misleading in a material particular, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. [19 [32/2014]"
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 5 - GENERAL",
      "section": "29",
      "title": "Protection from personal liability",
      "content": "29. No liability shall lie against a Licensing Officer, an Assistant Licensing Officer, a police officer, an authorised person or a member of the Public Entertainment Appeal Board for anything done or intended to be done with reasonable care and in good faith in the execution or purported execution of this Act. [19A [28/2017]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 5 - GENERAL",
      "section": "30",
      "title": "Service of documents",
      "content": "30. —(1) A document that is permitted or required to be served on a person under this Act may be served as described in this section. [32/2014] (2) A document may be served on an individual — ( a ) by giving it to the individual personally; ( b ) by sending it by prepaid registered post to the address specified by the individual for the service of documents under this Act or, if no address is so specified, the individual’s residential or business address; ( c ) by leaving it at the individual’s residential address with an adult person apparently residing there, or at the individual’s business address with an adult person apparently employed there; ( d ) by affixing a copy of the document in a conspicuous place at the individual’s residential or business address; ( e ) by sending it by fax to the fax number given by the individual as the fax number for the service of documents under this Act; or ( f ) by sending it by email to the individual’s email address. [32/2014] (3) A document may be served on a partnership (other than a limited liability partnership) — ( a ) by giving it to any partner, secretary or other like officer of the partnership; ( b ) by leaving it at, or by sending it by prepaid registered post to, the partnership’s business address; ( c ) by sending it by fax to the fax number used at the partnership’s business address; or ( d ) by sending it by email to the partnership’s email address. [32/2014] (4) A document may be served on a body corporate (including a limited liability partnership) or an unincorporated association — ( a ) by giving it to the secretary or other like officer of the body corporate or unincorporated association or the limited liability partnership’s manager; ( b ) by leaving it at, or by sending it by prepaid registered post to, the body corporate’s or unincorporated association’s registered office or principal office in Singapore; ( c ) by sending it by fax to the fax number used at the body corporate’s or unincorporated association’s registered office or principal office in Singapore; or ( d ) by sending it by email to the body corporate’s or unincorporated association’s email address. [32/2014] (5) Service of a document on a person under this section takes effect — ( a ) if the document is sent by fax and a notification of successful transmission is received, on the day of the transmission; ( b ) if the document is sent by email, at the time that the email becomes capable of being retrieved by the person; and ( c ) if the document is sent by pre‑paid registered post, 2 days after the day the document was posted (even if it is returned undelivered). [32/2014] (6) A document may be served on a person under this Act by email only with that person’s prior written consent. [32/2014] (7) This section does not apply to documents to be served in proceedings in court. [32/2014] (8) In this section — “business address” means — ( a ) in the case of an individual, the individual’s usual or last known place of business in Singapore; and ( b ) in the case of a partnership (other than a limited liability partnership), the partnership’s principal or last known place of business in Singapore; “email address” means the last email address given by the addressee concerned as the email address for the service of documents under this Act; “residential address” means an individual’s usual or last known place of residence in Singapore. [20 [32/2014]"
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 5 - GENERAL",
      "section": "31",
      "title": "Composition of offences",
      "content": "31. —(1) The Licensing Officer may compound any offence under this Act which is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum not exceeding the lower of the following: ( a ) one half of the amount of the maximum fine that is prescribed for the offence; ( b ) $5,000. [32/2014] (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence. (3) All sums collected under this section must be paid into the Consolidated Fund. [21 [32/2014]"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 5 - GENERAL",
      "section": "32",
      "title": "Onus of proof",
      "content": "32. In any proceedings under this Act, the onus of proving that the public or any class of the public did not have access to any public entertainment lies on the person alleging the fact. [22"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 5 - GENERAL",
      "section": "33",
      "title": "Rules",
      "content": "33. —(1) The Minister may make rules for any of the following purposes: ( a ) to prescribe the fees or charges in respect of any matter or thing to be done or required under or for the purposes of this Act, including for any application or licence; ( b ) to prescribe the matters required or permitted to be prescribed by this Act; ( c ) to prescribe the hours during which public entertainment may be provided; ( d ) to prescribe the form and manner of, and any procedures or proceedings relating to, any appeal under this Act; ( e ) generally to give effect to the provisions of this Act. [32/2014; 28/2017] (2) In this section, “Minister” means — ( a ) in the case where the power under this section is to be exercised in connection with section 16, 17 or 18 — the Minister charged with the responsibility for the licensing of arts entertainments; and ( b ) in the case where the power under this section is to be exercised in connection with any other provision of this Act — the appropriate Minister. [32/2014] (3) All rules made under this Act must be presented to Parliament as soon as possible after publication in the Gazette . [23"
    }
  ],
  "definitions": [
    {
      "term": "appropriate Licensing Officer",
      "definition": "“appropriate Licensing Officer” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "appropriate Minister",
      "definition": "“appropriate Minister” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "approved place",
      "definition": "“approved place” means a building, tent, street or place, or any part of that, whether open or enclosed, which is approved by the appropriate Licensing Officer for the purposes of this Act;",
      "source_provision": "s2"
    },
    {
      "term": "arts entertainment",
      "definition": "“arts entertainment” has the meaning given in the First Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Arts Entertainment Licensing Officer",
      "definition": "“Arts Entertainment Licensing Officer” means the Licensing Officer appointed under section 3 by the Minister charged with the responsibility for the licensing of arts entertainments, and includes an Assistant Licensing Officer appointed by that Minister under that section;",
      "source_provision": "s2"
    },
    {
      "term": "authorised person",
      "definition": "“authorised person” means an individual appointed as an authorised person under section 3(2);",
      "source_provision": "s2"
    },
    {
      "term": "licence",
      "definition": "“licence” means a public entertainment licence issued or renewed under this Act;",
      "source_provision": "s2"
    },
    {
      "term": "licensee",
      "definition": "“licensee” means a person who is the holder of a licence;",
      "source_provision": "s2"
    },
    {
      "term": "Licensing Officer",
      "definition": "“Licensing Officer” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "public entertainment",
      "definition": "“public entertainment” has the meaning given in the First Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Public Entertainment Appeal Board",
      "definition": "“Public Entertainment Appeal Board” means the Public Entertainment Appeal Board established by section 20;",
      "source_provision": "s2"
    },
    {
      "term": "Public Entertainment Licensing Officer",
      "definition": "“Public Entertainment Licensing Officer” means the Licensing Officer appointed under section 3 by the Minister charged with the responsibility for public entertainments, and includes an Assistant Licensing Officer appointed by that Minister under that section;",
      "source_provision": "s2"
    },
    {
      "term": "responsible officer",
      "definition": "“responsible officer” , in relation to an applicant or a licensee, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "specified establishment",
      "definition": "“specified establishment” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "appeal authority",
      "definition": "“appeal authority” means — ( a )",
      "source_provision": "s19"
    },
    {
      "term": "appealable decision",
      "definition": "“appealable decision” , in relation to the appropriate Licensing Officer, means any of the following decisions or directions: ( a )",
      "source_provision": "s19"
    },
    {
      "term": "business address",
      "definition": "“business address” means — ( a )",
      "source_provision": "s30"
    },
    {
      "term": "email address",
      "definition": "“email address” means the last email address given by the addressee concerned as the email address for the service of documents under this Act;",
      "source_provision": "s30"
    },
    {
      "term": "residential address",
      "definition": "“residential address” means an individual’s usual or last known place of residence in Singapore. [20 [32/2014]",
      "source_provision": "s30"
    }
  ]
}