{
  "id": "pmo-1910",
  "type": "statute",
  "title": "Portuguese Missions Ordinance 1910",
  "title_en": "Portuguese Missions Ordinance 1910",
  "short_name": "PMO1910",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PMO1910",
  "description": "An Ordinance to incorporate the Agent of the Commission for the Administration of the Estates of the Portuguese Missions in China at Singapore.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Ordinance may be cited as the Portuguese Missions Ordinance 1910."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "The Agent or Procurator of the Commission for the Administration of the Estates of the Portuguese Missions in China at Singapore to be a body corporate",
      "content": "2. —(1) Antonio Augusto Cardozo, Agent at Singapore, and his successors for the time being in the office of Agent at Singapore of the Commission for the Administration of the Estates of the Portuguese Missions in China, duly qualified as hereinafter provided, shall be a body corporate, hereinafter called the Corporation, and shall for the purposes of this Ordinance have the name of “The Agent of the Commission for the Administration of the Estates of the Portuguese Missions in China at Singapore”, and by that name have perpetual succession and shall and may have and use a corporate seal. (2) The said seal may from time to time be broken, changed, altered and made anew as to the Corporation seems fit."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Vesting clause as to properties in Schedules referred to",
      "content": "3. Subject to section 8, all the properties comprised in the Schedules are hereby vested in the Corporation for the residue of the term of years under which the same are held for the use and behoof of the Portuguese Missions in China."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Powers of the Corporation relative to properties",
      "content": "4. The Corporation may acquire, purchase, take, hold and enjoy movable and immovable property of every description within the Colony, and sell, convey, assign, exchange, surrender, yield up, mortgage, demise, re‑assign, transfer or otherwise howsoever dispose of or deal with any movable or immovable property vested in the Corporation upon such terms as to the Corporation seem fit."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Powers of suing and being sued",
      "content": "5. —(1) The Corporation may sue and be sued and take all legal proceedings in any of the Courts of the Colony by the name of “The Agent of the Commission for the Administration of the Estates of the Portuguese Missions in China at Singapore”. (2) All originating claims, notices and legal process may be served upon the Corporation by being left at the residence for the time being in Singapore of the Corporation. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Qualifications of the Agent before acting",
      "content": "6. —(1) No person other than the said Antonio Augusto Cardozo shall be deemed to be duly qualified as aforesaid unless and until he has been duly appointed to fill the office of the Agent of the Commission for the Administration of the Estates of the Portuguese Missions in China at Singapore by the Bishop of Macao, as President of the aforesaid Commission, by instrument in writing, and such instrument has been produced to the Minister and the same approved by him and unless and until a notification of such approval has appeared in the Gazette . (2) Such notification shall be sufficient evidence of the appointment and that the person named therein is duly qualified as by this Ordinance is required."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Execution of deeds, etc.",
      "content": "7. —(1) No deed, document or other instrument sealed with the seal of the Corporation shall be deemed to be duly sealed unless such seal has been affixed in the presence of the said Antonio Augusto Cardozo or his attorney duly authorised by a power of attorney deposited under section 48 of the Conveyancing and Law of Property Act 1886, or in the presence of his successor for the time being in his said office of Agent of the Commission for the Administration of the Estates of the Portuguese Missions in China at Singapore, and duly qualified as aforesaid, or his attorney duly authorised as aforesaid, and unless such deed, document or other instrument is signed by the said Antonio Augusto Cardozo or his attorney as aforesaid or a successor in his said office, or the attorney of such successor authorised as aforesaid. (2) Such signing shall be taken as sufficient evidence of the due sealing of such deed or document or other instrument."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Saving of Government and other rights",
      "content": "8. Nothing in this Ordinance shall affect the rights of the Government, or any bodies politic or corporate or of any other persons, except such as are mentioned in this Ordinance, and those claiming by, from and under them or any of the legal personal representatives of the said Isaiah Zechariah, Joaquim Joz&#233; Leite, Liete or Letta, Nicholao Rodrigues Pereira de Borja or Manuel Louren&#231;o de Gouv&#234;a or any persons claiming by, through, from, or under them. [7/97]"
    }
  ],
  "definitions": []
}