{
  "id": "ppsa-1975",
  "type": "statute",
  "title": "Parking Places (Surcharge) Act 1975",
  "title_en": "Parking Places (Surcharge) Act 1975",
  "short_name": "PPSA1975",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PPSA1975",
  "description": "An Act to provide for the imposition of surcharge on parking places.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Parking Places (Surcharge) Act 1975."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “designated area” means any area or place which the Minister may, by order in the Gazette , specify as being a designated area for the purposes of this Act; “motor vehicle” means a mechanically propelled vehicle intended or adapted for use on roads; “parking lot” means the space marked out in a parking place for the parking of one motor vehicle; “parking place” means any land or premises, or any part of the land or premises, owned by any person, statutory board or institution and used for the parking of 5 or more motor vehicles; “Superintendent” means the Superintendent of Car Parks or a Deputy or an Assistant Superintendent of Car Parks appointed under the Parking Places Act 1974; “surcharge” means a surcharge imposed in respect of any parking place."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Levy of surcharge",
      "content": "3. —(1) There is to be levied a surcharge in respect of every parking place in any designated area at such rate or rates as the Minister may, by order in the Gazette , determine. (2) Such rate or rates must be on the basis of the number of parking lots or otherwise as the Minister may determine. (3) The surcharge is payable at such time and in such manner as the Minister may, by order in the Gazette , determine. (4) The surcharge is payable, without demand, at the office of the Superintendent or any other prescribed place. (5) All surcharges required to be paid under this Act or any order made under this Act are recoverable as a debt due to the Government. (6) Despite the provisions of any other written law, the Superintendent must not refund any surcharge except in such special circumstances as the Superintendent may approve."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Power to seek information",
      "content": "4. —(1) For the purposes of enforcing the provisions of this Act, the Superintendent may, and as often as the Superintendent thinks necessary, require any person — ( a ) to submit or give to the Superintendent, within such period as the Superintendent thinks fit, any form, return or information; or ( b ) to answer any question raised by the Superintendent. (2) All forms and returns under this Act must be in such form as the Superintendent may require. (3) Any person who fails to submit any form or return as required under subsection (1), or who in any such form or return makes any statement which is false in any material particular, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Power to compound offences",
      "content": "5. The Superintendent may accept from any person who is reasonably suspected of having committed an offence under this Act or any of its orders or rules a sum of money not exceeding $500 by way of composition for the offence which may have been committed."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Surcharges to be paid into Consolidated Fund",
      "content": "6. All surcharges collected by the Superintendent must be paid into the Consolidated Fund."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Exemption",
      "content": "7. The Minister may exempt any parking place or part of any parking place from all or any of the provisions of this Act."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Non-application",
      "content": "8. —(1) The provisions of this Act do not apply to private parking places used exclusively in connection with any private dwelling house for the housing or parking of vehicles kept for private use only. [24/2018] (2) In this section, “dwelling house” means any building or tenement, or any part thereof, which is used, constructed or adapted for use for human habitation."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Rules",
      "content": "9. The Minister may make rules for the purpose of carrying into effect any of the provisions of this Act."
    }
  ],
  "definitions": [
    {
      "term": "designated area",
      "definition": "“designated area” means any area or place which the Minister may, by order in the Gazette , specify as being a designated area for the purposes of this Act;",
      "source_provision": "s2"
    },
    {
      "term": "motor vehicle",
      "definition": "“motor vehicle” means a mechanically propelled vehicle intended or adapted for use on roads;",
      "source_provision": "s2"
    },
    {
      "term": "parking lot",
      "definition": "“parking lot” means the space marked out in a parking place for the parking of one motor vehicle;",
      "source_provision": "s2"
    },
    {
      "term": "parking place",
      "definition": "“parking place” means any land or premises, or any part of the land or premises, owned by any person, statutory board or institution and used for the parking of 5 or more motor vehicles;",
      "source_provision": "s2"
    },
    {
      "term": "Superintendent",
      "definition": "“Superintendent” means the Superintendent of Car Parks or a Deputy or an Assistant Superintendent of Car Parks appointed under the Parking Places Act 1974;",
      "source_provision": "s2"
    },
    {
      "term": "surcharge",
      "definition": "“surcharge” means a surcharge imposed in respect of any parking place.",
      "source_provision": "s2"
    }
  ]
}