{
  "id": "psa-2025",
  "type": "statute",
  "title": "Protection from Scams Act 2025",
  "title_en": "Protection from Scams Act 2025",
  "short_name": "PSA2025",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PSA2025",
  "description": "An Act to protect persons from scams by empowering specified officers to issue restriction orders to banks in Singapore prohibiting certain bank transactions and the grant and use of credit facilities temporarily.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title and commencement",
      "content": "1. This Act is the Protection from Scams Act 2025 and comes into operation on a date that the Minister appoints by notification in the Gazette ."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act — “bank” means a bank in Singapore within the meaning given by section 2(1) of the Banking Act 1970; “bank account”, in relation to a scam victim, means an account with a bank — ( a ) with moneys standing to the credit of, and held in the name of, the scam victim; or ( b ) with moneys standing to the credit of, and held in the names of, 2 or more persons, at least one of whom is the scam victim; “Commissioner” means the Commissioner of Police appointed under section 6(1) of the Police Force Act 2004; “communication device” means a machine, device or thing designed or capable of being used for — ( a ) sending or receiving oral or written messages, voice calls or video calls; ( b ) sending or receiving electronic documents; ( c ) sending or receiving still or moving images; ( d ) sending or receiving audio or video files; or ( e ) providing access to the Internet, using any technology (including remote communication technology), and includes a mobile phone, wireless handheld device (such as a tablet computer) and wearable device (such as a smart watch); “credit facility” means — ( a ) an advance, a loan or other facility that is granted by a bank to a customer who is an individual, and that gives the customer access to any funds or financial guarantee provided by the bank; or ( b ) any other liability that is incurred by a bank on behalf of a customer who is an individual; “remote communication” means communication through — ( a ) the Internet; ( b ) telephone or any other communication device; ( c ) television or radio; or ( d ) any other kind of electronic or other technology for facilitating communication, but excludes any specific system or method of communication that the Minister, by order in the Gazette , declares is not to be treated as remote communication for the purposes of this Act; “restriction order” has the meaning given by section 3; “scam offence” means any offence specified in the Schedule; “scam victim” means an individual against whom a scam offence is committed or intended to be committed; “scammer” means any person whom a specified officer has reason to believe — ( a ) has committed, participated in or facilitated the commission of, or taken any step preparatory to, or in furtherance of, the commission of, any scam offence against a scam victim, whether in Singapore or elsewhere; and ( b ) has interacted with the scam victim via remote communication for the purposes of the activity or step mentioned in paragraph ( a ); “specified officer” means a police officer within the meaning given by section 2(1) of the Police Force Act 2004 or a Commercial Affairs Officer appointed under section 64(1) of that Act."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - RESTRICTION ORDERS",
      "section": "3",
      "title": "Meaning and scope of restriction orders",
      "content": "3. A restriction order is an order issued by a specified officer to one or more banks in relation to a scam victim — ( a ) directing the bank or each of the banks not to do any of the following at any time when the restriction order is in force: (i) allow a transfer or withdrawal of money from any bank account of the scam victim maintained with that bank; (ii) grant, or allow a drawdown of, any credit facility to the scam victim; and ( b ) specifying the time that the direction under paragraph ( a ) takes effect."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - RESTRICTION ORDERS",
      "section": "4",
      "title": "Issue of restriction orders",
      "content": "4. —(1) A specified officer may, on receipt of any information, issue a restriction order to one or more banks if — ( a ) the specified officer has reason to believe that a scam victim will — (i) instruct the bank or any of the banks to transfer any money from a bank account to a scammer (whether directly or indirectly through any intermediary); (ii) withdraw any money from a bank account with the intention of giving the money (or any part of the money) to a scammer (whether directly or indirectly through any intermediary); or (iii) apply for any credit facility from the bank or any of the banks, or draw down on any credit facility granted by the bank or any of the banks, with the intention of benefitting a scammer by a drawdown on the credit facility; and ( b ) the restriction order is necessary for the protection of the scam victim, having regard to — (i) the time required by any specified officer, relative of the scam victim or other persons (including, but not limited to, non‑profit organisations and non‑governmental organisations) to implement any measures to reduce the risk of the scam victim becoming, or continuing to be, a victim of a scam offence; and (ii) all other relevant circumstances. (2) In subsection (1), “relative”, in relation to a scam victim, means the spouse, or a sibling or stepsibling, child (including an adopted child), stepchild, grandchild or step‑grandchild, nephew or step‑nephew, or niece or step‑niece, of the scam victim."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - RESTRICTION ORDERS",
      "section": "5",
      "title": "Duration, cancellation, variation and extension of restriction order",
      "content": "5. —(1) Subject to this section, a restriction order is in force for 30 days or any shorter period that may be specified in the order. (2) A specified officer may, at any time a restriction order is in force, cancel the order. (3) The cancellation of a restriction order does not affect the operation of the restriction order, or anything done or omitted to be done in compliance with the restriction order, before the date of its cancellation. (4) A specified officer may, on the application of any of the following persons, vary a restriction order by permitting a bank which is subject to the restriction order to allow a transfer or withdrawal of money from a bank account of a scam victim by or on the instruction of the applicant, subject to any limit or terms that the specified officer may specify to that bank: ( a ) the scam victim; ( b ) any joint account holder of that bank account. (5) A specified officer may, at any time a restriction order is in force, extend the restriction order for a period not exceeding 30 days if the specified officer is of the view that more time is required by any specified officer to reduce the risk of the scam victim becoming, or continuing to be, a victim of a scam offence. (6) A restriction order must not be extended more than 5 times under subsection (5)."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - RESTRICTION ORDERS",
      "section": "6",
      "title": "Offence of contravening restriction order and composition of offence",
      "content": "6. —(1) Any bank which contravenes a restriction order without reasonable excuse shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $3,000. (2) A specified officer may compound an offence under subsection (1) by collecting from a bank which is reasonably suspected of having committed the offence a sum not exceeding $1,500. (3) On payment of the sum of money under subsection (2), no further proceedings are to be taken against the bank in respect of the offence. (4) All sums collected under this section must be paid into the Consolidated Funds."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - APPEALS",
      "section": "7",
      "title": "Appeals against restriction orders, etc.",
      "content": "7. —(1) Any of the following persons may appeal to the Commissioner against any decision of a specified officer under this Act in relation to a restriction order: ( a ) a scam victim in relation to whom the restriction order is issued; ( b ) any joint account holder of a bank account of a scam victim maintained by a bank which is subject to the restriction order. (2) An appeal under this section must be — ( a ) in the prescribed form and specify the grounds on which it is made; ( b ) accompanied by the prescribed documents or information; and ( c ) made within the prescribed period after the time of receipt of the notification relating to the decision appealed against. (3) The Commissioner may reject an appeal of an appellant who fails to comply with subsection (2). (4) The Commissioner may — ( a ) consider any relevant documents or information other than those submitted by the appellant; and ( b ) decide an appeal — (i) based solely on documentary evidence; and (ii) without holding any hearing of the appeal. (5) After considering the appeal, the Commissioner may — ( a ) reject the appeal and confirm the specified officer’s decision; or ( b ) allow the appeal and revoke, substitute or vary the specified officer’s decision. (6) The Commissioner’s decision on an appeal is final. (7) Every appellant and any other prescribed person must be notified of the Commissioner’s decision under subsection (5). (8) An appeal against a specified officer’s decision — ( a ) does not affect the operation of the decision appealed against or prevent the taking of any action to implement the decision; and ( b ) unless otherwise directed by the Commissioner, the decision appealed against must be complied with until the determination of the appeal."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - APPEALS",
      "section": "8",
      "title": "Designation of appropriate officers to hear appeals",
      "content": "8. —(1) The Commissioner may designate an appropriate officer to hear and determine, in the Commissioner’s place, any appeals or a specific appeal under section 7. (2) Upon a designation under subsection (1), any reference in section 7 to the Commissioner includes a reference to the appropriate officer so designated for that appeal. (3) In this section, “appropriate officer” means any person who is designated by the Commissioner as a Deputy Commissioner of Police for the purposes of any provision of the Police Force Act 2004 or its subsidiary legislation, or in the Police General Orders, Force Orders or Standing Orders made under that Act."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "9",
      "title": "Immunity for complying with restriction orders",
      "content": "9. —(1) No criminal or civil liability is to be incurred by — ( a ) a bank; or ( b ) an officer, employee or agent of a bank, for anything done or omitted to be done with reasonable care and in good faith in complying with any restriction order or in the execution or purported execution of any duty under this Act. (2) In subsection (1), “officer”, in relation to a bank, means any director, chief executive, manager, secretary or other similar officer of the bank, and includes — ( a ) any person purporting to act in any such capacity; and ( b ) for a bank whose affairs are managed by its members — any of those members as if the member were a director of the bank."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "10",
      "title": "Amendment of Schedule",
      "content": "10. The Minister may, by order in the Gazette , amend the Schedule."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "11",
      "title": "Regulations",
      "content": "11. —(1) The Minister may make regulations — ( a ) to prescribe anything that is required or permitted to be prescribed by this Act; and ( b ) generally for the purposes of this Act. (2) Without limiting subsection (1), regulations may provide for — ( a ) the person or persons (each called in this subsection an affected person) who must be notified of an issue, cancellation, variation or extension of a restriction order under section 4(1) or 5; ( b ) the person or persons who must notify an affected person; ( c ) the time within which an affected person must be notified; ( d ) the manner in which an affected person may be notified; ( e ) the circumstances in which an affected person is deemed to have received a notification; and ( f ) the procedure for an appeal under section 7."
    }
  ],
  "definitions": [
    {
      "term": "bank",
      "definition": "“bank” means a bank in Singapore within the meaning given by section 2(1) of the Banking Act 1970;",
      "source_provision": "s2"
    },
    {
      "term": "bank account",
      "definition": "“bank account” , in relation to a scam victim, means an account with a bank — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Commissioner",
      "definition": "“Commissioner” means the Commissioner of Police appointed under section 6(1) of the Police Force Act 2004;",
      "source_provision": "s2"
    },
    {
      "term": "communication device",
      "definition": "“communication device” means a machine, device or thing designed or capable of being used for — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "credit facility",
      "definition": "“credit facility” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "remote communication",
      "definition": "“remote communication” means communication through — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "restriction order",
      "definition": "“restriction order” has the meaning given by section 3;",
      "source_provision": "s2"
    },
    {
      "term": "scam offence",
      "definition": "“scam offence” means any offence specified in the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "scam victim",
      "definition": "“scam victim” means an individual against whom a scam offence is committed or intended to be committed;",
      "source_provision": "s2"
    },
    {
      "term": "scammer",
      "definition": "“scammer” means any person whom a specified officer has reason to believe — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "specified officer",
      "definition": "“specified officer” means a police officer within the meaning given by section 2(1) of the Police Force Act 2004 or a Commercial Affairs Officer appointed under section 64(1) of that Act.",
      "source_provision": "s2"
    }
  ]
}