{
  "id": "pssca-1956",
  "type": "statute",
  "title": "Public Service (Service Commissions) Act 1956",
  "title_en": "Public Service (Service Commissions) Act 1956",
  "short_name": "PSSCA1956",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PSSCA1956",
  "description": "An Act to provide for the punishment of offences in connection with the exercise of the functions of the Public Service Commission, the Judicial Service Commission and the Legal Service Commission, for the protection of the members of these Commissions, and for matters connected therewith. [Act 33 of 2021 wef 14/01/2022]",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Public Service (Service Commissions) Act 1956. [Act 33 of 2021 wef 14/01/2022]"
    },
    {
      "provision_ref": "s1A",
      "section": "1A",
      "title": "Interpretation",
      "content": "1A. In this Act, “Commission” — ( a ) means the Public Service Commission, the Judicial Service Commission or the Legal Service Commission; and ( b ) includes a personnel board established under Article 110D, 111I or 111Q of the Constitution. [Act 33 of 2021 wef 14/01/2022]"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Offence to give false information to Commissions",
      "content": "2. Any person who, in connection with an application by any person for employment or appointment in the public service or with any matter upon which it is the duty of a Commission to act, wilfully gives to the Commission or to any member of it or to any person or body of persons appointed by the Commission to assist it in the exercise of its functions or the discharge of its duties any information which is false or misleading in any material particular shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 2 years or to both. [Act 33 of 2021 wef 14/01/2022]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Communications of Commissions to be privileged",
      "content": "3. No person shall in any legal proceedings be permitted or compelled to produce or disclose any communication, written or oral, which has taken place between a Commission or any member of it and the Government or the President or a Minister or the head of a department of the Government or any other person, or any communication between members of the Commission in exercise of or in connection with the exercise of the functions of the Commission, unless the President consents in writing to such production or disclosure. [5/2018] [Act 33 of 2021 wef 14/01/2022]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Publication and disclosure of information to unauthorised persons prohibited",
      "content": "4. —(1) No member of a Commission nor any other person shall, without the written permission of the President, publish or disclose to any unauthorised person or otherwise than in the course of the duty of the member or other person the contents or any part of the contents of any document, communication or information which has come to the knowledge of that member or other person in the course of the member’s or other person’s duties under any written law relating to the Commission in respect of any of the Commission’s functions under any such law, and any person who knowingly acts in contravention of this subsection shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding one year or to both. [5/2018] [Act 33 of 2021 wef 14/01/2022] (2) If any person having possession of any information which to his knowledge has been disclosed in contravention of this section publishes or communicates that information to any other person otherwise than for the purpose of a prosecution under this Act, he shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding one year or to both."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Protection of members of Commissions",
      "content": "5. A member of a Commission shall have such and the like protection and privileges in case of any action or suit brought against him for any act done or omitted to be done in the execution of his duty as is by law given to any Magistrate acting in the execution of his office. [Act 33 of 2021 wef 14/01/2022]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Offence to influence or attempt to influence Commissions",
      "content": "6. —(1) Every person who otherwise than in the course of his duty directly or indirectly by himself or by any other person in any manner whatsoever influences or attempts to influence any decision of a Commission or any member of a Commission shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 2 years or to both. [Act 33 of 2021 wef 14/01/2022] (2) Nothing in this section prohibits any person from giving a certificate or testimonial to any applicant or candidate for any public office. [Act 33 of 2021 wef 14/01/2022]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Consent of Public Prosecutor to prosecution",
      "content": "7. A prosecution under this Act shall not be instituted except by or with the consent of the Public Prosecutor or his deputy. 8. [ Repealed by Act 33 of 2021 wef 14/01/2022 ]"
    }
  ],
  "definitions": []
}