{
  "id": "pta-1915",
  "type": "statute",
  "title": "Public Trustee Act 1915",
  "title_en": "Public Trustee Act 1915",
  "short_name": "PTA1915",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/PTA1915",
  "description": "An Act to provide for the appointment of a Public Trustee.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Public Trustee Act 1915."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless there is something repugnant in the subject or context — “Board” means the Investment Board mentioned in section 13; “Common Fund” means the Common Fund mentioned in section 10; “expenses” includes costs and charges; “letters of administration” means letters of administration of the estate and effects of a deceased person, whether general or with a will annexed, or limited either in time or otherwise; “private trustee” means a trustee other than the Public Trustee; “Reserve Fund” means the fund established under section 15A; “trust” includes an executorship or administratorship, and “trustee” is to be construed accordingly; “trust property” includes all property in the possession or under the control wholly or partly of the Public Trustee by virtue of any trust. [44/2014] Establishment of Public Trustee"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Minister to appoint Public Trustee",
      "content": "3. —(1) The Minister may appoint a fit person to the office of Public Trustee, who is to hold office during the Minister’s pleasure, and receive such salary or fees, and be appointed on such terms, as the Minister determines. [7/1997] (2) The Minister may appoint such fit and proper persons to be Deputy Public Trustees, Assistant Public Trustees and other officers of the Public Trustee as the Minister considers necessary for the purposes of this Act. [44/2014] (3) The Deputy Public Trustees, Assistant Public Trustees and other officers of the Public Trustee are to hold office on such terms as the Minister may determine. [44/2014] (4) Any reference in this Act or in any other written law to officer or officers of the Public Trustee includes a reference to a Deputy Public Trustee and an Assistant Public Trustee. [44/2014] Corporation sole (5) The Public Trustee is a corporation sole under that name, with perpetual succession and an official seal, and may sue and be sued under the above name like any other corporation sole. Remuneration (6) The salary or remuneration of the Public Trustee and the officers of the Public Trustee and such other expenses of executing the office of the Public Trustee or otherwise carrying this Act into effect as are sanctioned by the Minister are to be paid out of the Consolidated Fund. [7/1997] (7) The Public Trustee and every officer of the Public Trustee is declared to be a public servant within the meaning of the Penal Code 1871."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "General powers and duties of Public Trustee",
      "content": "4. —(1) Subject to and in accordance with this Act and the rules made under this Act, the Public Trustee may — ( a ) act in the administration of estates; ( b ) act as an ordinary trustee; and ( c ) be appointed trustee by a court of competent jurisdiction. [27/2012] (2) In addition to the powers and duties under subsection (1), the Public Trustee may — ( a ) undertake any functions and duties relating to victims of motor accidents and their claims to compensation that the Minister may assign to the Public Trustee; ( b ) be appointed as a deputy by the court under the Mental Capacity Act 2008 with powers and duties conferred or imposed under that Act in relation to the property and affairs of a person who lacks capacity; ( c ) undertake the role, functions and duties of the Public Trustee set out in the Deposit Insurance and Policy Owners’ Protection Schemes Act 2011; and ( d ) undertake any functions and duties relating to bona vacantia arising from the death of natural persons that the Minister may assign to the Public Trustee. [22/2008; 15/2011; 27/2012; 27/2014] (3) Subject to and in accordance with this Act and the rules made under this Act, the Public Trustee — ( a ) may act either alone or jointly with any person or body of persons in any capacity to which he or she is appointed pursuant to this Act; and ( b ) has all the same powers, duties and liabilities, and is entitled to the same rights and immunities and is subject to the control and orders of the court, as a private trustee acting in the same capacity. (4) The Public Trustee may decline, either absolutely or except on the prescribed conditions, to accept any trust, but must not decline to accept any trust on the ground only of the small value of the trust property. (5) The Public Trustee must not accept — ( a ) any trust which involves the management or carrying on of any business, except in the cases in which the Public Trustee is authorised to do so by rules made under this Act; ( b ) any trust under a deed of arrangement for the benefit of creditors; or ( c ) the administration of any estate that the Public Trustee knows or believes to be insolvent. (6) Subject to any conditions or restrictions imposed by the Minister in writing, the Public Trustee may authorise in writing any Deputy Public Trustee or Assistant Public Trustee to exercise all or any of the powers, and perform all or any of the duties, of the Public Trustee conferred by or under any written law, except this power of authorisation. [44/2014] (7) Every Deputy Public Trustee or Assistant Public Trustee who is authorised under subsection (6) to exercise any power or perform any duty of the Public Trustee must, when exercising that power or performing that duty, comply with the directions of the Public Trustee. [44/2014] (8) Any reference in this Act or in any other written law to the Public Trustee includes a reference to a Deputy Public Trustee and an Assistant Public Trustee authorised under subsection (6), unless the context otherwise requires. [44/2014] (9) Subject to the sanction of and any direction given by the Board, the Public Trustee may authorise any person to be his or her agent to carry out any of his or her functions under section 10 and the rules made for the purpose of that section. [44/2014]"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Public Trustee may represent minor in certain cases",
      "content": "5. —(1) The Public Trustee or any other person may apply to the court by originating application or summons, as appropriate, for the Public Trustee to be appointed to act as litigation representative of any minor for the purpose of instituting any suit or proceeding in the name of the minor. [42/2005; 44/2014] [Act 25 of 2021 wef 01/04/2022] (2) In any suit or proceeding in which a minor is a party or to which it becomes necessary to add a minor as a party, the court may, on its own motion or on the application of the Public Trustee or any other person, appoint the Public Trustee to act as litigation representative of the minor in the suit or proceeding. [44/2014] (3) A court is to consider the views of the Public Trustee before deciding whether to appoint the Public Trustee as litigation representative of a minor — ( a ) on the application of a person other than the Public Trustee under subsection (1); ( b ) on its own motion under subsection (2); or ( c ) on the application of a person other than the Public Trustee under subsection (2). [44/2014] (4) The court must not make any order under this section unless provision is made to the satisfaction of the court for the payment of the costs of the Public Trustee as between solicitor and client and for the payment of any costs which may be awarded against the Public Trustee or directed to be paid by the Public Trustee. (5) In any suit or proceeding in which the Public Trustee is appointed under this section to act for a minor, no costs are recoverable from the Public Trustee personally or from the Government. (6) In this section, “suit” means an action for the administration of the estate of any deceased person or of a trust, and “proceeding” means a proceeding under Order 32 of the Rules of Court 2021 (administration and similar actions). [5/2014] [Act 31 of 2022 wef 01/11/2022]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Administration of small estates",
      "content": "6. —(1) Any person who in the opinion of the Public Trustee would be entitled to apply to the court for an order for the administration of an estate, the gross capital value of which is proved to the satisfaction of the Public Trustee to be less than the prescribed amount, may apply to the Public Trustee to administer the estate, and where any such application is made, and it appears to the Public Trustee that the persons beneficially entitled are persons of small means, the Public Trustee must administer the estate, unless the Public Trustee sees good reason for refusing to do so. [44/2014] (2) On the Public Trustee undertaking, by written declaration signed and sealed by him or her, to administer the estate, the trust property vests, by virtue of this Act, in the Public Trustee. [44/2014] (3) As from such vesting, any trustee entitled under the trust to administer the estate is discharged from all liability attaching to the administration, except in respect of past acts. Administrative powers (4) For the purposes of the administration, the Public Trustee may exercise the administrative powers and authorities of the court that are conferred on him or her by rules made under this Act, subject to any conditions that are imposed by the rules. Rules (5) Rules may be made under this Act for enabling the Public Trustee to take the opinion of the court on any question arising in the course of any administration without judicial proceedings, and otherwise for making the procedure under this section simple and inexpensive. (6) Where proceedings have been instituted in any court for the administration of an estate, the court may order the Public Trustee to administer the estate, subject to any directions that the court may give, where it appears to the court that — ( a ) by reason of the small value of the estate, the estate can be more economically administered by the Public Trustee than by any other person; or ( b ) for any other reason, it is expedient that the estate should be administered by the Public Trustee instead of any other person. [44/2014] (7) The court must, before making any order under subsection (6), consider the views of the Public Trustee on the matter. [44/2014] (8) Where the court makes an order under subsection (6), this section applies as if the Public Trustee has given an undertaking under subsection (2) to administer the estate. [44/2014] (9) Where any trust money (forming part of an estate administered by the Public Trustee under this section) which is not included in the Common Fund is normally insufficient to earn bank interest if kept in a bank current account, the money may be kept in a general banking account or deposited in any bank and any interest allowed by the bank must be paid into the Consolidated Fund. [44/2014]"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Appointment of Public Trustee to be trustee, executor, etc.",
      "content": "7. —(1) Subject to subsection (4), a testator, a settlor or a court may appoint the Public Trustee by that name, or by any sufficient description, as if the Public Trustee were a private trustee — ( a ) to be trustee of any will, settlement or other instrument creating a trust; or ( b ) to perform any trust or duty belonging to a class which the Public Trustee is authorised by rules made under this Act to accept. [44/2014] (2) This section applies regardless of when the will, settlement or other instrument creating the trust or duty was made or came into operation. [44/2014] (3) The Public Trustee may be appointed under subsection (1) — ( a ) as an original trustee; or ( b ) as a new trustee in place of or in addition to one or more trustees. [44/2014] (4) No appointment under subsection (1) has effect unless the Public Trustee has given his or her written consent to the appointment. [44/2014] (5) Where a court wishes to appoint the Public Trustee under subsection (1), the court must direct that an application for the written consent of the Public Trustee required under subsection (4) be made by such person seeking the appointment of a trustee by the court as the court considers fit. [44/2014] (6) Where no written consent has been given by the Public Trustee before his or her appointment, the Public Trustee may, at any time after he or she knows of the fact of his or her appointment, act as if the Public Trustee had given his or her written consent. [44/2014] (7) Where the Public Trustee has been appointed a trustee of any trust, a co‑trustee may retire from the trust under and in accordance with the provisions of the Trustees Act 1967 but without such consent as is required by that Act, even if the Public Trustee becomes the sole trustee upon the retirement. [44/2014] Contrary provisions in trust instrument (8) The Public Trustee is not to be so appointed either as a new or additional trustee where the will, settlement or other instrument creating the trust or duty contains a direction to the contrary, unless the court orders otherwise. Notice to beneficiaries (9) Notice of any proposed appointment of the Public Trustee, either as a new or additional trustee, must, where practicable, be given in the prescribed manner to all persons beneficially interested who are resident in Singapore and whose addresses are known to the persons proposing to make the appointment, or, if the beneficiaries are infants, to their guardians. (10) If any person who has been given notice under subsection (9) applies to the court within 21 days from the receipt of the notice, the court may, if having regard to the interests of all the beneficiaries it considers it expedient to do so, make an order prohibiting the appointment being made. (11) The failure to give the notice under subsection (9) does not invalidate the appointment."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Granting probate to Public Trustee",
      "content": "8. —(1) If, pursuant to any rule under this Act, the Public Trustee is authorised to accept by that name probates of wills or letters of administration, the court having jurisdiction to grant probate of a will or letters of administration may grant such probate or letters to the Public Trustee by that name. (2) For the purpose of subsection (1), the court is to consider the Public Trustee to be equally entitled in law with any other person or class of persons to obtain the grant of letters of administration except that the consent or citation of the Public Trustee will not be required for the grant of letters of administration to any other person, and that, as between the Public Trustee and the widower, widow or next of kin of the deceased, the widower, widow or next of kin is to be preferred, unless good cause is shown to the contrary. (3) An executor who has obtained probate or an administrator who has obtained letters of administration may, even if he or she has already acted in the administration of the deceased’s estate in part, apply to the court to sanction the transfer of the estate to the Public Trustee for administration either solely or jointly with the continuing executors or administrators, if any. [44/2014] (4) Any executor or administrator who wishes to apply to the court for a transfer of the estate to the Public Trustee under subsection (3) must, before making such an application, obtain the Public Trustee’s written consent. [44/2014] (5) Before hearing an application made under subsection (3), the court may direct that notice of the hearing be given, in such manner as it considers fit, to any person beneficially interested in the deceased’s estate. [44/2014] (6) The court hearing an application made under subsection (3) may sanction the transfer of the deceased’s estate to the Public Trustee for administration, either solely or jointly with the continuing executors or administrators, if any. [44/2014] (7) Upon the court making an order under subsection (6), the Public Trustee has all the powers of the executor or administrator from whom the estate is transferred. [44/2014] (8) The court may, on the application of any person beneficially interested in a deceased’s estate, with the written consent of the Public Trustee obtained by the person and upon proof of sufficient cause, appoint the Public Trustee in place of all or any one or more of the existing executors or administrators. [44/2014] (9) Upon the court making an order under subsection (8), the Public Trustee has all the powers of the executor or administrator the Public Trustee replaces. [44/2014] (10) The executor or administrator mentioned in subsection (3), or an executor or administrator replaced under an order under subsection (8), is not in any way liable in respect of any act done or default made in relation to the estate occurring after the date of an order under subsection (6) or (8) (as the case may be), other than the act or default of himself or herself or of other persons for whose conduct he or she is in law responsible. [44/2014] 9. [ Repealed by Act 44 of 2014 ]"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Common Fund",
      "content": "10. —(1) All capital moneys available for investment which come into the hands of the Public Trustee are to be placed in a fund known as the Common Fund. [44/2014] (2) Any credit balance at the date immediately before 31 December 2014 in the common fund mentioned in section 10(1) of this Act in force immediately before 31 December 2014 is transferred to the Common Fund, and constitutes its credit balance on 31 December 2014. [44/2014] (3) The Public Trustee may from time to time invest all moneys in the Common Fund in any investments permitted by law for the investment of trust funds. [44/2014] (4) The Public Trustee must not make any investment on account of the Common Fund, or dispose of any investment made on account of the Common Fund, without the sanction of the Board. [44/2014] (5) The Board may grant the sanction mentioned in subsection (4) with reference to any class or description of investments and upon such conditions as the Board may specify. [44/2014] (6) Subject to section 15A(4), all income received from the investments of capital moneys in the Common Fund is to be credited to the Common Fund. [44/2014] (7) Any investments of capital moneys belonging to any estate in the hands of the Public Trustee may, subject to the following subsections and section 11, be taken over and included in the Common Fund. [44/2014] (8) All investments taken over under subsection (7) are to be taken over at their market value at the date of the taking over less any interest accrued at that date. [44/2014] (9) No investment may be taken over under subsection (7) unless — ( a ) the investment is one which is permitted by law for the investment of trust funds; ( b ) the taking over of the investment is sanctioned by the Board; and ( c ) the Board is of the opinion that the investment is and is likely to continue to be readily realisable. [44/2014] (10) For the purposes of this section, interest is to accrue from day to day, and is apportionable in respect of time. [44/2014] (11) Any investment made on account of the Common Fund or taken over and included in the Common Fund is not made or held on account of and does not belong to any particular estate. [44/2014] (12) To avoid doubt, it is declared that section 7(4) of the Financial Procedure Act 1966 does not — ( a ) restrict the investment of any moneys included in or forming part of the Common Fund; or ( b ) preclude any investments permitted by law for the investment of trust funds from being taken over under subsection (7). [2/2012; 44/2014]"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "What are not to be included in Common Fund",
      "content": "11. —(1) The following are not to be included in or form part of the Common Fund: ( a ) moneys expressly or by necessary implication forbidden to be included in the Common Fund or directed to be invested in investments other than those permitted by law for the investment of trust funds; ( b ) investments held by the Public Trustee which have not been taken over under section 10(7). [44/2014] (2) Section 16 does not apply to the moneys and investments mentioned in subsection (1). (3) Nothing in this section is deemed to limit or restrict the liability of the Consolidated Fund under section 17."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Frequency of calculation and income payable to estates",
      "content": "12. —(1) The Board must determine a schedule of regular periods in each year (each called a basis period) for the purpose of calculating and paying to the relevant estates the income earned during each basis period from the investment of the Common Fund. [44/2014] (2) The Public Trustee must, no later than the 45th day after the last day of each basis period determined under subsection (1), by notification in the Gazette , specify the income payable to the respective estates for each basis period, expressed as a rate of return on the investment of the Common Fund during that basis period. [44/2014]"
    },
    {
      "provision_ref": "s12A",
      "section": "12A",
      "title": "Manner of calculating and paying income to estates",
      "content": "12A. —(1) The income payable to an estate the moneys of which form part of the Common Fund and which are subject to investment during any part of a basis period, is the total of the prescribed amount for every day in the same basis period in which moneys in the estate are subject to investment. [44/2014] (2) In subsection (1), “prescribed amount”, in relation to any day in a basis period, means where — ( a ) Y is the distributable sum for the basis period; ( b ) V E is the amount of money from the estate which is subject to investment on that day; ( c ) V CF is the amount of money in the Common Fund which is subject to investment on that day; and ( d ) V Agg is the aggregate value of V CF for all days in the basis period in which moneys in the Common Fund are subject to investment. [44/2014] (3) In subsections (1) and (2), moneys are subject to investment if they have been invested, and the investment has not been sold or liquidated. [44/2014] (4) The income payable to an estate which is ascertained in accordance with subsection (1), after rounding down to the nearest cent, must be distributed to the estate no later than the 45th day after the last day of the basis period to which the income relates. [44/2014] (5) Any part of the income which is not distributed as a result of the rounding down under subsection (4) must be carried forward for distribution in the next basis period. [44/2014] (6) In this section — “distributable sum”, in relation to a basis period, means the income earned in the basis period from all investments made on account of the Common Fund, including — ( a ) any transfers from the Reserve Fund which are made or to be made in accordance with rules made for the purposes of section 15A(3), for the purpose of supplementing that distributable sum; and ( b ) any undistributed income carried from the immediately preceding basis period in accordance with subsection (5), less any lawful charges, and any moneys or income which is or is to be transferred and credited to the Reserve Fund under section 15A(4) during the same basis period or before the expiry of the 45th day after the last day of that basis period; “lawful charges” includes — ( a ) any fees chargeable by the Public Trustee upon the receipt of income earned during the basis period in question from investments of the Common Fund; and ( b ) any expenses incurred in the basis period in question by the Public Trustee in respect of the investments of the Common Fund by the Public Trustee. [44/2014]"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Constitution of Investment Board",
      "content": "13. —(1) A board called the Investment Board is established. [44/2014] (2) The members of the Board are — ( a ) a Permanent Secretary to the Ministry of Law, as chairperson; ( b ) the Public Trustee; and ( c ) 3 other persons to be appointed from time to time by the Minister, of whom at least one must be a public officer (called appointed members). [44/2014] (3) The appointed members of the Board hold office for such period and on such terms and conditions as the Minister may determine. [44/2014] (4) Any appointed member of the Board may resign by giving written notice to the Minister. [44/2014] (5) The Minister may at any time revoke the appointment of any appointed member of the Board. [44/2014] (6) If an appointed member of the Board dies, resigns, has his or her appointment revoked by the Minister under subsection (5) or otherwise vacates his or her office before the expiry of the term of his or her appointment, the Minister may appoint any other person to fill the vacancy for so long as the member in whose place that person is appointed would have held office. [44/2014] (7) The chairperson and 2 other members of the Board form a quorum. [44/2014] (8) The Board may make by-laws for the control of its business and proceedings. 14. [ Repealed by Act 44 of 2014 ]"
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Persons not obliged to enquire whether dealing sanctioned",
      "content": "15. No person dealing with the Public Trustee in the matter of the sale or purchase of any investment is under any obligation to enquire whether the sale or purchase has received the Board’s sanction."
    },
    {
      "provision_ref": "s15A",
      "section": "15A",
      "title": "Reserve Fund",
      "content": "15A. —(1) There is to be a fund called the Reserve Fund. [44/2014] (2) Any credit balance at the date immediately before 31 December 2014 in the reserve fund mentioned in section 14(4) of this Act in force immediately before 31 December 2014 is transferred to the Reserve Fund, and constitutes its credit balance on 31 December 2014. [44/2014] (3) The Reserve Fund is to be under the control of the Board and may be dealt with by the Board in such manner as may be prescribed. [44/2014] (4) The following moneys may, with the Board’s sanction, be transferred and credited to the Reserve Fund: ( a ) such capital gains from the disposal of such investment or class or description of investments made on account of the Common Fund as the Board may determine to be reasonable — (i) to meet any possible future shortfall in the Common Fund arising from losses on any investment made on account of the Common Fund; and (ii) to supplement the distributable sum for a basis period mentioned in section 12A in the event that — (A) losses are incurred during the basis period on any investment made on account of the Common Fund; or (B) there is no income earned during the basis period from investments made on account of the Common Fund; ( b ) such amount of the income on such investment of moneys in the Common Fund as the Board may determine, for the purpose of meeting any known or expected shortfall in the Common Fund arising from the disposal of that investment. [44/2014]"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Government guarantee in regard to moneys included in Common Fund",
      "content": "16. —(1) The Consolidated Fund shall be liable to make good any lawful claims on the Common Fund which cannot be met from the Common Fund, whether the claims relate to capital moneys or to income. [44/2014] (2) The capital moneys claimable by any estate include the moneys from the estate included in the Common Fund and, where investments have been taken over under section 10(7), also include the value of those investments as ascertained in accordance with section 10(8). [44/2014]"
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Liability of Consolidated Fund",
      "content": "17. The Consolidated Fund shall be liable to make good all sums required to discharge any liability which the Public Trustee, if he or she were a private trustee, would be personally liable to discharge, except where the liability is one to which neither the Public Trustee nor any of the officers of the Public Trustee has in any way contributed, and which neither the Public Trustee nor any of the officers of the Public Trustee could by the exercise of reasonable diligence have averted, and in that case, neither the Public Trustee nor the Consolidated Fund shall be subject to any liability."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Fees charged by Public Trustee",
      "content": "18. —(1) Such fees, whether by way of percentage or otherwise, as the Minister prescribes, may be charged in respect of the duties of the Public Trustee. (2) Any expenses which might be retained or paid out of the trust property, if the Public Trustee were a private trustee, are to be so retained or paid, and the fees are to be retained or paid in the like manner as and in addition to such expenses. (3) Such fees are to be paid into the Consolidated Fund. (4) The incidence of the fees and expenses under this section as between capital and income are to be determined by the Public Trustee."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Appeal to court from Public Trustee",
      "content": "19. A person aggrieved by any act or omission or decision of the Public Trustee in relation to any trust may apply to the court, and the court may make such order in the matter as the court thinks just."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Mode of action of Public Trustee",
      "content": "20. —(1) The Public Trustee and his or her officers must not act under this Act for reward, except as provided by this Act. Employment of solicitors, bankers, accountants, brokers, etc. (2) The Public Trustee may, subject to the rules made under this Act, employ for the purposes of any trust such solicitors, bankers, accountants and brokers, or other persons as he or she considers necessary. (3) In determining the persons to be so employed in relation to any trust the Public Trustee must have regard to the interests of the trust, but subject to this must, whenever practicable, take into consideration the wishes of the creator of the trust and of the other trustees (if any), and of the beneficiaries, either expressed or as implied by the practice of the creator of the trust, or in the previous management of the trust. (4) Any prescribed person may, on behalf of the Public Trustee, take any oath, make any declaration, verify any account, give personal attendance at any court or place, and do any act or thing which the Public Trustee is required or authorised to take, make, verify, give or do. (5) Where any bond or security would be required from a private person upon the grant of administration to that person, or upon that person’s appointment to act in any capacity, the Public Trustee, if administration is granted to him or her or if he or she is appointed to act in that capacity, is not required to give such bond or security, but is subject to the same liabilities and duties as if he or she had given such bond or security. (6) The entry of the Public Trustee by that name in the books of a company does not constitute notice of a trust, and — ( a ) a company is not entitled to object to the name of the Public Trustee being entered in its books by reason only that the Public Trustee is a corporation; and ( b ) in dealings with property, the fact that the person or one of the persons dealt with is the Public Trustee does not of itself constitute notice of a trust."
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Unclaimed funds to be paid into Consolidated Fund",
      "content": "21. —(1) Where — ( a ) upon the conclusion of the administration of the estate of a person dying testate or intestate, there remain in the hands of the Public Trustee funds that the Public Trustee is unable to dispose of by distribution in accordance with law by reason of the untraceability of the person entitled to give a discharge, or for any other cause; or ( b ) the Public Trustee is unable to conclude the administration of any trust as there is remaining in his or her hands funds that the Public Trustee is unable to dispose of by distribution in accordance with law by reason of the untraceability of the beneficiaries under the trust or for any other cause, the Public Trustee must credit those funds to an account called the Unclaimed Estates Account. (2) The funds credited to the Unclaimed Estates Account under subsection (1) are to be kept in the account for 7 years and, if they remain unclaimed at the end of that period, the funds together with any interest earned thereon are to be paid into the Consolidated Fund. (3) If any claim is made to any part of the funds so transferred to the Consolidated Fund and if the claim is established to the satisfaction of the Public Trustee, the amount certified by the Public Trustee to be due to the claimant must be paid to the claimant, without interest, from the Consolidated Fund."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "Investigation and audit of trust accounts",
      "content": "22. —(1) Subject to rules made under this Act and unless the court orders otherwise, on an application made and notice thereof given in the prescribed manner by any trustee or beneficiary, the condition and accounts of any trust are to be investigated and audited by a solicitor or public accountant agreed on by the applicant and the trustees or, in default of agreement, by the Public Trustee or a person appointed by the Public Trustee. (2) Except with the permission of the court no investigation or audit may be applied for under subsection (1) within 12 months after any such previous investigation or audit, and a trustee or beneficiary must not be appointed under this section to make an investigation or audit. [Act 25 of 2021 wef 01/04/2022] Access of auditor to books (3) The person making the investigation or audit (called the auditor) has a right of access to the books, accounts and vouchers of the trustees, and to any securities and documents of title held by them on account of the trust, and may require from them such information and explanation as are necessary for the performance of the auditor’s duties. (4) Upon the completion of the investigation and audit, the auditor must forward to the applicant and every trustee — ( a ) a copy of the accounts, together with a report thereon; and ( b ) a certificate signed by the auditor to the effect (as the case may be) that the accounts exhibit a true view of the state of the affairs of the trust and that the securities of the trust fund investments have been produced to and verified by the auditor, or that the accounts are deficient in such respects as are specified in the certificate. Inspection by beneficiaries (5) Every beneficiary under the trust is, subject to rules made under this Act, entitled at all reasonable times to inspect and take copies of the accounts, report and certificate, and, at his or her own expense, to be furnished with copies thereof or extracts therefrom. Removal of auditor (6) The auditor may be removed by order of the court, and, if any auditor is removed, or resigns, or dies, or becomes bankrupt or incapable of acting before the investigation and audit is completed, a new auditor may be appointed in the auditor’s place in like manner as the original auditor. Remuneration and expenses of auditor (7) The auditor’s remuneration and the other expenses of the investigation and audit are such as are prescribed and, unless the Public Trustee directs otherwise, are to be borne by the estate. (8) In the event of the Public Trustee so directing, he or she may order such expenses to be borne by the applicant or by the trustees personally or partly by them and partly by the applicant. (9) If any person having the custody of any documents to which the auditor has a right of access under this section fails or refuses to allow the auditor to have access thereto or in any way obstructs the investigation or audit, the auditor may apply to the court, and thereupon the court may make such order as it thinks fit. Penalty (10) Any person who wilfully makes, in any statement of accounts, report or certificate required for the purposes of this section, a statement that is false in any material particular shall be guilty of an offence and shall be liable on conviction to a fine or to imprisonment for a term not exceeding 2 years or to both."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Rules",
      "content": "23. —(1) The Minister may make rules for carrying into effect the objects of this Act, and in particular for all or any of the following purposes: ( a ) establishing the office of Public Trustee and prescribing the trusts or duties the Public Trustee is authorised to accept or undertake, and the security (if any), to be given by the Public Trustee and his or her officers; ( b ) the transfer to and from the Public Trustee of any property; ( c ) the accounts to be kept and an audit thereof; ( d ) the establishment and regulation of any branch office; ( e ) excluding any trusts from the operation of this Act or any part thereof; ( f ) the form and manner in which notices under this Act are to be given; ( g ) the payment of interest and income from investments; ( h ) the date from which interest, if allowed, is to be paid; ( i ) the management, investment and disposal of the Reserve Fund; ( j ) generally to carry out the provisions of sections 10 to 16; ( k ) the manner of authorisation of an agent by the Public Trustee under section 4(9) and the powers and duties of the agent. [44/2014] (2) All rules made under this section must be presented to Parliament as soon as possible after publication in the Gazette . [9/2003]"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Investment Board mentioned in section 13;",
      "source_provision": "s2"
    },
    {
      "term": "Common Fund",
      "definition": "“Common Fund” means the Common Fund mentioned in section 10;",
      "source_provision": "s2"
    },
    {
      "term": "expenses",
      "definition": "“expenses” includes costs and charges;",
      "source_provision": "s2"
    },
    {
      "term": "letters of administration",
      "definition": "“letters of administration” means letters of administration of the estate and effects of a deceased person, whether general or with a will annexed, or limited either in time or otherwise;",
      "source_provision": "s2"
    },
    {
      "term": "private trustee",
      "definition": "“private trustee” means a trustee other than the Public Trustee;",
      "source_provision": "s2"
    },
    {
      "term": "Reserve Fund",
      "definition": "“Reserve Fund” means the fund established under section 15A;",
      "source_provision": "s2"
    },
    {
      "term": "trust",
      "definition": "“trust” includes an executorship or administratorship, and “trustee” is to be construed accordingly;",
      "source_provision": "s2"
    },
    {
      "term": "trust property",
      "definition": "“trust property” includes all property in the possession or under the control wholly or partly of the Public Trustee by virtue of any trust. [44/2014]",
      "source_provision": "s2"
    },
    {
      "term": "distributable sum",
      "definition": "“distributable sum” , in relation to a basis period, means the income earned in the basis period from all investments made on account of the Common Fund, including — ( a )",
      "source_provision": "s12A"
    },
    {
      "term": "lawful charges",
      "definition": "“lawful charges” includes — ( a )",
      "source_provision": "s12A"
    }
  ]
}