{
  "id": "rca-1949",
  "type": "statute",
  "title": "Registration of Criminals Act 1949",
  "title_en": "Registration of Criminals Act 1949",
  "short_name": "RCA1949",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/RCA1949",
  "description": "An Act to provide for the registration of criminals.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Registration of Criminals Act 1949."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “authorised officer” means — ( a ) a police officer; ( b ) an officer of customs of the Singapore Customs in any case concerning an offence or alleged offence against any law or provision of law which is the function of the Singapore Customs to enforce; ( c ) an immigration officer; ( ca ) a forensic specialist acting in accordance with an authorisation under section 65B(1) of the Police Force Act 2004 to exercise a power under this Act; ( d ) an officer of any law enforcement agency in any case concerning an offence or alleged offence against any law or provision of law which it is the function of that agency to enforce; and ( e ) any other person who is duly appointed in writing by the Commissioner of Police as an authorised officer for the purposes of this Act or any provision of this Act; “body sample” means — ( a ) a sample of blood; ( b ) a sample of head hair, including the roots of the head hair; ( c ) a swab taken from an individual’s mouth; or ( d ) any other sample that is prescribed under subsection (2); [Act 26 of 2022 wef 12/06/2023] [ Deleted by Act 26 of 2022 wef 12/06/2023 ] “DNA” means deoxyribonucleic acid; “DNA database” means the database maintained under section 31; [Act 26 of 2022 wef 12/06/2023] “DNA information” means genetic information derived from the forensic DNA analysis of a body sample; “DNA officer” means an individual who is qualified and authorised under section 18(1) to take body samples; [Act 26 of 2022 wef 12/06/2023] “eligible crime” means any offence that is, at the time of the commission of the offence — ( a ) punishable by imprisonment; ( b ) not a registrable crime; and ( c ) not compoundable under any written law (unless the offence is specified in the third column of the Fourth Schedule to the Criminal Procedure Code 2010); [Act 26 of 2022 wef 12/06/2023] “finger impression” includes palmar impressions, hand prints, finger prints, foot prints or toe prints; “forensic procedure”, in relation to an individual, includes doing one or all of the following in relation to the individual: ( a ) taking an impression or cast of a wound from the external parts of the individual’s body other than the parts referred to in subsection (3); [Act 26 of 2022 wef 12/06/2023] ( b ) the taking of physical measurements (whether or not involving marking) for biomechanical analysis of an external part of the body other than the parts referred to in subsection (3); [Act 26 of 2022 wef 12/06/2023] ( c ) removing any article that the individual is wearing, and searching any article so removed; ( d ) removing a relevant thing attached physically to those external parts of the individual’s body or taking a sample of that relevant thing; ( e ) photographing any relevant thing in the position it is found on the external parts of the individual’s body, or in the individual’s mouth; “forensic specialist” means an individual who is appointed under section 65A of the Police Force Act 2004 as a forensic specialist; “identification database” means the database maintained under section 29; [Act 26 of 2022 wef 12/06/2023] “identifying information”, in relation to an individual, means all of the following information: ( a ) any description of the individual, including — (i) the individual’s sex; (ii) the individual’s age or apparent age; (iii) the individual’s bodily appearance; and (iv) the individual’s height; ( b ) any document that contains information that identifies the individual; ( c ) any finger impression of the individual; ( d ) any name of the individual or any name by which the individual is or is believed to have been known; ( e ) any photograph of the individual; [Act 26 of 2022 wef 12/06/2023] “law enforcement agency” means any body or organisation which is prescribed by the Minister to be a law enforcement agency for the purposes of this Act; “other particulars”, in relation to an individual, means any particulars, information or description of that individual, other than his or her identifying information, that may be relevant or useful in the identification of that individual; [Act 26 of 2022 wef 12/06/2023] “photograph”, in relation to an individual, includes the photograph of any distinguishing feature or mark on the body of that individual; [Act 26 of 2022 wef 12/06/2023] “principal registration area” means Singapore and Malaysia; “register” means the register of criminals maintained in accordance with section 4; [ Deleted by Act 26 of 2022 wef 12/06/2023 ] “registrable crime” means any offence included for the time being in the First Schedule; [Act 26 of 2022 wef 12/06/2023] “registrable particulars”, in relation to an individual, means — ( a ) the individual’s identifying information; ( b ) any record of any other particulars about the individual that has been made under section 9(2)( b )(iii), 10(2)( a )(ii)(C) or 11(4)( a )(ii)(C) or (6)( b )(iii); ( c ) the particulars of — (i) any conviction for a registrable crime; (ii) any sentence or order for that conviction; or (iii) any order of banishment, deportation, expulsion or removal, in respect of the individual; and ( d ) any particulars of any charge for an offence (whether or not a registrable crime) that was taken into consideration in determining and passing sentence on the conviction for the registrable crime; [Act 26 of 2022 wef 12/06/2023] “Registrar” means the Registrar of Criminals appointed under section 3, and includes an Assistant Registrar of Criminals; [Act 26 of 2022 wef 12/06/2023] “Reviewing Tribunal” means a Reviewing Tribunal established by section 41; [Act 26 of 2022 wef 12/06/2023] “volunteer” means an individual who voluntarily gives his or her consent under section 14 or 23 for the taking of any identifying information or body sample (as the case may be) from him or her. [45/2002; 4/2003; 10/2015] [Act 26 of 2022 wef 12/06/2023] (2) Subject to subsection (3), the Minister may prescribe any additional type of sample of or from an individual’s body that may be taken under this Act. [Act 26 of 2022 wef 12/06/2023] (3) The additional type of sample that may be prescribed under subsection (2) must not include body samples to be obtained from — ( a ) an individual’s genital or anal region; ( b ) an individual’s body orifice other than the mouth; or ( c ) the breasts of a woman. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Appointment of Registrar of Criminals and Assistant Registrars",
      "content": "3. —(1) The President may appoint a Registrar of Criminals and such Assistant Registrars as he or she may consider necessary for the purposes of this Act. (2) The President may, with the concurrence of the government of Malaysia, appoint an officer in the service of that government to be a Registrar of Criminals or an Assistant Registrar for the purposes of this Act."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - REGISTRATION OF CRIMINALS",
      "section": "4",
      "title": "Register of criminals",
      "content": "4. —(1) The Registrar must maintain a register of criminals in which must be recorded the following information and records: ( a ) the registrable particulars of an individual convicted of a registrable crime that are — (i) sent to the Registrar under section 10(3) or 11(7); or (ii) recorded in the register under section 30(2)( b ); ( b ) the registrable particulars — (i) of an individual ordered to be banished, deported or expelled and under detention in any prison or reformative training centre, that are sent to the Registrar under section 11(7) or 12; or (ii) of an individual ordered to be removed from Singapore under the Immigration Act 1959 and under detention in any immigration depot, police station, prison or other place appointed by the Controller of Immigration mentioned in section 34(4) of that Act, that are sent to the Registrar under section 11(8); ( c ) the registrable particulars of an individual — (i) convicted of any offence committed within, and registrable under the law of, Malaysia; or (ii) ordered to be banished, deported or expelled from Malaysia, sent to the Registrar by any officer of Malaysia who is authorised by the law of that territory to send the registrable particulars for registration; ( d ) the registrable particulars of an individual — (i) convicted of any offence in, or banished, deported or expelled from, any place outside the principal registration area; and (ii) whose registration is approved under section 5, sent to the Registrar by the officer in charge of any criminal records, register of criminals or prison in the place outside the principal registration area. [Act 26 of 2022 wef 12/06/2023] (2) The register must be kept at the place or places within or without Singapore and in the manner that the Minister may direct."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - REGISTRATION OF CRIMINALS",
      "section": "5",
      "title": "Registration of persons convicted in or banished from places outside principal registration area",
      "content": "5. —(1) The Minister may approve the registration under this Act of any individual convicted of any offence in, or banished, deported or expelled from, any place outside the principal registration area in respect of whom any registrable particulars are furnished to the Registrar by the officer in charge of any criminal records, register of criminals or prison in that place. [Act 26 of 2022 wef 12/06/2023] (2) Any approval given under this section may be either general, in respect of any place or of any class of case, or special in respect of a particular case. (3) Every general approval given under this section must be signified by notification in the Gazette . 6. [ Repealed by Act 26 of 2022 wef 12/06/2023 ] 7. [ Repealed by Act 26 of 2022 wef 12/06/2023 ]"
    },
    {
      "provision_ref": "s7A",
      "chapter": "PART 2A - SPENT CRIMINAL RECORDS",
      "section": "7A",
      "title": "Interpretation and application of this Part",
      "content": "7A. —(1) In this Part, unless the context otherwise requires — “criminal record”, in relation to an individual, means the record which is kept in the register before, on or after 17 October 2005 of his or her conviction for — ( a ) any registrable crime within Singapore; or [Act 26 of 2022 wef 12/06/2023] ( b ) any offence outside Singapore registrable under this Act, and the registrable particulars related thereto; [Act 26 of 2022 wef 12/06/2023] “term of imprisonment” does not include a term of imprisonment imposed by a court in default of payment of a fine or penalty. [20/2005] (2) For the purposes of this Part, an individual who is subject to a home detention order under section 52 of the Prisons Act 1933 is deemed to be in legal custody. [20/2005] [Act 26 of 2022 wef 12/06/2023] (3) This Part binds the Government. [20/2005]"
    },
    {
      "provision_ref": "s7B",
      "chapter": "PART 2A - SPENT CRIMINAL RECORDS",
      "section": "7B",
      "title": "Criminal record of Singapore registrable crime may become spent",
      "content": "7B. —(1) Subject to section 7C, all records in the register of any individual convicted within Singapore of any registrable crime shall be capable of becoming spent in accordance with this Part, whether the conviction is before, on or after 17 October 2005. [20/2005] [Act 26 of 2022 wef 12/06/2023] (2) The record in the register of an individual’s conviction within Singapore for a registrable crime becomes spent on the expiration of the crime‑free period applicable to the individual, unless he or she is disqualified under section 7C. [20/2005] [Act 26 of 2022 wef 12/06/2023] (3) A record of an individual’s conviction that is spent in accordance with this section is not revived by the subsequent conviction of the individual for any offence after the crime‑free period. [20/2005] [Act 26 of 2022 wef 12/06/2023] (4) In this section — “crime-free period” means a period of not less than 5 consecutive years starting from the relevant date applicable to an individual, during which the individual — ( a ) has not been convicted of a registrable crime; [Act 26 of 2022 wef 12/06/2023] ( b ) has not been unlawfully at large in relation to any registrable crime; [Act 26 of 2022 wef 12/06/2023] ( c ) has not been detained or subject to police supervision under section 30(1) of the Criminal Law (Temporary Provisions) Act 1955; and ( d ) has not been subject to a supervision order or admitted to an approved institution under the Misuse of Drugs Act 1973 or admitted to an approved centre under the Intoxicating Substances Act 1987; [Act 26 of 2022 wef 12/06/2023] “relevant date”, in relation to an individual, means — ( a ) where the sentence of the individual does not include a term of imprisonment and is no longer subject to appeal, the date on which the sentence was passed; [Act 26 of 2022 wef 12/06/2023] ( b ) where the sentence of the individual includes a term of imprisonment and is no longer subject to appeal, the date of his or her release from legal custody; or [Act 26 of 2022 wef 12/06/2023] ( c ) where a sentence of imprisonment has been wholly remitted or commuted to or substituted with a sentence other than a term of imprisonment, the date of that remission, commutation or substituted sentence, as the case may be. [20/2005; 12/2018] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s7C",
      "chapter": "PART 2A - SPENT CRIMINAL RECORDS",
      "section": "7C",
      "title": "Individual disqualified from having criminal record become spent",
      "content": "7C. An individual is disqualified from having the record in the register of his or her conviction becoming spent under section 7B if — ( a ) that conviction was for any offence specified in the Third Schedule; ( b ) the sentence imposed on him or her for that conviction included — (i) a term of imprisonment exceeding 3 months; or (ii) a fine exceeding $2,000; ( c ) that conviction was for a registrable crime committed within 5 years after he or she had been released from — (i) an approved institution under the Misuse of Drugs Act 1973; or (ii) an approved centre under the Intoxicating Substances Act 1987; [Act 26 of 2022 wef 12/06/2023] ( d ) he or she has been detained or subject to police supervision under section 30(1) of the Criminal Law (Temporary Provisions) Act 1955 at any time before that conviction; ( e ) for the time being, he or she has a warrant of arrest for any offence issued against him or her which remains unexecuted; ( f ) he or she has records in the register of more than one conviction, whether or not those convictions arise from the same particular occasion; or ( g ) he or she has had any previous record in the register of any of his or her convictions become spent under section 7B or treated as spent under section 7D. [20/2005; 12/2018] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s7D",
      "chapter": "PART 2A - SPENT CRIMINAL RECORDS",
      "section": "7D",
      "title": "Application by disqualified individual to have criminal record treated as spent",
      "content": "7D. —(1) An individual who is disqualified under section 7C from having the record in the register of his or her conviction within Singapore for any registrable crime becoming spent may, at any time, apply to the Commissioner of Police to have the record treated as spent. [20/2005] [Act 26 of 2022 wef 12/06/2023] (2) An application by any individual under subsection (1) must be in such form and be accompanied by such documents, particulars and information as the Commissioner of Police may require. [20/2005] [Act 26 of 2022 wef 12/06/2023] (3) Upon receiving an application under subsection (1), the Commissioner of Police may — ( a ) refuse to grant the application; or ( b ) grant the application. [20/2005] (4) In determining whether to grant an application to treat the record in the register of the applicant’s conviction as spent, the Commissioner of Police must have regard to the circumstances of the case, including the following factors: ( a ) the severity of the conviction for which the record is to be spent; ( b ) the severity of the sentence imposed for that conviction; ( c ) the applicant’s conduct subsequent to the conviction. [20/2005] (5) Where any document, particular or information given under subsection (2) is false in a material particular, the Commissioner of Police may, after giving the individual concerned a reasonable opportunity to be heard (orally or in writing), revoke his or her grant of the application to treat the record in the register of the individual’s conviction as spent, and the Registrar must, without delay, expunge any entry made under section 7E(1)( b ) in respect of that record. [20/2005] [Act 26 of 2022 wef 12/06/2023] (6) Nothing in this section is to be construed to prevent the prosecution, conviction and punishment of any individual according to the provisions of any other written law for the time being in force. [20/2005] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s7DA",
      "chapter": "PART 2A - SPENT CRIMINAL RECORDS",
      "section": "7DA",
      "title": "Criminal record rendered spent when community sentence completed",
      "content": "7DA. —(1) Despite any provision in this Part, the record in the register of an individual’s conviction within Singapore for a registrable crime for which a community sentence (as defined in section 336 of the Criminal Procedure Code 2010) is passed by a court becomes spent on the date on which the community sentence is completed. [15/2010; 30/2019] [Act 26 of 2022 wef 12/06/2023] (2) In addition, where a child or young person (as defined by section 2(1) of the Children and Young Persons Act 1993) is the subject of an order of a Youth Court mentioned in section 49(1)( e ), ( f ), ( g ), ( h ), ( i ) or ( j ) of that Act because of a registrable crime, then despite any provision in this Part, the criminal record in the register relating to that registrable crime becomes spent — ( a ) at the end of any period of supervision or detention specified in the order; ( b ) on the day after the community sentence specified in the order is completed; or ( c ) on the day after the fine, damages or costs ordered to be paid are paid. [30/2019] [S 23/2025] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s7E",
      "chapter": "PART 2A - SPENT CRIMINAL RECORDS",
      "section": "7E",
      "title": "Consequences of criminal record becoming or treated as spent",
      "content": "7E. —(1) Subject to subsection (2), if the record of an individual’s conviction in the register is spent or is treated as spent under this Part — ( a ) the individual is deemed to have no record of that conviction, and it is lawful for him or her to answer a question asked of him or her on or after 17 October 2005 about his or her criminal record or to disclose information about his or her criminal record in the manner as if he or she had no record of that conviction; [Act 26 of 2022 wef 12/06/2023] ( b ) the Registrar must, without delay, make an entry in the register to show that the record of that conviction is spent; and ( c ) any reference in any agreement or other document made on or after 17 October 2005 to the individual’s criminal record is taken not to refer to the conviction the record of which is so spent, but to refer only to any of the individual’s convictions the records of which are not so spent. [20/2005] [Act 26 of 2022 wef 12/06/2023] (2) Subsection (1)( a ) and ( c ) does not apply in relation to — ( a ) any investigation into an offence by a person authorised under any written law to carry out such investigation; ( b ) any prosecution against the individual for any offence; [Act 26 of 2022 wef 12/06/2023] ( c ) any proceedings before a court, including the giving of evidence, or any decision by a court, including any decision as to sentence; and ( d ) any application by an individual for an appointment to or employment in any office, or for admission to any profession or vocation, from which the individual may be disqualified under any written law by reason of his or her conviction. [20/2005] [Act 26 of 2022 wef 12/06/2023] (3) Despite subsection (2), subsection (1)( a ) and ( c ) applies in respect of the matters mentioned in subsection (2)( a ), ( b ), ( c ) and ( d ) where the individual in question is a child or young person as defined in section 2(1) of the Children and Young Persons Act 1993. [30/2019] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s7F",
      "chapter": "PART 2A - SPENT CRIMINAL RECORDS",
      "section": "7F",
      "title": "Reference to criminal record not to include record of offence not kept in register",
      "content": "7F. —(1) Where an individual has been convicted of any offence the record of which is not kept in the register, it is lawful for the individual — ( a ) to answer any question asked of him or her on or after 17 October 2005 about his or her criminal record of any conviction (whether or not kept in the register) in the manner as if the question relates only to his or her criminal record defined under section 7A(1); and ( b ) not to disclose any information about any record of a conviction which is not kept in the register. [20/2005] [Act 26 of 2022 wef 12/06/2023] (2) Any reference in any agreement or other document made on or after 17 October 2005 to the criminal record of any conviction (whether or not kept in the register) of an individual to which this section applies, is taken to refer only to his or her criminal record defined under section 7A(1), and not to any record of a conviction which is not kept in the register. [20/2005] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "8",
      "title": "Interpretation of this Part",
      "content": "8. In this Part, unless the context otherwise requires — “appropriate consent” means — ( a ) in relation to an individual who has attained 16 years of age — the written consent of the individual; ( b ) in relation to an individual who has not attained 16 years of age but has attained 14 years of age — the written consent of both the individual and the individual’s parent or guardian; and ( c ) in relation to an individual who has not attained 14 years of age — the written consent of the individual’s parent or guardian, given to an authorised officer after the individual concerned or the individual’s parent or guardian (as the case may be) has been informed by the authorised officer of the purpose for which and the manner by which any identifying information or a body sample is to be taken from the individual; “authorised analyst” means — ( a ) a forensic specialist; or ( b ) a person appointed by the Commissioner of Police to be an analyst for the purposes of this Part; “invasive sample” means any body sample that is obtained by means of any invasive procedure and includes a sample of blood; “registered medical practitioner” means a medical practitioner registered under the Medical Registration Act 1997 and includes a dentist registered under the Dental Registration Act 1999 or any corresponding previous written law. [Act 26 of 2022 wef 12/06/2023] Division 2 &#x2014; Taking of identifying information"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "9",
      "title": "Taking identifying information from accused individuals",
      "content": "9. —(1) This section applies to or in relation to an individual who — ( a ) is accused of an eligible crime or a registrable crime; and ( b ) is either — (i) under arrest or in lawful custody; or (ii) released on bail or personal bond, whether or not by a court. (2) An authorised officer may do any one or more of the following: ( a ) take or cause to be taken the finger impressions and photographs of the individual; ( b ) make or cause to be made a record of — (i) any other identifying information of the individual that the authorised officer thinks necessary; (ii) the particulars of the eligible crime or registrable crime that the individual is accused of; or (iii) any other particulars about the individual that the authorised officer thinks necessary; ( c ) subject to section 15, carry out any forensic procedure for the purpose of paragraph ( a ) or ( b ). (3) The authorised officer must send a copy of all identifying information and records taken or made under subsection (2) to the Registrar for identification and report. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "10",
      "title": "Taking identifying information from individuals convicted of eligible crime or registrable crime",
      "content": "10. —(1) When an individual is convicted of an eligible crime, the authorised officer in charge of the case may do any one or more of the following: ( a ) take or cause to be taken the finger impressions and photographs of the individual; ( b ) make or cause to be made a record of — (i) any other identifying information of the individual that the authorised officer thinks necessary; (ii) the particulars of the conviction and the sentence or order in respect of the individual; or (iii) any other particulars about the individual that the authorised officer thinks necessary; ( c ) subject to section 15, carry out any forensic procedure for the purpose of paragraph ( a ) or ( b ). (2) When an individual is convicted of a registrable crime, the authorised officer in charge of the case — ( a ) must do all of the following: (i) take or cause to be taken the finger impressions and photographs of the individual; (ii) make or cause to be made a record of — (A) all other identifying information of the individual; (B) the particulars of the conviction and the sentence or order in respect of the individual; and (C) any other particulars about the individual that the authorised officer thinks necessary; and ( b ) subject to section 15, may carry out any forensic procedure for the purpose of paragraph ( a ). (3) The authorised officer in charge of a case must send a copy of all identifying information and records taken or made under subsection (1) or (2) to the Registrar for identification and report. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "11",
      "title": "Taking identifying information from prisoners, etc.",
      "content": "11. —(1) Subsection (2) applies to or in relation to an individual who is — ( a ) convicted of an eligible crime; and ( b ) under detention in any prison or reformative training centre. (2) The Superintendent of the prison or reformative training centre may do any one or more of the following: ( a ) take or cause to be taken the finger impressions and photographs of the individual; ( b ) make or cause to be made a record of — (i) any other identifying information of the individual that the Superintendent thinks necessary; (ii) the particulars of the conviction and the sentence or order in respect of the individual; or (iii) any other particulars about the individual that the Superintendent thinks necessary; ( c ) subject to section 15, carry out any forensic procedure for the purpose of paragraph ( a ) or ( b ). (3) Subsection (4) applies to or in relation to an individual who is — ( a ) convicted of a registrable crime or ordered to be banished, deported or expelled; and ( b ) under detention in any prison or reformative training centre. (4) The Superintendent of the prison or reformative training centre — ( a ) must do all of the following: (i) take or cause to be taken the finger impressions and photographs of the individual; (ii) make or cause to be made a record of — (A) all other identifying information of the individual; (B) the particulars of the conviction and the sentence or order, or the order of banishment, deportation or expulsion, in respect of the individual; and (C) any other particulars about the individual that the Superintendent thinks necessary; and ( b ) subject to section 15, may carry out any forensic procedure for the purpose of paragraph ( a ). (5) Subsection (6) applies to or in relation to an individual who is — ( a ) ordered to be removed from Singapore under the Immigration Act 1959; and ( b ) under detention in any immigration depot, police station, prison or other place appointed by the Controller of Immigration mentioned in section 34(4) of the Immigration Act 1959. (6) An authorised officer may do any one or more of the following: ( a ) take or cause to be taken the finger impressions and photographs of the individual; ( b ) make or cause to be made a record of — (i) any other identifying information of the individual that the authorised officer thinks necessary; (ii) the particulars of the order of removal; or (iii) any other particulars about the individual that the authorised officer thinks necessary; ( c ) subject to section 15, carry out any forensic procedure for the purpose of paragraph ( a ) or ( b ). (7) The Superintendent must send any number of copies (that the Registrar requires) of all identifying information and records taken or made under subsection (2) or (4) to the Registrar for identification and report. (8) The authorised officer must send a copy of all identifying information and records taken or made under subsection (6) to the Registrar for identification and report. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "12",
      "title": "Particulars of removal of banishee",
      "content": "12. —(1) When an individual is removed from Singapore or from any part of Singapore in execution of an order of banishment, deportation or expulsion, the police officer responsible for the execution of the order — ( a ) must take or cause to be taken a thumb impression of the individual on — (i) the warrant of execution; or (ii) if no warrant of execution has been issued — the order of banishment, deportation or expulsion; ( b ) subject to section 15, may carry out any forensic procedure for the purpose of paragraph ( a ); ( c ) must endorse the particulars of the date, place and manner of removal on — (i) the warrant of execution; or (ii) if no warrant of execution has been issued — the order of banishment, deportation or expulsion; ( d ) must authenticate the endorsement mentioned in paragraph ( c ) with the police officer’s signature; and ( e ) must return the warrant of execution or order of banishment, deportation or expulsion, that has been endorsed and authenticated according to paragraphs ( c ) and ( d ), to the Minister. (2) The Minister must cause every warrant of execution or order of banishment, deportation or expulsion that is returned to him or her under subsection (1)( e ) to be sent as soon as possible to the Registrar. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "13",
      "title": "Taking identifying information from individuals arrested, etc., under Internal Security Act 1960",
      "content": "13. —(1) Subsection (2) applies to an individual who is — ( a ) arrested and detained pending enquiries under section 74 of the Internal Security Act 1960; ( b ) detained in a place of detention pursuant to — (i) an order made under section 8(1)( a ) of the Internal Security Act 1960; or (ii) a direction given under section 8(2) of the Internal Security Act 1960; or ( c ) served with an order made under section 8(1)( b ) of the Internal Security Act 1960. (2) An authorised officer may do any one or more of the following: ( a ) take or cause to be taken the finger impressions and photographs of the individual; ( b ) make or cause to be made a record of — (i) any other identifying information of the individual that the authorised officer thinks necessary; (ii) the particulars of the arrest, order or direction under the Internal Security Act 1960; or (iii) any other particulars about the individual that the authorised officer thinks necessary; ( c ) subject to section 15, carry out any forensic procedure for the purpose of paragraph ( a ) or ( b ). (3) The authorised officer must send a copy of all identifying information and records taken or made under subsection (2) to the Registrar for identification and report. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "14",
      "title": "Taking identifying information from volunteers",
      "content": "14. —(1) Subject to subsection (2), an authorised officer may do any one or more of the following: ( a ) take or cause to be taken the finger impressions and photographs of a volunteer; ( b ) make or cause to be made a record of any other identifying information of a volunteer that the authorised officer thinks necessary; ( c ) subject to section 15, carry out any forensic procedure for the purpose of paragraph ( a ) or ( b ), if the appropriate consent is given for the taking of the identifying information. (2) Despite subsection (1), an authorised officer may, without the appropriate consent, do anything mentioned in subsection (1) in relation to a volunteer below 16 years of age, if — ( a ) the consent of the parent or guardian of the volunteer is refused without good cause or cannot be obtained despite all reasonable efforts; ( b ) the volunteer is still willing to give the identifying information; and ( c ) a Magistrate sanctions the taking of the identifying information. (3) The authorised officer must send a copy of all identifying information and records of the identifying information taken or made under subsection (1) or (2) to the Registrar for identification and report. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "15",
      "title": "Only forensic specialists may carry out forensic procedure to take identifying information",
      "content": "15. An authorised officer or the Superintendent of a prison or reformative training centre must not carry out a forensic procedure to do anything mentioned in section 9(2), 10(1) or (2), 11(2), (4) or (6), 12(1)( a ), 13(2) or 14(1) or (2) unless the authorised officer or Superintendent is a forensic specialist. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "16",
      "title": "Offence for refusal to submit to taking identifying information, etc.",
      "content": "16. —(1) This section applies to an individual mentioned in section 9(1), 10(1) or (2), 11(1), (3) or (5), 12(1) or 13(1). (2) An individual mentioned in subsection (1) commits an offence if the individual, without reasonable excuse — ( a ) refuses to submit to — (i) the taking of his or her finger impressions or photographs; or (ii) any forensic procedure carried out, for the purposes of obtaining the individual’s identifying information, by an authorised officer or the Superintendent of a prison or reformative training centre, who is a forensic specialist; ( b ) refuses to provide any of the individual’s identifying information or other particulars when lawfully required to do so by an authorised officer or the Superintendent of a prison or reformative training centre, as the case may be; or ( c ) otherwise hinders or obstructs the taking of any finger impression, photograph or other identifying information from him or her. (3) An individual commits an offence under subsection (2) regardless of whether the individual’s finger impressions, photographs or other identifying information was obtained by reasonable force under section 17. (4) An individual who is guilty of an offence under subsection (2) shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding one month or to both. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "17",
      "title": "Reasonable force to take finger impressions, photographs, etc.",
      "content": "17. —(1) This section applies to an individual mentioned in section 9(1), 10(1) or (2), 11(1), (3) or (5), 12(1) or 13(1) who refuses to submit to — ( a ) the taking of his or her finger impressions or photographs; or ( b ) any forensic procedure carried out, for the purposes of obtaining the individual’s identifying information, by an authorised officer or the Superintendent of a prison or reformative training centre, who is a forensic specialist. (2) The authorised officer or Superintendent of the prison or reformative training centre (as the case may be) may, with such assistance as is required, use any force that is reasonably necessary for the purposes of taking the finger impressions or photographs of that individual or carrying out the forensic procedure, as the case may be. [Act 26 of 2022 wef 12/06/2023] Division 3 &#x2014; Taking of DNA information"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "18",
      "title": "Who may take body samples",
      "content": "18. —(1) For the purposes of this Division, any of the following persons (each called in this Act a DNA officer) may take a body sample for forensic DNA analysis: ( a ) a registered medical practitioner; ( b ) an authorised officer who has received training for that purpose; ( c ) a suitably qualified or trained individual who is authorised by the Commissioner of Police for the purpose. (2) Before taking any body sample, a DNA officer must satisfy himself or herself that the taking of the body sample does not endanger the individual. (3) The DNA officer who takes a body sample must record the fact that the body sample has been taken, in the form and manner required by the Commissioner of Police. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "19",
      "title": "Taking body samples from accused individuals",
      "content": "19. —(1) Subsection (2) applies to or in relation to an individual who is — ( a ) accused of an eligible crime or a registrable crime; and ( b ) either — (i) under arrest or in lawful custody; or (ii) released on bail or personal bond, whether or not by a court. (2) Subject to section 24, a DNA officer may take a body sample from the individual mentioned in subsection (1) for forensic DNA analysis. (3) The DNA officer must send any body sample taken under subsection (2) to an authorised analyst for forensic DNA analysis. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "20",
      "title": "Taking body samples from individuals convicted of eligible crime or registrable crime",
      "content": "20. —(1) Subject to section 24, when an individual is convicted of an eligible crime or a registrable crime, a DNA officer may take a body sample from the individual for forensic DNA analysis. (2) The DNA officer must send any body sample taken under subsection (1) to an authorised analyst for forensic DNA analysis. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "21",
      "title": "Taking body samples from prisoners, etc.",
      "content": "21. —(1) Subsection (2) applies to or in relation to any of the following individuals: ( a ) an individual who is — (i) convicted of an eligible crime or a registrable crime, or ordered to be banished, deported or expelled; and (ii) under detention in any prison or reformative training centre; ( b ) an individual who is — (i) ordered to be removed from Singapore under the Immigration Act 1959; and (ii) under detention in an immigration depot, police station, prison or other place appointed by the Controller of Immigration mentioned in section 34(4) of the Immigration Act 1959. (2) Subject to section 24, a DNA officer may take a body sample from the individual mentioned in subsection (1) for forensic DNA analysis. (3) The DNA officer must send any body sample taken under subsection (2) to an authorised analyst for forensic DNA analysis. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "22",
      "title": "Taking body samples from individuals arrested, etc., under Internal Security Act 1960",
      "content": "22. —(1) Subsection (2) applies to or in relation to an individual who is — ( a ) arrested and detained pending enquiries under section 74 of the Internal Security Act 1960; ( b ) detained in a place of detention pursuant to — (i) an order made under section 8(1)( a ) of the Internal Security Act 1960; or (ii) a direction given under section 8(2) of the Internal Security Act 1960; or ( c ) served with an order made under section 8(1)( b ) of the Internal Security Act 1960. (2) Subject to section 24, a DNA officer may take a body sample from the individual mentioned in subsection (1) for forensic DNA analysis. (3) The DNA officer must send any body sample taken under subsection (2) to an authorised analyst for forensic DNA analysis. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "23",
      "title": "Taking body samples from volunteers",
      "content": "23. —(1) Subject to section 26, a DNA officer may take a body sample for forensic DNA analysis from an individual who voluntarily consents to the body sample being taken. (2) The DNA officer must send any body sample taken under subsection (1) to an authorised analyst for forensic DNA analysis. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "24",
      "title": "Appropriate consent for taking invasive samples under section 19, 20, 21 or 22",
      "content": "24. An invasive sample must not be taken from an individual under section 19, 20, 21 or 22 unless the appropriate consent is given for the taking of the invasive sample. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "25",
      "title": "Reasonable force to take body samples other than invasive samples",
      "content": "25. If an individual mentioned in section 19(1), 20(1), 21(1) or 22(1) — ( a ) refuses to give a body sample that is not an invasive sample; ( b ) refuses to allow a body sample that is not an invasive sample to be taken from him or her; or ( c ) otherwise hinders or obstructs the taking of a body sample that is not an invasive sample from him or her, a DNA officer may, with such assistance as is required, use such force as is reasonably necessary for the purpose of taking that body sample. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "26",
      "title": "Appropriate consent for taking body samples from volunteers",
      "content": "26. —(1) Subject to subsection (2), a body sample must not be taken from a volunteer under section 23 unless the appropriate consent is given for the taking of the body sample. (2) Despite subsection (1), a DNA officer may take a body sample for forensic DNA analysis from a volunteer below 16 years of age without the appropriate consent if — ( a ) the consent of the parent or guardian of the volunteer is refused without good cause or cannot be obtained despite all reasonable efforts; ( b ) the volunteer is still willing to give the body sample; and ( c ) a Magistrate sanctions the taking of the body sample. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "27",
      "title": "Offence for refusal to give, etc., body sample",
      "content": "27. —(1) Subsections (2), (3) and (4) apply to an individual mentioned in section 19(1), 20(1), 21(1) or 22(1). (2) Except where subsection (3) or (4) applies, an individual mentioned in subsection (1) commits an offence if the individual, without reasonable excuse — ( a ) refuses to give a body sample; ( b ) refuses to allow a body sample to be taken from him or her; or ( c ) otherwise hinders or obstructs the taking of a body sample (other than an invasive sample) from him or her. (3) In a case where an individual mentioned in subsection (1) has not attained 16 years of age but has attained 14 years of age, both the parent or guardian of the individual and the individual who, without reasonable excuse, refuse to give the appropriate consent for an invasive sample to be taken from the individual each commits an offence. (4) In a case where an individual mentioned in subsection (1) has not attained 14 years of age, the parent or guardian of the individual who, without reasonable excuse, refuses to give the appropriate consent for an invasive sample to be taken from the individual commits an offence. (5) An individual commits an offence under subsection (2) regardless of whether the individual’s body sample (that is not an invasive sample) was obtained by reasonable force under section 25. (6) An individual who is guilty of an offence under subsection (2) or (3) or a parent or guardian who is guilty of an offence under subsection (3) or (4) shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding one month or to both. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 3 - IDENTIFICATION OF INDIVIDUALS",
      "section": "28",
      "title": "Inferences against individual mentioned in section 19 from refusal of appropriate consent for invasive samples",
      "content": "28. —(1) Where in any criminal proceeding, it is shown that the appropriate consent required under section 24 for the taking of an invasive sample from an individual under section 19 is refused without good cause, the court may in determining — ( a ) whether to commit that individual for trial in connection with the eligible crime or registrable crime of which he or she is accused of committing; ( b ) whether there is a case to answer against the individual; or ( c ) whether the individual is guilty of the eligible crime or registrable crime with which he or she has been charged, draw any inference from the refusal that the court thinks proper. (2) The refusal of the appropriate consent may, on the basis on the inference mentioned in subsection (1), be treated as, or as capable of amounting to, corroboration of any evidence given against that individual in relation to which the refusal is material. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 4 - IDENTIFICATION DATABASE",
      "section": "29",
      "title": "Maintaining identification database",
      "content": "29. The Registrar must maintain an identification database in which must be recorded the following information and records: ( a ) any identifying information or record of an individual accused of an eligible crime or a registrable crime, sent to the Registrar under section 9(3); ( b ) any identifying information or record of an individual convicted of an eligible crime sent to the Registrar under section 10(3) or 11(7); ( c ) any identifying information or record of an individual arrested or detained under the Internal Security Act 1960, sent to the Registrar under section 13(3); ( d ) any identifying information and records of the identifying information of a volunteer sent to the Registrar under section 14(3); ( e ) the information mentioned in section 34(2)( b ); ( f ) any finger impression, photograph or record taken or made under section 8 as in force immediately before the date of commencement of section 6 of the Registration of Criminals (Amendment) Act 2022. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 4 - IDENTIFICATION DATABASE",
      "section": "30",
      "title": "Moving of particulars to register upon conviction of registrable crime",
      "content": "30. —(1) Where — ( a ) the identifying information or records of an individual who is accused of a registrable crime — (i) have been sent to the Registrar under section 9(3); or (ii) had been sent to the Registrar under section 8( c ) as in force immediately before the date of commencement of section 6 of the Registration of Criminals (Amendment) Act 2022; and ( b ) the individual is convicted of a registrable crime with which the individual has been charged, the authorised officer in charge of the case must, as soon as practicable, notify the Registrar of the conviction. (2) The Registrar must, on receiving the notice from the authorised officer mentioned in subsection (1) — ( a ) remove the identifying information or records of the individual from the identification database; and ( b ) record the registrable particulars of the individual in the register. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 5 - DNA DATABASE",
      "section": "31",
      "title": "Maintaining DNA database",
      "content": "31. The Registrar must maintain a DNA database (whether in electronic form or otherwise) in which must be stored — ( a ) all DNA information derived from a body sample taken from an individual under Division 3 of Part 3; ( b ) all DNA information derived from a body sample taken from an individual under Part 4 as in force immediately before the date of commencement of section 6 of the Registration of Criminals (Amendment) Act 2022; and ( c ) all DNA information stored in the DNA database under section 13F as in force immediately before that date. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 5 - DNA DATABASE",
      "section": "32",
      "title": "Use of DNA information",
      "content": "32. Any information stored in the DNA database may be used for any of the following purposes: ( a ) for administering the DNA database for the purposes of this Act; ( b ) for any investigation into a death conducted by a police officer, a Coroner or a forensic pathologist (including a post-mortem examination) or any inquiry into any death held by a Coroner, under the Coroners Act 2010; ( c ) for any proceedings for any offence; ( d ) for comparison with DNA information in the DNA database maintained under — (i) section 27C of the Criminal Law (Temporary Provisions) Act 1955; (ii) section 26D of the Intoxicating Substances Act 1987; or (iii) section 40D of the Misuse of Drugs Act 1973; ( e ) for forensic comparison with any other DNA information in the course of an investigation of an offence conducted by a police officer; ( f ) for identifying a dead individual or any part of an individual; ( g ) for identifying an individual in order to provide police assistance to the individual; ( h ) for such other purposes as may be prescribed. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 6 - REMOVAL OF REGISTRABLE PARTICULARS,",
      "section": "33",
      "title": "Removal of information of individual upon death or attainment of 100 years of age",
      "content": "33. The Registrar must remove from the register, identification database and DNA database, all identifying information, records and DNA information relating to an individual — ( a ) whose death has been registered under the Registration of Births and Deaths Act 2021; or ( b ) who, the Registrar is satisfied, has attained 100 years of age. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 6 - REMOVAL OF REGISTRABLE PARTICULARS,",
      "section": "34",
      "title": "Acquittal of individuals of registrable crimes",
      "content": "34. —(1) Where — ( a ) the registrable particulars of an individual who is convicted of a registrable crime have been recorded in the register in relation to that registrable crime; and ( b ) the individual is acquitted of the registrable crime or of all the registrable crimes (as the case may be) with which the individual has been charged, whether or not on appeal or review, the authorised officer in charge of the case must, as soon as practicable, notify the Registrar of the acquittal. (2) The Registrar must, on receiving the notice from the authorised officer mentioned in subsection (1) — ( a ) remove the registrable particulars of the individual from the register; and ( b ) record the following information in the identification database: (i) the identifying information and records of the individual sent to the Registrar in relation to the registrable crime; (ii) the circumstances under which the registrable particulars of the individual were removed from the register. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 6 - REMOVAL OF REGISTRABLE PARTICULARS,",
      "section": "35",
      "title": "Individuals not involved in commission of eligible crime or registrable crime",
      "content": "35. —(1) This section applies to or in relation to an individual who is accused of an eligible crime or a registrable crime. (2) Where — ( a ) either or both of the following are satisfied: (i) the identifying information or records of the individual have been recorded in the identification database in relation to the eligible crime or registrable crime; (ii) the DNA information of the individual has been recorded in the DNA database in relation to the eligible crime or registrable crime; and ( b ) investigations reveal that the individual is not involved in the commission of the eligible crime or registrable crime, the authorised officer in charge of the case must, as soon as practicable, notify the Registrar of the findings of the investigations. (3) The Registrar must, on receiving the notice from the authorised officer mentioned in subsection (2) — ( a ) remove the identifying information and records of the individual (if any) from the identification database; and ( b ) remove the DNA information of the individual (if any) from the DNA database. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 6 - REMOVAL OF REGISTRABLE PARTICULARS,",
      "section": "36",
      "title": "Individuals not found to have acted or about to act in manner prejudicial to security of Singapore",
      "content": "36. —(1) This section applies to or in relation to an individual who is arrested and detained pending enquiries under section 74 of the Internal Security Act 1960. (2) Where — ( a ) either or both of the following are satisfied: (i) the identifying information or records of the individual have been sent to the Registrar under section 13(3) and recorded in the identification database; (ii) any body sample has been taken from the individual under section 22(2) and the DNA information derived from the body sample has been recorded in the DNA database; and ( b ) investigations reveal that — (i) there are no grounds to justify the individual’s detention under section 8 of the Internal Security Act 1960; and (ii) the individual has not acted or was not about to act in any manner prejudicial to the security of Singapore or any part of Singapore, the police officer or law enforcement officer, who is in charge of the case must, as soon as practicable, notify the Registrar of the findings of the investigations. (3) The Registrar must, on receiving the notice from the police officer or law enforcement officer mentioned in subsection (2) — ( a ) remove the identifying information and records of the individual (if any) from the identification database; and ( b ) remove the DNA information of the individual (if any) from the DNA database. (4) In this section, “law enforcement officer” has the meaning given by section 2(1) of the Police Force Act 2004. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 6 - REMOVAL OF REGISTRABLE PARTICULARS,",
      "section": "37",
      "title": "Application for removal of information from identification database or DNA database",
      "content": "37. —(1) Subsection (2) applies where — ( a ) any identifying information has been taken from a volunteer under section 14 and recorded in the identification database; or ( b ) any body sample has been taken from a volunteer under section 23 or 26 or section 13D as in force immediately before the date of commencement of section 6 of the Registration of Criminals (Amendment) Act 2022 and the DNA information derived from the body sample has been recorded in the DNA database. (2) The volunteer may apply, in the prescribed form and manner, to the Registrar to remove the identifying information or DNA information, or both, from the identification database or DNA database, as the case may be. (3) Subsection (4) applies to or in relation to an individual who is accused or convicted of an eligible crime or a registrable crime (called in this section a specified crime) where — ( a ) either or both of the following are satisfied: (i) the identifying information or records of the individual have been recorded in the identification database in relation to the specified crime; (ii) the DNA information of the individual has been recorded in the DNA database in relation to the specified crime; and ( b ) any one of the following circumstances is met: (i) the specified crime is compounded under any written law; (ii) the individual is discharged by a court before conviction of the specified crime or of all the specified crimes (as the case may be) with which the individual has been charged (unless the discharge does not amount to an acquittal); (iii) the individual is acquitted of the specified crime or of all the specified crimes (as the case may be) with which the individual has been charged, whether or not at trial or on appeal or review. (4) The individual may apply, in the prescribed form and manner and within the prescribed time, to the Registrar to remove the individual’s identifying information or DNA information, or both, from the identification database or DNA database, as the case may be. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 6 - REMOVAL OF REGISTRABLE PARTICULARS,",
      "section": "38",
      "title": "Removal of identifying information or DNA information of volunteers",
      "content": "38. Where the Registrar receives an application from a volunteer in accordance with section 37(2), the Registrar must remove the volunteer’s identifying information or DNA information, or both, from the identification database or DNA database, as the case may be. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 6 - REMOVAL OF REGISTRABLE PARTICULARS,",
      "section": "39",
      "title": "Removal of identifying information or DNA information of individuals other than volunteers",
      "content": "39. —(1) Where the Registrar receives an application from an individual in accordance with section 37(4), the Registrar must remove the individual’s identifying information or DNA information, or both, from the identification database or DNA database (as the case may be) unless the Registrar determines that any one or both of the following circumstances exist: ( a ) the individual’s identifying information or DNA information is relevant to another ongoing prosecution or investigation; ( b ) it is in the interests of the security of Singapore to retain the individual’s identifying information or DNA information. (2) Where the Registrar determines in accordance with subsection (1) not to remove the individual’s identifying information or DNA information from the identification database or DNA database (as the case may be), the Registrar must notify the individual of the Registrar’s determination and that the individual’s identifying information or DNA information will not be removed from the identification database or DNA database, as the case may be. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 7 - APPEAL AGAINST REGISTRAR’S DETERMINATION",
      "section": "40",
      "title": "Right of appeal against Registrar’s determination",
      "content": "40. An individual who receives a notice mentioned in section 39(2) may, on payment of such fee as may be prescribed, appeal to a Reviewing Tribunal in accordance with this Part against the determination of the Registrar. [Act 26 of 2022 wef 12/06/2023] Division 2 &#x2014; Reviewing Tribunals"
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 7 - APPEAL AGAINST REGISTRAR’S DETERMINATION",
      "section": "41",
      "title": "Reviewing Tribunals — composition",
      "content": "41. —(1) One or more bodies each called a Reviewing Tribunal is established by this section. (2) Every Reviewing Tribunal consists of a District Judge or Magistrate who is appointed by the President on the advice of the Cabinet subject to subsection (3). (3) An individual must not be, or be appointed as, a member of any Reviewing Tribunal if he or she is not a citizen of Singapore. (4) A member of a Reviewing Tribunal must vacate office at the end of a period of 3 years starting the day of his or her appointment, but is eligible for reappointment. (5) A member of a Reviewing Tribunal may resign his or her office by giving written notice to the President. (6) In the performance of his or her functions and duties under this Act, a member of a Reviewing Tribunal has the same protection and immunity as a District Judge or Magistrate, as the case may be. (7) The proceedings of a Reviewing Tribunal are deemed to be judicial proceedings and a member of the Reviewing Tribunal is deemed to be a public servant within the meaning of the Penal Code 1871. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 7 - APPEAL AGAINST REGISTRAR’S DETERMINATION",
      "section": "42",
      "title": "Reviewing Tribunal — remuneration and other terms",
      "content": "42. —(1) The Minister may pay to a member of a Reviewing Tribunal out of moneys provided by Parliament such remuneration or allowances as the Minister may, with the approval of the President, fix. (2) The remuneration and other terms of service of a member of a Reviewing Tribunal must not be altered to his or her disadvantage during his or her continuance in office as such. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 7 - APPEAL AGAINST REGISTRAR’S DETERMINATION",
      "section": "43",
      "title": "Reviewing Tribunal — resources",
      "content": "43. —(1) All expenses of every Reviewing Tribunal are to be defrayed out of moneys provided by Parliament. (2) The Minister must appoint a Secretary to the Reviewing Tribunals and any other public officers that are necessary for a Reviewing Tribunal to discharge its functions under this Act. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 7 - APPEAL AGAINST REGISTRAR’S DETERMINATION",
      "section": "44",
      "title": "Reviewing Tribunal — function",
      "content": "44. —(1) It is the function and duty of every Reviewing Tribunal to consider and determine any appeal made under section 40 and served on the Secretary to the Reviewing Tribunals by an individual who receives a notice mentioned in section 39(2). (2) However, a Reviewing Tribunal must dismiss any appeal if the Registrar, when called by the Reviewing Tribunal for a defence, presents to the Reviewing Tribunal a certificate issued by the Minister certifying that — ( a ) the individual’s identifying information or DNA information in question was taken in relation to an offence under the Foreign Interference (Countermeasures) Act 2021 or the Internal Security Act 1960; and ( b ) it is in the interests of the security of Singapore to retain the individual’s identifying information or DNA information. (3) A Reviewing Tribunal may determine an appeal made to the Reviewing Tribunal by — ( a ) dismissing the appeal and confirming the decision appealed against; or ( b ) revoking the decision appealed against. (4) Every Reviewing Tribunal has to carry out its work expeditiously. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 7 - APPEAL AGAINST REGISTRAR’S DETERMINATION",
      "section": "45",
      "title": "Procedure before Reviewing Tribunal",
      "content": "45. —(1) Except where a Reviewing Tribunal, having regard to all the circumstances, is satisfied that it is equitable to do so, the Reviewing Tribunal must not consider or determine any appeal against the Registrar’s determination under section 39(1), if the appeal is made more than 30 days after the date of the notice of that determination given under section 39(2). (2) A Reviewing Tribunal may at any stage in the appeal proceedings, and without calling for a defence from the Registrar whose determination is appealed against, dismiss an appeal made to or before it if the Reviewing Tribunal is satisfied that — ( a ) the appellant is not an individual entitled to appeal under section 40; ( b ) the bringing of the appeal is or the proceedings of the appeal are frivolous or vexatious; or ( c ) the appellant has, without reasonable excuse, failed to comply with the time delimited by any provision of the rules made under section 49 for the submission of any notice, document or other information in the appeal proceedings, or with any direction of the Reviewing Tribunal under those rules. (3) Subject to the rules made under section 49, every Reviewing Tribunal is entitled to determine its own procedure in relation to any appeal under section 40 made to or before the Reviewing Tribunal. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 7 - APPEAL AGAINST REGISTRAR’S DETERMINATION",
      "section": "46",
      "title": "Reviewing Tribunal’s decision final, etc.",
      "content": "46. —(1) Every determination, order and other decision of a Reviewing Tribunal made or purportedly made under this Act is final and is not to be called in question in any court. (2) For the purpose of subsection (1), a determination, an order and other decision includes a determination, an order and other decision purportedly made, proposed to be made, or required to be made, under this Act or any rules made under section 49 if there were not an excess of jurisdiction or a failure to exercise jurisdiction, in the making of the determination, order or other decision. (3) A certificate issued by the Minister under section 44(2) is conclusive evidence of the matters stated in the certificate. [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 8 - MISCELLANEOUS",
      "section": "47",
      "title": "Providing register information to foreign law enforcement agency",
      "content": "47. —(1) A Singapore designated authority may, pursuant to a crime prevention exchange of information arrangement or upon receiving a request from a foreign law enforcement agency of a non‑participating foreign country, transmit register information about an individual to a foreign law enforcement agency if the Singapore designated authority is satisfied that — ( a ) the register information is requested for one or more of the following purposes only: (i) comparing information transmitted and identifying matches for the investigation of a matter relating to the foreign country of the foreign law enforcement agency, or proceedings in respect of that matter; (ii) assisting the foreign country of the foreign law enforcement agency to decide whether to make a request under the Mutual Assistance in Criminal Matters Act 2000 or a requisition under the Extradition Act 1968; (iii) a purpose prescribed; ( b ) the foreign law enforcement agency has given an appropriate undertaking in relation to the retention, use and destruction of the register information, including the matters in subsection (2); ( c ) it is, having regard to all of the following, appropriate in all the circumstances of the case to do so: (i) the likely effect of transmission on any criminal investigation or proceedings in a Singapore court; (ii) the likely effect of transmission on the safety of the individual to whom the register information to be disclosed relates, or of any other person in Singapore; (iii) the public interest of Singapore; and ( d ) the foreign law enforcement agency is able to comply with conditions prescribed for transmission of information under this section, and any other conditions as the Singapore designated authority may impose specially in relation to the transmission. [8/2016] (2) For the purposes of subsection (1)( b ), the foreign law enforcement agency concerned must undertake — ( a ) that the register information the foreign law enforcement agency receives from a Singapore designated authority about an individual under this section — (i) will be kept and maintained using such methods and technologies as will ensure that persons not authorised to access the information cannot access the information; and (ii) will not be used for a purpose not specified in or prescribed for the purpose of subsection (1)( a ); and ( b ) that the foreign law enforcement agency will comply with the conditions referred to in subsection (1)( d ). [8/2016] (3) A Singapore designated authority may refuse to further transmit any register information about an individual to a foreign law enforcement agency if the Singapore designated authority is of the opinion that the foreign law enforcement agency has failed to comply with its undertaking given under subsection (1)( b ) and does not take steps to rectify the non‑compliance. [8/2016] (4) This section applies despite any duty of confidence, or any written law relating to confidentiality or secrecy, to the contrary. [8/2016] (5) To avoid doubt, sections 4 and 5 do not apply to any information transmitted by a foreign law enforcement agency to a Singapore designated authority. [8/2016] (6) In this section, unless the context otherwise requires — “crime prevention exchange of information arrangement” means an arrangement between a foreign country and the Government under which — ( a ) register information is to be transmitted from a Singapore designated authority to a foreign law enforcement agency in the foreign country; and ( b ) information similar to register information is to be transmitted from a foreign law enforcement agency of the foreign country to a Singapore designated authority, for the purpose of preventing and combating serious crime and identity fraud, and for the use and keeping of information transmitted under the arrangement; “foreign country” means any country, or territory, other than Singapore; “foreign law enforcement agency” — ( a ) in relation to a participating foreign country, means an official or an authority of the participating foreign country, designated by the participating foreign country to make a request to a Singapore designated authority for register information; ( b ) in relation to any other foreign country, means an official or an authority of the foreign country, exercising functions corresponding to — (i) the Singapore Police Force; (ii) the Central Narcotics Bureau; (iii) the Immigration & Checkpoints Authority; or (iv) any other similar authority prescribed, and whom the Singapore designated authority is satisfied is authorised to make a request to the Singapore designated authority for register information; “foreign offence” means any offence against the law of a foreign country which, if the conduct constituting the offence had occurred in Singapore, would amount to an offence against the law of Singapore punishable with imprisonment for a term exceeding 12 months; “investigation of a matter”, in relation to a foreign country, means — ( a ) an investigation of a foreign offence; ( b ) an investigation of a missing person in that foreign country; ( c ) an investigation for the purpose of identifying a deceased person in that foreign country; or ( d ) an investigation to prevent the commission of a foreign offence; “law of a foreign country” includes a reference to the law in force in any part of that country; “participating foreign country” means — ( a ) a member country of the International Criminal Police Organisation; or ( b ) a foreign country whose government has a crime prevention exchange of information arrangement with the Government; “proceedings” means proceedings in a court of law or in which judicial power is exercised (whether of a civil or criminal nature), and includes proceedings (whether or not in a court) in which evidence may be taken on oath; [ Deleted by Act 26 of 2022 wef 12/06/2023 ] “register information” means the registrable particulars or DNA information of an individual who is convicted by a court in Singapore of a registrable crime, that is recorded in the register or DNA database, whether recorded before, on or after 1 August 2016, but excludes registrable particulars and DNA information of — ( a ) an individual who is acquitted by a court in Singapore of the registrable crime, whether or not on appeal or review; ( b ) an individual in respect of whom a direction by the Commissioner of Police is given under section 7 as in force before the date of commencement of section 5 of the Registration of Criminals (Amendment) Act 2022; or ( c ) an individual whose conviction in the register is spent or is treated as spent under Part 2A; [Act 26 of 2022 wef 12/06/2023] “Singapore designated authority” means an individual appointed under section 3 who is specially designated by the Minister to disclose information under this section. [8/2016] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 8 - MISCELLANEOUS",
      "section": "48",
      "title": "Evidence",
      "content": "48. —(1) Subject to subsection (2) — ( a ) any photograph, finger impression or registrable particulars recorded in the register; ( aa ) any identifying information or record recorded in the identification database; [Act 26 of 2022 wef 12/06/2023] ( b ) any record from the DNA database; ( c ) any certificate or report purporting to have been compiled from particulars recorded in the register, identification database or DNA database under the provisions of this Act; and [Act 26 of 2022 wef 12/06/2023] ( d ) any document purporting to be a report upon any matter or thing relating to finger impressions or DNA information duly submitted to the Registrar for report, is, if duly produced from proper custody and authenticated by the signature of the Registrar, admissible in evidence in any court, and is sufficient proof of the facts thereon stated or appearing unless the same is disproved. [45/2002] (2) Despite subsection (1), in any trial at which any of the matters referred to in subsection (1) is tendered in evidence, the court or the accused may require that the Registrar be called as a witness. [45/2002] (3) Where the accused requires the Registrar to be called as a witness, the accused must give notice to the Public Prosecutor not less than 3 clear days before the commencement of the trial. [45/2002] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s49",
      "chapter": "PART 8 - MISCELLANEOUS",
      "section": "49",
      "title": "Rules",
      "content": "49. —(1) The Minister may make rules for carrying out the purposes of this Act and for any matter which is required under this Act to be prescribed. [45/2002] (1A) In particular, the Minister may make rules to provide for any of the following: ( a ) the safeguards that the Registrar must implement to protect the information recorded in the register, identification database or DNA database, and any computer system used to keep and maintain the register, identification database or DNA database, against — (i) accidental or unlawful loss, modification or destruction; and (ii) unauthorised access, disclosure, copying, use or modification; ( b ) the practice and procedure to be followed on, or in connection with, the hearing or consideration of any proceedings or appeal (including, where applicable, the mode and burden of proof and the admissibility of evidence) before a Reviewing Tribunal, including — (i) requiring individuals making an appeal under section 40 to take any preliminary steps, and to make any disclosures, that may be specified in the rules for the purpose of facilitating a determination whether the making of the appeal is frivolous or vexatious; (ii) enabling or requiring a Reviewing Tribunal to hear or consider any appeal without the individual who brought the appeal having been given full particulars of the grounds which are the subject of the appeal; (iii) the need to secure that matters which are the subject of appeals brought before or made to a Reviewing Tribunal are properly heard and considered; (iv) prescribing the circumstances and manner in which appeals under section 40 in relation to the same determination, or involving the same or similar issues, may be consolidated or heard together; (v) enabling or requiring a Reviewing Tribunal to take any steps in exercise of its jurisdiction in the absence of any individual (including the individual making the appeal and any legal representative of the individual); (vi) enabling or requiring a Reviewing Tribunal to give a summary of any evidence taken in its absence to the individual who made the appeal under section 40; (vii) securing that the information is not disclosed to an extent, or in a manner, that is contrary to Singapore’s national security, the prevention or detection of serious crime, the economic wellbeing of Singapore or the continued discharge of the functions of any of the intelligence services of Singapore; and (viii) providing for the manner in which the interests of an individual who has made an appeal under section 40 are to be represented, such as for the appointment in accordance with the rules, by such person as may be determined in accordance with the rules, of a person to represent those interests; ( c ) such saving, transitional and other consequential, incidental and supplemental provisions as are necessary or expedient for rules made under this section. [Act 26 of 2022 wef 12/06/2023] (2) All rules made under this Act must be presented to Parliament as soon as possible after publication in the Gazette . [45/2002] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s50",
      "chapter": "PART 8 - MISCELLANEOUS",
      "section": "50",
      "title": "Power to vary Schedules",
      "content": "50. The Minister may by order delete any provision from, or add to or vary the provisions of, the Schedules. [7/97] [Act 26 of 2022 wef 12/06/2023]"
    },
    {
      "provision_ref": "s51",
      "chapter": "PART 8 - MISCELLANEOUS",
      "section": "51",
      "title": "Saving",
      "content": "51. The Registrar has the custody of all records of criminals and particulars which would be registrable particulars under this Act held immediately before 29 June 1949 by any Registrar of Criminals in Singapore, and the records and particulars whether taken, received or registered in accordance with any written law for the time being in force or not, are deemed to have been duly taken or received and, when registered, are, for all purposes of this Act, deemed to be comprised in and form part of the register maintained under this Act. [Act 26 of 2022 wef 12/06/2023]"
    }
  ],
  "definitions": [
    {
      "term": "authorised officer",
      "definition": "“authorised officer” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "body sample",
      "definition": "“body sample” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "DNA",
      "definition": "“DNA” means deoxyribonucleic acid;",
      "source_provision": "s2"
    },
    {
      "term": "DNA database",
      "definition": "“DNA database” means the database maintained under section 31; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "DNA information",
      "definition": "“DNA information” means genetic information derived from the forensic DNA analysis of a body sample;",
      "source_provision": "s2"
    },
    {
      "term": "DNA officer",
      "definition": "“DNA officer” means an individual who is qualified and authorised under section 18(1) to take body samples; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "eligible crime",
      "definition": "“eligible crime” means any offence that is, at the time of the commission of the offence — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "finger impression",
      "definition": "“finger impression” includes palmar impressions, hand prints, finger prints, foot prints or toe prints;",
      "source_provision": "s2"
    },
    {
      "term": "forensic procedure",
      "definition": "“forensic procedure” , in relation to an individual, includes doing one or all of the following in relation to the individual: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "forensic specialist",
      "definition": "“forensic specialist” means an individual who is appointed under section 65A of the Police Force Act 2004 as a forensic specialist;",
      "source_provision": "s2"
    },
    {
      "term": "identification database",
      "definition": "“identification database” means the database maintained under section 29; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "identifying information",
      "definition": "“identifying information” , in relation to an individual, means all of the following information: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "law enforcement agency",
      "definition": "“law enforcement agency” means any body or organisation which is prescribed by the Minister to be a law enforcement agency for the purposes of this Act;",
      "source_provision": "s2"
    },
    {
      "term": "other particulars",
      "definition": "“other particulars” , in relation to an individual, means any particulars, information or description of that individual, other than his or her identifying information, that may be relevant or useful in the identification of that individual; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "photograph",
      "definition": "“photograph” , in relation to an individual, includes the photograph of any distinguishing feature or mark on the body of that individual; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "principal registration area",
      "definition": "“principal registration area” means Singapore and Malaysia;",
      "source_provision": "s2"
    },
    {
      "term": "register",
      "definition": "“register” means the register of criminals maintained in accordance with section 4;",
      "source_provision": "s2"
    },
    {
      "term": "registrable crime",
      "definition": "“registrable crime” means any offence included for the time being in the First Schedule; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "registrable particulars",
      "definition": "“registrable particulars” , in relation to an individual, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Registrar",
      "definition": "“Registrar” means the Registrar of Criminals appointed under section 3, and includes an Assistant Registrar of Criminals; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "Reviewing Tribunal",
      "definition": "“Reviewing Tribunal” means a Reviewing Tribunal established by section 41; [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "volunteer",
      "definition": "“volunteer” means an individual who voluntarily gives his or her consent under section 14 or 23 for the taking of any identifying information or body sample (as the case may be) from him or her. [45/2002; 4/2003; 10/2015] [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s2"
    },
    {
      "term": "criminal record",
      "definition": "“criminal record” , in relation to an individual, means the record which is kept in the register before, on or after 17 October 2005 of his or her conviction for — ( a )",
      "source_provision": "s7A"
    },
    {
      "term": "term of imprisonment",
      "definition": "“term of imprisonment” does not include a term of imprisonment imposed by a court in default of payment of a fine or penalty. [20/2005]",
      "source_provision": "s7A"
    },
    {
      "term": "crime-free period",
      "definition": "“crime-free period” means a period of not less than 5 consecutive years starting from the relevant date applicable to an individual, during which the individual — ( a )",
      "source_provision": "s7B"
    },
    {
      "term": "relevant date",
      "definition": "“relevant date” , in relation to an individual, means — ( a )",
      "source_provision": "s7B"
    },
    {
      "term": "appropriate consent",
      "definition": "“appropriate consent” means — ( a )",
      "source_provision": "s8"
    },
    {
      "term": "authorised analyst",
      "definition": "“authorised analyst” means — ( a )",
      "source_provision": "s8"
    },
    {
      "term": "invasive sample",
      "definition": "“invasive sample” means any body sample that is obtained by means of any invasive procedure and includes a sample of blood;",
      "source_provision": "s8"
    },
    {
      "term": "registered medical practitioner",
      "definition": "“registered medical practitioner” means a medical practitioner registered under the Medical Registration Act 1997 and includes a dentist registered under the Dental Registration Act 1999 or any corresponding previous written law. [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s8"
    },
    {
      "term": "crime prevention exchange of information arrangement",
      "definition": "“crime prevention exchange of information arrangement” means an arrangement between a foreign country and the Government under which — ( a )",
      "source_provision": "s47"
    },
    {
      "term": "foreign country",
      "definition": "“foreign country” means any country, or territory, other than Singapore;",
      "source_provision": "s47"
    },
    {
      "term": "foreign law enforcement agency",
      "definition": "“foreign law enforcement agency” — ( a )",
      "source_provision": "s47"
    },
    {
      "term": "foreign offence",
      "definition": "“foreign offence” means any offence against the law of a foreign country which, if the conduct constituting the offence had occurred in Singapore, would amount to an offence against the law of Singapore punishable with imprisonment for a term exceeding 12 months;",
      "source_provision": "s47"
    },
    {
      "term": "investigation of a matter",
      "definition": "“investigation of a matter” , in relation to a foreign country, means — ( a )",
      "source_provision": "s47"
    },
    {
      "term": "law of a foreign country",
      "definition": "“law of a foreign country” includes a reference to the law in force in any part of that country;",
      "source_provision": "s47"
    },
    {
      "term": "participating foreign country",
      "definition": "“participating foreign country” means — ( a )",
      "source_provision": "s47"
    },
    {
      "term": "proceedings",
      "definition": "“proceedings” means proceedings in a court of law or in which judicial power is exercised (whether of a civil or criminal nature), and includes proceedings (whether or not in a court) in which evidence may be taken on oath;",
      "source_provision": "s47"
    },
    {
      "term": "register information",
      "definition": "“register information” means the registrable particulars or DNA information of an individual who is convicted by a court in Singapore of a registrable crime, that is recorded in the register or DNA database, whether recorded before, on or after 1 August 2016, but excludes registrable particulars and DNA information of — ( a )",
      "source_provision": "s47"
    },
    {
      "term": "Singapore designated authority",
      "definition": "“Singapore designated authority” means an individual appointed under section 3 who is specially designated by the Minister to disclose information under this section. [8/2016] [Act 26 of 2022 wef 12/06/2023]",
      "source_provision": "s47"
    }
  ]
}