{
  "id": "rela-1983",
  "type": "statute",
  "title": "Revised Edition of the Laws Act 1983",
  "title_en": "Revised Edition of the Laws Act 1983",
  "short_name": "RELA1983",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/RELA1983",
  "description": "An Act to make provision for the preparation and publication of a revised edition of the laws of Singapore, for subsequent revisions thereof and for matters connected therewith. [4/2021]",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short Title",
      "content": "1. This Act is the Revised Edition of the Laws Act 1983."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Acts” means all Acts of Parliament and includes the Constitution, the United Kingdom enactments and all Ordinances having the force of law in Singapore; “Commissioners” means the Law Revision Commissioners appointed under section 3; “revised edition of Acts” means the revised edition of the Acts prepared under the authority of this Act; [Act 32 of 2024 wef 25/11/2024] “revised edition of subsidiary legislation” means a revised edition, prepared under the authority of this Act, of orders in council, proclamations, rules, regulations, orders, notifications, by‑laws and other forms of subsidiary legislation made under any Act or other lawful authority and having legislative effect. [Act 32 of 2024 wef 25/11/2024]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - LAW REVISION COMMISSION",
      "section": "3",
      "title": "Appointment of Commission",
      "content": "3. —(1) The President may appoint a Law Revision Commission comprising, as Law Revision Commissioners — ( a ) the Attorney‑General; ( b ) a Deputy Attorney‑General; ( c ) the Solicitor‑General; ( d ) the Chief Legislative Counsel; and ( e ) any other persons whom the President may appoint, to prepare and publish a revised edition of Acts and one or more revised editions of subsidiary legislation and to make subsequent revisions thereof in accordance with the provisions of this Act. [41/2014; 4/2021; S 365/2013] [Act 32 of 2024 wef 25/11/2024] (2) Every Commissioner appointed under subsection (1)( e ) holds office for a period not exceeding 3 years that the President may determine and is eligible for re‑appointment. (3) The President may at any time revoke the appointment of any Commissioner appointed under subsection (1)( e ). (4) In case any of the Commissioners, appointed under subsection (1), is unable from any cause fully to discharge his or her commission under this Act, the President may appoint some other person to be a Commissioner or temporarily in his or her stead to exercise the powers and discharge the duties of a Commissioner. [Act 5 of 2025 wef 09/03/2025] (5) In case any Commissioner is unable from any cause fully to discharge his or her commission under this Act and no appointment has been made under subsection (4), the remaining Commissioner or Commissioners have and may exercise all the powers and duties conferred by this Act upon the Commissioners. (6) Where any power is conferred by this Act upon the Commissioners to make any notification or order, or authorise any thing or matter to be done, it is sufficient if the exercise of such power by the Commissioners is signified by the Attorney-General or any other Commissioner. [Act 32 of 2024 wef 25/11/2024] (7) An appointment under subsection (1) or (4) must be published in the Gazette . [Act 5 of 2025 wef 09/03/2025]"
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "4",
      "title": "Powers of Commissioners",
      "content": "4. —(1) In the preparation of the revised edition of Acts, the Commissioners have power, without changing the meaning of any Act — ( a ) to omit — (i) all Acts or parts of Acts which have been repealed, expressly, specifically or by necessary implication, or which have expired or have become spent or have had effect, and all Supply Acts and Acts or parts of Acts so far as they effect changes of titles; (ii) all repealing enactments contained in Acts and all tables or lists of repealed enactments, whether contained in schedules or otherwise; (iii) all preambles to Acts; (iv) all introductory words of enactment in any Act or section of an Act; (v) all enactments prescribing the date when an Act or part of an Act is to come into force; (vi) all amending Acts or parts of Acts where the amendments effected by those Acts or parts of Acts have been embodied by the Commissioners in the Acts to which they relate; (vii) all enacting clauses; and (viii) any parts of an Act which can more conveniently be included as rules, regulations, orders, notifications, by‑laws or other instruments made under any Act or other lawful authority and having legislative effect: Provided that section 16 of the Interpretation Act 1965 applies to such omissions in the same manner as if the enactments omitted had been repealed; ( b ) to arrange the grouping and sequence of Acts; ( c ) to add a long title or a short title to any Act and to alter the long title or the short title of any Act; ( d ) to supply, alter or omit tables of contents, footnotes, marginal notes, headings to sections and other provisions, and headings to Parts, Chapters and other subdivisions of any Act; ( e ) to adopt a convenient standard form in all Acts for — (i) the interpretation section; (ii) any penal section; and (iii) any section giving power to make subsidiary legislation, whether that section already appears in any Act or is inserted by the Commissioners as a result of the exercise by them of the power conferred by paragraph ( a )(viii) or any other power conferred upon them by this Act; ( f ) to consolidate into one Act any 2 or more Acts in pari materia, making any alterations that are thereby rendered necessary in the consolidated Act, and affixing a date thereto that may seem most convenient, and to incorporate all or any of the provisions of any Act in one or more other Acts where the provisions so incorporated relate to the same subject matter as the Act in which they are incorporated; ( g ) to divide any Act into 2 or more Acts and to make any amendments, including the supplying of titles or the alteration of existing titles, that are thereby rendered necessary; ( h ) to incorporate in any Act any amendment made to any schedule, form or other part by any authority under powers conferred by that Act; ( i ) to change the order of sections or other provisions of an Act, and to number or renumber the sections or other provisions of an Act; ( j ) to make the following editorial changes to bring an Act in line, or more closely in line, with current legislative drafting practice: (i) changes to spelling, punctuation, grammar or syntax, or the use of conjunctives and disjunctives; (ii) changes to the way of referring to or expressing a number, year, date, time, amount of money or of other things, penalty, quantity, measurement or other matter, idea or concept; (iii) changes to language that indicates or could be taken to indicate gender; ( k ) to alter the form of arrangement of any section of an Act by transposing words, by combining it in whole or in part with another section or other sections or by dividing it into 2 or more subsections; ( l ) to divide any Act, whether consolidated or not, into parts or other divisions; ( m ) to correct grammatical, typographical and similar mistakes in any Act and to make verbal additions, omissions or alterations; ( n ) to make any formal alterations as to names, localities, departments, offices, titles and otherwise that may be necessary to bring any Act to be included in the revised edition of Acts into conformity with the circumstances of Singapore; ( o ) to correct or update cross‑references; ( p ) to incorporate in or omit from any Act (as the case may be) all matters required to be added to, omitted from or substituted for any provisions of the Act as a result of any amendments made to that Act by any written law; ( q ) to delete any words, expressions, nomenclature or other provisions in any Act which have expired or become obsolete, including references to repealed Acts, and to substitute therefor, where necessary, appropriate words, expressions, nomenclature or provisions or references to the appropriate Acts; ( r ) to restyle Ordinances as Acts; and ( s ) to do all other things relating to form and method reasonably necessitated by or consequential upon the exercise by the Commissioners of any of the powers conferred upon them by this section or which may be necessary for the perfecting of the revised edition of Acts. [7/97; 2/2012; 4/2021] (2) A notification specifying the Acts that are omitted from the revised edition of Acts under subsection (1) must be published in the Gazette . (3) For the purpose of preparing the revised edition of Acts, the Commissioners may appoint a revision date and all Acts included in the revised edition must be revised up to that date."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "5",
      "title": "Omission of certain Acts from revised edition of Acts",
      "content": "5. —(1) The Commissioners must omit from the revised edition of Acts any Acts that the President may specify by notification in the Gazette . (2) Despite anything to the contrary in this Act, such Acts and any Parts, sections or other divisions of such Acts remain in force until they have been expressly repealed or have expired or become spent or had effect."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "6",
      "title": "Mode of dealing with amendments, etc., not authorised under section 4",
      "content": "6. —(1) If the Commissioners consider that it is desirable that, in the preparation of the revised edition of Acts, there should be omissions, amendments or additions, other than those authorised by section 4, the same may be collected and submitted to Parliament in the form of one or more Acts. (2) If the Act or Acts mentioned in subsection (1) are enacted prior to the date specified in the order mentioned in section 7, then — ( a ) the Commissioners must, in the preparation of the revised edition of Acts, give the like effect to such omissions, amendments or additions as if they had been authorised by section 4; and ( b ) if, as a result of any such omissions, amendments or additions, any Act or part thereof has been repealed or has expired or become spent or had effect, the Act or part thereof must be omitted from the revised edition of Acts."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "7",
      "title": "Bringing of revised edition of Acts into force",
      "content": "7. —(1) The Commissioners must, upon completion, transmit to the President a copy of the revised edition of Acts. (2) The President may then, by order in the Gazette , provide that the revised edition of Acts comes into force on such date as the President thinks fit. (3) The revised edition of Acts must, as soon as possible after the publication of the order, be published and presented to Parliament. (4) From the date specified in the order mentioned in subsection (2), the revised edition of Acts is, without affecting sections 5 and 6, in all courts and for all purposes the sole and only proper Statute Book of Singapore in respect of Acts contained therein."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "8",
      "title": "Contents and arrangement of revised edition of Acts",
      "content": "8. —(1) Subject to sections 4, 5 and 6, the revised edition of Acts must include — ( a ) the Constitution of the Republic of Singapore; ( b ) all Acts wholly or substantially in force on 31 December 2020, and any other Acts coming wholly or substantially into force after that date that the Commissioners think fit to include; ( c ) a table of contents and a chronological table of Acts; and ( d ) a list of Acts omitted under section 5. [2/2012; 4/2021] (2) The revised edition of Acts must be printed in such number of volumes and divided as the Commissioners think fit. [4/2021] (3) The Acts contained in the revised edition of Acts may be arranged alphabetically or in any other way the Commissioners think fit, regardless of their date of enactment. [4/2021] (4) There must be annexed to each Act contained in the revised edition of Acts the Chapter number (if any) and the year and number by which the Act had previously been denoted in the last official publication thereof, as well as the year and number of any other law the provisions of which have been incorporated into it by virtue of the powers conferred upon the Commissioners under section 4. [4/2021] (5) The commencement of each Act must be set out immediately below the long title of the Act."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "9",
      "title": "Form of publication to be by bound booklet",
      "content": "9. —(1) The Commissioners must cause the revised edition of every Act to be published in the form of one or more separate booklets, each of which must contain — ( a ) on the front page thereof the words — (i) “The Statutes of the Republic of Singapore”; and (ii) “2020 Revised Edition”; and ( b ) at the top of every subsequent page of each such booklet the words “2020 Ed.”. [4/2021] (2) The Commissioners must cause the various booklets which have been compiled for the purposes of subsection (1) to be contained together in any number of volumes that they consider convenient. (3) A booklet must be bound in a manner that will enable it to be easily removed from and replaced in a volume."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "10",
      "title": "Subsequent revision of revised edition of Acts",
      "content": "10. —(1) The Commissioners may, from time to time after the revised edition of Acts comes into force, cause to be published — ( a ) a revised edition of any Act that they consider has been extensively amended; ( b ) a revised edition of any new Act enacted, other than an Act the sole or substantial effect of which was to amend other Acts; ( c ) either separately or together with any other such enactment or instrument, a new revised edition of any treaty or convention and other instruments already included in the revised edition of Acts that they consider has been extensively amended; ( d ) any treaties, conventions and other instruments enacted, made or agreed to that they consider may usefully be published; and ( e ) a new table of contents, a chronological table of Acts and a list of the latest edition of each booklet containing an Act included in the revised edition of Acts and, in the case of Acts which have been published or revised in loose‑leaf form, a list of those Acts and the pages thereof which have been revised. [2/2012; 4/2021] (2) The Commissioners may from time to time cause to be published a new revised edition of any Act, treaty, convention or other instrument which has not been amended. [4/2021] (3) A publication under subsection (1) or (2) may — ( a ) be in electronic form, in the form of a booklet or in a loose‑leaf form; and [Act 5 of 2025 wef 09/03/2025] ( b ) include any notes, indexes, instructions or other information that the Commissioners consider useful. [4/2021]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "11",
      "title": "Powers and duties of Commissioners under section 10",
      "content": "11. —(1) For the purposes of section 10, the Commissioners may exercise and perform any of the powers and duties conferred or imposed upon them by this Act in the preparation of the revised edition of Acts. (2) Every edition of any Act, treaty, convention or other instrument published pursuant to section 10 must contain the description referred to in section 9(1) except that for the reference to the 2020 Revised Edition there must be substituted a reference to the year in which the edition is published. [4/2021] [Act 5 of 2025 wef 09/03/2025] (3) The Commissioners must transmit to the President a copy of every edition of any Act, treaty, convention or other instrument published under section 10 and with effect from such date as the President may specify by order in the Gazette any such edition of any Act, treaty, convention or other instrument is, in all courts and for all purposes, the sole and only proper law of Singapore in respect of that Act, treaty, convention or other instrument. [Act 5 of 2025 wef 09/03/2025] (4) Every edition of any Act, treaty, convention or other instrument must, as soon as possible after the publication of the order, be presented to Parliament. [Act 5 of 2025 wef 09/03/2025] 11A. [ Repealed by Act 5 of 2025 wef 09/03/2025 ]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "12",
      "title": "Publication of lists of titles of current Acts",
      "content": "12. The Commissioners may from time to time cause to be published in the Gazette a list of the titles of all Acts in force in Singapore and the year of the last published edition thereof."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "13",
      "title": "Validity of Acts not affected by omission from revised edition of Acts",
      "content": "13. An Act omitted from the revised edition of Acts, other than any Act omitted under section 4, is not to be deemed to be without force and validity by reason only of the fact that it is so omitted."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - REVISION OF ACTS",
      "section": "14",
      "title": "Saving of existing subsidiary legislation",
      "content": "14. All subsidiary legislation made under the Acts in the revised edition of Acts or in any subsequent revision of Acts made pursuant to section 10 or under other lawful authority and having legislative effect, and in force on the date the revised edition of Acts or the subsequent revision of Acts (as the case may be) comes into force, continues in force until otherwise provided for. [4/2021]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 4 - REVISION OF SUBSIDIARY LEGISLATION",
      "section": "15",
      "title": "Subsidiary legislation",
      "content": "15. —(1) The Commissioners may issue, as supplementary to the revised edition of Acts, one or more revised editions of subsidiary legislation in any manner or form (including in electronic form) that, in the opinion of the Commissioners, may be most practicable. [Act 32 of 2024 wef 25/11/2024] [Act 5 of 2025 wef 09/03/2025] (2) In the preparation of a revised edition of subsidiary legislation, the Commissioners have the like powers to do all things as are conferred upon them by this Act in respect of the revised edition of Acts except that — ( a ) the powers conferred by section 6, other than that contained in subsection (2) of that section, are inapplicable; and ( b ) if the Commissioners consider it desirable that, in the preparation of the revised edition of subsidiary legislation, there should be amendments not authorised under the power previously conferred by this section, the Commissioners are empowered to prepare the amendments by virtue of this section, and submit them for approval to the authority having power to make the same. [Act 32 of 2024 wef 25/11/2024] (3) The Commissioners also have power to include in a revised edition of subsidiary legislation any part of an Act omitted pursuant to section 4(1)( a )(viii), and any matter included in a revised edition of subsidiary legislation pursuant to this power is deemed for all purposes, including the exercise by the Commissioners of all the powers conferred by this section in relation thereto, to be subsidiary legislation of which a revised edition is being prepared pursuant to this Act. [Act 32 of 2024 wef 25/11/2024] (4) For the purpose of preparing a revised edition of subsidiary legislation, the Commissioners may appoint a revision date and all subsidiary legislation included in the revised edition must be revised up to that date. (5) Where the Commissioners, in exercise of their powers under subsection (2) read with section 4(1)( f ), have (whether before, on or after the date of commencement of section 12 of the Statutes (Miscellaneous Amendments) (No. 2) Act 2024) consolidated into one subsidiary legislation (called the consolidated subsidiary legislation) any 2 or more pieces of subsidiary legislation in pari materia and made by or under the same authority (whether or not those pieces of subsidiary legislation had been revised by the Commissioners), the consolidated subsidiary legislation may be amended by or under that same authority as if it were made by or under that authority. [Act 32 of 2024 wef 25/11/2024]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - REVISION OF SUBSIDIARY LEGISLATION",
      "section": "16",
      "title": "Subsidiary legislation not revised remains in force",
      "content": "16. Despite anything to the contrary in this Act, any subsidiary legislation that is not revised by the Commissioners remains in force until it has been expressly revoked or has expired, become spent or had effect. [Act 32 of 2024 wef 25/11/2024]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - REVISION OF SUBSIDIARY LEGISLATION",
      "section": "17",
      "title": "Bringing of revised edition of subsidiary legislation into force",
      "content": "17. —(1) The Commissioners must, upon completion, transmit to the President a copy of every revised edition of subsidiary legislation. [Act 32 of 2024 wef 25/11/2024] (2) The President may then, by order in the Gazette , provide that the revised edition of subsidiary legislation comes into force on such date as the President thinks fit. (3) Every revised edition of subsidiary legislation must, as soon as possible after the publication of the order, be published and presented to Parliament. [Act 32 of 2024 wef 25/11/2024] (4) From the date specified in the order mentioned in subsection (2), the revised edition of subsidiary legislation is, without affecting sections 15 and 16, in all courts and for all purposes the sole and only proper Statute Book of Singapore in respect of subsidiary legislation contained therein. (5) Despite anything in section 15, the Commissioners may from time to time cause to be published a revised edition in any form (including in electronic form) that they may decide — ( a ) of all subsidiary legislation made under or by virtue of any Act; or ( b ) of any single piece of subsidiary legislation, whether or not it has been amended after it came into force and whether or not it is made under or by virtue of any Act. [Act 32 of 2024 wef 25/11/2024] [Act 32 of 2024 wef 25/11/2024] [Act 5 of 2025 wef 09/03/2025] (6) [ Deleted by Act 5 of 2025 wef 09/03/2025 ] (7) In the preparation of a revised edition of subsidiary legislation under subsection (5), the Commissioners — ( a ) have the like powers to do all things as are conferred upon them by section 15(2) and (3); and ( b ) may include any notes, indexes, instructions or other information that they consider useful. [Act 5 of 2025 wef 09/03/2025] (8) With effect from such date as the Commissioners may specify by notification in the Gazette — ( a ) any revised edition of subsidiary legislation mentioned in subsection (5)( a ) is, in all courts and for all purposes, the sole and only proper Statute Book of Singapore in respect of those subsidiary legislation; and ( b ) any revised edition of any single piece of subsidiary legislation mentioned in subsection (5)( b ) is, in all courts and for all purposes, the sole and only proper Statute Book of Singapore in respect of that piece of subsidiary legislation. [2/2012]"
    },
    {
      "provision_ref": "s17A",
      "chapter": "PART 5 - SUPPLEMENTARY PROVISIONS",
      "section": "17A",
      "title": "Electronic versions of revised editions to be prima facie evidence of proper law, etc.",
      "content": "17A. —(1) A revised edition of any material published in electronic form under this Act (including under section 11A(1) as in force before the appointed date) is, in all courts and for all purposes, prima facie evidence of the proper law of Singapore in respect of that material. (2) To the extent of any inconsistency, the revised edition of any material published in electronic form under this Act on or after the appointed date prevails over the same revised edition published in print under this Act on or after that date. (3) To the extent of any inconsistency, the revised edition of any material published in print under this Act before the appointed date prevails over the same revised edition published in electronic form under this Act before that date. (4) In this section — “appointed date” means the date of commencement of section 3( m ) of the Electronic Gazette and Legislation Act 2025; “material” means any Act, subsidiary legislation, treaty, convention or other instrument. [Act 5 of 2025 wef 09/03/2025]"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 5 - SUPPLEMENTARY PROVISIONS",
      "section": "18",
      "title": "Complementary matter in revised edition of Acts",
      "content": "18. —(1) The revised edition of Acts may also contain a reprint of such other statutes, orders in council, treaties, conventions and other instruments, enactments and such indexes, notes and references as the Commissioners consider useful to include. [Act 5 of 2025 wef 09/03/2025] (2) When any statutes, orders in council, treaties, conventions, instruments or enactments are reprinted pursuant to subsection (1), the provisions of the statutes, orders in council, treaties, conventions, instruments or enactments may be reproduced with such amendments as may have been made thereto by any other statutes, orders in council, treaties, conventions, instruments or enactments; and where any statutes, orders in council, treaties, conventions, instruments or enactments have been applied or extended to Singapore with modifications, the provisions of those statutes, orders in council, treaties, conventions, instruments or enactments may be reproduced with those modifications. (3) The Commissioners may also cause the reprint mentioned in subsection (1) to be published in such number of separate booklets, in the manner prescribed by section 10, or in such other form as they consider convenient."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - SUPPLEMENTARY PROVISIONS",
      "section": "19",
      "title": "Effect of repealed or omitted Acts",
      "content": "19. —(1) The repeal or omission from the revised edition of Acts of any Act repealed or omitted during and for the purpose of the preparation of the revised edition of Acts, does not affect the validity of any existing resolutions of Parliament, or any proclamations, rules, regulations, orders, notifications, by‑laws or other instruments made under any Acts or other lawful authority and having legislative effect, made under any Act so repealed or omitted. (2) The proclamations, rules, regulations, orders, notifications, by‑laws or other instruments made under any such Acts or other lawful authority and having legislative effect, so far as they are not inconsistent with any Act for the time being in force, continue in force until otherwise provided."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - SUPPLEMENTARY PROVISIONS",
      "section": "20",
      "title": "Construction of references to Acts and subsidiary legislation revised under this Act",
      "content": "20. —(1) Where in any written law or other instrument or document reference is made to any Act or any provision of any Act affected by or under the operation of this Act, that reference is, where necessary and practicable, to be construed as a reference to that Act or to the corresponding provision of that Act in the revised edition of Acts or in any subsequent revision of Acts made pursuant to section 10. [4/2021] (2) Where in any written law or other instrument or document reference is made to any subsidiary legislation or any provision of any subsidiary legislation affected by or under the operation of this Act, that reference is, where necessary and practicable, to be construed as a reference to that subsidiary legislation or to the corresponding provision of that subsidiary legislation in the relevant revised edition of subsidiary legislation. [Act 32 of 2024 wef 25/11/2024] 21. [ Repealed by Act 5 of 2025 wef 09/03/2025 ] 22. [ Repealed by Act 5 of 2025 wef 09/03/2025 ]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - SUPPLEMENTARY PROVISIONS",
      "section": "23",
      "title": "Rectification of errors",
      "content": "23. —(1) The Commissioners may, by order in the Gazette , rectify any clerical or publication error appearing in — ( a ) the revised edition of Acts or in any new or revised edition of any Act, treaty, convention or other instrument published pursuant to section 10; or ( b ) any revised edition of subsidiary legislation issued under section 15 or in any new or revised edition of any piece of subsidiary legislation published pursuant to section 17, [Act 32 of 2024 wef 25/11/2024] or rectify in a manner not inconsistent with the powers of revision conferred by this Act any other error so appearing. [Act 5 of 2025 wef 09/03/2025] (2) Every order made under section (1)( a ) must be presented to Parliament as soon as possible after publication."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - SUPPLEMENTARY PROVISIONS",
      "section": "24",
      "title": "Expenses of revision",
      "content": "24. The expenses of and incidental to the preparation and publication of the revised edition of Acts and any subsequent revision of Acts made pursuant to section 10 and any revised edition of subsidiary legislation are to be defrayed out of moneys provided by Parliament. [4/2021] [Act 32 of 2024 wef 25/11/2024]"
    }
  ],
  "definitions": [
    {
      "term": "Acts",
      "definition": "“Acts” means all Acts of Parliament and includes the Constitution, the United Kingdom enactments and all Ordinances having the force of law in Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "Commissioners",
      "definition": "“Commissioners” means the Law Revision Commissioners appointed under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "revised edition of Acts",
      "definition": "“revised edition of Acts” means the revised edition of the Acts prepared under the authority of this Act; [Act 32 of 2024 wef 25/11/2024]",
      "source_provision": "s2"
    },
    {
      "term": "revised edition of subsidiary legislation",
      "definition": "“revised edition of subsidiary legislation” means a revised edition, prepared under the authority of this Act, of orders in council, proclamations, rules, regulations, orders, notifications, by‑laws and other forms of subsidiary legislation made under any Act or other lawful authority and having legislative effect. [Act 32 of 2024 wef 25/11/2024]",
      "source_provision": "s2"
    },
    {
      "term": "appointed date",
      "definition": "“appointed date” means the date of commencement of section 3( m ) of the Electronic Gazette and Legislation Act 2025;",
      "source_provision": "s17A"
    },
    {
      "term": "material",
      "definition": "“material” means any Act, subsidiary legislation, treaty, convention or other instrument. [Act 5 of 2025 wef 09/03/2025]",
      "source_provision": "s17A"
    }
  ]
}