{
  "id": "samho-1934",
  "type": "statute",
  "title": "Saint Andrew’s Mission Hospital Ordinance 1934",
  "title_en": "Saint Andrew’s Mission Hospital Ordinance 1934",
  "short_name": "SAMHO1934",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SAMHO1934",
  "description": "An Ordinance to incorporate Saint Andrew’s Mission Hospital.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Ordinance may be cited as the Saint Andrew’s Mission Hospital Ordinance 1934."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Incorporation and rights on incorporation",
      "content": "2. The persons constituting the present Committee of Management of St. Andrew’s Mission Hospital and the persons who for the time being are members of the Board of Management hereinafter constituted and the persons and firms whose names are with their consent inscribed in the register of members mentioned in section 8 hereof shall forever hereafter be one body corporate and politic by the name of Saint Andrew’s Mission Hospital (hereinafter called “the Corporation”) and by the same name shall have perpetual succession and a common seal with power to break, alter and make anew the said seal from time to time at their will and pleasure and by the same name shall and may sue and be sued in all Courts and in all manner of actions and suits and shall have power to do all other matters and things incidental or appertaining to a body corporate."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Powers",
      "content": "3. The Corporation may acquire, purchase, lease, take, hold and enjoy movable and immovable property of every description and, subject as hereinafter provided, may sell, convey, assign, surrender and yield up, mortgage, demise, re‑assign, transfer or otherwise dispose of any movable or immovable property vested in the Corporation upon such terms as to the Corporation may seem fit."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Vesting of property",
      "content": "4. The said piece of land (being Lot 132 5 T.S. III) demised to the Trustees by the said indenture together with the buildings erected thereon (which land and buildings are hereinafter called “the Hospital”) are hereby vested in the Corporation for the residue of the term of 999 years now subsisting therein for the purposes of this Ordinance freed from the trusts declared in the said indenture but subject to the terms and conditions therein contained and all chattels, moneys, bonds, securities and property belonging to Saint Andrew’s Mission Hospital or any trustees on its behalf are hereby vested in the Corporation but as to the bonds or securities specified in the First Schedule hereto upon and for the trusts and purpose more particularly specified in the First Schedule hereto. OBJECTS"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Objects and purposes",
      "content": "5. The objects and general purposes for which the Corporation is established and incorporated are — ( a ) to take over the property vested in the Corporation by section 4 hereof and to carry on and maintain the Hospital with all necessary furniture and other equipment as a Christian mission hospital and dispensary for the treatment as in-patients or out-patients of women and children suffering from disease or accident without distinction of race, language or creed; ( b ) to instruct women in the proper care of their children; ( c ) to train Asiatic girls to nurse women and children; ( d ) to offer to those who desire it a knowledge of Christianity; ( e ) to employ medical, surgical and pharmaceutical officers, nurses and attendants for the purposes aforesaid, and to provide and supply all such medical, surgical, and pharmaceutical appliances and things, and all such provisions and necessaries as may be required for the purposes aforesaid or any of them; ( f ) to solicit and accept and receive subscriptions, donations, devises and bequests (whether of immovable or movable property and whether absolute or conditional) for the general purposes of the Corporation or for any special purpose of the Corporation or subject to any trust; ( g ) to purchase or otherwise acquire land for any estate or interest and to erect buildings and maintain, alter and improve the same (including the Hospital) and to provide the same with light, water, drainage and other necessities; ( h ) to raise money for any of the above purposes or other purposes of the Corporation by mortgaging or charging all or any of the property of the Corporation (other than the Hospital) with capital sums or with terminable annuities for lives or years; ( i ) to hold, control and administer the moneys, funds, securities and property movable and immovable hereby vested in the Corporation or hereafter given to or in any manner acquired by or being in the custody or control of the Corporation and the income thereof, in accordance with the trusts or for the purposes affecting the same respectively, or in the absence of any special trust or purpose, for the general purposes of the Corporation and in particular to invest any money for the time being requiring investment in any investment authorised by law for trust funds or in the purchase of immovable property; ( j ) to do all such other lawful things as are incidental or conducive to the attainment of the above objects."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Application of income",
      "content": "6. The income of the Corporation shall be applied solely towards the promotion of the objects of the Corporation as set forth in this Ordinance, and no portion thereof shall be paid or transferred directly or indirectly by way of dividend, bonus or otherwise howsoever by way of profits to the members of the Corporation: Provided that nothing herein contained shall prevent the payment in good faith of remuneration to any officers or servants of the Corporation or to any member thereof in return for services actually rendered to the Corporation or the payment of interest upon money borrowed from any member of the Corporation, or the payment to the donor of any money or securities or his or her nominee or nominees of any annuity by way of annual interest guaranteed by the Corporation on the amount of such gift during a period not exceeding the life of the donor or such nominee or nominees."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Membership",
      "content": "7. —(1) The persons who are for the time being members of the Board of Management hereinafter constituted shall be members of the Corporation and in addition the Board of Management may appoint, with their consent, 3 classes of members of the Corporation namely — ( a ) permanent members; ( b ) ordinary members; and ( c ) honorary members. Permanent members (2) The persons named in the Register of Subscribers abovementioned, and every person who shall have subscribed in the aggregate the sum of $500, including subscriptions made to the Building Committee or the Committee of Management shall be entitled to be members for life or in the case of a firm or corporation till the dissolution of such firm or corporation and shall be called permanent members. Ordinary members (3) Every person who in any calendar year shall have subscribed the sum of $12 (twelve dollars) shall be entitled to be a member for the residue of that year, and the next following year and shall be called an ordinary member. Honorary members (4) A person may be elected an honorary member by the Board of Management hereinafter constituted in recognition of signal services to the Hospital and shall be a member for life or until he retires."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Register of members",
      "content": "8. —(1) A register of members of the Corporation shall be kept in which shall be inscribed the names of all persons and firms who are qualified and consent to become members of the Corporation. Retirement of any member (2) Any member who shall desire to retire shall signify such desire in writing to the Secretary and thereupon his name shall be removed from the register of members."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Right of membership",
      "content": "9. The right of membership is not transferable or transmissible and shall cease upon a member ceasing to be a member by death or otherwise."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Founder",
      "content": "10. Mrs. Charlotte Elizabeth Ferguson-Davie, O.B.E., M.D., who was the founder of the Hospital shall be called the Founder."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Patrons",
      "content": "11. Lady Ella Guillemard who since the year 1927 has been a Patron of the Hospital shall be a Patron and other Patrons may be elected from time to time by the Board of Management hereinafter constituted."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "President and Vice-President",
      "content": "12. The Bishop of Singapore for the time being shall be President of the Corporation and he may from time to time appoint and remove a Vice‑President."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Treasurer",
      "content": "13. There shall be a Treasurer of the Corporation who may be an honorary or salaried officer. The first Treasurer shall be Richard Vivian Welch and future Treasurers shall be appointed by the Board. The Treasurer may at any time be removed by the Board and he shall perform such functions as shall be assigned to him by the Board."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Subscriptions, donations and legacies",
      "content": "14. The Treasurer shall receive subscriptions, donations and legacies to or for the benefit of the Hospital and shall issue receipts for the same."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Name and address of Treasurer",
      "content": "15. The name and address of the Treasurer shall be published in the Gazette as soon as possible after his appointment."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Auditor",
      "content": "16. There shall be an auditor or auditors of the Corporation. The first auditors shall be Rennie Lowick & Company who shall hold office until the annual meeting to be held in the year 1935. Future auditors shall be appointed with their consent either at a salary or not by the members of the Corporation at the annual meeting in each year and shall hold office for one year. A retiring auditor may be re‑elected, and if a vacancy occurs in the office of auditor between 2 annual meetings a person shall be appointed by the Board to fill the post during the remainder of the year."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Chaplain",
      "content": "17. There shall be a Chaplain of the Hospital who shall be a clergyman of the Church of England and in priests’ orders and shall be appointed by the Bishop of Singapore and shall perform such religious services and other duties as shall be authorised or directed by the Bishop of Singapore."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Management and Board of Management",
      "content": "18. The management of the Corporation and of the property and affairs thereof shall be vested in a Board of Management (hereinafter called “the Board”) consisting of the President, the Vice‑President, the Treasurer, 8 nominated members, 2 professional members and at least 7 but not more than 15 elective members."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Nominated members",
      "content": "19. The nominated members shall be appointed in accordance with the rules in force under this Ordinance, 2 by the Society for the Propagation of the Gospel, 2 by the Singapore Diocesan Association, 2 by the Parochial Church Council of St. Andrew’s Cathedral, one by the Presbyterian Church and one by the Methodist Episcopal Church, and a nominated member shall hold office until his death, resignation or the revocation of his appointment in accordance with the rules."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Original nominated members",
      "content": "20. The following persons shall be the first nominated members, the Reverend Richard Richards and Mrs. Ursula Howard Ker, appointed by the Society for the Propagation of the Gospel, Frank Henry Geake and Gordon Alan Potts by the Singapore Diocesan Association, the Venerable Graham White and Newnham Arthur Worley by the Parochial Church Council of St. Andrew’s Cathedral, the Reverend Stephen Band by the Presbyterian Church, the Reverend Raymond Leroy Archer by the Methodist Episcopal Church."
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Professional members",
      "content": "21. The professional members of the Board shall be annually elected by the other members of the Board from the Honorary Consultants of the Hospital at the first meeting of the Board after the annual general meeting. Dr. Joseph Sandys English and Dr. John Smith Sloper shall be the first professional members."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "Elective members",
      "content": "22. The elective members of the Board shall be elected at the annual general meeting of the Corporation from amongst the members of the Corporation but no person shall be eligible for election whilst holding any salaried office under the Corporation. The first elective members of the Board shall be Mrs. Bridget Catherine Handy, Lim Kee Cheok, Christopher Gervase Windle, Lim Teck Kim, Charles Valentine Miles, Dr. Wee Hiap Tock, Miss Alice Florence King, Gordon Henry Bowen, Mrs. Gertrude Lee, Dr. Brian Maurice Johns, Dr. Lim Eng Hae, Mrs. Robina Menzies Thompson, Mrs. Edith Loveridge, Lim Bock Kee and Mrs. Dorothy Mary Roberts."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Tenure of office of elective members",
      "content": "23. All elective members of the Board shall hold office till their successors are appointed at the annual general meeting and shall be eligible for re‑election."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Casual vacancies",
      "content": "24. Casual vacancies among the elective and professional members of the Board may be filled by the Board."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Medical officers and nursing sisters",
      "content": "25. The medical officers and nursing sisters required for service in the Hospital shall from time to time be appointed by the Bishop from missionary workers selected or approved by the Society for the Propagation of the Gospel and may from time to time be removed by him, and all matters relating to their conditions of service and emoluments shall be determined by the Bishop. They shall nevertheless be subject for the period of their appointment to any general regulations made by the Board for the conduct of the professional duties of the hospital staff: Provided always that the Board may, whenever necessary, with the approval of the Bishop appoint any medical officer or nursing sister to act temporarily until such time as some missionary worker selected or approved by the said Society is available, or with the consent of the said Society may engage any person approved by the Bishop as medical officer or nursing sister for a definite period: Provided that nothing in this Ordinance shall be deemed to exempt any person from the provisions of any Ordinance relating to the registration of medical practitioners, dentists or pharmacists."
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "Powers of Board of Management",
      "content": "26. Subject to the provisions of the preceding section the Board shall have the entire superintendence and control of the Hospital and of the property and affairs of the Corporation, and shall govern, direct and decide all matters whatsoever connected with the administration of the affairs of the Corporation and the accomplishment of the objects and purposes thereof, and shall have and may exercise all the powers conferred on and vested in the Corporation by this Ordinance, and may make, vary and repeal such standing orders as they may from time to time think fit in relation to any matters within the scope of their authority, including the conduct and transaction of their business, subject nevertheless to the rules in force under this Ordinance."
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "Executive committee",
      "content": "27. The Board may delegate all or any of their powers, authorities or discretions to an executive committee consisting of such members of the Board as the Board shall think fit, or may be prescribed by the rules in force under this Ordinance and also may from time to time appoint other committees consisting wholly or partly of members of the Board for any special purposes."
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "Board to act notwithstanding any vacancy",
      "content": "28. The Board may act notwithstanding any vacancy in its body and all acts done by any meeting of the Board or of a committee of the Board shall, notwithstanding that it shall be afterwards discovered that there was some defect in the appointment of any member or members of the Board attending such meeting, or that they or any of them were disqualified, be as valid as if every person purporting to act as a member of the Board had been duly appointed, and was qualified to be a member of the Board."
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "Annual general meeting",
      "content": "29. A general meeting, to be called the annual general meeting, shall be held annually not later than the month of April in each year and at such meeting a report of all the affairs of the Hospital including the number of in-patients and out-patients treated and a full account of all the receipts and expenditure of the Corporation, together with a balance sheet for the past year, shall be presented by the Board, and there shall be elected the auditor for the ensuing year and elective members of the Board in place of the out‑going members."
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "Special meeting",
      "content": "30. The Board may at any time and shall on a requisition signed by not less than 10 members of the Corporation stating the objects of such requisition summon a special meeting of the members of the Corporation to be held not less than 3 weeks and not later than 6 weeks after the receipt of such requisition. If they neglect to do so within 14 days after the receipt of any such requisition, the requisitionists may summon such meeting. The notice convening the meeting shall specify the particular matter or matters to be discussed."
    },
    {
      "provision_ref": "s31",
      "section": "31",
      "title": "Rules",
      "content": "31. The Board may make rules subject to the approval of the Minister not inconsistent with this Ordinance — ( a ) to regulate the calling of meetings of members of the Corporation, the quorum necessary for the transaction of business, the voting of members of the Corporation and the procedure for the transaction of business; ( b ) to regulate the proceedings of the Board, the calling of meetings, the quorum necessary for the transaction of business, the voting of the members of the Board and the procedure for the transaction of business; ( c ) for the appointment of an executive committee and other committees and for the delegation of all or any of the powers of the Board to any such committee; ( d ) for the appointment of a Secretary either honorary or as a salaried officer; ( e ) to regulate the exercise of executive power by the Board or the Executive Committee or other committees and the officers of the Corporation and the custody and use of the common seal; ( f ) to regulate the keeping and presentation of accounts and the register of members; ( g ) to regulate the general administration of the Hospital; ( h ) generally to carry out the objects of this Ordinance."
    },
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Rules in Second Schedule to apply",
      "content": "32. The rules set forth in the Second Schedule hereto shall be the rules of the Corporation until the same shall be repealed or altered in manner hereinafter provided."
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Revocation, alteration and addition of rules",
      "content": "33. The rules or any of them may from time to time be revoked, altered or added to by the Board provided that due notice shall have been given to the members of the Board of the proposed revocation, alteration or addition and that such revocation, alteration or addition is approved by a majority of not less than two‑thirds of the members voting on the question."
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "No revocation, alteration or addition of rules unless approved by Minister",
      "content": "34. No revocation, alteration or addition of the rules set out in the Second Schedule hereto shall come into operation until the same shall have been approved by the Minister and shall have been published in the Gazette ."
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Winding up",
      "content": "35. It shall be lawful for the Board with the sanction of a special general meeting of the members of the Corporation called for the purpose to wind up the affairs of the Corporation in such manner as shall be directed by such special general meeting, or, in default of such direction, as the Board shall think expedient, having due regard to the liabilities of the Corporation for the time being; and on the winding up of the Corporation the investments specified in the First Schedule and any property whatsoever which may remain, after satisfaction of all its debts and liabilities, shall not be paid or distributed amongst the members of the Corporation or any of them, but shall be given and transferred to some missionary association, society or institution of the Church of England within the Diocese of Singapore having objects similar or in part similar to the objects of the Corporation, such association, society or institution to be determined by a majority of three‑fourths of the Board of Management, with the approval of the Society for the Propagation of the Gospel, and in default thereof by the General Division of the High Court. [40/2019]"
    },
    {
      "provision_ref": "s36",
      "section": "36",
      "title": "Saving of Government and other rights",
      "content": "36. Nothing in this Ordinance contained shall affect the rights of the Government, all bodies politic and corporate and all others except such as are mentioned in this Ordinance and those claiming by, from or under them. [7/97]"
    }
  ],
  "definitions": []
}