{
  "id": "sbfa-2001",
  "type": "statute",
  "title": "Singapore Business Federation Act 2001",
  "title_en": "Singapore Business Federation Act 2001",
  "short_name": "SBFA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SBFA2001",
  "description": "An Act to provide for membership of certain local and foreign companies in the Singapore Business Federation and for certain matters relating to the management and operation thereof.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Singapore Business Federation Act 2001."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “authorised person” means a person authorised by the Board; “Board” means the Board of Trustees of the Singapore Business Federation mentioned in its Constitution; “Constitution”, in relation to the Singapore Business Federation, means the instrument constituting the Singapore Business Federation and containing the rules thereof, and subject to which the Federation is registered under the Societies Act 1966; “Council” means the Council of the Singapore Business Federation mentioned in its Constitution; “foreign chambers of commerce and industry” means any organisation in Singapore which represents the interests of persons from a foreign country, or any region or part of a foreign country, who are carrying on business in Singapore; “foreign company” means a foreign company which is registered under Division 2 of Part 11 of the Companies Act 1967 or under any corresponding previous written law; “local company” means a company incorporated under Division 1 of Part 3 of the Companies Act 1967 or under any corresponding previous written law; “rules”, in relation to the Singapore Business Federation, has the meaning given by section 11(3) of the Societies Act 1966; “Singapore Business Federation” means the society registered under the Societies Act 1966 by that name, and “Federation” is to be construed accordingly."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Objects of Singapore Business Federation",
      "content": "3. The objects of the Singapore Business Federation are — ( a ) to enhance the organisation of the business community in Singapore; and ( b ) to represent, advance, promote and protect, in Singapore and abroad, the major business concerns (such as investment and trade opportunities and labour management issues) of business entities carrying on commerce and industry in Singapore and, in particular, of larger local and foreign companies."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Composition of Council",
      "content": "4. —(1) The Council consists of the members specified in the Constitution of the Federation who must include — ( a ) one nominee from each of the local ethnic chambers of commerce and industry specified in the Schedule; and ( b ) such number of representatives from foreign chambers of commerce and industry, not exceeding one‑quarter of the total number of members of the Council. (2) The Minister may, by order in the Gazette , amend, add to or vary the Schedule."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Membership of Federation",
      "content": "5. —(1) Every — ( a ) local company which has a paid-up share capital of or above the amount of $500,000; and ( b ) foreign company which has an authorised share capital of or above the amount of $500,000, becomes, by virtue of this section and without election, admission or appointment, a member of the Federation, unless the membership of the local or foreign company is terminated in accordance with the Constitution of the Federation. (2) The Minister may, by order in the Gazette — ( a ) exempt any local or foreign company or any class of local or foreign companies from subsection (1); and ( b ) substitute the amount of paid-up share capital or authorised share capital specified in subsection (1)( a ) or ( b ) (as the case may be) with any other amount that the Minister may determine."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Appointment of Board",
      "content": "6. —(1) The Minister is to appoint the Board of Trustees of the Federation, consisting of such number of trustees as the Minister thinks fit. (2) The Minister may appoint one of the trustees on the Board to be the Chairperson. (3) The Chairperson and every other trustee on the Board hold office on such terms and conditions and for such period as the Minister may determine. (4) The Minister may, at any time, remove or replace any trustee on the Board and appoint new or additional trustees to the Board."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Functions and powers of Board",
      "content": "7. —(1) The Board is responsible for ensuring that — ( a ) the Federation acts in furtherance of its objects as set out in this Act and in its Constitution; ( b ) the funds and assets of the Federation are properly accounted for and safeguarded; and ( c ) the persons who are members of the Council are fit and proper persons to hold such office. (2) The approval of the Board is required for the following matters: ( a ) the annual report and accounts of the Federation; ( b ) the annual budget of the Federation; ( c ) the acquisition, sale, lease, mortgage, alienation or disposal by the Federation of any movable or immovable property of such value as the Board may determine; ( d ) the appointment of members of the Council; ( e ) any proposed amendment to or variation of the Constitution of the Federation."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Accounts to be kept",
      "content": "8. —(1) The Council must — ( a ) cause to be kept full and proper accounts and records of all financial transactions of the Federation; ( b ) ensure that payments out of the funds of the Federation are correctly made and properly authorised; and ( c ) ensure that adequate control is maintained over the assets and receipts of the funds of the Board. (2) The accounts of the Federation must be audited by an auditor appointed by the Council with the approval of the Board. (3) A person is not qualified for appointment as an auditor under subsection (2) unless the person is a public accountant within the meaning of the Companies Act 1967. (4) The Council must cause a copy of the audited accounts of the Federation and the auditor’s report to be submitted to the Board. (5) The Minister may, by regulations made under section 13, provide for the proper control and management of the funds of the Federation and for the proper accounting, reporting, auditing and periodic examination of the accounts of the Federation."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Access to accounts and other records",
      "content": "9. —(1) The Board or any authorised person is entitled, at all reasonable times, to full and free access to all accounting and other records relating, directly or indirectly, to the financial transactions of the Federation. (2) The Board or any authorised person may require any person to disclose or furnish to the Board or authorised person (as the case may be) such information or document which such person possesses or has access to as the Board or authorised person considers necessary — ( a ) for the purpose of ascertaining whether the funds of the Federation have been applied or expended in accordance with or in furtherance of its objects as set out in this Act and in its Constitution; or ( b ) for the proper discharge by the Board of its functions under this Act. (3) Any person who — ( a ) without reasonable excuse, fails to comply with any requirement of the Board or any authorised person under subsection (2); ( b ) furnishes to the Board or any authorised person any information or document which the person knows or has reason to believe is false; or ( c ) hinders, obstructs or delays the Board or any authorised person in the performance by the Board or the authorised person of their respective duties or in the exercise of their respective powers under this section, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Dissolution of Federation",
      "content": "10. —(1) The Federation must not be dissolved without the prior approval of the Minister. (2) Upon dissolution of the Federation, the movable or immovable property of the Federation must be disposed of in such manner as may be determined by its members and approved by the Board."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Act to prevail over Constitution of Federation",
      "content": "11. —(1) Any provision of the Constitution of the Federation that is inconsistent with this Act shall, to the extent of the inconsistency, be void. (2) Nothing in this Act is to be construed to excuse or exempt the Federation from complying with any written law that (apart from this Act) would apply to it."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Subscriptions payable by members",
      "content": "12. —(1) Every local or foreign company that is a member of the Federation by virtue of this Act must pay to the Federation an annual or periodic subscription of such amount as may be — ( a ) determined by the Council after consultation with the Board; and ( b ) approved by the Minister. (2) For the purpose of subsection (1), the Council, after consultation with the Board and subject to the approval of the Minister, may — ( a ) divide the members of the Federation into different classes; ( b ) determine that different amounts of subscription are to be payable by different classes of such members and for different periods; ( c ) vary from time to time, the subscriptions payable by such members or different classes of such members; and ( d ) determine the rate of interest that is payable by any such member in the event that any subscription due from such member remains unpaid for such period as the Federation may determine. (3) The amount of subscription prescribed as being payable by any member of the Federation under this section must not exceed in the aggregate $1,500 in any calendar year. (4) Any subscription that is payable to the Federation under this section may be recovered by the Council by an action for a debt in any court of competent jurisdiction. [33/2018]"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Power to make regulations",
      "content": "13. The Minister may make such regulations as may be necessary or expedient for the purposes of this Act."
    }
  ],
  "definitions": [
    {
      "term": "authorised person",
      "definition": "“authorised person” means a person authorised by the Board;",
      "source_provision": "s2"
    },
    {
      "term": "Board",
      "definition": "“Board” means the Board of Trustees of the Singapore Business Federation mentioned in its Constitution;",
      "source_provision": "s2"
    },
    {
      "term": "Constitution",
      "definition": "“Constitution” , in relation to the Singapore Business Federation, means the instrument constituting the Singapore Business Federation and containing the rules thereof, and subject to which the Federation is registered under the Societies Act 1966;",
      "source_provision": "s2"
    },
    {
      "term": "Council",
      "definition": "“Council” means the Council of the Singapore Business Federation mentioned in its Constitution;",
      "source_provision": "s2"
    },
    {
      "term": "foreign chambers of commerce and industry",
      "definition": "“foreign chambers of commerce and industry” means any organisation in Singapore which represents the interests of persons from a foreign country, or any region or part of a foreign country, who are carrying on business in Singapore;",
      "source_provision": "s2"
    },
    {
      "term": "foreign company",
      "definition": "“foreign company” means a foreign company which is registered under Division 2 of Part 11 of the Companies Act 1967 or under any corresponding previous written law;",
      "source_provision": "s2"
    },
    {
      "term": "local company",
      "definition": "“local company” means a company incorporated under Division 1 of Part 3 of the Companies Act 1967 or under any corresponding previous written law;",
      "source_provision": "s2"
    },
    {
      "term": "rules",
      "definition": "“rules” , in relation to the Singapore Business Federation, has the meaning given by section 11(3) of the Societies Act 1966;",
      "source_provision": "s2"
    },
    {
      "term": "Singapore Business Federation",
      "definition": "“Singapore Business Federation” means the society registered under the Societies Act 1966 by that name, and “Federation” is to be construed accordingly.",
      "source_provision": "s2"
    }
  ]
}