{
  "id": "sca-1970",
  "type": "statute",
  "title": "State Courts Act 1970",
  "title_en": "State Courts Act 1970",
  "short_name": "SCA1970",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SCA1970",
  "description": "An Act relating to the constitution, jurisdiction and powers of the State Courts and the administration of justice therein. [5/2014]",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the State Courts Act 1970. [5/2014]"
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “action” means a civil proceeding commenced by summons or in any other manner prescribed by Rules of Court; “commissioner for oaths” means a commissioner for oaths appointed under section 68 of the Supreme Court of Judicature Act 1969; “Coroner” has the meaning given by section 2(1) of the Coroners Act 2010; “District Court limit” means $250,000 or any other amount specified by an order under section 30; “judicial officer” means a District Judge, Magistrate or registrar; “Magistrate’s Court limit” means $60,000 or any other amount specified by an order under section 52(3); “prescribed” means prescribed by Rules of Court; “registrar” means the registrar of the State Courts and includes a deputy registrar; “Rules of Court” means Rules of Court made under this Act and includes forms; “seal” includes stamp. [14/2010; 5/2014; 27/2014]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - CONSTITUTION",
      "section": "3",
      "title": "State Courts",
      "content": "3. —(1) There are within Singapore the following subordinate courts called the State Courts: ( a ) District Courts; ( b ) Magistrates’ Courts; ( c ) Coroners’ Courts; ( d ) Small Claims Tribunals; ( e ) Employment Claims Tribunals. [21/2016] (1A) The District Courts and Magistrates’ Courts have the jurisdiction conferred by this Act and any other written law. [21/2016] (2) The Small Claims Tribunals have the jurisdiction conferred by the Small Claims Tribunals Act 1984 and any other written law. (3) [ Deleted by Act 33 of 2018 ] (4) The Coroners’ Courts have the jurisdiction that is conferred by the Coroners Act 2010 and any other written law. [14/2010] (5) The Employment Claims Tribunals have the jurisdiction that is conferred by the Employment Claims Act 2016 and any other written law. [21/2016]"
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - CONSTITUTION",
      "section": "4",
      "title": "Constitution of State Courts",
      "content": "4. The President may constitute under appropriate names so many State Courts as the President thinks fit. [5/2014] [Act 25 of 2021 wef 01/04/2022] [S 759/2022]"
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - CONSTITUTION",
      "section": "5",
      "title": "Seals of courts",
      "content": "5. The State Courts are to have and use as occasion may require a seal or seals of such nature as the Chief Justice may, by notification in the Gazette , prescribe. [5/2014]"
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - CONSTITUTION",
      "section": "6",
      "title": "Process of courts",
      "content": "6. Subject to Rules of Court, all writs, summonses, warrants, orders, notices and other mandatory processes issued by the State Courts must be signed by a judicial officer and must bear the seal of the court issuing the same. [5/2014]"
    },
    {
      "provision_ref": "s6A",
      "chapter": "PART 2 - CONSTITUTION",
      "section": "6A",
      "title": "Sittings of State Courts",
      "content": "6A. —(1) Subject to subsection (2), every State Court is to sit on every day of the year except on Saturdays, Sundays and public holidays. [5/2014] (2) Despite subsection (1), a judicial officer may lawfully sit on a Saturday, Sunday or public holiday or during a vacation authorised under section 61 if — ( a ) the Presiding Judge of the State Courts, with the concurrence of the Chief Justice, has directed the judicial officer to sit on that day or during that vacation; or ( b ) in the opinion of the judicial officer, the business to be despatched is extremely urgent. [5/2014] (3) Every State Court is to sit at such times and at such places as the Chief Justice may from time to time appoint. [5/2014] [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - CONSTITUTION",
      "section": "7",
      "title": "Sittings in private, etc.",
      "content": "7. —(1) The place in which any State Court is held is deemed an open and public court to which the public generally may have access. [5/2014] (2) A State Court has the power to hear any matter or proceeding or any part thereof in private if the court is satisfied that it is expedient in the interests of justice, public safety, public security or propriety, the national interest or national security of Singapore, or for other sufficient reason to do so. [5/2014; 19/2018] [Act 25 of 2021 wef 01/04/2022] (2AA) Any application for a matter or proceeding to be held in private, on the grounds that it is expedient in the national interest or national security of Singapore to do so, is to be heard in private. [Act 25 of 2021 wef 01/04/2022] (2AB) A State Court has the power to hear any application mentioned in subsection (2AA), or any part of such an application, otherwise than in private, if the court is satisfied that — ( a ) it is expedient in the interests of justice to hear the application or part of the application otherwise than in private; and ( b ) it is not prejudicial to the national interest or national security of Singapore to hear the application or part of the application otherwise than in private. [Act 25 of 2021 wef 01/04/2022] (2A) A State Court may, in any matter or proceeding or any part thereof tried or held or to be tried or held before it, if satisfied that it is expedient in the interests of justice, public safety, public security or propriety, the national interest or national security of Singapore, or for other sufficient reason to do so, order that — ( a ) the name, address or photograph of any witness; [Act 25 of 2021 wef 01/04/2022] ( b ) any evidence or any other thing likely to lead to the identification of such witness by a person other than the party to that matter or proceeding; or [Act 25 of 2021 wef 01/04/2022] ( c ) any information that, if disclosed, may be prejudicial to the national interest or national security of Singapore, which is contained in any court document intended to be produced before the court, be removed or be sufficiently redacted. [15/2010; 5/2014] [Act 25 of 2021 wef 01/04/2022] (3) A State Court may at any time order that no person is to — ( a ) publish the name, address or photograph of any witness in any matter or proceeding or any part thereof tried or held or to be tried or held before it, or any evidence or any other thing likely to lead to the identification of any such witness; [Act 25 of 2021 wef 01/04/2022] ( b ) do any other act which is likely to lead to the identification of any witness mentioned in paragraph ( a ); or [15/2010; 5/2014] [Act 25 of 2021 wef 01/04/2022] ( c ) publish any information relating to any matter or proceeding before the court that, if disclosed, may be prejudicial to the national interest or national security of Singapore. [Act 25 of 2021 wef 01/04/2022] (4) Any person who acts in contravention of any order under subsection (2A) or (3) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both. [15/2010] (5) A State Court that hears the whole or any part of any matter or proceeding in private may, in its discretion, permit any of the following individuals to be present in the courtroom while that matter or proceeding is heard in private: ( a ) any journalist who reports news for a newspaper or a broadcasting service; ( b ) any individual whom the court determines has a sufficient interest in that matter or proceeding; ( c ) any other individual that the court specifies in any particular case. [19/2018] [Act 25 of 2021 wef 01/04/2022] (6) For the purposes of subsection (2), the matters that a State Court may consider, when deciding whether it is expedient in the interests of justice, public safety, public security or propriety, the national interest or national security of Singapore, or for other sufficient reason, to hear the whole or any part of any matter or proceeding in private, include the following matters: ( a ) whether the defence of any accused person in that matter or proceeding will be prejudiced by the presence of any member of the public in the courtroom; ( b ) whether any accused person or witness in that matter or proceeding has any legitimate interest in privacy that needs to be protected; ( c ) whether the object of that matter or proceeding will be defeated by publicity if that matter or proceeding is heard in open court; ( d ) whether any accused person or witness in that matter or proceeding has any legitimate interest in protecting the confidentiality of any information that may be disclosed during the hearing of that matter or proceeding; ( e ) whether any information that may be disclosed during the hearing of that matter or proceeding will be prejudicial to the interests of Singapore. [19/2018] [Act 25 of 2021 wef 01/04/2022] (7) In this section — “broadcasting service” has the meaning given by section 2(1) of the Broadcasting Act 1994; “newspaper” has the meaning given by section 2(1) of the Newspaper and Printing Presses Act 1974. [19/2018]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - CONSTITUTION",
      "section": "8",
      "title": "State Court may conduct hearing through electronic means of communication",
      "content": "8. —(1) Without limiting section 7, a State Court may conduct the hearing of any matter or proceeding (other than a matter or proceeding prescribed by the Rules of Court or the Criminal Procedure Rules) through a live video link, a live television link, a live audio link or any other electronic means of communication approved by the Chief Justice. [Act 25 of 2021 wef 01/04/2022] (2) Subsection (1) does not affect the operation of section 26A of the Administration of Justice (Protection) Act 2016, section 62A of the Evidence Act 1893 and section 281 of the Criminal Procedure Code 2010. [46/2018] [Act 25 of 2021 wef 01/04/2022] (3) A State Court must not conduct any part of a hearing of a matter through a live audio link only, without an accompanying live video link or live television link — ( a ) where oral evidence is given during that part of the hearing (including in a trial of an offence) in a criminal proceeding; ( b ) where oral evidence is given during that part of the hearing (including in a trial of an action) in a civil proceeding, unless all the parties consent; or ( c ) where the matter is prescribed by the Rules of Court or the Criminal Procedure Rules. [Act 25 of 2021 wef 01/04/2022] (4) For the purposes of subsection (3), a court is not considered to have conducted a part of a hearing of a matter through a live audio link only and without an accompanying live video link or live television link, by reason only of a temporary disruption in the accompanying live video link or live television link that was insignificant and which did not affect the court’s duty to conduct proceedings fairly. [Act 25 of 2021 wef 01/04/2022] (5) A State Court must not conduct a hearing of a matter or proceeding in the manner provided under subsection (1), if to do so would be inconsistent with the court’s duty to ensure that the hearing is conducted fairly to all parties. [Act 25 of 2021 wef 01/04/2022] (6) A State Court is deemed to be sitting at a place appointed under section 6A(3) when the court conducts a hearing of a matter or proceeding in the manner provided under subsection (1) (whether any judicial officer of the court is situated in Singapore or outside Singapore). [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s8A",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "8A",
      "title": "Appointment of Presiding Judge of State Courts",
      "content": "8A. —(1) For the purposes of the administration of this Act, the President may, on the recommendation of the Chief Justice, appoint a Supreme Court Judge or a Judicial Commissioner to be the Presiding Judge of the State Courts for such period as the Chief Justice may recommend. [5/2014; 40/2019] (2) Despite any other written law, the Presiding Judge of the State Courts may sit in any State Court and act as a judge (however described) thereof, in which case the Presiding Judge has all the jurisdiction, power and privileges of such a judge. [5/2014] (3) A Supreme Court Judge or a Judicial Commissioner may, during the period of his or her appointment as the Presiding Judge of the State Courts, continue to sit in the General Division of the High Court, the Appellate Division of the High Court or the Court of Appeal in accordance with the Constitution. [5/2014; 40/2019] (4) Any person appointed to be the Presiding Judge of the State Courts is, although the period of his or her appointment as such has expired or his or her appointment as such has been revoked, in relation to any case heard by him or her as a judge (however described) of a State Court, to continue to sit as such a judge for the purpose of giving judgment or otherwise. [5/2014]"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "9",
      "title": "Appointments and qualifications of District Judges",
      "content": "9. —(1) Subject to section 8A, a District Court is to be presided over by a District Judge appointed by the President on the recommendation of the Chief Justice. [5/2014] (2) [ Deleted by Act 5 of 2014 ] (3) A person must not be appointed to be or to act as a District Judge unless he or she has been for not less than 7 years a qualified person as defined in section 2 of the Legal Profession Act 1966. [5/2014] (3A) Despite subsection (3), a person may be appointed to be or to act as a District Judge if — ( a ) the person has been for not less than 5 years a qualified person as defined in section 2 of the Legal Profession Act 1966; and ( b ) the Chief Justice, after having regard to the qualifications and experience of the person, is of the opinion that the person is suitable to be appointed as a District Judge. [5/2014] (4) Any person appointed to be or to act as a District Judge is, although the period of his or her appointment has expired or his or her appointment has been revoked, to sit as a District Judge for the purpose of giving judgment or otherwise in relation to any case heard by him or her. (5) Every person appointed to be or to act as a District Judge is ex officio a Magistrate."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "10",
      "title": "Appointments and qualifications of Magistrates",
      "content": "10. —(1) The President may, on the recommendation of the Chief Justice, appoint any fit and proper person to be a Magistrate. [14/2010] (2) A person must not be appointed to be or to act as a Magistrate unless he or she has been for not less than 3 years a qualified person as defined in section 2 of the Legal Profession Act 1966. [14/2010; 5/2014] (3) Despite subsection (2), a person may be appointed to be or to act as a Magistrate if — ( a ) the person has been for not less than one year a qualified person as defined in section 2 of the Legal Profession Act 1966; and ( b ) the Chief Justice, after having regard to the qualifications and experience of the person, is of the opinion that the person is suitable to be appointed as a Magistrate. [5/2014]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "11",
      "title": "Justices of the Peace",
      "content": "11. —(1) The President may, by warrant under his or her hand, appoint fit and proper persons to be Justices of the Peace. (2) Justices of the Peace have and may exercise such powers and perform such duties of a Magistrate as may be conferred on them by any written law."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "12",
      "title": "Appointments and qualifications of registrar and deputy registrars of State Courts",
      "content": "12. —(1) There are to be appointed by the Chief Justice a registrar and so many deputy registrars as may be necessary for the State Courts. [5/2014] (2) A person must not be appointed to be or to act as registrar unless he or she is a qualified person as defined in section 2 of the Legal Profession Act 1966, except that the Chief Justice may, in his or her discretion, appoint any person who is not a qualified person under that Act. (3) The registrar and the deputy registrars are ex officio commissioners for oaths."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "13",
      "title": "Powers and duties of deputy registrars",
      "content": "13. Subject to Rules of Court, all the powers and duties conferred and imposed on the registrar may be exercised by a deputy registrar."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "14",
      "title": "State Court officers",
      "content": "14. There are to be attached to the State Courts such commissioners for oaths, interpreters, clerks, bailiffs, process servers and other officers as may appear to the Chief Justice to be necessary for the administration of justice and the due execution of all powers and duties which are vested in the State Courts. [5/2014]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "15",
      "title": "Powers and duties of certain State Court officers, etc.",
      "content": "15. —(1) The bailiffs and process servers are to — ( a ) execute all writs, summonses, warrants, orders, notices and other mandatory processes of the State Courts given to them; ( b ) make a return of the same together with the manner of the execution thereof to the court from which the process issued; and ( c ) arrest and receive all such persons and property as are committed to the custody of the State Courts. [5/2014] [Act 25 of 2021 wef 01/04/2022] (2) The registrar may engage any auxiliary police officer appointed under the Police Force Act 2004 * , any security agency, a provider of transport and of warehousing, a valuer, an estate agent, a broker, a solicitor or any other appropriate person to assist the bailiffs in the discharge of the bailiffs’ duties. [*Updated to be consistent with the 2020 Revised Edition] [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s15A",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "15A",
      "title": "Solicitor, etc., authorised to act as bailiff",
      "content": "15A. —(1) Subject to any directions that may be given by the Presiding Judge of the State Courts, the registrar may authorise a solicitor or a person employed by a solicitor to exercise the powers and perform the duties of a bailiff during such period or on such occasion as the registrar thinks fit and subject to such terms and conditions as the registrar may determine. [4/2010; 5/2014] (2) Section 68(2) applies to a solicitor or person authorised under subsection (1) as it applies to an officer of a State Court. [5/2014]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "16",
      "title": "Special powers of bailiffs",
      "content": "16. The bailiffs in executing any enforcement order for seizure and sale of property, any other enforcement order or any writ of distress may effect an entry into any building, and for that purpose, if necessary, may break open any outer or inner door or window of the building or any receptacle therein, using such force as is reasonably necessary to effect an entry. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "17",
      "title": "Oaths of judicial officers and certain other officers",
      "content": "17. —(1) All judicial officers and any other officers of the State Courts as may be required by the Chief Justice, before exercising the functions of their respective offices, are to take and subscribe the appropriate oath of office and allegiance set out in the Schedule. [5/2014] (2) The oath mentioned in subsection (1) may be taken and subscribed before the Presiding Judge of the State Courts, the Presiding Judge of the Family Justice Courts, a Supreme Court Judge or a Judicial Commissioner. [4/2010; 5/2014; 27/2014; 40/2019] (2A) To avoid doubt, where an oath is required to be taken and subscribed under subsection (1), a person may take and subscribe the oath by appearing before the Presiding Judge of the State Courts, the Presiding Judge of the Family Justice Courts, a Supreme Court Judge or a Judicial Commissioner through a live video link or live television link created using a remote communication technology that allows the Presiding Judge of the State Courts, Presiding Judge of the Family Justice Courts, Supreme Court Judge or Judicial Commissioner (as the case may be) to — ( a ) maintain visual contact and communicate with the person taking the oath, and any interpreter present, throughout the process; ( b ) confirm the identity of the person taking the oath and any interpreter present; and ( c ) verify by inspection the oath to be subscribed. [Act 25 of 2023 wef 01/12/2023] (3) Where the oath is taken before the Presiding Judge of the State Courts, he or she is to — ( a ) enter in the record of the State Courts that the oath was duly administered and taken before him or her; and ( b ) transmit a certified copy of the entry to the Registrar of the Supreme Court. [4/2010; 5/2014] (4) Where the oath is taken before the Presiding Judge of the Family Justice Courts, he or she is to — ( a ) enter in the record of the Family Justice Courts that the oath was duly administered and taken before him or her; ( b ) transmit a certified copy of the entry to the Registrar of the Supreme Court; and ( c ) transmit a certified copy of the entry to the Presiding Judge of the State Courts. [27/2014]"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - APPOINTMENTS, POWERS AND DUTIES",
      "section": "18",
      "title": "Appointments and revocations to be gazetted",
      "content": "18. All appointments and revocations made under this Part must be published in the Gazette ."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - JURISDICTION",
      "section": "19",
      "title": "General civil jurisdiction",
      "content": "19. —(1) A District Court exercising civil jurisdiction is a court of record. (2) Subject to subsections (3) and (4), a District Court has all the jurisdiction of the General Division of the High Court to hear and try any action in personam where — ( a ) the defendant is served with an originating claim or any other originating process — (i) in Singapore in the manner prescribed by Rules of Court; or (ii) outside Singapore in the circumstances authorised by and in the manner prescribed by Rules of Court; or [Act 25 of 2021 wef 01/04/2022] ( b ) the defendant submits to the jurisdiction of a District Court. [31/2010; 40/2019] (3) Subject to section 28A of the Supreme Court of Judicature Act 1969 and any order under subsection (1) thereof, a District Court’s jurisdiction under subsection (2) does not include — ( a ) any supervisory jurisdiction or revisionary jurisdiction; ( b ) any jurisdiction relating to the judicial review of any act done or decision made by any person or authority, including the issue of any of the following prerogative orders: (i) a Mandatory Order; (ii) a Prohibiting Order; (iii) a Quashing Order; (iv) an Order for Review of Detention; ( c ) any jurisdiction vested exclusively in the General Division of the High Court, in a Family Court, in a Youth Court, in any other State Court, or in any judicial, quasi‑judicial or administrative tribunal, by written law; [Act 23 of 2019 wef 01/04/2022] ( ca ) any jurisdiction to hear and try an action in passing off; and [Act 23 of 2019 wef 01/04/2022] ( d ) any jurisdiction expressly excluded by written law. [31/2010; 5/2014; 27/2014; 40/2019] (4) Subject to sections 22 and 23, a District Court’s jurisdiction under subsection (2) does not include jurisdiction to hear and try any action where — ( a ) the amount claimed in the action exceeds the District Court limit; or ( b ) any remedy or relief sought in the action is in respect of a subject matter the value of which exceeds the District Court limit. [31/2010] (5) [ Deleted by Act 27 of 2014 ] (6) Without limiting subsection (2), a District Court has such jurisdiction as is vested in it by any other written law. 20. [ Repealed by Act 31 of 2010 ] 21. [ Repealed by Act 31 of 2010 ]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 4 - JURISDICTION",
      "section": "22",
      "title": "Abandonment of part of claim to give District Court jurisdiction",
      "content": "22. —(1) Where — ( a ) the amount claimed in an action exceeds the District Court limit, or any remedy or relief sought in an action is in respect of a subject matter the value of which exceeds the District Court limit; and ( b ) a District Court would have jurisdiction under section 19(2) to hear and try the action if the amount or value (as the case may be) did not exceed the District Court limit, the claimant may abandon the excess amount or that remedy or relief, as the case may be, and thereupon a District Court has jurisdiction under section 19(2) to hear and try the action, except that the claimant cannot in that action — ( c ) recover an amount exceeding the District Court limit; and ( d ) obtain any remedy or relief in respect of the subject matter the value of which exceeds the District Court limit. [31/2010] [Act 25 of 2021 wef 01/04/2022] (2) Where a District Court has jurisdiction to hear and try an action by virtue of this section, the judgment of the court in the action is a full discharge of all demands in respect of the cause of action."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 4 - JURISDICTION",
      "section": "23",
      "title": "Jurisdiction by agreement in certain actions",
      "content": "23. Where the parties to an action agree, by a memorandum signed by them or their respective solicitors, a District Court has jurisdiction under section 19(2) to hear and try the action even though — ( a ) the amount claimed in the action exceeds the District Court limit; or ( b ) any remedy or relief sought in the action is in respect of a subject matter the value of which exceeds the District Court limit. [31/2010] 24. [ Repealed by Act 26 of 2005 ]"
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 4 - JURISDICTION",
      "section": "25",
      "title": "Jurisdiction in actions for recovery of immovable property",
      "content": "25. Without limiting section 19, a District Court has jurisdiction under section 19(2) to hear and try any action for the recovery of immovable property with or without a claim for rent or mesne profits and whether or not the title to the property is in dispute, where — ( a ) the annual value of the property appearing in the Valuation List prepared under section 10 of the Property Tax Act 1960 does not exceed the District Court limit; ( b ) the annual rent payable by the tenant does not exceed the District Court limit or the monthly rent payable by the tenant does not exceed one-twelfth of the District Court limit; or ( c ) if the annual value, annual rent or monthly rent cannot be ascertained, the last transacted price of the property does not exceed 10 times the District Court limit. [31/2010]"
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 4 - JURISDICTION",
      "section": "26",
      "title": "Equity jurisdiction",
      "content": "26. Without limiting section 19, a District Court has jurisdiction under section 19(2) to hear and try any of the following proceedings: ( a ) [ Deleted by Act 27 of 2014 ] ( b ) proceedings for the execution of any trust or for a declaration that a trust subsists, where the amount or value of the property subject, or alleged to be subject, to the trust does not exceed the District Court limit; ( c ) proceedings for foreclosure or redemption of any mortgage or for enforcing any charge or lien, where the amount owing in respect of the mortgage, charge or lien does not exceed the District Court limit; ( d ) proceedings for the specific performance, or for the rectification, delivery up or cancellation of any agreement for the sale, purchase or lease of any property, where, in the case of a sale or purchase, the purchase money or, in the case of a lease, the amount or value of the property does not exceed the District Court limit; ( e ) [ Deleted by Act 27 of 2014 ] ( f ) proceedings for the dissolution or winding up of any partnership (other than a limited liability partnership registered under the Limited Liability Partnerships Act 2005), whether or not the existence of the partnership is in dispute, where the amount or value of all the assets of the partnership does not exceed the District Court limit; ( g ) proceedings for relief against fraud or mistake where the damage sustained or the amount or value of the estate or fund in respect of which relief is sought does not exceed the District Court limit. [31/2010; 27/2014] 27. [ Repealed by Act 27 of 2014 ]"
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 4 - JURISDICTION",
      "section": "28",
      "title": "Jurisdiction to issue writ of distress",
      "content": "28. A District Court has jurisdiction under the Distress Act 1934 in all cases where the amount of rent distrained or to be distrained does not exceed the District Court limit."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 4 - JURISDICTION",
      "section": "29",
      "title": "Jurisdiction to grant relief by interpleader",
      "content": "29. —(1) Without limiting section 19, a District Court has jurisdiction under section 19(2) to grant relief by way of interpleader — ( a ) where a bailiff of a District Court is charged with the execution of any writ or order of the Court and claim is made to any money or other movable property taken or intended to be taken in execution of the writ or order, or to the proceeds or value of any such property, by any person other than the person against whom the writ or order was issued or made; and ( b ) where the person seeking relief is under liability for any debt, money, or other movable property of which the amount or value does not exceed the District Court limit and for or in respect of which the person has been or expects to be sued by 2 or more parties making adverse claims thereto. [31/2010] (2) If it appears to the General Division of the High Court that any proceedings in the General Division of the High Court by way of interpleader, in which the amount in dispute or value of the subject matter does not exceed the District Court limit, may be more conveniently tried in a District Court, the General Division of the High Court may at any time order that the proceedings be transferred to a District Court. [40/2019]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 4 - JURISDICTION",
      "section": "30",
      "title": "Variation of District Court limit",
      "content": "30. The President may, after consulting the Chief Justice, by order vary the District Court limit mentioned in any of the foregoing provisions."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 4 - JURISDICTION",
      "section": "31",
      "title": "Powers of District Court same as General Division of High Court",
      "content": "31. —(1) A District Court, as regards any action within its jurisdiction, is in any proceedings before it — ( a ) to grant such relief, redress or remedy or combination of remedies, either absolute or conditional; and ( b ) to give such and the like effect to every ground of defence or counterclaim equitable or legal, as ought to be granted or given in the like action by the General Division of the High Court and in as full and ample a manner. [40/2019] (2) Without limiting subsection (1), a District Court, as regards any action within its jurisdiction, has power — ( a ) to grant an injunction whether or not any other relief is or could be claimed; ( b ) to make binding declarations of rights whether or not any consequential relief is or could be claimed; and ( c ) to order medical examination of a person who is a party to any proceedings where the physical or mental condition of the person is relevant to any matter in question in the proceedings. [31/2010]"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 4 - JURISDICTION",
      "section": "32",
      "title": "Powers of District Judge in chambers",
      "content": "32. A District Judge has power in any civil proceeding pending in a District Court to make any order or to exercise any authority or jurisdiction which, if it related to a proceeding pending in the General Division of the High Court, might be made or exercised by a Judge sitting in chambers in the General Division of the High Court. [31/2010; 40/2019]"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 4 - JURISDICTION",
      "section": "33",
      "title": "Assessors",
      "content": "33. —(1) In any proceedings, a District Judge may, if he or she thinks fit on the application of any party, or on his or her own motion, summon to his or her assistance, in such manner that is prescribed by Rules of Court, one or more persons of skill and experience in the matter to which the proceedings relate who may be willing to sit with the District Judge and act as assessors. (2) Subject to subsection (3), the remuneration of assessors for sitting under this section is to be at such rate as may be prescribed by Rules of Court and is to be costs in the proceedings unless otherwise ordered by the District Judge. (3) Where one or more assessors are summoned for the purposes of this section otherwise than on the application of a party to the proceedings, the remuneration of any such assessor is payable out of moneys provided by Parliament. (4) Where any person is proposed to be summoned as an assessor, objection to the person, either personally or in respect of the person’s qualification, may be taken by any party in the prescribed manner."
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 4 - JURISDICTION",
      "section": "34",
      "title": "Jurisdiction of registrar",
      "content": "34. Any jurisdiction and powers conferred on a District Court by this Act or any other written law relating to civil proceedings may be exercised, to the extent authorised by this Act or any other written law or Rules of Court, by the registrar."
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 4 - JURISDICTION",
      "section": "35",
      "title": "Division of causes of action",
      "content": "35. A cause of action must not be divided for the purpose of bringing 2 or more actions."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 4 - JURISDICTION",
      "section": "36",
      "title": "Examination of witnesses abroad in District Court cases",
      "content": "36. —(1) The General Division of the High Court, on application made in the manner prescribed by Rules of Court, has the same power to issue a request or an order to examine witnesses abroad for the purpose of civil proceedings in a District Court as it has for the purpose of an action or matter in the General Division of the High Court. [40/2019] (2) Where such an application is made, the General Division of the High Court may, if it thinks fit, order the proceedings to be transferred to the General Division of the High Court. [40/2019] 37. [ Repealed by Act 26 of 2005 ] 38. [ Repealed by Act 26 of 2005 ]"
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 4 - JURISDICTION",
      "section": "39",
      "title": "Costs of certain actions commenced in General Division of High Court which could have been commenced in a State Court",
      "content": "39. —(1) Where an action is commenced in the General Division of the High Court which could have been commenced in a State Court, then, subject to subsections (3) and (4), the claimant — ( a ) if he or she recovers a sum not exceeding the District Court limit, is not entitled to any more costs of the action than those to which he or she would have been entitled if the action had been brought in a District Court; and ( b ) if he or she recovers a sum not exceeding the Magistrate’s Court limit, is not entitled to any more costs of the action than those to which he or she would have been entitled if the action had been brought in a Magistrate’s Court. [31/2010; 5/2014; 40/2019] [Act 25 of 2021 wef 01/04/2022] (2) For the purposes of subsection (1)( a ) and ( b ), a claimant is treated as recovering the full amount recoverable in respect of his or her claim without regard to any deduction made in respect of contributory negligence on his or her part or otherwise in respect of matters not falling to be taken into account in determining whether the action could have been commenced in a State Court. [5/2014] [Act 25 of 2021 wef 01/04/2022] (3) Where a claimant is entitled to costs on the State Courts scale only, the Registrar of the Supreme Court has the same power of allowing any items of costs as a District Judge or Magistrate would have had if the action had been brought in a State Court. [5/2014] [Act 25 of 2021 wef 01/04/2022] (4) In any action, the General Division of the High Court, if satisfied — ( a ) that there was sufficient reason for bringing the action in the General Division of the High Court; or ( b ) that the defendant or one of the defendants objected to the transfer of the action to a State Court, may make an order allowing the costs or any part of the costs thereof on the scale of the General Division of the High Court or on the State Courts scale as it may direct. [5/2014; 40/2019] (5) This section does not apply in the case of any proceedings by the Government. (6) This section does not affect any question as to costs if it appears to the General Division of the High Court that there was reasonable ground for supposing the amount recoverable in respect of the claimant’s claim to be in excess of the amount recoverable in an action commenced in a State Court. [5/2014; 40/2019] [Act 25 of 2021 wef 01/04/2022] 40. [ Repealed by Act 26 of 2005 ]"
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 4 - JURISDICTION",
      "section": "41",
      "title": "Allocation of proceedings to General Division of High Court",
      "content": "41. —(1) The Chief Justice may, where he or she considers it necessary or expedient to improve efficiency in the administration of justice and to provide for more speedy disposal of proceedings commenced in the District Courts, by order direct such class or classes or description of proceedings as may be specified in the order to be heard and determined by the General Division of the High Court. [40/2019] (2) Any order under subsection (1) may make such incidental provision for the transfer of the proceedings to the General Division of the High Court (including matters relating to procedure and costs) as the Chief Justice thinks fit. [40/2019]"
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 4 - JURISDICTION",
      "section": "42",
      "title": "Finality of judgments and orders of District Court",
      "content": "42. Every judgment and order of a District Court exercising civil jurisdiction is, except as provided by this Act, any other written law or Rules of Court, final and conclusive between the parties."
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 4 - JURISDICTION",
      "section": "43",
      "title": "Satisfaction of judgments and orders for payment of money",
      "content": "43. —(1) Where a judgment is given or an order is made by a District Court under which any sum of money is payable, whether by way of satisfaction of the claim or counterclaim in the proceedings or by way of costs or otherwise, the Court may, as it thinks fit, order the money to be paid either — ( a ) in one sum, whether immediately or within a period fixed by the Court; or ( b ) by the instalments payable at the times fixed by the Court. (2) If at any time it appears to the satisfaction of a District Court that any party to any proceedings is unable from any cause to pay any sum recovered against the party (whether by way of satisfaction of the claim or counterclaim in the proceedings or by way of costs or otherwise) or any instalment thereof, the Court may, in its discretion, suspend or stay any judgment or order given or made in the proceedings — ( a ) for such time and on such terms as the Court thinks fit; and ( b ) from time to time until it appears that the cause of inability has ceased. (3) Where an order for payment by instalments is made, the payment is to be made into court and no enforcement may issue, except with the permission of the District Court. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 4 - JURISDICTION",
      "section": "44",
      "title": "Enforcement of judgments of District Courts",
      "content": "44. Subject to section 43(3), a judgment or an order of a District Court may be enforced in any manner prescribed by Rules of Court."
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 4 - JURISDICTION",
      "section": "45",
      "title": "Execution of deed or indorsement of negotiable instrument",
      "content": "45. —(1) If a judgment or order of a District Court is for the execution of a deed, or signing of a document, or for the indorsement of a negotiable instrument, and the party ordered to execute, sign or indorse such instrument is absent, neglects or refuses to do so, any party interested in having the same executed, signed or indorsed, may — ( a ) prepare a deed, document or indorsement of the instrument in accordance with the terms of the judgment or order; and ( b ) tender the same to a District Court for execution upon the proper stamp, if any is required by law, and the signature thereof by the registrar, by order of the District Court, has the same effect as the execution, signing or indorsement thereof by the party ordered to execute. (2) Nothing in this section shall be held to abridge the powers of a District Court to proceed by attachment against any person neglecting or refusing to execute, sign or indorse any such instrument. 46. [ Repealed by Act 15 of 1993 ]"
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 4 - JURISDICTION",
      "section": "47",
      "title": "General provision relating to civil appeals",
      "content": "47. Subject to the provisions of the Supreme Court of Judicature Act 1969 relating to civil appeals from the State Courts to the General Division of the High Court, Rules of Court are to regulate and prescribe the procedure on appeals from a District Court exercising civil jurisdiction to the General Division of the High Court. [5/2014; 40/2019]"
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 4 - JURISDICTION",
      "section": "48",
      "title": "Agreement not to appeal",
      "content": "48. —(1) An appeal cannot be brought against a decision of a District Court exercising civil jurisdiction, where the parties have agreed in writing signed by or on behalf of each party that the decision is final, unless the party seeking to appeal proves that — ( a ) the decision is affected by fraud or illegality; or ( b ) there was a fundamental breach of the rules of natural justice in the proceedings resulting in the decision. (2) An agreement mentioned in subsection (1) — ( a ) may be made before or after the decision to which the agreement relates is made; and ( b ) may relate to part of a decision, in which case references in subsection (1) to a decision are to be read as references to that part of the decision. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s49",
      "chapter": "PART 4 - JURISDICTION",
      "section": "49",
      "title": "Appeal not to operate as stay of execution or enforcement",
      "content": "49. —(1) An appeal from a District Court exercising civil jurisdiction does not operate as a stay of execution or enforcement or of proceedings under the judgment or order appealed from, unless the District Court or the General Division of the High Court so orders. [40/2019] [Act 25 of 2021 wef 01/04/2022] (2) No intermediate act or proceeding is invalidated except so far as the General Division of the High Court may direct. [40/2019] [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s49A",
      "chapter": "PART 4 - JURISDICTION",
      "section": "49A",
      "title": "Oral hearing not needed generally",
      "content": "49A. —(1) Subject to subsection (2), a District Court may decide any matter in its civil jurisdiction without hearing oral arguments, other than a matter prescribed by the Rules of Court. (2) Subsection (1) does not allow any part of a proceeding where oral evidence is given (including any part of a trial of an action) to be conducted without an oral hearing, unless all the parties consent. (3) Subject to subsection (4), a District Court may, in any matter that the court may decide without hearing oral arguments, direct that the matter be heard in an asynchronous manner by exchange of written correspondence with the party or parties using such means of communications as directed by the court. (4) A District Court must not hear a matter in an asynchronous manner if to do so would be inconsistent with the court’s duty to ensure that the proceedings are conducted fairly to all parties. (5) To avoid doubt, this section does not affect the power of a District Court to hear oral arguments before deciding any matter that may be decided without hearing oral arguments. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s49B",
      "chapter": "PART 4 - JURISDICTION",
      "section": "49B",
      "title": "Summary dismissal of certain matters",
      "content": "49B. —(1) A District Judge sitting in a District Court may, on his or her own motion, summarily dismiss any appeal made against a decision of the registrar relating to civil proceedings, if the District Judge is satisfied of any of the following: ( a ) every issue in the appeal has already been decided by a District Court or a higher court in an earlier matter in which the appellant was involved, and the appeal therefore has no merit; ( b ) such conditions as may be prescribed by the Rules of Court are met. (2) Before summarily dismissing any appeal under subsection (1), a District Judge sitting in a District Court must — ( a ) give the appellant a reasonable opportunity to show cause why the appeal should not be summarily dismissed; and ( b ) consider any representations of the appellant. (3) In this section, “appeal” includes part of an appeal. [Act 25 of 2021 wef 01/04/2022] Criminal Jurisdiction of District Courts"
    },
    {
      "provision_ref": "s50",
      "chapter": "PART 4 - JURISDICTION",
      "section": "50",
      "title": "Jurisdiction of District Courts exercising criminal jurisdiction",
      "content": "50. —(1) Subject to subsection (2), a District Court exercising criminal jurisdiction has — ( a ) the jurisdiction and powers conferred on it by the Criminal Procedure Code 2010 and any other written law; and ( b ) without limiting paragraph ( a ), the power to order medical examination of a person who is an accused in any criminal proceedings where the physical or mental condition of the person is relevant to any matter in question in the proceedings. [31/2010] (2) The criminal jurisdiction of a District Court is exercisable where the offence is committed — ( a ) within Singapore; ( b ) on board any ship or aircraft registered in Singapore; ( c ) by any person who is a citizen of Singapore on the high seas or on any aircraft; and ( d ) in any place or by any person if it is provided in any written law that the offence is triable in Singapore. Jurisdiction of Magistrates’ Courts"
    },
    {
      "provision_ref": "s51",
      "chapter": "PART 4 - JURISDICTION",
      "section": "51",
      "title": "Criminal jurisdiction of Magistrates’ Courts",
      "content": "51. —(1) Subject to subsection (2), a Magistrate’s Court exercising criminal jurisdiction has — ( a ) the jurisdiction and powers conferred on it by the Criminal Procedure Code 2010 and any other written law; and ( b ) without limiting paragraph ( a ), the power to order medical examination of a person who is an accused in any criminal proceedings where the physical or mental condition of the person is relevant to any matter in question in the proceedings. [31/2010] (2) The criminal jurisdiction of a Magistrate’s Court is exercisable where the offence is committed — ( a ) within Singapore; ( b ) on board any ship or aircraft registered in Singapore; ( c ) by any person who is a citizen of Singapore on the high seas or on any aircraft; and ( d ) in any place or by any person if it is provided in any written law that the offence is triable in Singapore."
    },
    {
      "provision_ref": "s52",
      "chapter": "PART 4 - JURISDICTION",
      "section": "52",
      "title": "Civil jurisdiction of Magistrates’ Courts",
      "content": "52. —(1) Subject to subsection (1A), a Magistrate’s Court has all the jurisdiction of the General Division of the High Court to hear and try any action in personam where — ( a ) the defendant is served with an originating claim or any other originating process — (i) in Singapore in the manner prescribed by Rules of Court; or (ii) outside Singapore in the circumstances authorised by and in the manner prescribed by Rules of Court; or [Act 25 of 2021 wef 01/04/2022] ( b ) the defendant submits to the jurisdiction of a Magistrate’s Court. [31/2010; 40/2019] (1A) The jurisdiction of a Magistrate’s Court under subsection (1) does not include jurisdiction to hear and try any action where — ( a ) there is no claim for any sum of money; ( aa ) the action is in passing off; [Act 23 of 2019 wef 01/04/2022] ( b ) the amount claimed in the action exceeds the Magistrate’s Court limit; or ( c ) any remedy or relief sought in the action, in addition or as an alternative to the amount claimed in the action, is in respect of a subject matter the value of which exceeds the Magistrate’s Court limit. [31/2010] (1B) A Magistrate’s Court has, in any proceedings within its jurisdiction under subsection (1) — ( a ) the power — (i) to grant such relief, redress or remedy or combination of remedies, either absolute or conditional; and (ii) to give such and the like effect to every ground of defence or counterclaim equitable or legal, as ought to be granted or given in the like action by the General Division of the High Court and in as full and ample a manner; ( b ) without limiting paragraph ( a ), the power — (i) to grant an injunction; (ii) to make binding declarations of rights; and (iii) to order medical examination of a person who is a party to any proceedings where the physical or mental condition of the person is relevant to any matter in question in the proceedings; ( c ) the power to make any order or to exercise any authority or jurisdiction which, if it related to a proceeding pending in the General Division of the High Court, might be made or exercised by a Judge sitting in chambers in the General Division of the High Court; and ( d ) the powers conferred on a District Court by — (i) sections 43 and 49A; and [Act 25 of 2021 wef 01/04/2022] (ii) section 12 of the Civil Law Act 1909. [31/2010; 40/2019] (2) In exercising its jurisdiction under subsection (1) or powers under subsection (1B), a Magistrate’s Court is subject to the same limitations and provisions as are applicable to a District Court under this Act. [31/2010] (3) The President may, after consulting the Chief Justice, by order vary the Magistrate’s Court limit. 53. [ Repealed by Act 26 of 2005 ]"
    },
    {
      "provision_ref": "s54",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54",
      "title": "Judgments and orders of Magistrates’ Courts",
      "content": "54. Every judgment or order of a Magistrate’s Court in the exercise of its civil jurisdiction has the same effect (for purposes of appeal or otherwise) and is to be enforced in the same manner as if it were given or made by a District Court."
    },
    {
      "provision_ref": "s54AA",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54AA",
      "title": "Agreement not to appeal",
      "content": "54AA. —(1) An appeal cannot be brought against a decision of a Magistrate’s Court exercising civil jurisdiction, where the parties have agreed in writing signed by or on behalf of each party that the decision is final, unless the party seeking to appeal proves that — ( a ) the decision is affected by fraud or illegality; or ( b ) there was a fundamental breach of the rules of natural justice in the proceedings resulting in the decision. (2) An agreement mentioned in subsection (1) — ( a ) may be made before or after the decision to which the agreement relates is made; and ( b ) may relate to part of a decision, in which case references in subsection (1) to a decision are to be read as references to that part of the decision. [Act 25 of 2021 wef 01/04/2022] Transfers of Civil Proceedings"
    },
    {
      "provision_ref": "s54A",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54A",
      "title": "General power to transfer from Magistrate’s Court to District Court",
      "content": "54A. —(1) Where it appears to a District Court, on the application of a party to any civil proceedings pending in a Magistrate’s Court, that the proceedings, by reason of its involving some important question of law, or being a test case, or for any other sufficient reason, should be tried in the District Court, it may order the proceedings to be transferred to the District Court. (2) An order under subsection (1) may be made on such terms as the court sees fit."
    },
    {
      "provision_ref": "s54B",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54B",
      "title": "General power to transfer from State Courts to General Division of High Court",
      "content": "54B. —(1) Where it appears to the General Division of the High Court, on the application of a party to any civil proceedings pending in a State Court, that the proceedings, by reason of its involving some important question of law, or being a test case, or for any other sufficient reason, should be tried in the General Division of the High Court, it may order the proceedings to be transferred to the General Division of the High Court. [5/2014; 40/2019] (2) An order under subsection (1) may be made on such terms as the court sees fit. Explanation.— The intended enforcement overseas of any judgment obtained in the General Division of the High Court, under any enforcement arrangements currently in force, would ordinarily be sufficient reason for transferring the proceedings to the General Division of the High Court. [40/2019]"
    },
    {
      "provision_ref": "s54C",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54C",
      "title": "General power to transfer from General Division of High Court to State Courts",
      "content": "54C. —(1) A party to any civil proceedings pending in the General Division of the High Court may for any sufficient reason at any time apply to the General Division of the High Court for an order that the proceedings be transferred to a State Court. [5/2014; 40/2019] (2) Subject to subsection (3), the General Division of the High Court may, if it thinks fit, and on such terms as it sees fit, and either on its own motion or on application, order that the proceedings be transferred accordingly despite any other provision of this Act. [40/2019] (3) An order under subsection (2) may only be made in respect of such proceedings as could have been commenced in the State Court to which the application relates, if the value of the claim had been within the District Court limit or the Magistrate’s Court limit, as the case may be. Explanation.— The fact that the proceedings fall within the civil jurisdiction of the State Courts would not, by itself, ordinarily constitute sufficient reason for transferring the proceedings to the State Courts, if enforcement overseas is intended of any judgment obtained in the General Division of the High Court under any enforcement arrangements currently in force. [5/2014; 40/2019]"
    },
    {
      "provision_ref": "s54D",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54D",
      "title": "General power to transfer from District Court to Magistrate’s Court",
      "content": "54D. —(1) A party to any civil proceedings pending in the District Court may for any sufficient reason at any time apply to the District Court for an order that the proceedings be transferred to a Magistrate’s Court. (2) Subject to subsection (3), the District Court may, if it thinks fit, and on such terms as it sees fit, and either on its own motion or on application, order that the proceedings be transferred accordingly despite any other provision of this Act. (3) An order under subsection (2) may only be made in respect of such proceedings as could have been commenced in the Magistrate’s Court if the value of the claim had been within the Magistrate’s Court limit."
    },
    {
      "provision_ref": "s54E",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54E",
      "title": "Transfer of counterclaim from State Courts to General Division of High Court",
      "content": "54E. —(1) Where, in any civil proceedings pending in a State Court, any counterclaim or set-off and counterclaim of any defendant involves a matter beyond the District Court limit, any party to the proceedings may apply to the General Division of the High Court, within such time as may be prescribed by Rules of Court, for an order that the whole proceedings, or the proceedings on the counterclaim or set-off and counterclaim, be transferred to the General Division of the High Court. [5/2014; 40/2019] (2) On any application under subsection (1) or on its own motion, the General Division of the High Court may, as it thinks fit, and on such terms as it sees fit, order — ( a ) that the whole proceedings be transferred to the General Division of the High Court; ( b ) that the whole proceedings be tried in the State Courts; or ( c ) that the proceedings on the counterclaim or set-off and counterclaim be transferred to the General Division of the High Court and that the proceedings on the claimant’s claim and the defence thereto other than the set‑off (if any) be tried in the State Courts. [5/2014; 40/2019] [Act 25 of 2021 wef 01/04/2022] (3) Where an order is made under subsection (2)( c ), and judgment on the claim is given for the claimant, enforcement thereon, unless the General Division of the High Court at any time otherwise orders, is to be stayed until the proceedings transferred to the General Division of the High Court have been concluded. [40/2019] [Act 25 of 2021 wef 01/04/2022] (4) Where no application is made under subsection (1) or where it is ordered that the whole proceedings be tried in the State Courts, the State Court has jurisdiction to try the proceedings, despite any other provision of this Act. [5/2014]"
    },
    {
      "provision_ref": "s54F",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54F",
      "title": "Transfer of counterclaim from Magistrate’s Court to District Court",
      "content": "54F. —(1) Where, in any civil proceedings pending in a Magistrate’s Court, any counterclaim or set-off and counterclaim of any defendant involves a matter beyond the Magistrate’s Court limit, any party to the proceedings may apply to the District Court, within such time as may be prescribed by Rules of Court, for an order that the whole proceedings, or the proceedings on the counterclaim or set‑off and counterclaim, be transferred to the District Court. (2) On any application under subsection (1) or on its own motion, the District Court may, as it thinks fit, and on such terms as it sees fit, order — ( a ) that the whole proceedings be transferred to a District Court; ( b ) that the whole proceedings be tried in a Magistrate’s Court; or ( c ) that the proceedings on the counterclaim or set-off and counterclaim be transferred to a District Court and that the proceedings on the claimant’s claim and the defence thereto other than the set-off (if any) be tried in a Magistrate’s Court. [Act 25 of 2021 wef 01/04/2022] (3) Where an order is made under subsection (2)( c ), and judgment on the claim is given for the claimant, enforcement thereon, unless the District Court at any time otherwise orders, is to be stayed until the proceedings transferred to the District Court have been concluded. [Act 25 of 2021 wef 01/04/2022] (4) Where no application is made under subsection (1) or where it is ordered that the whole proceedings be tried in a Magistrate’s Court, the Magistrate’s Court has jurisdiction to try the proceedings, despite any other provision of this Act."
    },
    {
      "provision_ref": "s54G",
      "chapter": "PART 4 - JURISDICTION",
      "section": "54G",
      "title": "Costs in cases transferred from one court to another",
      "content": "54G. —(1) Where proceedings are ordered to be transferred — ( a ) from the General Division of the High Court to a State Court; ( b ) from a State Court to the General Division of the High Court; or ( c ) from one State Court to another, the costs of the whole proceedings both before and after the transfer, subject to any order made by the court which ordered the transfer, are in the discretion of the court to which the proceedings are transferred, and that court has power to make orders with respect thereto and as to the scales on which the costs of the several parts of the proceedings are to be paid. [5/2014; 40/2019] (2) As regards so much of the proceedings in any action transferred from the General Division of the High Court to a State Court as takes place in the General Division of the High Court before the transfer — ( a ) the costs thereof are subject to section 39; and ( b ) the powers of the General Division of the High Court under section 39(4) to make an order allowing costs on the scale of the General Division of the High Court or on the State Courts scale are, subject to any order of the General Division of the High Court, exercisable by the State Court. [5/2014; 40/2019] 55. [ Repealed by Act 27 of 2014 ] 56. [ Repealed by Act 14 of 2010 ] 56A. [ Repealed by Act 15 of 2010 ]"
    },
    {
      "provision_ref": "s57",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "57",
      "title": "Registry of State Courts",
      "content": "57. —(1) The Registry of the State Courts is to be open on every day of the year except on Saturdays, Sundays and public holidays. [5/2014] (2) Despite subsection (1), the registrar may lawfully sit or carry out the business of the Registry on a Saturday, Sunday or public holiday if — ( a ) the Presiding Judge of the State Courts, with the concurrence of the Chief Justice, has directed the registrar to do so on that day; or ( b ) in the opinion of the registrar, the business to be despatched is extremely urgent. [4/2010; 5/2014] (3) The office hours of the Registry are such times as the Presiding Judge of the State Courts, with the concurrence of the Chief Justice, may from time to time direct. [4/2010; 5/2014]"
    },
    {
      "provision_ref": "s58",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "58",
      "title": "Nature of business at any sitting",
      "content": "58. At any sitting of a District Court or a Magistrate’s Court both civil and criminal proceedings may be tried."
    },
    {
      "provision_ref": "s59",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "59",
      "title": "Distribution of business",
      "content": "59. The distribution of business in the State Courts is to be made in accordance with the directions, which may be of a general or a particular nature, that may be given by the Presiding Judge of the State Courts, with the concurrence of the Chief Justice. [4/2010; 5/2014]"
    },
    {
      "provision_ref": "s60",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "60",
      "title": "Office of State Court",
      "content": "60. —(1) There shall be attached to each State Court or a number of State Courts an office, under whatever name, for the purpose of carrying out the work or business in such Court or Courts. [5/2014] (2) Subject to any directions that may be given by the Chief Justice from time to time, the Presiding Judge of the State Courts is responsible for the apportionment of the work among the several officers in any such office. [4/2010; 5/2014]"
    },
    {
      "provision_ref": "s61",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "61",
      "title": "Vacations for District and Magistrates’ Courts",
      "content": "61. The Chief Justice may authorise vacations for District Courts and Magistrates’ Courts in the exercise of their civil jurisdiction not exceeding 15 days in any calendar year."
    },
    {
      "provision_ref": "s62",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "62",
      "title": "List of touts",
      "content": "62. —(1) The Presiding Judge of the State Courts may — ( a ) frame and publish a list of persons proved to his or her satisfaction, by evidence of general repute or otherwise, to act as touts or unauthorised advisers to suitors or other persons; and ( b ) alter and amend the list. [4/2010; 5/2014] (2) The Presiding Judge of the State Courts may, by general or special order, exclude from the precincts of the State Courts any person whose name is included in the list, except that when the person is a party to or a witness in any proceedings in a State Court, then he or she is allowed to remain for such time as is necessary. [4/2010; 5/2014] (3) A person’s name must not be included in the list until the person has been heard or had an opportunity of being heard against such inclusion. (4) An appeal lies to a Judge sitting in chambers in the General Division of the High Court from an order made by the Presiding Judge of the State Courts to include a person’s name in the list. [4/2010; 5/2014; 40/2019] (5) The decision of the Judge is final. [40/2019] (6) A copy of the list is to be kept hung up in the office or offices of the State Courts and must be published in the Gazette . [5/2014] (7) A person whose name appears in the list of touts under section 73 of the Supreme Court of Judicature Act 1969, or the list of touts under section 39 of the Family Justice Act 2014, is deemed to be included in the list under this section, and vice versa. [27/2014]"
    },
    {
      "provision_ref": "s63",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "63",
      "title": "Impounding documents",
      "content": "63. —(1) A State Court may order any document produced before it in any proceedings to be impounded. [5/2014] (2) The document which has been impounded must not be delivered out of the custody of the court or inspected except on an order signed by a judicial officer. (3) The court that impounded the document may direct the document to be sent to the Attorney-General, the Commissioner of Stamp Duties or any other officer of the Government."
    },
    {
      "provision_ref": "s64",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "64",
      "title": "Disqualification of judicial officers",
      "content": "64. —(1) Except with the approval of the Chief Justice, a judicial officer — ( a ) shall not be capable of — (i) accepting or taking any other office of emolument; or (ii) carrying on any business either directly or indirectly; and ( b ) must not accept any fees of office, perquisites, emoluments or advantages, other than the judicial officer’s salary and allowances. [31/2010] (2) Without limiting subsection (1), a judicial officer may, with the approval of the Chief Justice — ( a ) be appointed to any commission of inquiry, committee of inquiry or other judicial, quasi-judicial or administrative tribunal, or hold any office in any institution or society for charitable purposes or for the advancement or encouragement of art, science, education or other knowledge; and ( b ) receive an allowance or other honorarium in respect of that appointment or office. [31/2010]"
    },
    {
      "provision_ref": "s65",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "65",
      "title": "Judicial officers not to act where interested",
      "content": "65. A judicial officer must not, except with the approval of the Chief Justice and with the consent of the parties, investigate, try or commit for trial any proceedings to which the judicial officer is a party or in which the judicial officer is personally interested."
    },
    {
      "provision_ref": "s66",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "66",
      "title": "Officers of court not to bid at sales under any written law",
      "content": "66. An officer of the State Courts having any duty to perform in connection with the sale of any property under any written law must not, directly or indirectly, purchase or bid for the property. [5/2014]"
    },
    {
      "provision_ref": "s67",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "67",
      "title": "Misconduct of officers",
      "content": "67. —(1) Without affecting any written law and rules governing the conduct and discipline of public officers, if any officer of a State Court is charged — ( a ) with extortion or misconduct while acting under colour of the process of the court; or ( b ) with not duly paying or accounting for any money levied by him or her under the authority of this Act or Rules of Court, it is lawful for a District Judge nominated by the Presiding Judge of the State Courts to inquire into the matter in a summary manner. [4/2010; 5/2014] (2) For the purpose of any such inquiry, the District Judge may summon and enforce the attendance of all necessary parties in the like manner as the attendance of witnesses in any case may be enforced. (3) On any such inquiry, the District Judge may make such order as he or she thinks just for the repayment of the money extorted or the due payment of the money levied, and for the payment of damages and costs, and also, if he or she thinks fit, may impose such fine upon the officer, not exceeding $100 for each offence, as appears to the District Judge to be adequate. (4) If it is found by a District Judge that any officer, while employed in carrying out his or her duties under this Act or Rules of Court or in exercising any of the powers thereof, has wilfully and corruptly exacted or accepted any fee or reward, other than any fees that are for the time being allowed under this Act or Rules of Court, that officer shall, in addition to being liable for damages under subsection (3), be incapable of being an officer of the State Courts. [5/2014] (5) An appeal lies to the Chief Justice from an order made by the District Judge under this section. (6) The decision of the Chief Justice is final."
    },
    {
      "provision_ref": "s68",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "68",
      "title": "Protection of judicial and other officers",
      "content": "68. —(1) A judicial officer shall not be liable to be sued for any act done by the judicial officer in the discharge of his or her judicial duty whether or not within the limits of his or her jurisdiction, provided that the judicial officer at the time in good faith believed himself or herself to have jurisdiction to do or order the act complained of. (2) No officer of a State Court charged with the duty of executing any writ, summons, warrant, order, notice or other mandatory process of the State Courts shall be liable to be sued — ( a ) for the execution of or attempting to execute such writ, summons, warrant, order, notice or other mandatory process; or ( b ) in respect of any damage caused to any property in effecting or attempting to effect execution, unless the officer knowingly acted in excess of the authority conferred upon him or her by such writ, summons, warrant, order, notice or other mandatory process of the court in question. [5/2014] (3) An officer of a State Court is not to be deemed to have acted knowingly in excess of his or her authority merely by reason of the existence of a dispute as to the ownership of any property seized under any enforcement order or writ of distress. [5/2014] [Act 25 of 2021 wef 01/04/2022] (4) No judicial officer, officer of a State Court or court‑appointed mediator shall be liable to be sued for an act done by him or her for the purposes of any mediation or other alternative dispute resolution process conducted by him or her in a State Court, if the act — ( a ) was done in good faith; and ( b ) did not involve any fraud or wilful misconduct on his or her part. [31/2010; 5/2014]"
    },
    {
      "provision_ref": "s69",
      "chapter": "PART 5 - ADMINISTRATION",
      "section": "69",
      "title": "Rules of Court",
      "content": "69. —(1) The Rules Committee appointed under section 80(3) of the Supreme Court of Judicature Act 1969 may make Rules of Court regulating and prescribing the procedure and the practice to be followed in the District Courts and the Magistrates’ Courts in the exercise of their civil jurisdiction and any matters incidental to or relating to any such procedure or practice. (2) The power to make Rules of Court extends to all matters of procedure or practice, or matters relating to or concerning the effect or operation in law of any procedure or practice or the enforcement of judgments or orders, in any case within the cognizance of the District Courts and Magistrates’ Courts in the exercise of the civil jurisdiction as to which Rules of Court have been or might lawfully be made for cases within the cognizance of the General Division of the High Court. [40/2019] (3) Without limiting subsections (1) and (2), the power to make Rules of Court extends to — ( a ) prescribing the office or offices where process may be issued and business other than the hearing of proceedings transacted; ( b ) prescribing the circumstances and procedure by which proceedings may be transferred from one court to another; ( c ) prescribing what part of the business which may be transacted and of the jurisdiction and powers which may be exercised by a District Judge or Magistrate in court or in chambers may be transacted or exercised by the registrar (including provisions for and concerning appeals from decisions of the registrar); ( d ) directing interest to be paid on debts, including judgment debts, or on sums found due in an administration action, except that the rate of interest must not in any case exceed 8% per annum unless it has been otherwise agreed between parties; ( e ) regulating — (i) the issue of judgment debtor summonses for the discovery of a judgment debtor’s property or means and the procedure and practice relating thereto; and (ii) the making of orders against judgment debtors for the payment, by instalments or otherwise, of sums due under judgments and orders and the enforcement thereof by committal; ( f ) requiring any party at whose instance — (i) any enforcement order; [Act 25 of 2021 wef 01/04/2022] (ii) any order of arrest or committal; (iii) any order of attachment of property; or (iv) any order to bring up a prisoner as a witness, is issued, to deposit from time to time a sum of money to provide for the expenses of executing the order and of bringing the person to be arrested or the person ordered to be committed before the court or to prison and of his or her subsistence while in the custody of the bailiff or in prison and of keeping possession of the property attached; [Act 25 of 2021 wef 01/04/2022] ( g ) enabling proceedings — (i) to be commenced in a State Court against the estate of a deceased person (whether by the appointment of a person to represent the estate or otherwise) where no grant of probate or letters of administration has been made; (ii) purporting to have been commenced in a State Court by or against a person to be treated, if he or she was dead at their commencement, as having been commenced by or against (as the case may be) his or her estate whether or not a grant of probate or letters of administration was made before their commencement; and (iii) commenced or treated as commenced in a State Court by or against the estate of a deceased person to be maintained (whether by substitution of parties, amendment or otherwise) by or against (as the case may be) a person appointed to represent the estate or, if a grant of probate or letters of administration is or has been made, by or against the personal representatives; ( h ) prescribing the manner in which money in a court is to be dealt with and in particular — (i) prescribing that money in court may be kept at a bank, to be approved by the Accountant-General, in the official name of the registrar; (ii) regulating the manner in which the court’s bank account is to be operated; (iii) requiring the registrar to pay from time to time to the Accountant-General or into the court’s bank account all moneys not required for meeting current demands and to pay to the Accountant-General all sums which have been in the court’s bank account for such period as may be prescribed; [Act 25 of 2021 wef 01/04/2022] ( i ) prescribing the books, registers and accounts required to be kept by the registrar and bailiffs; and [5/2014] [Act 25 of 2021 wef 01/04/2022] ( j ) prescribing anything that is required or permitted under this Act to be prescribed by Rules of Court. [Act 25 of 2021 wef 01/04/2022] (3A) The Rules of Court may, instead of providing for any matter, refer to any provision made or to be made for that matter by practice directions issued for the time being by the registrar. [Act 25 of 2021 wef 01/04/2022] (4) All Rules of Court made under this section must be presented to Parliament as soon as possible after publication in the Gazette ."
    },
    {
      "provision_ref": "s70",
      "chapter": "PART 6 - SUPPLEMENTAL",
      "section": "70",
      "title": "Conversion of pending petitions to writs of summons and originating summonses",
      "content": "70. —(1) Where — ( a ) under any written law any civil action or application may be commenced in or made to a District Court, a Magistrate’s Court or the registrar (called in this section the Court); and ( b ) the provisions under any written law by virtue of which such an action or application was required to be commenced or made by way of a petition have been amended such as to require that any such action or application must, as from the date appointed for the coming into operation of the amendment, be commenced or made by way of a writ of summons or an originating summons, then, if any such action or application that has been commenced or made before that date by way of a petition is still pending before the Court on or after that date, the Court may, if it thinks just and expedient, order that the action or application (called in this section a pending action or application) be converted to and be continued as an action or application commenced or made by way of a writ of summons or an originating summons, as is appropriate. (2) The Presiding Judge of the State Courts, with the concurrence of the Chief Justice, may, where the Presiding Judge considers it necessary or expedient to improve efficiency in the administration of justice, by order direct that any class or description of pending actions or applications before the Court be converted to and be continued as actions or applications commenced or made by way of a writ of summons or an originating summons, as is appropriate. [4/2010; 5/2014] (3) Where pursuant to subsection (1) or (2) any pending action or application has been converted to an action or application commenced or made by way of a writ of summons or an originating summons — ( a ) the action or application is to be continued in accordance with the provisions of the relevant written law and the practice and procedure as are in force and applicable in relation to that action or application at the time of the conversion; and ( b ) the Court may give to the parties to the action or application such directions as to the conduct and costs of the action or application as it thinks just and expedient for the purpose of facilitating the conversion of the action or application to an action or application commenced or made by way of a writ of summons or an originating summons (as the case may be) and its continuance as such."
    }
  ],
  "definitions": [
    {
      "term": "action",
      "definition": "“action” means a civil proceeding commenced by summons or in any other manner prescribed by Rules of Court;",
      "source_provision": "s2"
    },
    {
      "term": "commissioner for oaths",
      "definition": "“commissioner for oaths” means a commissioner for oaths appointed under section 68 of the Supreme Court of Judicature Act 1969;",
      "source_provision": "s2"
    },
    {
      "term": "Coroner",
      "definition": "“Coroner” has the meaning given by section 2(1) of the Coroners Act 2010;",
      "source_provision": "s2"
    },
    {
      "term": "District Court limit",
      "definition": "“District Court limit” means $250,000 or any other amount specified by an order under section 30;",
      "source_provision": "s2"
    },
    {
      "term": "judicial officer",
      "definition": "“judicial officer” means a District Judge, Magistrate or registrar;",
      "source_provision": "s2"
    },
    {
      "term": "Magistrate’s Court limit",
      "definition": "“Magistrate’s Court limit” means $60,000 or any other amount specified by an order under section 52(3);",
      "source_provision": "s2"
    },
    {
      "term": "prescribed",
      "definition": "“prescribed” means prescribed by Rules of Court;",
      "source_provision": "s2"
    },
    {
      "term": "registrar",
      "definition": "“registrar” means the registrar of the State Courts and includes a deputy registrar;",
      "source_provision": "s2"
    },
    {
      "term": "Rules of Court",
      "definition": "“Rules of Court” means Rules of Court made under this Act and includes forms;",
      "source_provision": "s2"
    },
    {
      "term": "seal",
      "definition": "“seal” includes stamp. [14/2010; 5/2014; 27/2014]",
      "source_provision": "s2"
    },
    {
      "term": "broadcasting service",
      "definition": "“broadcasting service” has the meaning given by section 2(1) of the Broadcasting Act 1994;",
      "source_provision": "s7"
    },
    {
      "term": "newspaper",
      "definition": "“newspaper” has the meaning given by section 2(1) of the Newspaper and Printing Presses Act 1974. [19/2018]",
      "source_provision": "s7"
    }
  ]
}