{
  "id": "scca-1970",
  "type": "statute",
  "title": "Science Centre Act 1970",
  "title_en": "Science Centre Act 1970",
  "short_name": "ScCA1970",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/ScCA1970",
  "description": "An Act to establish the Science Centre Board and for purposes incidental thereto.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Science Centre Act 1970."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Board” means the Science Centre Board established under section 3; “Chairperson” means the Chairperson of the Board appointed under section 4 and includes any temporary Chairperson so appointed; “chief executive” means the chief executive of the Board, and includes any individual acting in that capacity; “Deputy Chairperson” means the Deputy Chairperson of the Board appointed under section 4 and includes any temporary Deputy Chairperson so appointed; “financial year” means a period of 12 months beginning on 1 April in any year; “Science Centre” means the Science Centre established under section 5. [5/2018]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Establishment of Science Centre Board",
      "content": "3. —(1) A body corporate called the Science Centre Board is established in accordance with the provisions of this Act. (2) The Board — ( a ) has perpetual succession; ( b ) must have a common seal; and ( c ) may, subject to the provisions of this Act — (i) acquire, hold and dispose of property, both movable and immovable; (ii) enter into contracts; (iii) sue and be sued in its corporate name; and (iv) perform any other acts that bodies corporate may by law perform."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Constitution of Board",
      "content": "4. —(1) The Board consists of the following persons, all of whom must be appointed by the Minister: ( a ) a Chairperson; ( b ) a Deputy Chairperson; and ( c ) not less than 7 but not more than 15 other members. (2) Subject to the provisions of this Act, the members of the Board hold office for such term and subject to such conditions as the Minister may determine. (3) The Minister may appoint any person to be a temporary member of the Board during the temporary incapacity from illness or otherwise, or during the temporary absence from Singapore, of any member of the Board. (4) The Minister may appoint any member of the Board to be a temporary Chairperson or temporary Deputy Chairperson during the temporary incapacity from illness or otherwise, or during the temporary absence from Singapore, of the Chairperson or the Deputy Chairperson, as the case may be. (5) The Minister may, at any time, accept the resignation of any member of the Board. (6) The Minister may, at any time, revoke the appointment of the Chairperson, the Deputy Chairperson and any other member of the Board. (7) The Board may act despite any vacancy in its membership."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Duties of Board",
      "content": "5. It is the duty of the Board to establish and maintain a Science Centre for the purpose of — ( a ) exhibiting objects illustrative of the physical sciences, life sciences, applied sciences, technology and industry; and ( b ) promoting the dissemination of knowledge in science and technology."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Powers of Board",
      "content": "6. The Board has the following powers for the discharge of its duties under section 5: ( a ) to carry on all activities that appear to the Board to be necessary, advantageous or convenient for or in connection with the discharge of its duties; ( b ) to promote the carrying on of any such activities by other bodies or persons; ( c ) to carry on such activities in association with other bodies or persons including the departments of the Government; ( d ) with the approval of the Minister, to acquire, purchase, lease, take, hold and enjoy movable and immovable property of every description and sell, convey, assign, surrender and yield up, mortgage, demise, reassign, transfer or otherwise dispose of any movable or immovable property vested in the Board upon any terms that the Board thinks fit; ( e ) to erect and maintain all necessary buildings for the purposes of the Science Centre; ( f ) to manage the Science Centre; ( g ) to acquire, install and maintain exhibits for the Science Centre; ( h ) to receive donations, grants, gifts of movable or immovable property from any source or raise funds by any lawful means; ( i ) to regulate and control public access to the Science Centre and charge fees for such access; ( j ) to make provision for the specialised training of any officers or employees of the Board and in that connection may offer scholarships to intending trainees or otherwise pay for the course of such training and all expenditure incidental to the training; ( k ) to enter into contracts, establish trusts and generally regulate transaction of all business connected with the Board."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Chief executive, officers and employees, etc.",
      "content": "7. —(1) There must be a chief executive of the Board, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Board may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the chief executive during any period, or during all periods, when the chief executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018] (3) The Board may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on such terms and conditions as it may determine, such other officers, employees, consultants and agents as may be necessary for the effective performance of its functions. [5/2018] 8. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Directions by Minister",
      "content": "9. —(1) The Minister may give to the Board any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (2) The Board must furnish the Minister with such information with respect to its property and activities as the Minister may require."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Appointment of committees and delegation of powers",
      "content": "10. —(1) The Board may, in its discretion, appoint from among its own members or other persons who are not members of the Board one or more committees consisting of persons who may or may not be members of the Board for purposes which, in the opinion of the Board, would be better regulated and managed by means of those committees. (2) The Board may, subject to any conditions or restriction that it thinks fit, delegate to any committee mentioned in subsection (1) or the chairperson of that committee or any employee of the Board all or any of the powers, functions and duties by this Act vested in the Board, and any power, function or duty so delegated may be exercised or performed by that committee or the chairperson of that committee or employee in the name and on behalf of the Board. [5/2018]"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Protection from personal liability",
      "content": "11. —(1) No action, suit, prosecution or proceedings shall be brought or instituted against any member of the Board in respect of any act done bona fide in pursuance or execution or intended execution of this Act. (2) Where any member of the Board is exempt from liability by reason only of this section, the Board itself is liable only to the extent that it would be if that member of the Board were an employee or agent of the Board."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Execution of documents",
      "content": "12. All deeds, documents and other instruments requiring the seal of the Board must be sealed with the common seal of the Board in the presence of the Chairperson or the Deputy Chairperson and one other member of the Board, who must sign every such deed, document and other instrument to which the common seal is affixed, and their signing is sufficient evidence that the seal was duly and properly affixed and that it is the lawful seal of the Board."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Grants to Board",
      "content": "13. For the purpose of enabling the Board to carry out its function under this Act, the Minister may make grants to the Board of such sums of money as the Minister may determine."
    },
    {
      "provision_ref": "s13A",
      "section": "13A",
      "title": "Issue of shares, etc.",
      "content": "13A. As a consequence of the vesting of any property, rights or liabilities of the Government in the Board under this Act, or of any capital injection or other investment by the Government in the Board in accordance with any written law, the Board must issue such shares or other securities to the Minister for Finance as that Minister may direct."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Science Centre Fund",
      "content": "14. All moneys received or raised by the Board must forthwith be paid into any bank that may be decided by the Board to the credit of a fund to be called the Science Centre Fund (called in this Act the Fund) which is to be controlled and administered by the Board, subject to the directions of the Minister."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Purposes of Science Centre Fund",
      "content": "15. The moneys standing to the credit of the Fund must be devoted solely to the following purposes: ( a ) the payment of the expenses of, or connected with, the administration of the Board; ( b ) the payment of all expenses necessary for carrying out the purposes of this Act. 16. [ Repealed by Act 5 of 2018 ] 17. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Minister’s approval of estimates",
      "content": "18. —(1) A copy of all annual estimates of revenue and expenditure and supplementary estimates must, upon their adoption by the Board, be sent without delay to the Minister. [5/2018] (2) The Minister may approve or disallow any item or portion of any item shown in the annual estimates or supplementary estimates. [5/2018] (3) The Minister must return the annual estimates or supplementary estimates as amended under subsection (2) to the Board, and the Board is bound by the Minister’s decision. [5/2018]"
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Power of investment",
      "content": "19. The Board may invest its moneys in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Regulations",
      "content": "20. —(1) The Minister may make regulations for or in respect of — ( a ) the convening of meetings of the Board and the procedure to be followed, to the extent not inconsistent with the Public Sector (Governance) Act 2018; ( b ) the management and control of the Science Centre and the premises of the Centre; ( c ) the exercise of the Board’s powers and functions under the provisions of this Act; and ( d ) every purpose which is considered by the Minister to be necessary for carrying out the provisions of this Act. [5/2018] (2) All regulations made under this Act — ( a ) may prescribe that any act or omission in contravention of any regulation is an offence; and ( b ) may provide for the imposition of a penalty not exceeding a fine of $1,000 for such offence."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Science Centre Board established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Board appointed under section 4 and includes any temporary Chairperson so appointed;",
      "source_provision": "s2"
    },
    {
      "term": "chief executive",
      "definition": "“chief executive” means the chief executive of the Board, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means the Deputy Chairperson of the Board appointed under section 4 and includes any temporary Deputy Chairperson so appointed;",
      "source_provision": "s2"
    },
    {
      "term": "financial year",
      "definition": "“financial year” means a period of 12 months beginning on 1 April in any year;",
      "source_provision": "s2"
    },
    {
      "term": "Science Centre",
      "definition": "“Science Centre” means the Science Centre established under section 5. [5/2018]",
      "source_provision": "s2"
    }
  ]
}