{
  "id": "scma-2020",
  "type": "statute",
  "title": "Singapore Convention on Mediation Act 2020",
  "title_en": "Singapore Convention on Mediation Act 2020",
  "short_name": "SCMA2020",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SCMA2020",
  "description": "An Act to give effect to the United Nations Convention on International Settlement Agreements Resulting from Mediation, also known as the Singapore Convention on Mediation, opened for signature on 7 August 2019 in Singapore.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Singapore Convention on Mediation Act 2020."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “Convention” means the United Nations Convention on International Settlement Agreements Resulting from Mediation, also known as the Singapore Convention on Mediation, opened for signature on 7 August 2019 in Singapore, a copy of the English text of which is set out in the Schedule; “international settlement agreement” means a settlement agreement to which this Act applies under section 3; “mediation” means a process (whether referred to by the expression “mediation” or “conciliation” or any term of similar import) — ( a ) by which the parties to the mediation attempt to reach an amicable settlement of their dispute with the assistance of one or more third parties (called in this Act the mediator); and ( b ) in which the mediator lacks the authority to impose a solution upon the parties to the dispute; “parties”, in relation to a mediation, does not include any mediator conducting the mediation; “settlement agreement” means an agreement resulting from mediation and concluded in writing by the parties to the mediation to resolve a commercial dispute. (2) For the purposes of the definition of “settlement agreement” in subsection (1) — ( a ) a settlement agreement is in writing if the contents of the settlement agreement are recorded in any form; and ( b ) the requirement that a settlement agreement be in writing is met by an electronic communication if the information contained in the communication is accessible to be useable for subsequent reference. (3) For the purposes of this Act, a reference to a State is to be read in conformity with articles 12 and 13 of the Convention. (4) A reference in this Act to the High Court is, on or after 2 January 2021, a reference to the General Division of the High Court. (5) A reference in this Act to the Court of Appeal is, on or after 2 January 2021, a reference to the Appellate Division of the High Court or the Court of Appeal."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Application of Act",
      "content": "3. —(1) Subject to subsection (2), this Act applies to a settlement agreement which, at the time of its conclusion, is international within the meaning of article 1, paragraph 1( a ) and ( b ), read with article 2, paragraph 1, of the Convention. (2) This Act does not apply to — ( a ) a settlement agreement mentioned in article 1, paragraph 2 or 3 of the Convention; or ( b ) a settlement agreement in relation to which a reservation by Singapore under article 8 of the Convention has been made and the reservation is not withdrawn. (3) Articles 12 and 13 of the Convention apply to the interpretation of the articles of the Convention mentioned in subsections (1) and (2). (4) This Act binds the Government."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Applications in respect of international settlement agreements",
      "content": "4. —(1) Subject to this Act, a party to an international settlement agreement may — ( a ) apply to the High Court to record the agreement as an order of court for the purposes of — (i) enforcing the agreement in Singapore; or (ii) invoking the agreement in any court proceedings in Singapore involving a dispute concerning a matter that the party to the international settlement agreement claims was already resolved by the agreement, in order to prove that the matter has already been resolved; or ( b ) in any proceedings in the High Court (whether exercising its original or appellate jurisdiction), or in any proceedings in the Court of Appeal — (i) to which the party to the international settlement agreement is a party; and (ii) which involves a dispute concerning a matter that the party claims was already resolved by the agreement, apply to the High Court or the Court of Appeal (as the case may be) to invoke the agreement in the proceedings in order to prove that the matter has already been resolved. (2) This section does not limit or restrict any right or remedy of a party to an international settlement agreement that exists or may arise apart from this Act."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Grant of permission to record international settlement agreement as order of High Court",
      "content": "5. —(1) The High Court may, following an application under section 4(1)( a ), grant permission to record an international settlement agreement as an order of court if the requirements of this Act are complied with. [Act 25 of 2021 wef 01/04/2022] (2) Subject to this Act, an international settlement agreement that is recorded by the High Court as an order of court — ( a ) may be enforced in the same manner as a judgment given, or an order made, by the High Court; and ( b ) may be relied on by the party who made the application under section 4(1)( a ) by way of defence, set‑off or otherwise in any court proceedings. [Act 25 of 2021 wef 01/04/2022]"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Requirements for applications under section 4",
      "content": "6. —(1) A party to an international settlement agreement making an application mentioned in section 4(1) must provide to the court before which the application is made the following documents and evidence: ( a ) the international settlement agreement signed by the parties to the agreement or a certified copy of the signed agreement; ( b ) evidence that the international settlement agreement resulted from mediation, such as — (i) the signature on the international settlement agreement of the mediator conducting the mediation; (ii) a document signed by the mediator conducting the mediation indicating that the mediation was carried out; (iii) an attestation by the institution that administered the mediation; or (iv) in the absence of sub‑paragraph (i), (ii) or (iii), any other evidence acceptable to the court before which the application is made. (2) A requirement under subsection (1) that the international settlement agreement be signed by the parties to the agreement or by the mediator conducting the mediation that resulted in the international settlement agreement is met, in relation to an electronic communication, if — ( a ) a method is used to identify the parties or the mediator (as the case may be) and to indicate the parties’ or mediator’s intention (as the case may be) in respect of the information contained in the electronic communication; and ( b ) the method used is either — (i) as reliable as is appropriate for the purpose for which the electronic communication was generated or communicated, in the light of all the circumstances, including any relevant agreement; or (ii) proven in fact to have fulfilled the functions described in paragraph ( a ), by itself or together with further evidence. (3) A party to the international settlement agreement making an application mentioned in section 4(1) may be required by the court before which the application is made to provide any necessary document in order to verify that the requirements of the Convention have been complied with. (4) If the international settlement agreement is not in English, the international settlement agreement must be accompanied by a certified translation of it in the English language. (5) In this section, “certified” means certified — ( a ) in the manner set out in rules prescribed by the Rules Committee constituted under section 80(3) of the Supreme Court of Judicature Act 1969; or ( b ) in the manner determined by the court before which the application mentioned in section 4(1) is made."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Grounds for refusing application",
      "content": "7. —(1) The court before which an application mentioned in section 4(1) is made may, at the request of the party ( A ) against whom the international settlement agreement is sought to be enforced or invoked, refuse to grant the application if A furnishes proof of any of the grounds set out in subsection (2). (2) For the purposes of subsection (1), the grounds are the following: ( a ) that a party to the international settlement agreement was under some incapacity; ( b ) that the international settlement agreement — (i) is null and void, inoperative or incapable of being performed under the law to which the parties have validly subjected it or, failing any indication thereon, under the law deemed applicable by the court before which the application is made; (ii) is not binding, or is not final, according to its terms; or (iii) has been subsequently modified; ( c ) that the obligations in the international settlement agreement — (i) have been performed; or (ii) are not clear or comprehensible; ( d ) that it is contrary to the terms of the international settlement agreement for the application mentioned in section 4(1) to be granted; ( e ) that there was a serious breach by the mediator who conducted the mediation that resulted in the international settlement agreement of the standards applicable to the mediator, or the mediation, without which breach A would not have entered into the international settlement agreement; ( f ) that — (i) there was a failure by the mediator to disclose to the parties to the international settlement agreement circumstances that raise justifiable doubts as to the mediator’s impartiality or independence; and (ii) the failure to disclose mentioned in sub‑paragraph (i) had a material impact or undue influence on a party, without which failure that party would not have entered into the international settlement agreement. (3) In addition to subsection (1), the court before which an application mentioned in section 4(1) is made may also refuse to grant the application if — ( a ) it would be contrary to the public policy of Singapore for the application to be granted; or ( b ) the subject matter of the dispute purported to be settled by the international settlement agreement is not capable of settlement by mediation under the law in force in Singapore."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Setting aside of order of court",
      "content": "8. Where an international settlement agreement has been recorded as an order of court under section 5(2) in the absence of the party against whom the order of court is sought to be enforced or invoked, the High Court may, upon the application of that party, set aside the order of court on any ground on which the High Court may refuse to grant the application mentioned in section 4(1)( a ) to record the international settlement agreement as an order of court."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Parallel applications or claims",
      "content": "9. If an application or a claim relating to an international settlement agreement has been made to a court of any State, any arbitral tribunal or any other competent authority which may affect the grant of an application mentioned in section 4(1), the court before which the application mentioned in section 4(1) is made may — ( a ) if the court before which the application is made considers it proper, adjourn the decision on the application; and ( b ) on the request of a party, order the other party to give suitable security."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Rules of Court",
      "content": "10. The Rules Committee constituted under section 80(3) of the Supreme Court of Judicature Act 1969 may make Rules of Court with respect to — ( a ) applications and other proceedings, and the practice and procedure, of any court in respect of any matter under this Act; and ( b ) the fees and costs of those applications and other proceedings."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Regulations",
      "content": "11. —(1) The Minister may make regulations prescribing matters required or permitted by this Act to be prescribed, or necessary or convenient to be prescribed for carrying out or giving effect to this Act. (2) The power conferred by subsection (1) does not extend to any matter for which Rules of Court mentioned in section 10 may be made."
    }
  ],
  "definitions": [
    {
      "term": "Convention",
      "definition": "“Convention” means the United Nations Convention on International Settlement Agreements Resulting from Mediation, also known as the Singapore Convention on Mediation, opened for signature on 7 August 2019 in Singapore, a copy of the English text of which is set out in the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "international settlement agreement",
      "definition": "“international settlement agreement” means a settlement agreement to which this Act applies under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "mediation",
      "definition": "“mediation” means a process (whether referred to by the expression “mediation” or “conciliation” or any term of similar import) — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "parties",
      "definition": "“parties” , in relation to a mediation, does not include any mediator conducting the mediation;",
      "source_provision": "s2"
    },
    {
      "term": "settlement agreement",
      "definition": "“settlement agreement” means an agreement resulting from mediation and concluded in writing by the parties to the mediation to resolve a commercial dispute.",
      "source_provision": "s2"
    }
  ]
}