{
  "id": "sda-1999",
  "type": "statute",
  "title": "Sewerage and Drainage Act 1999",
  "title_en": "Sewerage and Drainage Act 1999",
  "short_name": "SDA1999",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SDA1999",
  "description": "An Act to provide for and regulate the construction, maintenance, improvement, operation and use of sewerage and land drainage systems, to regulate the discharge of sewage and trade effluent and for matters connected therewith. [10/2012]",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Sewerage and Drainage Act 1999."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “authorised officer” means any person appointed as an authorised officer under section 3(2); “Board” means the Public Utilities Board continued under section 3 of the Public Utilities Act 2001; “building” has the meaning given by the Building Control Act 1989; “competent authority” means an authority appointed under section 5 of the Planning Act 1998; “drain” includes any canal, culvert, conduit, river or watercourse; “drain‑line” means any pipe or sewer which is connected to the sewerage system of any premises; “drainage reserve” means — ( a ) any land set aside for drainage works pursuant to development proposals approved by a competent authority; ( b ) any land vested in the Government under section 29; or ( c ) any State land that is reserved for the purposes of the Board (permanently or temporarily) in connection with drainage works or a storm water drainage system; [Act 42 of 2022 wef 01/11/2024] “drainage works” includes any engineering works for the construction, alteration and maintenance of any stormwater drainage system; “earth retaining structure” means any structure, structural system or other means used to maintain the shape of excavation to enable the access to, repair of or replacement of a sewerage system or part thereof; [Act 38 of 2024 wef 01/03/2025] “fittings” means any apparatus or parts used for any sanitary facility or drain‑line of any premises; “flood protection measure” means any measure or system, or any specification required for any premises, for the purpose of — ( a ) preventing stormwater from entering any premises; ( b ) removing from any premises into the stormwater drainage system (such as by pumped drainage systems), stormwater that has entered the premises; or ( c ) regulating or controlling (including by means of detention tanks) the entry of stormwater into the stormwater drainage system from any premises; [Act 38 of 2024 wef 01/03/2025] “industrial water” means any water reclaimed from the sewage treatment works for use in industries that do not require high grade potable water; “licensed plumber” means an individual who holds a plumber’s licence as defined in section 2 of the Public Utilities Act 2001; “Magistrate’s Court limit” has the meaning given by the State Courts Act 1970; “occupier”, in relation to any premises, includes any person having the charge, management or control of the premises or any part thereof; “owner”, in relation to — ( a ) any premises, includes — (i) the person for the time being receiving the rent of the premises, whether on the person’s own account or as agent or trustee or as receiver, or who would receive the rent if the premises were let to a tenant; and (ii) the person whose name is entered in the Valuation List prepared under section 10 of the Property Tax Act 1960; ( b ) the common property of any building erected on land comprised in a strata subdivision plan approved by the competent authority, includes — (i) the management corporation having control of the building; (ii) a managing agent appointed by a management corporation or by the Commissioner of Buildings under the Building (Strata Management) Act 2004 * ; and [Act 12 of 2020 wef 01/10/2025] (iii) a liquidator appointed for that management corporation; and ( c ) the limited common property of any building erected on land comprised in a strata subdivision plan approved by the competent authority, includes — (i) the subsidiary management corporation having control of that limited common property; (ii) a managing agent appointed by a subsidiary management corporation or by the Commissioner of Buildings under the Building (Strata Management) Act 2004 * ; and [Act 12 of 2020 wef 01/10/2025] (iii) a liquidator appointed for that subsidiary management corporation; “premises” includes messuages, houses, buildings, lands, tenements, easements and hereditaments of any tenure, whether open or enclosed, whether built or not, whether public or private, and whether maintained under statutory authority or not; “public sewerage system” includes — ( a ) sewerage systems which were vested in the Government before 1 April 1999 under the repealed Water Pollution Control and Drainage Act (Cap. 348, 1985 Revised Edition) or any other written law; ( b ) sewerage systems with respect to which a declaration of vesting has been made under section 8; ( c ) sewerage systems constructed by the Government or the Board on behalf of the Government on any private property at the expense of the Government or acquired by the Government; ( d ) sewerage systems constructed on any private property and maintained by the Board; and ( e ) sewerage systems owned or managed by the Board; “public sewers” includes — ( a ) sewers which were vested in the Government before 1 April 1999 under the repealed Water Pollution Control and Drainage Act (Cap. 348, 1985 Revised Edition) or any other written law; ( b ) sewers with respect to which a declaration of vesting has been made under section 9; ( c ) sewers constructed by the Government or the Board on behalf of the Government on any private property at the expense of the Government or acquired by the Government; and ( d ) sewers constructed on any private property and maintained by the Board; “qualified person” means a person who is registered as — ( a ) an architect under the Architects Act 1991 and has in force a practising certificate issued under that Act; or ( b ) a professional engineer under the Professional Engineers Act 1991 and has in force a practising certificate issued under that Act; [Act 38 of 2024 wef 01/03/2025] “reclaimed water” means treated water which has been recovered from a public sewerage system; “Registrar of Deeds” means the Registrar of Deeds appointed under the Registration of Deeds Act 1988; “Registrar of Titles” means the Registrar of Titles appointed under the Land Titles Act 1993; “reservoir” means a body of water maintained as a reservoir by the Board in any Catchment Area Park or Central Water Catchment Area (as defined in regulations made under section 72 of the Public Utilities Act 2001); [Act 38 of 2024 wef 01/03/2025] “sanitary appliances” includes washbasins, bathtubs, sinks, urinals, toilet bowls, bidets and other similar fixtures; “sanitary facilities” includes bathrooms, toilets, facilities for washing and sanitary appliances, together with the associated pipework, whether above or below the ground, which connect, directly or otherwise, to a private sewage treatment plant or a public sewerage system; “sanitary works” means — ( a ) constructing, altering, repairing, replacing, discontinuing or closing up any discharge pipe, ventilating pipe, drain‑line, fitting, floor trap, inspection chamber, grease trap, pump or any other appurtenance related to the conveyance of sewage or sullage water from any sanitary appliance or sanitary facility to a sewerage system; and ( b ) installing, fixing, altering, repairing or removing a sanitary appliance or sanitary facility, and any other connected works; “sewage” includes waterborne domestic waste and trade effluent; “sewerage system” means a system of sewers, pipes, drain-lines, pumping systems, sumps, tanks, flow control systems, sensors, odour control and ventilating systems, chambers, manholes, sewage treatment systems or water reclamation facilities, or other appurtenances, for use in connection with one or both of the following purposes: ( a ) the collection, treatment and disposal of sewage; ( b ) the recovery and treatment of water which is supplied to the Board or by the Board, and includes any pipes and tanks for the temporary collection of sewage that do not connect downstream to or empty into any sewer; [Act 38 of 2024 wef 01/03/2025] “sewerage works” includes engineering works for the construction, alteration and maintenance of any sewerage system or any part thereof; [Act 38 of 2024 wef 01/03/2025] “stormwater” means rainwater and surface water but does not include sewage; “stormwater drainage system” means a system of drains for the conveyance or storage of stormwater and includes — ( a ) any weir, grating, float, boom, gauge, tidegate, sump, storage pond, pumping station, maintenance access, and debris interception and removal facility related to such system; ( b ) any structure constructed to convey, store or measure stormwater or for flood alleviation; and ( c ) any bridge over or railing for any such drain or any appurtenance thereof; “temporary building” has the meaning given by the Building Control Act 1989; “Town Council” means any Town Council established under section 4 of the Town Councils Act 1988; “trade effluent” means any liquid, including particles of matter and other substances in suspension in the liquid, which is the outflow from any trade, business or manufacture or of any works of engineering or building construction; “works” has the same meaning as “building works” in the Building Control Act 1989 and includes sewerage works, drainage works and sanitary works. [Act 38 of 2024 wef 01/03/2025] [*Updated to be consistent with the 2020 Revised Edition] (2) For the purposes of the definition of “sewerage system” in subsection (1), regulations made under section 74 may provide — ( a ) for any thing to be excluded from the definition; or ( b ) for any thing to be included in the definition. [9/2002; 47/2004; 10/2012; 5/2014; 11/2018] [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ADMINISTRATION",
      "section": "3",
      "title": "Administration of Act",
      "content": "3. —(1) The Board is responsible for the administration of this Act subject to the general and special directions of the Minister. (2) The Board may in writing appoint any public officer or any officer of the Board or of any other statutory authority to be an authorised officer for the purposes of this Act. (3) The functions, duties and powers which are imposed or conferred upon the Board under this Act may be performed or exercised by any authorised officer subject to the direction and control of the Board. (4) Every authorised officer is deemed to be a public servant within the meaning of the Penal Code 1871. (5) The Board may appoint and authorise in writing any person to perform any particular function or duty or to exercise any particular power under this Act, subject to such conditions or limitations as the Board may specify. [10/2012]"
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 3 - SEWERAGE",
      "section": "4",
      "title": "Construction and maintenance of public sewerage systems",
      "content": "4. —(1) The Board — ( a ) may cause to be made and constructed any public sewerage system; ( b ) must maintain and keep in repair every public sewerage system; and ( c ) may enlarge, alter or otherwise improve or discontinue, close up or destroy any public sewerage system which the Board thinks is useless or unnecessary. (2) For the purposes of subsection (1), the Board may — ( a ) lay pipes in, under or over any premises, street or building and keep the pipes there; ( b ) tunnel or bore under any premises, street or building; ( c ) carry the sewerage system across, through, along or under any premises or the cellar, basement or vault of any building; and ( d ) carry out any works requisite for, or incidental to, the purposes of subsection (1). (3) Unless section 43(2) applies, an authorised officer may enter any premises for the purposes of subsection (1) only after giving notice in accordance with section 44. [12/2015] [Act 38 of 2024 wef 01/03/2025] (4) In carrying out any works under this section, the Board must cause as little damage as possible, and must make reasonable compensation for any damage done to any premises, street or building affected by those works. [10/2012] (5) If by reason of the alteration or closing up of any public sewerage system any person is deprived of the lawful use of any sewer, the Board must with due diligence provide some other sewer as effectual as the one the person is so deprived of. (6) The Board may serve a notice on the owner or supplier of any gas, electricity, water or telecommunication services to alter the course or position of any wire, line, cable, pipe, tube, casing, duct, post, structure or other apparatus which belongs to that owner or is maintained by that owner or supplier and to repair any road surface thereby disturbed if, in the opinion of the Board, such alteration is required for the purposes of subsection (1). (7) The Board may give notice to the owner or occupier of any premises requiring the owner or occupier to remove any object or structure described in the notice which is erected on or attached to, or projects from, the land or building, if in the opinion of the Board the removal of the object or structure is required for the purposes of subsection (1). (8) Any costs and expenses incurred by an owner, supplier or occupier under subsection (6) or (7) must be borne by the Board."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 3 - SEWERAGE",
      "section": "5",
      "title": "Sewers may be emptied into sea",
      "content": "5. The Board may — ( a ) cause any sewer to be emptied into the sea or other fit place; ( b ) cause the sludge from any sewer to be conveyed by a proper channel to the most convenient site for its deposit; and ( c ) sell or otherwise dispose of the sludge for agricultural or any other purpose deemed most expedient so long as it does not become a nuisance."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 3 - SEWERAGE",
      "section": "6",
      "title": "Premises not provided with adequate sewerage system",
      "content": "6. —(1) If it appears to the Board that any premises are not provided with an adequate sewerage system, the Board may, by written notice, require the owner or occupier of the premises to construct such sewerage system, or to make such alteration to the existing sewerage system as the Board considers necessary. (2) The Board may, at any time by written notice, require the owner or occupier of any premises served by any sewerage system or any part thereof to make a sufficient drain‑line emptying into any public sewerage system and to disconnect and demolish at the owner’s or occupier’s own expense any sewerage system or any part thereof rendered useless or unnecessary thereby. [Act 38 of 2024 wef 01/03/2025] (3) The Board may, by written notice, require the owner or occupier of any premises to cause all sewage from those premises to be discharged into such sewerage system as the Board may direct."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - SEWERAGE",
      "section": "7",
      "title": "Board may take over control, etc., of private sewerage systems",
      "content": "7. —(1) The Board may take over the control, supervision, maintenance and repair of any private sewerage system or any part thereof to such extent as the Board thinks fit and may charge fees therefor. [Act 38 of 2024 wef 01/03/2025] (2) The Board may, at any time, vary or rescind any decision to control, supervise, maintain and repair a private sewerage system or part thereof. [Act 38 of 2024 wef 01/03/2025] (3) Fees charged by the Board for the control, supervision, maintenance and repair of a private sewerage system under subsection (1) are payable by any user of the sewerage system. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - SEWERAGE",
      "section": "8",
      "title": "Vesting of sewerage systems in Government",
      "content": "8. —(1) Where any premises have been set aside or are being used for any sewerage system pursuant to any development proposals approved by the competent authority and the owner of the premises has agreed to surrender the premises to the Government, the Board may, by an instrument in the form approved by the Registrar of Titles or the Registrar of Deeds (as the case may be), declare that the premises vest in the Government. (2) Any plan prepared by the Board under subsection (1) must comply with the requirements of the Land Titles Act 1993 in respect of registered land and of the Registration of Deeds Act 1988 in respect of other land and must show on the plan the premises which will vest in the Government. (3) Any declaration made by the Board under subsection (1) must be published in the Gazette . (4) Where any premises that are to be vested in the Government under this section consist of premises included in separate lots already set aside for a sewerage system, the declaration must be registered against those lots under the provisions of the Land Titles Act 1993 in respect of registered land and under the provisions of the Registration of Deeds Act 1988 in respect of other land. (5) Where any premises that are to be vested in the Government under this section consist of premises included in an existing lot or lots, those premises forming the sewerage system must be excised from the existing lot or lots and the declaration must be registered in respect of the excised portions under the provisions of the Land Titles Act 1993 in respect of registered land and under the provisions of the Registration of Deeds Act 1988 in respect of other land. (6) Upon the registration of a declaration made under subsection (1), the premises including every sewerage system installed therein vest in the Government free from all encumbrances and, where the premises are held under a statutory land grant, such vesting is not to be deemed to create a subdivision within the meaning of the State Lands Act 1920. (7) No compensation is payable for any premises that are vested in the Government under this section. (8) When any premises are vested in the Government under this section, the Board may take possession of the premises and proceed to demolish and remove any building or portion of any building forming part thereof."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - SEWERAGE",
      "section": "9",
      "title": "Vesting of private sewers in Government",
      "content": "9. —(1) The Board may, at any time, declare that any private sewer vests, as from the date specified in the declaration, in the Government. (2) Before the Board makes a declaration under subsection (1), it must give written notice of its intention to do so to the owner of the sewer in question. (3) Any owner who is aggrieved by a notice issued by the Board under subsection (2) may appeal to the Minister within 28 days from the date of service of the notice. (4) Upon the hearing of an appeal under this section, the Minister may allow the appeal and the Board must not take any further action on the matter. (5) Where no appeal has been filed within the time specified in subsection (3) or an appeal has been dismissed by the Minister, the Board may proceed to make the declaration. (6) Where a declaration has been made in respect of a private sewer under this section, the Board must maintain the sewer and, if it sees fit, enlarge, alter or otherwise improve the sewer and may discontinue, close up or destroy the sewer as it thinks necessary as if it were a sewer constructed by the Board. (7) If by reason of the alteration, discontinuation, closing up or destruction of any private sewer vested in the Government under this section any person is deprived of the lawful use of the sewer, the Board must with due diligence provide some other sewer as effectual as the one the person is so deprived of. (8) The declaration under subsection (1) must be registered against those lands under the provisions of the Land Titles Act 1993 in respect of registered land and under the provisions of the Registration of Deeds Act 1988 in respect of other land."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - SEWERAGE",
      "section": "10",
      "title": "Sewerage systems to be kept in proper order at cost of owners",
      "content": "10. —(1) Every sewerage system at any premises (but not any public sewerage system) must be altered, repaired and kept in proper order at the cost and expense of the owner of the premises. [Act 38 of 2024 wef 01/03/2025] (1A) Without affecting subsection (1), where the sewerage system under that subsection or any part thereof — ( a ) is connected to any other premises; and ( b ) serves the sewerage needs of the other premises, then the owner of the other premises must also at that owner’s own cost and expense alter, repair and keep in proper order the system or part thereof (as the case may be) at the premises under subsection (1). [Act 38 of 2024 wef 01/03/2025] (2) The Board may, by written notice, require any of the owners of any premises mentioned in subsections (1) and (1A) to do one or both of the following at the owner’s own cost and expense: ( a ) to have the sewerage system or part thereof inspected and tested in such manner and at such intervals as the Board may require, to ensure that the sewerage system or part thereof is kept in proper order; [Act 38 of 2024 wef 01/03/2025] ( b ) to alter, repair or put in proper order the sewerage system or part thereof in such manner as the Board may require. [10/2012] [Act 38 of 2024 wef 01/03/2025] (3) Where the Board is satisfied that it is immediately necessary to alter, repair or put in proper order any sewer, drain‑line, privy, cesspool, septic or other tank, toilet, urinal, water closet, sink, bath or lavatory or any appurtenance thereof, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out any alterations, repairs, works, acts or things that are necessary for any of those purposes. [10/2012] [Act 38 of 2024 wef 01/03/2025] (4) The Board may, as it thinks just — ( a ) recover the costs and expenses reasonably and necessarily incurred in carrying out the works under subsection (3) from any owner of the premises mentioned in subsections (1) and (1A); or ( b ) apportion such costs and expenses among all or any of the owners of the premises mentioned in subsections (1) and (1A) and recover the sums apportioned from those owners. [Act 38 of 2024 wef 01/03/2025] (5) Any person who contravenes subsection (1) or (1A) shall be guilty of an offence. [Act 38 of 2024 wef 01/03/2025] (6) Nothing in this section prevents any owner of the premises mentioned in subsection (1) and any owner of any other premises in subsection (1A) from agreeing on an apportionment between them of any costs of altering, repairing or keeping in proper order the sewerage system or part thereof mentioned in subsection (1A); but the Board is not, for the purposes of subsection (4)( b ), bound by any such agreement. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - SEWERAGE",
      "section": "11",
      "title": "Sewerage systems, etc., not to be constructed or altered without Board’s certificate or approval",
      "content": "11. —(1) A person must not — ( a ) construct, alter, discontinue or close up any sewerage system or any part thereof or any earth retaining structure; or [Act 38 of 2024 wef 01/03/2025] ( b ) carry out any sanitary works, unless the person obtains a clearance certificate or the approval of the Board under section 33 for those works. [11/2018] (2) Where any sewerage system or any part thereof or any earth retaining structure is constructed, altered, discontinued or closed up, or any sanitary works are carried out, in contravention of subsection (1) or any condition of a clearance certificate or approval granted pursuant to subsection (1), the Board may do one or both of the following: ( a ) serve on any person specified in subsection (3) a notice requiring the person to demolish or make good the sewerage system or part thereof, earth retaining structure or sanitary facilities (as the case may be) to its original condition within the time specified in the notice; ( b ) revoke the clearance certificate or approval given, or suspend the clearance certificate or approval for such period as the Board considers reasonable. [Act 38 of 2024 wef 01/03/2025] (3) The notice mentioned in subsection (2)( a ) may be served on all or any of the following persons: ( a ) any person who does or causes or permits to be done any of the acts mentioned in subsection (1); ( b ) the owner or occupier of the premises at which the sewerage system or part thereof, earth retaining structure or sanitary facilities mentioned in subsection (2) are situated; [Act 38 of 2024 wef 01/03/2025] ( ba ) the owner or occupier of any other premises to which the sewerage system or part thereof, earth retaining structure or sanitary facilities mentioned in subsection (2) are connected and which serve the sewerage needs of the other premises; [Act 38 of 2024 wef 01/03/2025] ( c ) any person having power to construct, alter or demolish the sewerage system or part thereof, earth retaining structure or sanitary facilities mentioned in subsection (2). [Act 38 of 2024 wef 01/03/2025] (4) Any person who — ( a ) contravenes subsection (1); or ( b ) carries out any works after the clearance certificate or approval relating to those works has been revoked or during the period that the clearance certificate or approval is suspended under subsection (2)( b ), shall be guilty of an offence and shall be liable — ( c ) on the first conviction to a fine not exceeding $50,000; and ( d ) on a second or subsequent conviction to a fine not exceeding $100,000. [Act 38 of 2024 wef 01/03/2025] (5) Any contravention of subsection (1) in respect of any sanitary works must not be dealt with by the Board under section 40Q of the Public Utilities Act 2001. [11/2018] (6) Where the Board is satisfied that it is immediately necessary to demolish or make good the sewerage system or part thereof or sanitary facilities to its original condition, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out any alterations, repairs, works, acts or things that are necessary for that purpose. [Act 38 of 2024 wef 01/03/2025] (7) The Board may, as it thinks just — ( a ) recover the costs and expenses reasonably and necessarily incurred in carrying out the works under subsection (6) from any of the persons mentioned in subsection (3); or ( b ) apportion such costs and expenses among all or any of the persons mentioned in subsection (3) and recover the sums apportioned from those persons. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - SEWERAGE",
      "section": "12",
      "title": "Buildings without adequate sanitary facilities",
      "content": "12. —(1) If it appears to the Board that any building or part thereof is without adequate sanitary facilities, it may by written notice require the owner or occupier of the building — ( a ) to provide or install such sanitary facilities as the Board may consider adequate; or ( b ) to alter, improve, demolish or resite any sanitary facilities in such manner as the Board may require, within the time specified in the notice. (2) All sanitary facilities provided or installed in any building must be maintained, repaired and renewed to the satisfaction of the Board by the owner or occupier of the building. (3) All costs and expenses incurred for the provision, installation, alteration, demolition or re‑siting of sanitary facilities under this section must be borne by the owner or occupier of the building or the relevant part of the building."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - SEWERAGE",
      "section": "13",
      "title": "Power to inspect sewerage systems and sanitary facilities",
      "content": "13. —(1) Any authorised officer may inspect any sewerage system or sanitary facilities and may, for that purpose, at any time enter upon any premises under section 44 or section 43(2) (as the case may be) and cause the ground to be opened. [Act 38 of 2024 wef 01/03/2025] (2) In carrying out any inspection under this section, the authorised officer must cause as little damage as possible, and the Board must make reasonable compensation for any damage done to any premises, sewerage system or sanitary facilities affected by the inspection. [10/2012] [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s13A",
      "chapter": "PART 3 - SEWERAGE",
      "section": "13A",
      "title": "Duty to enquire before excavation",
      "content": "13A. —(1) Any person who digs, bores, trenches, grades, excavates, tunnels or breaks any ground with any mechanical equipment, tool or explosive, or allows the person’s employee or agent to do so, without first — ( a ) obtaining from the Board the relevant drainage plan or sewerage plan or other plans or records to ascertain the location of any public sewerage system or part thereof that may be interfered with by such works; ( b ) carrying out trial trenches to physically ascertain the location of any public sewerage system or part thereof that may be interfered with by such works; and ( c ) complying with such other requirements as the Board may specify to protect any public sewerage system or part thereof within the vicinity of such works, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $50,000 or to imprisonment for a term not exceeding 3 years or to both. [10/2012] (2) For the purposes of subsection (1)( a ), any person may, upon payment of the prescribed fee, be permitted to inspect and take copies of the relevant plans or records maintained by or on behalf of the Board. [10/2012]"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - SEWERAGE",
      "section": "14",
      "title": "Works likely to affect sewer or sewerage system not to be carried out without Board’s certificate or approval",
      "content": "14. —(1) A person must not — ( a ) erect or cause or permit to be erected any object, building or structure over, across or adjacent to any sewer or sewerage system; or ( b ) carry out or cause to be carried out any other works which adversely affect or are likely to adversely affect any sewer or sewerage system, directly or indirectly, without obtaining, in respect of those works, a clearance certificate or the approval of the Board under section 33. [10/2012] (2) Where any object, building or structure is erected or any other works are carried out in contravention of subsection (1), the Board may, by written notice, require any person specified in subsection (3) to do one or more of the following: ( a ) to immediately cease the carrying out of those works, either indefinitely or for such period as the Board may specify; ( b ) to carry out any works that the Board may think necessary to protect the sewer or sewerage system within the time specified in the notice; ( c ) to demolish and remove the object, building or structure within the time specified in the notice. [10/2012] (3) The notice mentioned in subsection (2) may be served on all or any of the following persons: ( a ) the person who does or causes or permits to be done any of the acts referred to in subsection (1); ( b ) the owner or occupier of the premises where the object, building or structure referred to in subsection (1)( a ) is erected; ( c ) the owner or occupier of the premises where the works referred to in subsection (1)( b ) are being carried out; ( d ) any person having power to demolish the object, building or structure referred to in subsection (1)( a ). [10/2012] (4) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000. [10/2012] (5) In this section, “works”, in addition to its meaning in section 2, includes — ( a ) any act of excavating earth, rock or other material (by any means) in connection with — (i) any work for or relating to the construction, reconstruction, extension, renovation, alteration, demolition or repair of any building, structure, road, railway, bridge, viaduct, flyover, drain or sewer; (ii) any work for or relating to the laying, inspecting, repairing or renewing of any main, pipe, cable, fittings or other apparatus; or (iii) any soil investigation work; ( b ) any act of boring, dredging, jacking, levelling, piling or tunnelling on or under any premises or street by any mechanical means; ( c ) the driving or sinking of any earth rod, casing or tube into the ground; and ( d ) any storage or placement of large construction equipment, construction materials and stockpiling of earth or heavy objects. [10/2012]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - SEWERAGE",
      "section": "15",
      "title": "Sanitary facilities, sewerage system and sewage removal for farms",
      "content": "15. —(1) The Board may, by written notice, direct the owner or occupier of any premises used as a farm — ( a ) to install, operate and maintain such sanitary facilities and sewerage system; and ( b ) to provide and maintain such facilities for the removal, treatment and disposal of waste matter, as the Board may require. (2) The Board may at any time apply such system of sewage removal as the Board thinks fit to any premises used as a farm. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - SEWERAGE",
      "section": "16",
      "title": "Trade effluent not to be discharged into public sewerage system without Board’s approval",
      "content": "16. —(1) A person must not discharge, or cause or permit to be discharged, any trade effluent into any public sewerage system or any drain‑line or sewer connected to a public sewerage system, except — ( a ) with the prior written approval of the Board; and ( b ) in accordance with the conditions of that approval (if any) and any regulations under this Act providing for the control of such discharge. [10/2012] [Act 38 of 2024 wef 01/03/2025] (2) Subsection (1) does not apply to the discharge of any dangerous or hazardous substance or any trade effluent containing any dangerous or hazardous substance under section 16A. [10/2012] (3) Where any trade effluent has been discharged from any premises into any public sewerage system or any drain‑line or sewer connected to a public sewerage system, it is presumed, until the contrary is proved, that the occupier of the premises has discharged, or caused or permitted to be discharged, the trade effluent in contravention of subsection (1). [10/2012] [Act 38 of 2024 wef 01/03/2025] (4) The presumption under subsection (3) is not rebutted unless the occupier of the premises proves that the occupier had taken all reasonable precautions and exercised due diligence to prevent the contravention of subsection (1). [10/2012] (5) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable — ( a ) on the first conviction, to a fine of at least $4,000 and not more than $20,000 or to imprisonment for a term not exceeding 3 months or to both and, in the case of a continuing offence, to a further fine not exceeding $1,000 for every day or part of a day during which the offence continues after conviction; and ( b ) on a second or subsequent conviction, to a fine of at least $10,000 and not more than $50,000 or to imprisonment for a term not exceeding 3 months or to both and, in the case of a continuing offence, to a further fine not exceeding $2,000 for every day or part of a day during which the offence continues after conviction. [Act 38 of 2024 wef 01/03/2025] (6) A person shall not be guilty of an offence under this section if the person proves that — ( a ) the discharge of trade effluent was made in an emergency to avoid danger to life or property; and ( b ) the person informed the Board of the discharge in writing as soon as was reasonably practicable. (7) The court may order any person who is convicted of an offence under this section to pay the cost incurred by the Board, or by the owner or occupier of any premises, in carrying out any work to restore the public sewerage system to its original condition, or to clear the public sewerage system of the trade effluent so discharged. [10/2012]"
    },
    {
      "provision_ref": "s16A",
      "chapter": "PART 3 - SEWERAGE",
      "section": "16A",
      "title": "Prohibition on discharge of dangerous or hazardous substance or trade effluent containing dangerous or hazardous substance",
      "content": "16A. —(1) A person must not discharge, or cause or permit to be discharged, any dangerous or hazardous substance or any trade effluent containing any dangerous or hazardous substance into any public sewerage system or any drain‑line or sewer connected to a public sewerage system, except — ( a ) with the prior written approval of the Board; and ( b ) in accordance with the conditions of that approval (if any) and any regulations under this Act providing for the control of such discharge. [10/2012] [Act 38 of 2024 wef 01/03/2025] (2) Where any dangerous or hazardous substance or any trade effluent containing any dangerous or hazardous substance has been discharged from any premises into any public sewerage system or any drain‑line or sewer connected to a public sewerage system in contravention of subsection (1), it is presumed, until the contrary is proved, that the occupier of the premises has discharged, or caused or permitted to be discharged, the substance or trade effluent. [10/2012] [Act 38 of 2024 wef 01/03/2025] (3) The presumption under subsection (2) is not rebutted unless the occupier of the premises proves that the occupier had taken all reasonable precautions and exercised due diligence to prevent the contravention of subsection (1). [10/2012] (4) Where, in any proceedings for an offence under subsection (5) or (6), it is proved that the accused had committed any act referred to in subsection (1), it is presumed, unless the contrary is proved, that the accused knew that the substance discharged was a dangerous or hazardous substance or that the trade effluent discharged contained a dangerous or hazardous substance, as the case may be. [10/2012] (5) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable — ( a ) on the first conviction, to a fine of at least $10,000 and not more than $50,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $2,000 for every day or part of a day during which the offence continues after conviction; and [Act 38 of 2024 wef 01/03/2025] ( b ) on a second or subsequent conviction, to a fine of at least $20,000 and not more than $100,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $2,000 for every day or part of a day during which the offence continues after conviction. [10/2012] [Act 38 of 2024 wef 01/03/2025] (6) Any person who contravenes subsection (1) and thereby causes — ( a ) injury or death to any person; ( b ) damage to any public sewerage system which renders the sewerage system inoperable; or ( c ) severe disruption to the process of treating sewage or the process of water reclamation, shall be guilty of an offence and shall be liable — ( d ) on the first conviction, to a fine of at least $40,000 and not more than $200,000 or to imprisonment for a term not exceeding 2 years or to both; and ( e ) on a second or subsequent conviction, to a fine of at least $80,000 and not more than $400,000 or to imprisonment for a term not exceeding 2 years or to both. [Act 38 of 2024 wef 01/03/2025] (7) The court may order any person who is convicted of an offence under this section to pay the cost incurred by the Board, or by the owner or occupier of any premises, in carrying out any work — ( a ) to restore the public sewerage system to its original condition; ( b ) to resume the process of treating sewage or the process of water reclamation; or [Act 38 of 2024 wef 01/03/2025] ( c ) to clear the public sewerage system of the dangerous or hazardous substance or the trade effluent containing the dangerous or hazardous substance so discharged. [10/2012] (8) The Board may, with the approval of the Minister, by regulations provide for the control or prohibition of the discharge of dangerous or hazardous substances or trade effluent containing dangerous or hazardous substances into any public sewerage system or any drain‑line or sewer connected to a public sewerage system. [10/2012] [Act 38 of 2024 wef 01/03/2025] (9) For the purposes of this section and section 17, a substance is a dangerous or hazardous substance if — ( a ) it is of a nature that is likely, either alone or in combination with or by interaction with another substance — (i) to pose a health hazard to or cause danger to the safety and health of any person at work at, on or in any part of any public sewerage system; (ii) to cause a fire or an explosion in any public sewerage system; (iii) to damage any public sewerage system to the extent that would render the sewerage system inoperable; or (iv) to severely disrupt — (A) the proper working of any public sewerage system, or any facility, machinery or equipment related or connected to the sewerage system; (B) any process of treating sewage or other waste for reuse; [Act 38 of 2024 wef 01/03/2025] (C) any process of water reclamation; or (D) the proper working of any facility, machinery or equipment used for any process mentioned in sub‑paragraph (B) or (C); or ( b ) it is prescribed as a dangerous or hazardous substance. [10/2012]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - SEWERAGE",
      "section": "17",
      "title": "Order to stop discharge of dangerous or hazardous substance or trade effluent containing dangerous or hazardous substance",
      "content": "17. —(1) Where it appears to the Board that any dangerous or hazardous substance or any trade effluent containing any dangerous or hazardous substance is being or has been discharged into any public sewerage system or any drain‑line or sewer connected to a public sewerage system, the Board may, by order, direct the occupier of any premises from which the substance or trade effluent is being or has been discharged or any other person who, in the opinion of the Board, has caused or permitted the discharge — ( a ) to immediately cease the discharge of the substance or trade effluent into the public sewerage system or the drain‑line or sewer connected to a public sewerage system; [Act 38 of 2024 wef 01/03/2025] ( b ) to take such steps as may be specified in the order to treat the substance or trade effluent which is complained of; and ( c ) to immediately cease the carrying on of any process or work which produces the substance or trade effluent, either indefinitely or until such steps as are specified in the order have been taken to treat the substance or trade effluent before it is discharged into the public sewerage system or the drain‑line or sewer connected to a public sewerage system. [10/2012] [Act 38 of 2024 wef 01/03/2025] (2) Any person who is aggrieved by an order made by the Board under subsection (1) may, within 14 days from the date of service of the order, appeal in writing to the Minister, who may confirm, vary or rescind the order. [10/2012] (3) Even though an appeal has been made under subsection (2), an aggrieved person must comply with the order pending the outcome of the appeal to the Minister and the Board may exercise the powers conferred under subsection (5). [10/2012] (4) If any person to whom an order under subsection (1) is directed fails to comply with the order (called in this section the person in default), that person shall be guilty of an offence and shall be liable on conviction to a fine of at least $20,000 and not more than $100,000 or to imprisonment for a term not exceeding 3 months or to both and, in the case of a continuing offence, to a further fine of $2,000 for every day or part of a day during which the offence continues after conviction. [10/2012] [Act 38 of 2024 wef 01/03/2025] (5) Where the person in default fails to comply with the order made under subsection (1), an authorised officer may, at all reasonable hours in the day or night, or at such other time as may be agreed with the owner or occupier of the premises to which the order relates, enter the premises and take such measures and execute such work as may be necessary to secure compliance with the order but without affecting any proceedings that may be taken against the person in default under subsection (4). [10/2012] (6) Any expenses reasonably incurred by the Board under subsection (5) may be recovered from the person in default and section 48 and, if that person is the owner of the premises, section 50 applies in respect of those expenses. (7) Nothing in this section is deemed to prohibit the Board from carrying out any works specified in any such order at the request of a person who has been served with the order upon an undertaking by that person to pay the costs and expenses in executing the works."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - SEWERAGE",
      "section": "18",
      "title": "Discharge of sewage, etc.",
      "content": "18. —(1) Any person who, without the written approval of the Board, discharges or causes or permits the discharge of any sewage, waste matter or effluent into any public sewerage system or any drain‑line or sewer connected to a public sewerage system — ( a ) directly or indirectly, from any conveyance or mobile toilet; or ( b ) by opening a manhole or an inspection chamber or any other means of access to the public sewerage system, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000. [10/2012] [Act 38 of 2024 wef 01/03/2025] (2) Subsection (1) does not apply to any discharge from a conveyance or mobile toilet which may be lawfully made into any public sewer or public sewerage system under any regulations made under this Act. [10/2012] (3) In this section — “conveyance” includes any vessel, train, aircraft, vehicle or trailer, and any fixed or floating platform in a marine environment; “mobile toilet” means a sanitary convenience which is not part of a sewerage system, including a sanitary convenience which is mobile or in a conveyance."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 3 - SEWERAGE",
      "section": "19",
      "title": "Restrictions on use of public sewerage system",
      "content": "19. —(1) A person must not throw, empty or pass, or allow or permit to be thrown or emptied or passed, into any public sewerage system, or into any drain‑line or sewer connected to a public sewerage system — ( a ) any matter or other substance likely to injure the public sewerage system, sewer or drain‑line, to interfere with the free flow of its contents or to affect prejudicially the treatment and disposal of its contents; or ( b ) any sand, earth, gravel, cement, cement grout, brick, timber, wood or other building materials. [10/2012] [Act 38 of 2024 wef 01/03/2025] (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000. (3) The court may order any person who is convicted of an offence under this section to pay the cost incurred by the Board or the owner or occupier of any premises who has carried out any work to restore the sewerage system to its original condition, or to clear the sewerage system of any obstruction to the free flow of its contents."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 3 - SEWERAGE",
      "section": "20",
      "title": "Damage caused to public sewerage system, etc.",
      "content": "20. —(1) Any person who — ( a ) causes any damage to — (i) any public sewerage system or any part thereof; (ii) any drain-line or sewer connected to a public sewerage system; or (iii) any earth retaining structure; or ( b ) renders any public sewerage system or any part thereof or any private sewer a nuisance, shall be guilty of an offence and shall be liable — ( c ) on the first conviction to a fine not exceeding $50,000 or to imprisonment for a term not exceeding 3 months or to both; and ( d ) on a second or subsequent conviction to a fine not exceeding $100,000 or to imprisonment for a term not exceeding 3 months or to both. [Act 38 of 2024 wef 01/03/2025] (2) Any person who — ( a ) does any act which renders any public sewerage system or any part thereof or any private sewer dangerous or injurious to health; ( b ) causes any damage to a pipe of 0.9 metres or greater in diameter that is part of or connected to the public sewerage system; or ( c ) does any act which disrupts the operation of or causes damage to any sewage treatment plant, sewage treatment works or water reclamation facility, shall be guilty of an offence and shall be liable — ( d ) on the first conviction to a fine not exceeding $200,000 or to imprisonment for a term not exceeding 2 years or to both; and ( e ) on a second or subsequent conviction to a fine not exceeding $400,000 or to imprisonment for a term not exceeding 2 years or to both. [Act 38 of 2024 wef 01/03/2025] (3) In any proceedings for an offence under subsection (1) or (2), it is a defence for the person charged under either of those subsections to prove that the person took all reasonable precautions and exercised all due diligence to avoid the commission of the offence, but this defence is not available to a person who may be liable by virtue of section 67A. [10/2012] (4) If it appears to the Board that there has been a contravention of subsection (1) or (2), the Board may, by written notice, require any person who has caused the damage or done any of the acts mentioned in subsection (1) or (2), or any other person who may be liable under either of those subsections by virtue of section 67A, to carry out any works that may be necessary to restore the public sewerage system, private sewer or earth retaining structure to its original condition within the time specified in the notice. [Act 38 of 2024 wef 01/03/2025] (5) Where the Board is satisfied that it is immediately necessary to carry out any works that may be necessary to restore the public sewerage system to its original condition, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out those works. [Act 38 of 2024 wef 01/03/2025] (6) The Board may, as it thinks just — ( a ) recover the costs and expenses reasonably and necessarily incurred in carrying out the works under subsection (5) from any person mentioned in subsection (4) on whom the Board could have served a written notice to restore the public sewerage system to its original condition; or ( b ) apportion such costs and expenses among all or any of the persons mentioned in subsection (4) and recover the sums apportioned from those persons. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 4 - DRAINAGE",
      "section": "21",
      "title": "Board may construct stormwater drainage systems",
      "content": "21. —(1) The Board may — ( a ) cause to be made, constructed and maintained any stormwater drainage system or drain; and ( b ) enlarge and alter or otherwise improve any stormwater drainage system or drain. [Act 38 of 2024 wef 01/03/2025] (2) For the purposes of subsection (1), the Board may — ( a ) carry the drainage system across, through, along or under any premises or any cellar, basement or vault of any building; and ( b ) carry out any works requisite for, or incidental to, the purposes of subsection (1). [Act 38 of 2024 wef 01/03/2025] (3) Unless section 43(2) applies, an authorised officer may enter any premises to execute any work necessary for the purposes of subsection (1) only after giving notice in accordance with section 44. [12/2015] [Act 38 of 2024 wef 01/03/2025] (4) In carrying out any works under this section, the Board must cause as little damage as possible, and must make reasonable compensation for any damage done to any affected premises or building. [10/2012]"
    },
    {
      "provision_ref": "s21A",
      "chapter": "PART 4 - DRAINAGE",
      "section": "21A",
      "title": "Board may take over control, etc., of stormwater drainage systems and drains",
      "content": "21A. —(1) The Board may take over the control, supervision, maintenance and repair of any stormwater drainage system or drain not already under its control or supervision or maintained by it, to such extent as the Board thinks fit and may charge fees therefor. (2) The Board may, at any time, vary or rescind any decision to control, supervise, maintain and repair a stormwater drainage system or drain. (3) Fees charged by the Board for the control, supervision, maintenance and repair of a stormwater drainage system or drain under subsection (1) are payable by any user thereof. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 4 - DRAINAGE",
      "section": "22",
      "title": "Vesting of private drains in Government",
      "content": "22. —(1) The Board may at any time declare that any private drain vests, as from the date specified in the declaration, in the Government. (2) Before the Board makes a declaration under subsection (1), it must give notice of its intention to do so to the owner of the drain in question. (3) Any owner who is aggrieved by a notice issued by the Board under subsection (2) may appeal to the Minister within 28 days from the date of service of the notice. (4) Upon the hearing of an appeal under this section, the Minister may allow the appeal and the Board must not take any further action on the matter. (5) Where no appeal has been filed within the time specified in subsection (3), or an appeal has been dismissed by the Minister, the Board may proceed to make the declaration. (6) Where a declaration has been made in respect of a private drain under this section, the Board — ( a ) must maintain the drain and, if it sees fit, enlarge, alter or otherwise improve the drain; and ( b ) may discontinue, close up or destroy the drain as it thinks necessary as if it were a drain constructed by the Board. (7) If by reason of the alteration, discontinuation, closing up or destruction of any drain vested in the Government under this section, any person is deprived of the lawful use of the drain, the Board must with due diligence provide some other drain as effectual as the one the person so deprived of. (8) The declaration under subsection (1) must be registered against those lands under the provisions of the Land Titles Act 1993 in respect of registered land and under the provisions of the Registration of Deeds Act 1988 in respect of other land."
    },
    {
      "provision_ref": "s22A",
      "chapter": "PART 4 - DRAINAGE",
      "section": "22A",
      "title": "Drains, etc., to be kept in proper order at cost of owners",
      "content": "22A. —(1) Every stormwater drainage system or drain at any premises (but not any such system or drain under the control or supervision of the Board or maintained by the Board) must be altered, repaired and kept in proper order at the cost and expense of the owner of the premises. (2) Without affecting subsection (1), where the stormwater drainage system or drain under that subsection or any part thereof — ( a ) is connected to any other premises; and ( b ) serves the drainage needs of the other premises, then the owner of the other premises must also at that owner’s own cost and expense alter, repair and keep in proper order the system or drain or part thereof (as the case may be) at the premises under subsection (1). (3) The Board may, by written notice, require any of the owners mentioned in subsections (1) and (2) to do one or both of the following at the owner’s own cost and expense: ( a ) to have the stormwater drainage system or drain or part thereof inspected and tested in such manner and at such intervals as the Board may require, to ensure that the system or drain or part thereof is kept in proper order; ( b ) to alter, repair or put in proper order the stormwater drainage system or drain or part thereof in such manner as the Board may require. (4) Where the Board is satisfied that it is immediately necessary to alter, repair or put in proper order any or any part of a stormwater drainage system or drain under subsection (1) or (2), any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out any alterations, repairs, works, acts or things that are necessary for any of those purposes. (5) The Board may, as it thinks just — ( a ) recover the costs and expenses reasonably and necessarily incurred in carrying out the works under subsection (4) from any owner of the premises mentioned in subsections (1) and (2); or ( b ) apportion such costs and expenses among all or any of the owners of the premises mentioned in subsections (1) and (2) and recover the sums apportioned from those owners. (6) Any person who contravenes subsection (1) or (2) shall be guilty of an offence. (7) Nothing in this section prevents any owner of the premises mentioned in subsection (1) and any owner of any other premises in subsection (2) from agreeing on an apportionment between them of any costs of altering, repairing or keeping in proper order the stormwater drainage system or drain or part thereof mentioned in subsection (2); but the Board is not, for the purposes of subsection (5)( b ), bound by any such agreement. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s22B",
      "chapter": "PART 4 - DRAINAGE",
      "section": "22B",
      "title": "Flood protection measures to be kept in proper order at cost of owners",
      "content": "22B. —(1) The owner of any premises must alter, repair and keep in proper order every flood protection measure at the premises. (2) The Board may, by written notice, require the owner mentioned in subsection (1) to do one or both of the following at the owner’s own cost and expense: ( a ) to have the flood protection measure inspected and tested in such manner and at such intervals as the Board may require, to ensure that the flood protection measure is kept in proper order; ( b ) to alter, repair or put in proper order the flood protection measure in such manner as the Board may require. (3) Where the Board is satisfied that it is immediately necessary to alter, repair or put in proper order any flood protection measure, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out any alterations, repairs, works, acts or things that are necessary for any of those purposes. (4) Any expenses reasonably and necessarily incurred in carrying out the works referred to in subsection (3) may be recovered from the owner mentioned in subsection (1). (5) Any person who contravenes subsection (1) shall be guilty of an offence. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 4 - DRAINAGE",
      "section": "23",
      "title": "Stormwater drainage system not to be constructed or altered without Board’s certificate or approval",
      "content": "23. —(1) A person must not construct, alter, discontinue or close up any stormwater drainage system or drain without obtaining in respect of those works, a clearance certificate or the approval of the Board under section 33. (2) Where any stormwater drainage system or drain has been constructed, altered, discontinued or closed up in contravention of subsection (1) or any condition of a clearance certificate or approval granted pursuant to subsection (1), the Board may do one or both of the following: ( a ) serve on any person specified in subsection (3) a notice requiring the person to demolish or make good the stormwater drainage system or drain to its original condition within the time specified in the notice; ( b ) revoke the clearance certificate or approval given, or suspend the clearance certificate or approval for such period as the Board considers reasonable. [Act 38 of 2024 wef 01/03/2025] (3) The notice mentioned in subsection (2)( a ) may be served on all or any of the following persons: ( a ) any person who does or causes or permits to be done any of the acts mentioned in subsection (1); ( b ) the owner or occupier of the premises at which the stormwater drainage system or drain mentioned in subsection (2) are situated; [Act 38 of 2024 wef 01/03/2025] ( ba ) the owner or occupier of any other premises to which the stormwater drainage system or drain mentioned in subsection (2) or any part thereof are connected and which serve the drainage needs of the other premises; [Act 38 of 2024 wef 01/03/2025] ( c ) any person having power to construct, alter or demolish the stormwater drainage system or drain mentioned in subsection (2). [Act 38 of 2024 wef 01/03/2025] (4) Any person who — ( a ) contravenes subsection (1); or ( b ) carries out any works after the clearance certificate or approval relating to those works has been revoked or during the period that the clearance certificate or approval is suspended under subsection (2)( b ), shall be guilty of an offence and shall be liable — ( c ) on the first conviction to a fine not exceeding $50,000; and ( d ) on a second or subsequent conviction to a fine not exceeding $100,000. [Act 38 of 2024 wef 01/03/2025] (5) Where the Board is satisfied that it is immediately necessary to demolish or make good the stormwater drainage system or drain to its original condition, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out any alterations, repairs, works, acts or things that are necessary for that purpose. [Act 38 of 2024 wef 01/03/2025] (6) The Board may, as it thinks just — ( a ) recover the costs and expenses reasonably and necessarily incurred in carrying out the works under subsection (5) from any of the persons mentioned in subsection (3); or ( b ) apportion such costs and expenses among all or any of the persons mentioned in subsection (3) and recover the sums apportioned from those persons. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 4 - DRAINAGE",
      "section": "24",
      "title": "Drains, drainage reserves and reservoirs not to be interfered with",
      "content": "24. —(1) A person must not — ( a ) erect or place any fence, partition, structure or object in, above or across, or enclosing, the whole or any part of, any drain or reservoir; [Act 38 of 2024 wef 01/03/2025] ( b ) cause any obstruction to the flow of any stormwater drainage system; or ( c ) erect, construct or lay within any drainage reserve any fence, retaining wall, foundation, manhole, pipe, cable, mains or any obstruction or structure (whether temporary or permanent), [Act 38 of 2024 wef 01/03/2025] without obtaining in respect of those works a clearance certificate or the approval of the Board under section 33. (1A) A person must not, except with the prior approval of the Board — ( a ) deposit or leave any soil, building material or components, construction or renovation debris or other like matter within any drain or drainage reserve; [Act 38 of 2024 wef 01/03/2025] ( b ) park or leave any vehicle on any drainage reserve; [Act 38 of 2024 wef 01/03/2025] ( c ) clear, dig up or cultivate, or interfere with any substance on, in or forming part of, any drain or drainage reserve; or [Act 38 of 2024 wef 01/03/2025] ( d ) cause or allow any activity mentioned in paragraph ( a ), ( b ) or ( c ) to be carried out. (2) Where any fence, partition, structure or object is erected or placed, or any obstruction is caused, in contravention of subsection (1) or an act is carried out in contravention of subsection (1A), the Board may by notice, direct the person to whom the notice is given, to do all or any of the following and within the time as are specified in the notice: ( a ) to demolish or remove any fence, partition, structure or object erected or placed — (i) in, above or across, or enclosing, the whole or any part of, the drain or reservoir; or [Act 38 of 2024 wef 01/03/2025] (ii) within the drainage reserve; ( b ) to move or remove from the drain, drainage reserve or reservoir, any object or obstruction, including vehicles, soil, building material or components, construction or renovation debris or other like matter; [Act 38 of 2024 wef 01/03/2025] ( c ) to do, or to refrain from doing, any work that is specified in the notice in order — (i) to rectify any damage to the drain, drainage reserve or reservoir as a result of; or [Act 38 of 2024 wef 01/03/2025] (ii) to restore the drain, drainage reserve or reservoir to its state before, [Act 38 of 2024 wef 01/03/2025] any unlawful activity mentioned in subsection (1) or (1A) done by the person, or caused or permitted by the person. [Act 42 of 2022 wef 01/11/2024] (2A) Without affecting subsection (2), if any condition of a clearance certificate or approval granted pursuant to subsection (1) or (1A) is contravened, the Board may revoke the clearance certificate or approval given, or suspend the clearance certificate or approval for such period as the Board considers reasonable. [Act 38 of 2024 wef 01/03/2025] (3) The notice mentioned in subsection (2) may be served on all or any of the following persons: ( a ) any person who does or causes or permits to be done any of the acts mentioned in subsection (1) or (1A)( a ), ( b ) or ( c ); [Act 42 of 2022 wef 01/11/2024] ( b ) the owner or occupier of the premises where the fence, partition, structure, object or obstruction mentioned in subsection (2) are located; [Act 42 of 2022 wef 01/11/2024] ( c ) any other person having power to remove the fence, partition, structure, object or obstruction mentioned in subsection (2). [Act 42 of 2022 wef 01/11/2024] (4) Any person who — ( a ) contravenes subsection (1) or (1A); or ( b ) carries out any works after the clearance certificate or approval relating to those works has been revoked or during the period that the clearance certificate or approval is suspended under subsection (2A), shall be guilty of an offence and shall be liable — ( c ) on the first conviction to a fine not exceeding $50,000; and ( d ) on a second or subsequent conviction to a fine not exceeding $100,000. [Act 38 of 2024 wef 01/03/2025] (5) Where the person on whom a notice mentioned in subsection (2) is served fails to comply with the notice, an authorised officer may, at all reasonable hours in the day or night, or at any other time that may be agreed with an owner or occupier of the premises to which the notice relates, enter the premises and take such measures and execute such work as may be necessary to secure compliance with the notice, including — ( a ) by cutting or breaking open any lock, seal, fastener or other device on or connected to the fence, partition, structure, object, vehicle, material, article or thing concerned using reasonable force; ( b ) by towing away the object, vehicle, material, article or thing concerned; or ( c ) by removing or demolishing any fence, partition, structure or object concerned and removing any resulting debris. [Act 42 of 2022 wef 01/11/2024] (6) Any expenses reasonably incurred by the Board under subsection (5) may be recovered from the person who failed to comply with the notice served on the person under subsection (2), and section 48 applies in respect of those expenses. [Act 42 of 2022 wef 01/11/2024] (6A) Where the Board is satisfied that it is immediately necessary to remove the structure, object or obstruction and make good the drain, drainage reserve or reservoir to its original condition, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out any alterations, repairs, works, acts or things that are necessary for that purpose. [Act 38 of 2024 wef 01/03/2025] (6B) The Board may, as it thinks just — ( a ) recover the costs and expenses reasonably and necessarily incurred in carrying out the works under subsection (6A) from any of the persons mentioned in subsection (3); or ( b ) apportion such costs and expenses among all or any of the persons mentioned in subsection (3) and recover the sums apportioned from those persons. [Act 38 of 2024 wef 01/03/2025] (7) Unless subsection (8) applies, any fence, partition, structure, object, vehicle, material, article, thing or resulting debris removed under subsection (5) or (6A) — ( a ) must be dealt with in accordance with section 364(1) of the Criminal Procedure Code 2010 where the fence, partition, structure, object, vehicle, material, article, thing or debris is to be produced in any criminal trial in connection with an offence under this Act; ( b ) is deemed to be forfeited to the Board where any owner of the fence, partition, structure, object, vehicle, material, article, thing or debris consents to its disposal; or ( c ) in any other case, must be — (i) returned to the owner; or (ii) reported to a Magistrate’s Court, in which event sections 370, 371 and 372 of the Criminal Procedure Code 2010 then apply with the necessary modifications. [Act 42 of 2022 wef 01/11/2024] [Act 38 of 2024 wef 01/03/2025] (8) Where it appears to the Board that any fence, partition, structure, object, vehicle, material, article, thing or resulting debris removed by an authorised officer under subsection (5) or (6A) — ( a ) is perishable; ( b ) may rapidly depreciate in value; or ( c ) is of such a nature or in such condition that it would be dangerous, not reasonably practicable or unduly costly for the Board to retain custody of the fence, partition, structure, object, vehicle, material, article, thing or debris, the Board may cause the fence, partition, structure, object, vehicle, material, article, thing or debris (called in this section the removed material) — ( d ) to be sold (by public auction or otherwise) at once and the proceeds of sale to be paid into the funds of the Board; or ( e ) to be destroyed or otherwise disposed of at such time and in such manner as the Board thinks fit. [Act 42 of 2022 wef 01/11/2024] [Act 38 of 2024 wef 01/03/2025] (9) If a person who appears, to the satisfaction of the Board, to be the owner of any removed material and not to be a person in default with complying with the relevant notice in subsection (2), claims — ( a ) after that removed material has been sold, destroyed or disposed of under subsection (8); but ( b ) before the end of one year starting the date the removed material was removed under subsection (5) or (6A), the Board may compensate, out of the funds of the Board, the person for the loss of the removed material, less reasonable costs and expenses incurred by the Board in storing and selling, destroying or disposing of the removed material. [Act 42 of 2022 wef 01/11/2024] [Act 38 of 2024 wef 01/03/2025] (10) Subject to any order to the contrary by the Magistrate’s Court under the Criminal Procedure Code 2010, any removed material deemed forfeited under this section may be disposed of by the Board in any manner that the Board thinks fit. [Act 42 of 2022 wef 01/11/2024] (11) To avoid doubt — ( a ) this section does not prohibit the Board from carrying out any works specified in any notice under subsection (2) at the request of a person who has been served with the notice upon an undertaking by that person to pay the costs and expenses in executing the works; and ( b ) any measures taken or work executed under subsection (5) or (6A) by an authorised officer does not affect any proceedings that may be taken against a person for an offence under subsection (4). [Act 42 of 2022 wef 01/11/2024] [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s24A",
      "chapter": "PART 4 - DRAINAGE",
      "section": "24A",
      "title": "Trees and plants encroaching into drainage reserve",
      "content": "24A. —(1) Where the Board is satisfied that any tree or plant (whether or not dead or dying) on any premises adjoining a drainage reserve or any part of a drainage reserve is likely, by falling or otherwise — ( a ) to cause any obstruction to the flow of any storm water drainage system or the maintenance of any drain in the drainage reserve; or ( b ) to hinder the efficient operation of any storm water drainage system or drain in the drainage reserve, the Board may serve a notice requiring the occupier of the premises to take any measures (including cutting the tree or plant or any part of it) that the Board thinks fit within the time specified in the notice. (2) Any person on whom a notice mentioned in subsection (1) is served who, without reasonable excuse, fails to comply with the notice shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000. (3) Where the person on whom the notice mentioned in subsection (1) is served fails to comply with the notice, an authorised officer may, at all reasonable hours in the day or night, or at any other time that may be agreed with the owner or occupier of the premises to which the notice relates, enter the premises and take such measures and execute such work as may be necessary to secure compliance with the notice. (4) Any expenses reasonably incurred by the Board under subsection (3) may be recovered from the person who failed to comply with the notice served on the person under subsection (1), and section 48 and, if that person is the owner of the premises, section 50 apply in respect of those expenses. (5) To avoid doubt — ( a ) this section does not prohibit the Board from carrying out any works specified in any notice under subsection (1) at the request of a person who has been served with the notice upon an undertaking by that person to pay the costs and expenses in executing the works; and ( b ) any measures taken or work executed under subsection (3) by an authorised officer does not affect any proceedings that may be taken against a person for an offence under subsection (2). [Act 42 of 2022 wef 01/11/2024]"
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 4 - DRAINAGE",
      "section": "25",
      "title": "Premises without proper drainage",
      "content": "25. If it appears to the Board that any premises are without proper drainage, it may by written notice require the owner or occupier of the premises to remedy the defect within the time specified in the notice."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 4 - DRAINAGE",
      "section": "26",
      "title": "Works affecting stormwater drainage system, etc.",
      "content": "26. —(1) A person must not carry out or cause to be carried out — ( a ) any works which affect or are likely to affect any stormwater drainage system, drain, drainage reserve or reservoir, directly or indirectly; or [Act 38 of 2024 wef 01/03/2025] ( b ) any works that could lead to the discharge of silt directly or indirectly into any stormwater drainage system, drain, drainage reserve or reservoir, [Act 38 of 2024 wef 01/03/2025] without obtaining, in respect of those works, a clearance certificate or the approval of the Board under section 33. [10/2012] [Act 38 of 2024 wef 01/03/2025] (1A) A person must not carry out or cause to be carried out — ( a ) any activity (not being works) which affects or is likely to affect any stormwater drainage system, drain or drainage reserve, directly or indirectly; or ( b ) any activity (not being works) that could lead to the discharge of silt directly or indirectly into any stormwater drainage system, drain, drainage reserve or reservoir. [Act 38 of 2024 wef 01/03/2025] (2) Every person given a clearance certificate or approval by the Board to carry out any works under subsection (1) must — ( a ) notify the Board in writing before the commencement of the works; ( b ) provide adequate silt control measures in accordance with any standards or guidelines issued by the Board before the commencement and for the duration of the works; and ( c ) comply with the conditions of the clearance certificate or approval, if any. [10/2012] (3) The Board may prescribe standards and limits in respect of any discharge of silt into any stormwater drainage system, drain, drainage reserve or reservoir. [10/2012] [Act 38 of 2024 wef 01/03/2025] (4) Where any works are or have been carried out in contravention of subsection (1) or (2), or as a result of which silt is discharged which exceeds the standards or limits prescribed under subsection (3), the Board may do all or any of the following: ( a ) by written notice require the person who carried out or caused to be carried out the works, or the owner or occupier of any premises in respect of which the works were carried out, to do one or more of the following: (i) to immediately cease the carrying out of those works, either indefinitely or for such period as the Board may specify; (ii) to carry out any works that the Board may think necessary to restore the stormwater drainage system, drain, drainage reserve or reservoir to its original condition or to protect the stormwater drainage system, drain, drainage reserve or reservoir, within the time specified in the notice; [Act 38 of 2024 wef 01/03/2025] (iii) to take any measures that the Board may think necessary to comply with subsection (2)( b ) or ( c ) or adhere to the standards or limits prescribed under subsection (3); ( b ) revoke the clearance certificate or approval given, or suspend the clearance certificate or approval for such period as the Board considers reasonable. [10/2012] (4A) Where any activity is or has been carried out in contravention of subsection (1A), or as a result of which silt is discharged which exceeds the standards or limits prescribed under subsection (3), the Board may by written notice require the person who carried out or caused to be carried out the activity, or the owner or occupier of any premises where the activity was carried out, to do one or more of the following: ( a ) to immediately cease the carrying out of the activity, either indefinitely or for such period as the Board may specify; ( b ) to carry out any works that the Board thinks necessary to restore the stormwater drainage system, drain, drainage reserve or reservoir to its original condition or to protect the stormwater drainage system, drain, drainage reserve or reservoir, within the time specified in the notice; ( c ) to take any measures that the Board thinks necessary to adhere to the standards or limits prescribed under subsection (3). [Act 38 of 2024 wef 01/03/2025] (5) Any person who — ( a ) contravenes subsection (1), (1A) or (2); ( b ) without reasonable excuse, fails to comply with a notice of the Board under subsection (4)( a ) or (4A); or ( c ) carries out any works after the clearance certificate or approval relating to those works has been revoked or during the period that the clearance certificate or approval is suspended under subsection (4)( b ), shall be guilty of an offence and shall be liable — ( d ) on the first conviction to a fine not exceeding $50,000; and ( e ) on a second or subsequent conviction to a fine not exceeding $100,000. [Act 38 of 2024 wef 01/03/2025] (6) Where the person on whom the notice is served under subsection (4)( a ) or (4A) fails to comply with the notice, an authorised officer may, at all reasonable hours in the day or night, or at such other time as may be agreed with the owner or occupier of the premises to which the notice relates, enter the premises and take such measures and execute such work as may be necessary to secure compliance with the notice but without affecting any proceedings that may be taken against that person under subsection (5). [10/2012] [Act 38 of 2024 wef 01/03/2025] (7) Any expenses reasonably incurred by the Board under subsection (6) may be recovered from the person who failed to comply with the notice served on the person under subsection (4)( a ) or (4A), and section 48 and, if that person is the owner of the premises, section 50 applies in respect of those expenses. [10/2012] [Act 38 of 2024 wef 01/03/2025] (7A) Where the Board is satisfied that it is immediately necessary to take any measure or carry out any works — ( a ) to stop the works or activity carried out in contravention of subsection (1), (1A) or (2); ( b ) to restore the stormwater drainage system, drain, drainage reserve or reservoir to its original condition or to protect the stormwater drainage system, drain, drainage reserve or reservoir; or ( c ) without affecting paragraph ( a ) or ( b ), to prevent any silt resulting from any works or activity mentioned in subsection (1) or (1A) from discharging directly or indirectly into any stormwater drainage system, drain, drainage reserve or reservoir, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out the measures or works. [Act 38 of 2024 wef 01/03/2025] (7B) The Board may, as it thinks just — ( a ) recover the costs and expenses reasonably and necessarily incurred in carrying out the measures or works under subsection (7A) from any of the persons mentioned in subsection (4)( a ) or (4A), as the case may be; or ( b ) apportion such costs and expenses among all or any of the persons mentioned in subsection (4)( a ) or (4A) (as the case may be) and recover the sums apportioned from those persons. [Act 38 of 2024 wef 01/03/2025] (8) Nothing in this section is to be construed as prohibiting the Board from carrying out any works specified in any notice under subsection (4)( a ) or (4A) at the request of a person who has been served with the notice upon an undertaking by that person to pay the costs and expenses in executing the works. [10/2012] [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 4 - DRAINAGE",
      "section": "27",
      "title": "Construction and maintenance of private drains",
      "content": "27. —(1) The Board may authorise any person to construct any drain through, across or under any private property or to alter, repair or otherwise deal with the drain as the Board thinks fit. (2) Any authorisation given under subsection (1) may be subject to any conditions that the Board thinks fit. (3) Before authorising any person to construct any drain under subsection (1), the Board must serve a notice on the owner and occupier of the premises — ( a ) describing the nature of the works to be carried out; and ( b ) stating that if no objection is received within 28 days from the date of service of the notice, the works will commence on the date specified in the notice. (4) A person served with a notice under subsection (3) must submit any objections to the Board within the prescribed time and the Board may allow or disallow the objections or allow the objections in part."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 4 - DRAINAGE",
      "section": "28",
      "title": "Areas not provided with effectual drainage",
      "content": "28. —(1) If it appears to the Board that any area is not provided with effectual drainage, the Board may cause to be executed any drainage works that it considers necessary to provide for the desired drainage of the area. (2) The Board may, as it thinks just, apportion the costs and expenses of such drainage works among the owners of the premises in such area and recover the sums apportioned from the owners."
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 4 - DRAINAGE",
      "section": "29",
      "title": "Vesting of drainage reserves in Government",
      "content": "29. —(1) The Board may by an instrument in the form approved by the Registrar of Titles or the Registrar of Deeds (as the case may be) declare that a drainage reserve that is not within State land and described in the instrument vests in the Government. [Act 42 of 2022 wef 01/11/2024] (2) Any plan prepared by the Board for the purposes of subsection (1) must comply with the requirements of the Land Titles Act 1993 in respect of registered land and of the Registration of Deeds Act 1988 in respect of other land and must show on the plan the drainage reserve which will vest in the Government. (3) Any declaration made by the Board under subsection (1) must be published in the Gazette . (4) Where any drainage reserve that is to be vested in the Government under this section consists of premises included in separate lots already set aside as part of the drainage reserve, the declaration must be registered against those lots under the provisions of the Land Titles Act 1993 in respect of registered land and under the provisions of the Registration of Deeds Act 1988 in respect of other land. (5) Where any drainage reserve that is to be vested in the Government under this section consists of premises included in an existing lot or lots, those premises forming the drainage reserve must be excised from the existing lot or lots and the declaration must be registered in respect of the excised portions under the provisions of the Land Titles Act 1993 in respect of registered land and under the provisions of the Registration of Deeds Act 1988 in respect of other land. (6) Upon the registration of the declaration made under subsection (1), the premises forming the drainage reserve vest in the Government free from all encumbrances. (7) Where the premises are held under a statutory land grant, such vesting under this section is not to be deemed to create a subdivision within the meaning of the State Lands Act 1920. (8) No compensation is payable for any premises that are vested in the Government under this section. (9) When any drainage reserve is vested in the Government under this section, the Board may take possession of the drainage reserve and proceed to demolish and remove any building or portion of any building forming part of the drainage reserve."
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 4 - DRAINAGE",
      "section": "30",
      "title": "Damage caused to stormwater drainage system, etc.",
      "content": "30. —(1) A person must not cause any damage to any stormwater drainage system or drain. (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable — ( a ) on the first conviction to a fine not exceeding $50,000 or to imprisonment for a term not exceeding 3 months or to both; and ( b ) on a second or subsequent conviction to a fine not exceeding $100,000 or to imprisonment for a term not exceeding 3 months or to both. (3) Where a person has caused any damage to any stormwater drainage system or drain in contravention of subsection (1), the Board may, by written notice, require the person to carry out any works to restore the stormwater drainage system or drain to its original condition within the time specified in the notice. (4) Where the Board is satisfied that it is immediately necessary to restore the stormwater drainage system or drain to its original condition, any authorised officer may enter upon any premises pursuant to section 43(2) and carry out or cause to be carried out any alterations, repairs, works, acts or things that are necessary for that purpose. (5) Any expenses reasonably and necessarily incurred in carrying out the works under subsection (4) may be recovered from the person who contravened subsection (1). [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 5 - PROTECTION OF WATER RESOURCES",
      "section": "31",
      "title": "Prohibition on extraction of water",
      "content": "31. —(1) A person must not, without the approval of the Board, construct any works for taking or intercepting water from any place or sea, within the territorial limits of Singapore. (2) An application for approval to construct any works for taking or intercepting water from any such place or sea must be made in such form as the Board may require. (3) In considering an application made under this section, the Board may require the applicant to provide such particulars and plans for the proposed works as the Board thinks fit. (4) In granting any approval under this section, the Board may impose any conditions that it thinks fit. (5) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 3 months. (6) This section does not apply to the lands, buildings and installations of the Board."
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 6 - REGISTRATION, CODES OF PRACTICE AND",
      "section": "32",
      "title": "Codes of practice and specifications",
      "content": "32. —(1) The Board may issue or approve and from time to time review — ( a ) specifications for sewerage works, sewerage systems, earth retaining structures, sanitary facilities, sanitary appliances, drains, drainage works, silt control measures, stormwater drainage systems, flood protection measures, and works which are likely to affect any sewerage system, earth retaining structure, stormwater drainage system or flood protection measure; and [Act 38 of 2024 wef 01/03/2025] ( b ) codes of practice for professionals engaged in the design and construction of any of the matters referred to in paragraph ( a ). [10/2012] (2) If any provision in any code of practice or specifications issued or approved by the Board under subsection (1) is inconsistent with any regulation made under this Act, the provision, to the extent of the inconsistency — ( a ) has effect subject to the regulation; or ( b ) where appropriate having regard to the regulation, does not have effect. (3) [ Deleted by Act 38 of 2024 wef 01/03/2025 ]"
    },
    {
      "provision_ref": "s32A",
      "chapter": "PART 6 - REGISTRATION, CODES OF PRACTICE AND",
      "section": "32A",
      "title": "Incorporation by reference",
      "content": "32A. —(1) The regulations made under section 74 may apply, adopt or incorporate by reference — ( a ) wholly or partially; ( b ) with or without any addition, omission or substitution; or ( c ) specifically or by reference, any code of practice, standard, requirement, specification or other document that relates to any subject matter of any regulations made under section 74 (called in this section the material), as in force or published at a particular time or as in force or published from time to time. (2) The material mentioned in subsection (1) may be material issued by the Board, or material issued by any standards setting organisation, or other organisation or person. (3) Any material applied, adopted or incorporated in the regulations by reference under subsection (1) is to be treated for all purposes as forming part of the regulations. (4) Unless otherwise provided in the regulations, where the material is applied, adopted or incorporated by reference as in force or published from time to time, every amendment to the material that is made by the organisation or person originating the material is to be treated as being a part of those regulations. (5) Where any material is applied, adopted or incorporated by reference in any provision of any regulations, the Board must give notice in the Gazette stating — ( a ) that the material is incorporated in the regulations, and the date on which the relevant provision in the regulations was made; ( b ) that the material is available for inspection, free of charge, and the place at which the material may be inspected; ( c ) that copies of the material can be purchased, and the place where the copies can be purchased; and ( d ) if copies of the material are available in other ways, the details of where or how the material can be accessed or obtained. (6) In addition, the Board must cause a copy of every material applied, adopted or incorporated in the regulations by reference under subsection (1), to be made available for inspection by members of the public without charge at any of its offices during normal office hours. (7) To avoid doubt, any part of the material that is not applied, adopted or incorporated by reference under subsection (1) has no legislative effect. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s32B",
      "chapter": "PART 6 - REGISTRATION, CODES OF PRACTICE AND",
      "section": "32B",
      "title": "Advisory guidelines",
      "content": "32B. —(1) The Board may issue advisory guidelines for the purposes of providing practical guidance or certainty in respect of any one or more requirements imposed by or under this Act. (2) The advisory guidelines may — ( a ) be of general or specific application; or ( b ) specify that different provisions of the advisory guidelines apply to different circumstances, or are applicable to different persons or classes of persons. (3) The Board may amend or revoke the whole or part of any advisory guidelines issued under subsection (1). (4) Advisory guidelines issued or amended under this section do not have any legislative effect. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 6 - REGISTRATION, CODES OF PRACTICE AND",
      "section": "33",
      "title": "Certificates or approval required for works",
      "content": "33. —(1) Every application for a clearance certificate or for the approval of the Board for the purposes of section 11, 14, 23, 24 or 26 must be made in such form and manner as the Board may require. (2) There is payable for the processing of every application mentioned in subsection (1) such fees as may be prescribed. (3) Every applicant for a clearance certificate or the approval of the Board must submit plans of the works to which the application relates in such form and manner as the Board may require to such filing authority as the Board may designate. (4) The Board may require the plans mentioned in subsection (3) — ( a ) to be made by any of the following persons as the Board may decide: (i) a qualified person whose qualifications the Board considers are appropriate to the works to which the application relates; (ii) a licensed plumber; and ( b ) to show such details or specifications as the Board may determine. [11/2018] (5) Upon receipt of an application mentioned in subsection (1), the Board may — ( a ) where it has determined that a clearance certificate is required in respect of the works to which the application relates, issue or refuse to issue a clearance certificate in respect of those works; or ( b ) where it has determined that a clearance certificate is not required in respect of any particular works or class of works, grant or refuse to grant its approval in respect of those works. (6) The Board may, before issuing a clearance certificate or granting its approval under subsection (5), give a direction in writing to the applicant to comply, within the time specified in the direction, with any requirements that it may specify for the purposes of this Act. (7) In issuing a clearance certificate or granting its approval under subsection (5), the Board may impose any conditions that it thinks fit, including — ( a ) a condition that only sanitary appliances, pipes and fittings of a type approved by the Board must be used; ( b ) the transfer of ownership to the Government, or the transfer of control, supervision or maintenance to the Board, of any drain or sewer constructed or installed under the clearance certificate or approval, and any other structure, appurtenance or apparatus that is constructed or installed in connection with the drain or sewer; and ( c ) the provision to the Board, whether by assignment or otherwise — (i) of any warranty against defects that become apparent within the period specified in the condition, in the drain or sewer; and (ii) of any undertaking to make good any such defects at the costs and expenses of the person providing the warranty. [Act 38 of 2024 wef 01/03/2025] (7A) A condition mentioned in subsection (7) may impose an obligation on or otherwise apply to a person other than the applicant, but the Board must serve a written notice of the condition on the person. [Act 38 of 2024 wef 01/03/2025] (7B) Where a person contravenes a condition mentioned in subsection (7), the Board may — ( a ) serve on the person a written notice to take any measures that the Board thinks necessary to comply with the condition or otherwise rectify the contravention; or ( b ) without affecting paragraph ( a ), serve on any of the following persons a written notice directing the person to make good any defects in the drain or sewer that would have been covered by any warranty or undertaking mentioned in subsection (7)( c ): (i) any person who constructed the drain or sewer; (ii) any person who caused the construction of the drain or sewer. [Act 38 of 2024 wef 01/03/2025] (7C) All costs and expenses incurred by a person in complying with a written notice mentioned in subsection (7B) must be borne by the person. [Act 38 of 2024 wef 01/03/2025] (7D) Any person who, without reasonable excuse, fails to comply with a written notice served on the person under subsection (7B) shall be guilty of an offence. [Act 38 of 2024 wef 01/03/2025] (7E) Where a person on whom a written notice mentioned in subsection (7B) has been served fails to comply with the notice, an authorised officer may, at all reasonable hours in the day or night, or at any other time that may be agreed with the owner or occupier of the premises at which the drain or sewer is located, enter the premises and execute any works and take any measures needed to secure compliance with the written notice but without affecting any proceedings that may be taken against that person under subsection (7D). [Act 38 of 2024 wef 01/03/2025] (7F) Any expenses reasonably incurred by the Board under subsection (7E) may be recovered from the person who failed to comply with the notice served on the person under subsection (7B), and section 48 and, if that person is the owner of the premises, section 50 applies in respect of those expenses. [Act 38 of 2024 wef 01/03/2025] (7G) Nothing in this section prohibits the Board from making good any defects in the drain or sewer that would have been covered by any warranty or undertaking mentioned in subsection (7)( c ), at the request of the person on whom the written notice was served, upon the person’s undertaking to pay the Board’s costs and expenses of making good the defects. [Act 38 of 2024 wef 01/03/2025] (7H) Nothing in subsection (7G) imposes on the Board, directly or indirectly, any form of duty or liability enforceable by proceedings before any court to make good the defects mentioned in that subsection. [Act 38 of 2024 wef 01/03/2025] (8) Where any works in respect of which a clearance certificate has been issued under subsection (5), have been carried out, the Board may by written notice — ( a ) require the qualified person that made the plans for the works to apply to the Board for a compliance certificate within the period and in the form and manner specified in the notice; and ( b ) if the qualified person fails to do so, require the person for whom the works were carried out to apply to the Board for the compliance certificate within the period and in the form and manner specified in the notice. [Act 38 of 2024 wef 01/03/2025] (8A) To avoid doubt, the Board may serve more than one written notice under subsection (8) on the same person, so long as the compliance certificate has not been obtained in accordance with any written notice previously served on any person under that subsection. [Act 38 of 2024 wef 01/03/2025] (8B) Any person who fails to comply with a written notice issued to the person under subsection (8) shall be guilty of an offence. [Act 38 of 2024 wef 01/03/2025] (9) If, after considering the report and certificate submitted under section 35(1)( e ) and ( f ), the Board is satisfied that the works have been completed in accordance with the plans submitted under subsection (3) and any conditions or requirements imposed by the Board under subsection (7) or (10), it may issue the compliance certificate subject to any conditions that it thinks fit. (10) The Board may, before issuing a compliance certificate, give a direction in writing to the applicant to comply, within the time specified in the direction, with any requirements that it may specify for the purposes of this Act."
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 6 - REGISTRATION, CODES OF PRACTICE AND",
      "section": "34",
      "title": "Supervision of works by qualified person",
      "content": "34. —(1) A person must not commence or carry out any works for which a clearance certificate is required under this Act except under the supervision of a qualified person whose qualifications are appropriate to the nature of those works. [11/2018] (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $50,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $1,000 for every day or part of a day during which the offence continues after conviction."
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 6 - REGISTRATION, CODES OF PRACTICE AND",
      "section": "35",
      "title": "Duties of qualified person",
      "content": "35. —(1) Every qualified person appointed to supervise any works for the purposes of section 34 must — ( a ) take all reasonable steps and exercise due diligence in supervising and inspecting the works to ensure that those works are carried out in accordance with this Act, with the plans submitted under section 33(3) and with any condition imposed by the Board under that section; ( b ) notify the Board of any contravention of the provisions of this Act pertaining to the works; ( c ) keep and maintain at the premises on which works are carried out such documents, books and records as may be prescribed; ( d ) carry out such inspection of the works as the Board may require; ( e ) submit to the Board at the prescribed times such reports and certificates as may be prescribed; and ( f ) on completion of the inspection mentioned in paragraph ( d ), submit to the Board a certificate containing such particulars as the Board may require. [8/2001] (2) Any qualified person who contravenes any of the requirements of subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both and, in the case of a continuing offence, to a further fine not exceeding $500 for every day or part of a day during which the offence continues after conviction. (3) In any prosecution against a person for an offence under subsection (1)( b ), it is a defence for the person to prove to the satisfaction of the court that the person could not reasonably have discovered the contravention referred to in the charge. (4) Any qualified person who — ( a ) being required by this Act to make or produce to the Board any plan, declaration, certificate, report, record, notice or other document; or ( b ) for the purpose of obtaining any certificate or approval from the Board under this Act or of establishing any fact relevant to the administration of this Act, makes or produces any plan, declaration, certificate, report, record, notice or other document which — ( c ) is false in a material particular; ( d ) has not been made by the person by whom it purports to have been made; or ( e ) has been in any way altered or tampered with, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both. [8/2001] (5) If any qualified person appointed for the purposes of section 34 becomes unwilling or unable, whether by reason of the termination of his or her appointment or for any other reason, to carry out his or her duties under the Building Control Act 1989 or this Act, he or she must, within 14 days of ceasing to carry out his or her duties, notify the Board of the fact."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 6 - REGISTRATION, CODES OF PRACTICE AND",
      "section": "36",
      "title": "Directions to qualified persons",
      "content": "36. —(1) Where the Board is of the opinion that a qualified person has contravened, or is likely to have contravened, any requirement imposed by or under this Act, the Board may give a direction, verbally or in writing, to any person specified in subsection (2), and the person must comply with the direction. [11/2018] (2) The persons specified for the purposes of subsection (1) are — ( a ) the qualified person; ( b ) if the Board is of the opinion that the qualified person is incapable of carrying out any requirement specified in the Board’s direction, another qualified person; ( c ) where the contravention or likely contravention relates to any stormwater drainage system, drain, flood protection measure, sewerage system or sanitary facilities at any premises — the owner or occupier of the premises; [Act 38 of 2024 wef 01/03/2025] ( ca ) where the contravention or likely contravention relates to any stormwater drainage system, drain, sewerage system or sanitary facilities or any part thereof at any premises that — (i) is connected to any other premises; and (ii) serves the drainage or sewerage needs of the other premises, the owner or occupier of the other premises; [Act 38 of 2024 wef 01/03/2025] ( cb ) where the contravention or likely contravention relates to any drainage reserve — the owner or occupier of the premises of which the drainage reserve forms a part; or [Act 38 of 2024 wef 01/03/2025] ( d ) any person authorised to construct, alter or demolish the stormwater drainage system, drain, sewerage system or sanitary facilities, or authorised to carry out works in the drainage reserve or at the reservoir. [11/2018] [Act 38 of 2024 wef 01/03/2025] (3) A direction given under subsection (1) — ( a ) may require the person specified in subsection (2) to do, or to refrain from doing, such things as are specified in the direction or are of a description as specified in the direction; ( b ) is to take effect at such time, being the earliest practicable time, as is determined by or under that direction; and ( c ) may be revoked at any time by the Board. [11/2018] (4) The Board is not liable for any cost or expense incurred by any person specified in subsection (2) in complying with any direction given by the Board under this section. [11/2018] (5) Where a qualified person receives a direction from the Board under this section, the qualified person must notify the owner or occupier specified in subsection (2)( c ) of the direction. [11/2018] (6) Any person to whom a direction is given under this section who fails to comply with the direction shall be guilty of an offence. [11/2018] 37. [ Repealed by Act 9 of 2002 ]"
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "38",
      "title": "Power to demand names and addresses",
      "content": "38. —(1) Any police officer, authorised officer or such other person as may be authorised by the Board for the purposes of this section (called in this section an authorised person) who reasonably believes that any person has committed an offence under this Act may require that person to provide evidence of his or her identity, and the person must then provide any evidence of his or her identity that the police officer, authorised officer or authorised person (as the case may be) may require. [10/2012] (2) Any police officer, authorised officer or authorised person may require any owner or occupier of any premises to provide the owner’s or occupier’s name and address and any other proof of identity or particulars that the police officer, authorised officer or authorised person may require for the purposes of this Act. [10/2012] (3) Any person who, upon being required by any police officer, authorised officer or authorised person to give the person’s name and address or provide any particulars under subsection (1) or (2), refuses to do so or wilfully mis‑states the person’s name and address or gives false particulars shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000. [10/2012]"
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "39",
      "title": "Powers of Board to examine and secure attendance",
      "content": "39. —(1) Any authorised officer may — ( a ) examine orally any person who appears to be acquainted with the facts and circumstances of matters under this Act — (i) whether before or after that person or anyone else is charged with an offence in connection with the matter; and (ii) whether or not that person is to be called as a witness in any inquiry, trial, or other proceeding in connection with the matter; ( b ) require any person to provide any information or produce any document or footage recorded by any video surveillance system in the possession of that person in connection with the matter, and may, without payment, inspect, keep, copy or make extracts from the document or footage; and [Act 38 of 2024 wef 01/03/2025] ( c ) require by written order the attendance before the authorised officer of any person, being within the limits of Singapore, who, from information given or otherwise, appears to be acquainted with the facts and circumstances of matters under this Act and that person must attend as so required. [10/2012] (2) Any person examined under this section is bound to state truly what he or she knows of the facts and circumstances concerning matters under this Act, except that he or she need not say anything that might expose him or her to a criminal charge, penalty or forfeiture. [10/2012] (3) A statement made by any person examined under this section must — ( a ) be reduced to writing; ( b ) be read over to the person; ( c ) if the person does not understand English, be interpreted in a language that the person understands; and ( d ) after correction (if necessary) be signed by the person. [10/2012] (4) If any person fails to attend as required by an order under subsection (1)( c ), the Board may report the failure to a Magistrate who may then issue a warrant to secure the attendance of that person as required by the order."
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "40",
      "title": "Powers of arrest",
      "content": "40. —(1) The Board, an authorised officer or a police officer may arrest any person, whom the Board or officer has reason to believe has committed an offence under this Act, if the name and address of the person are unknown to the Board or officer and — ( a ) the person declines to give his or her name and address; or ( b ) there is reason to doubt the accuracy of the name and address, if given. (2) A person arrested under this section may be detained until his or her name and address are correctly ascertained. (3) A person so arrested must not be detained longer than is necessary for bringing the person before a court."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "41",
      "title": "Default in compliance with notice",
      "content": "41. —(1) Where a person on whom a notice under section 4(6) or (7), 6, 10, 11, 12, 14, 15, 20, 22A, 22B, 23, 24, 25 or 30 is served fails to comply with the notice within the time specified in the notice — ( a ) the person shall, unless the person satisfies the court that the person has used all due diligence to comply with the notice, be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000; and ( b ) any authorised officer may enter the premises under section 44 and execute the works specified in the notice. [10/2012] [Act 38 of 2024 wef 01/03/2025] (1A) To avoid doubt, an authorised officer may exercise his or her power under subsection (1)( b ) whether or not any proceedings have been started, or any conviction has been obtained, pursuant to subsection (1)( a ). [Act 27 of 2023 wef 01/01/2024] (2) Any expenses reasonably incurred by the Board under subsection (1)( b ) may be recovered from the person in default and section 48 and, if that person is the owner of the premises, section 50 applies in respect of those expenses. (3) Nothing in this section is to be construed as prohibiting the Board from carrying out any works specified in any such notice at the request of a person who has been served with the notice upon an undertaking by that person to pay the costs and expenses in executing the works."
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "42",
      "title": "Appeal against notice",
      "content": "42. —(1) Where a person is aggrieved by a notice mentioned in section 26(4)( a ), 33(7B) or 41(1) served on the person — ( a ) the person may, within 14 days from the date of service of the notice and in the prescribed form and manner, appeal to the Minister; and ( b ) until after the determination or abandonment of the appeal — (i) no liability to a fine under section 26(5)( b ), 33(7D) or 41(1)( a ) (as the case may be) shall arise except as provided for in this section; or [Act 38 of 2024 wef 01/03/2025] (ii) no proceedings may be taken or work done under the notice. [10/2012] [Act 38 of 2024 wef 01/03/2025] (2) Where an appeal is brought under this section, the Minister may dismiss or allow the appeal unconditionally or subject to any conditions that he or she considers fit, and any decision made by the Minister on the appeal is final. (3) Where an appeal has been brought under this section, and the Minister is of the opinion that — ( a ) the non‑execution of the notice will be injurious or dangerous to the public health; and ( b ) the immediate execution of the notice will not cause any injury to the person against whom the notice was made which cannot be compensated by damages, the Minister may authorise the Board immediately to execute the work. (4) The Board must, if it carries out the work and the appeal is successful, pay the costs and expenses of the work and any damages sustained by the appellant by reason of the work. (5) The Board may, if it carries out the work and the appeal is dismissed or abandoned, recover the costs and expenses of the work from the appellant, and section 48 and, if the appellant is the owner of the premises in respect of which the notice was made, section 50 apply to any sum recoverable from the appellant under this section. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "43",
      "title": "Board may act in cases of emergency",
      "content": "43. —(1) Where the Board considers it necessary in the case of an emergency, the Board may direct the immediate execution of any work or the doing of any act being any work or act authorised under this Act which is in its opinion necessary for the service and safety of the public. [Act 38 of 2024 wef 01/03/2025] (2) Despite anything in section 44, where the Board has reason to believe that any public sewerage system or stormwater drainage system, or any part thereof, is damaged or obstructed, the Board may immediately and without notice enter any premises and carry out, or direct the immediate execution of, any work or the doing of any act to repair the public sewerage system or stormwater drainage system, or the part thereof, or remove the obstruction, which is in the opinion of the Board necessary for the service or safety of the public. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "44",
      "title": "Power of entry",
      "content": "44. —(1) Any authorised officer may, for the purposes of this Act, enter any premises at all reasonable hours in the day or night, or at such other time as may be agreed with the owner or occupier of the premises, with such assistants and workmen as are necessary for the purpose of making any survey, inspection or soil investigation and executing any work authorised by this Act. [10/2012] (2) Unless otherwise provided in this Act, any authorised officer must, before entering any premises under subsection (1), give at least 14 days’ written notice of intention to enter to every owner or occupier of the premises. [12/2015] (3) A notice mentioned in subsection (2) must — ( a ) state the estimated period (if any) during which the Board intends to temporarily occupy or take possession of the premises; ( b ) give a brief description of the works (if any) which are to be carried out in or on the premises; ( c ) describe the area or extent of the land and the subterranean space needed for the carrying out of the works mentioned in paragraph ( b ); and ( d ) state that the owner or occupier of the premises may serve on the Board a claim of compensation for the items of loss, damage or cost set out in the first column of the Schedule to the extent of the loss, damage or cost suffered or incurred by the owner or occupier of the premises. [12/2015] (4) Unless the consent of the occupier has been obtained, a person must not enter any dwelling house in actual occupation under this section without giving 6 hours’ previous notice to the occupier. (5) For the purposes of this section, the Minister may declare that any class of premises is liable to inspection at any time of the day or night, and thereupon any authorised officer may, with such assistants and workmen as are necessary, at any time of the day or night and without notice, enter using such force as may be necessary and search or inspect any premises of the class specified in the declaration. [10/2012] (6) The Board shall not be liable to pay any person any fee, charge or expense on account of such entry to any premises or of anything done in any part of the premises under this Act. [10/2012]"
    },
    {
      "provision_ref": "s44A",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "44A",
      "title": "Power to enter and investigate",
      "content": "44A. Despite section 44, if an authorised officer has reasonable grounds to suspect that an offence under this Act has been committed, he or she may, at any time without notice, enter any premises and do all or any of the following for the purpose of investigating the suspected offence under this Act: ( a ) search the premises and take possession of anything found on the premises and reasonably believed to be or to contain dangerous or hazardous substances or to be otherwise connected to the commission of the offence; ( b ) require the production of records, certificates, notices, documents and footage recorded by any video surveillance system, relating or reasonably believed to relate to any dealing in or with dangerous or hazardous substances or the discharge of trade effluent containing dangerous or hazardous substances or to the offence, wherever and by whomever kept, and take and retain extracts or copies thereof; [Act 38 of 2024 wef 01/03/2025] ( c ) take and retain samples of any materials (whether solid, liquid, gaseous or vapour) found for the purpose of analysis; ( d ) take any photographs or video recordings that the authorised officer thinks necessary for the purposes of the investigation; [Act 38 of 2024 wef 01/03/2025] ( e ) require any person whom the authorised officer finds in the premises to produce his or her identity card or other identification papers for inspection for the purpose of the investigation. [10/2012]"
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "45",
      "title": "Power to enter on land adjacent to works",
      "content": "45. —(1) Any authorised officer may, with such assistants and workmen as are necessary, enter upon any land, adjoining or being within 100 metres of any works authorised to be executed by this Act — ( a ) for the purpose of depositing upon that land any soil, gravel, sand, lime, brick, stone or other materials; or ( b ) for any other purposes connected with the formation of those works, without making any previous payment, tender or deposit and doing as little damage as may be in the exercise of the powers under this subsection. (2) However, an authorised officer must not enter any land for the purposes specified in subsection (1) unless the Board has given at least 7 days’ written notice of intention to enter to every owner and occupier of the land. [12/2015] (3) A notice mentioned in subsection (2) must — ( a ) state the estimated period (if any) during which the Board intends to temporarily occupy or take possession of the land; ( b ) give a brief description of the works (if any) which are to be carried out in or on the land; ( c ) describe the area or extent of the land and the subterranean space needed for the carrying out of the works mentioned in paragraph ( b ); and ( d ) state that the owner or occupier of the land may serve on the Board a claim of compensation for the items of loss, damage or cost set out in the first column of the Schedule to the extent of the loss, damage or cost suffered or incurred by the owner or occupier of the land. [12/2015]"
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "46",
      "title": "Penalty for obstructing Board in its duty",
      "content": "46. Any person who — ( a ) hinders or obstructs the Board, any authorised officer or other person authorised by the Board in the performance or execution of its or his or her duty or of anything which it or he or she is empowered or required to do under this Act; or ( b ) interferes with any work authorised to be done under this Act, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $20,000 or to imprisonment for a term not exceeding 3 months or to both. [10/2012]"
    },
    {
      "provision_ref": "s46A",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "46A",
      "title": "Making of false statements, etc.",
      "content": "46A. —(1) Any person who, when giving any information to the Board or making any application under or for the purposes of any provision of this Act, makes any statement which the person knows to be false in a material particular, or who recklessly makes any statement which is false in a material particular, shall be guilty of an offence. [10/2012] (2) Any person who — ( a ) wilfully or fraudulently procures or attempts to procure for the person or for any other person any licence or approval under this Act by making or producing or causing to be made or produced any false or fraudulent representation or declaration either verbally or in writing; or ( b ) knowingly aids or assists anything under paragraph ( a ), shall be guilty of an offence. [10/2012]"
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 7 - ENFORCEMENT",
      "section": "47",
      "title": "Appeal to Minister against notices, orders, directions, etc.",
      "content": "47. —(1) Any person who is aggrieved by any notice, order, direction, authorisation or declaration by the Board under this Act or, unless otherwise expressly provided, any regulations made under this Act may appeal in writing to the Minister within 14 days from the date of service of the notice, order, direction or authorisation or within 28 days from the date of service of the declaration. (2) Upon any appeal under subsection (1), the execution of the notice or the doing of the thing required to be done must be stayed. (3) The Minister may confirm, vary or rescind the notice, order, direction, authorisation or declaration or direct that the thing must be proceeded with, varied or abandoned (as the case may be), or make any order which the Board is competent to make under this Act and the decision of the Minister is final. (4) This section does not apply to — ( a ) a notice or declaration under section 9, 22 or 52(1)( b ); [Act 38 of 2024 wef 01/03/2025] ( b ) an authorisation under section 27; ( c ) an order under section 17 or 39(1)( c ); or [Act 38 of 2024 wef 01/03/2025] ( d ) a notice under section 4, 6, 10, 11, 12, 14, 15, 20, 21, 23, 24, 25, 26, 30, 33(7B), 44, 45 or 50(3). [10/2012; 12/2015] [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s47AA",
      "chapter": "PART 7A - COMPENSATION FOR TEMPORARY OCCUPATION OF",
      "section": "47AA",
      "title": "Application of this Part",
      "content": "47AA. This Part does not apply if the temporary possession of premises taken under section 44 is necessitated on account of the failure of an owner or occupier to comply with a notice mentioned in section 26, 33 or 41. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s47A",
      "chapter": "PART 7A - COMPENSATION FOR TEMPORARY OCCUPATION OF",
      "section": "47A",
      "title": "Compensation for temporary occupation of premises",
      "content": "47A. —(1) Subject to sections 47B and 47C, every owner and occupier of premises of which temporary possession is taken under section 4, 21, 44 or 45 is entitled to claim compensation for the items of loss, damage or cost set out in the first column of the Schedule to the extent of the loss, damage or cost suffered or incurred by the owner or occupier, as the case may be. [12/2015] (2) A claim for compensation for an item of loss, damage or cost set out in the first column of the Schedule is to be assessed by the Board — ( a ) on the basis of the matters specified opposite in the second column of the Schedule; and ( b ) by not taking into consideration any of the matters specified in subsection (3). [12/2015] (3) No account is to be taken of the following in the assessment of any claim for compensation by any owner or occupier of premises of which temporary possession is taken under section 4, 21, 44 or 45: ( a ) the financial loss resulting from the interruption of or interference with any trade or business carried on any premises; ( b ) any increase or decrease in the value of the premises to which the compensation relates which is attributable to the purpose for which the premises are occupied and used; ( c ) any building, object or structure within those premises which was erected and maintained in contravention of any written law in force on the date of the notice under section 44(2) or 45(2) (as the case may be) relating to those premises; ( d ) any building or part of a building within those premises which has been constructed or modified or on which building works have been carried out so as to amount to a contravention of the Building Control Act 1989 within the meaning of that Act. [12/2015] (4) On receiving a claim for compensation from any owner or occupier of premises of which temporary possession is taken under section 4, 21, 44 or 45, the Board must inquire into that claim and must, as soon as is possible, pay to the owner or occupier (as the case may be) compensation for such loss, damage or cost arising from the exercise of the powers under that section as is determined in accordance with this section. [12/2015] (5) To avoid doubt, nothing in this section prevents the Board from restoring premises of which temporary possession is taken under section 4, 21, 44 or 45 to the reasonable satisfaction of the owner or occupier of the premises before returning those premises to the owner or occupier, in lieu of compensation for any item of loss, damage or cost set out in the first column of the Schedule. [12/2015]"
    },
    {
      "provision_ref": "s47B",
      "chapter": "PART 7A - COMPENSATION FOR TEMPORARY OCCUPATION OF",
      "section": "47B",
      "title": "Time for, and manner of, claiming for compensation",
      "content": "47B. —(1) Every claim for compensation under this Part must be in writing. [12/2015] (2) Subject to subsection (4), if a claim for compensation for an item of loss, damage or cost set out in the first column of the Schedule is not served on the Board before the expiry of the relevant period specified in subsection (3) for that item, the right to claim compensation for that item is barred and any late claim may be disregarded. [12/2015] (3) The period within which a claim for compensation for an item of loss, damage or cost set out in the first column of the Schedule must be served on the Board is as follows: ( a ) for a claim for loss due to displacement of any person in lawful occupation of the premises on the date of the notice under section 44(2) or 45(2) — 2 years starting from the date of that notice; ( b ) for a claim for structural damage to any building resulting from the occupation and use of the premises under section 4, 21, 44 or 45 — 6 years starting from the date those premises are returned; ( c ) for a claim for other damage to any premises — 6 years starting from the date those premises are returned; ( d ) for a claim for removal of any object or structure which was erected and maintained without the contravention of any written law — one year from the date of removal, or the date of reinstatement or replacement, whichever is applicable. [12/2015] (4) The Board may extend the period referred to in subsection (3) within which a claim must be served upon it if an application for the extension is made to the Board, either before or after the expiry of that period, and the Board considers — ( a ) that the delay in serving the claim was occasioned by mistake of fact or mistake of any matter of law (other than this Act) or by any other reasonable cause; or ( b ) that the Board is not materially prejudiced by the delay. [12/2015] (5) An extension may be granted by the Board under subsection (4) with or without conditions, and for such period as the Board thinks fit, but in no case exceeding 6 years from the time when the right to compensation first arose. [12/2015]"
    },
    {
      "provision_ref": "s47C",
      "chapter": "PART 7A - COMPENSATION FOR TEMPORARY OCCUPATION OF",
      "section": "47C",
      "title": "Disqualification as to certain compensation",
      "content": "47C. If an owner of premises of which temporary possession is or has been taken in accordance with section 4, 21, 44 or 45 gives to the Board any notice under section 47E(1) in relation to those premises within the claim period referred to in section 47F(2)( d ), the owner is entitled to claim only for loss due to displacement of any person in lawful occupation of the premises on the date of the notice under section 44(2) or 45(2) (as the case may be) and no other item in the Schedule. [12/2015]"
    },
    {
      "provision_ref": "s47D",
      "chapter": "PART 7A - COMPENSATION FOR TEMPORARY OCCUPATION OF",
      "section": "47D",
      "title": "Bar to other proceedings",
      "content": "47D. Except as provided in this Part, no action, claim or other proceeding shall lie against the Board, or any authorised officer — ( a ) to restrain the doing of anything which is authorised by or under section 4, 21, 44 or 45, or to compel the doing of anything which may be omitted to be done under section 4, 21, 44 or 45; or ( b ) to recover damages, compensation or costs for — (i) damage or disturbance to or loss of or in the value of any land, chattel, trade or business; (ii) personal disturbance or inconvenience; (iii) extinguishment, modification or restriction of rights; or (iv) effecting or complying with any requirement or condition imposed by the Board or authorised officer, which is authorised by or under section 4, 21, 44 or 45 or arises from any act or omission so authorised. [12/2015]"
    },
    {
      "provision_ref": "s47E",
      "chapter": "PART 7A - COMPENSATION FOR TEMPORARY OCCUPATION OF",
      "section": "47E",
      "title": "Owners who suffer substantial impairment in rights in land may require their premises to be acquired",
      "content": "47E. —(1) The owner of any premises of which temporary possession is or has been taken in accordance with section 4, 21, 44 or 45 may, by written notice given to the Board, request the Government to acquire under the Land Acquisition Act 1966 — ( a ) the premises; and ( b ) any other premises (if any) of the owner related to the premises in paragraph ( a ), if the owner considers that the owner suffers substantial impairment of the owner’s rights in the premises in paragraphs ( a ) and ( b ) because of the taking of that temporary possession. [12/2015] (2) If there is more than one owner of the premises concerned, the notice under this section must be given by all the owners. [12/2015] (3) Any notice under this section is irrevocable once given to the Board. [12/2015] (4) For the purposes of this section and section 47F, premises (called A premises) are related to other premises temporary possession of which is or has been taken in accordance with section 4, 21, 44 or 45 (in this section and section 47F called temporarily occupied premises) if the A premises are the remainder of a parcel of land part of which are the temporarily occupied premises. [12/2015] (5) In this section and section 47F — “owner”, in relation to any premises, means — ( a ) a person who has the fee simple estate in the premises; ( b ) a person who is the grantee or lessee under a State title for the premises; ( c ) a person who has become entitled to exercise a power of sale of the premises; or ( d ) a person in occupation of the premises under a tenancy the term of which exceeds 7 years; “parcel of land” means the whole area of land that — ( a ) is the subject of a separate certificate of title registered under the Land Titles Act 1993; or ( b ) is a lot in a lawful division of land and capable of being separately held by any owner, and where a single building is erected on 2 or more such adjoining lands or lots referred to in paragraph ( a ) or ( b ), includes the area comprised in those lands or lots, as the case may be. [12/2015]"
    },
    {
      "provision_ref": "s47F",
      "chapter": "PART 7A - COMPENSATION FOR TEMPORARY OCCUPATION OF",
      "section": "47F",
      "title": "Owner‑initiated acquisition",
      "content": "47F. —(1) Upon the Board receiving a notice under section 47E in relation to any temporarily occupied premises, and any other premises related to the temporarily occupied premises, the President is to proceed under the Land Acquisition Act 1966 to acquire those premises as if those premises were the subject of a notice under section 49 of that Act. [12/2015] (2) The provisions of sections 49 and 49A of the Land Acquisition Act 1966 apply (so far as relevant) to any premises that are the subject of a notice under section 47E with the following exceptions, modifications and adaptations: ( a ) any reference in those sections to any land that is the subject of a notice under section 49(1) of the Land Acquisition Act 1966 is to be read as a reference to the premises that are the subject of a notice under section 47E; ( b ) any reference in those sections to land temporary possession of which is or has been taken under section 42 of the Land Acquisition Act 1966 is to be read as a reference to any premises temporary possession of which is or has been taken in accordance with section 4, 21, 44 or 45; ( c ) any reference in those sections to an owner of land is to be read as a reference to an owner of premises referred to in section 47E; ( d ) any reference in section 49A of the Land Acquisition Act 1966 to a claim period for any land temporary possession of which is or has been taken in accordance with a direction under section 42 of the Land Acquisition Act 1966 is to be read as a reference to one year starting from either of the following dates: (i) the date of the notice under section 44(2) or 45(2) (as the case may be) relating to those premises; (ii) the date of the expiry of the term of temporary possession in a notice under section 44(2) or 45(2) (as the case may be) for the temporary occupation and use of those premises, or the date the premises are returned to the owner if earlier; ( e ) such other exceptions, modifications and adaptations as the differences between them necessarily require. [12/2015]"
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "48",
      "title": "Compensation, damages, fees, costs and expenses to be determined by Magistrate’s Court or District Court",
      "content": "48. —(1) Except as otherwise provided, in all cases where compensation, damages, fees, costs or expenses are provided under this Act to be paid, the amount and (if necessary) the apportionment of the amount and any question of liability are, in case of dispute, or failure to pay, to be summarily ascertained and determined by a Magistrate’s Court or, if the amount claimed exceeds the Magistrate’s Court limit, by a District Court. (2) In any proceeding under subsection (1), the Magistrate’s Court or District Court may — ( a ) inquire whether those expenses ought to be borne wholly or in part by some person other than the defendant in the proceedings; ( b ) make any order concerning the expenses or their apportionment that appears to the Court to be just; and ( c ) where those expenses were incurred under section 26(6), 33(7E) or 41(1)( b ) by the Board in carrying out any works specified in a notice, inquire whether any requirement specified in the notice was reasonable. [10/2012] [Act 38 of 2024 wef 01/03/2025] (3) The Magistrate’s Court or District Court is not to order the expenses or any part of the expenses to be borne by any person other than the defendant in the proceedings unless the Court is satisfied that the other person has had due notice of the proceedings and an opportunity of being heard. (4) If the amount of compensation, damages, fees, costs or expenses is not paid by the party liable to pay it within 7 days after demand, that amount may be reported to a Magistrate’s Court or District Court and recovered in the same way as if it were a fine imposed by a Magistrate’s Court or District Court. (5) An appeal lies to the General Division of the High Court from any decision of a Magistrate’s Court or District Court under this section, and the provisions of the Criminal Procedure Code 2010 apply, with the necessary modifications, to all such appeals. [40/2019]"
    },
    {
      "provision_ref": "s49",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "49",
      "title": "Occupier may execute work where owner defaults in execution of work",
      "content": "49. —(1) Whenever default is made by an owner of any premises in the execution of any work required under this Act to be executed by the owner, an occupier of the premises may, with the approval of the Board, cause the work to be executed. (2) The expense of the work executed under subsection (1) must be paid to the occupier by the owner of the premises or the amount may be deducted out of the rent from time to time becoming due from the occupier to the owner, and the occupier may, in the absence of any special agreement to the contrary, retain possession until that expense has been fully reimbursed to the occupier."
    },
    {
      "provision_ref": "s50",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "50",
      "title": "Recovery of costs and expenses payable by owners",
      "content": "50. —(1) All sums payable by or recoverable from the owner of any premises in respect of costs and expenses incurred by the Board in connection with the execution of any work which are under this Act recoverable from an owner of any premises are, subject and without prejudice to any other rights of the Board, a first charge on the premises in respect of which the costs and expenses were incurred. (2) In addition to any other remedies conferred by this Act, any such sum may be recovered in the manner provided in this section, and the person or persons liable to pay it are the owner or owners at the time when the work was completed. (3) If any such sum remains unpaid at the end of the prescribed time, a notice must be served upon the person or any one of the persons (if more than one) liable to pay it, calling on the person to pay that sum together with a prescribed fee for the cost of the notice, within 15 days from the date of service of the notice. (4) Without affecting section 62, if no person liable to pay the sum can be found, the notice is deemed to have been duly served by the posting of it at the office of the Board and by fixing a copy of it on some conspicuous part of the premises in respect of which the costs and expenses were incurred. (5) At the end of the period of 15 days or any further period that the Board may allow, if any such sum or part of the sum remains due and unpaid, it is deemed to be in arrears and may be recovered as provided in section 52. (6) The charge mentioned in subsection (1) attaches, and the powers and remedies conferred by subsections (2) to (5) become exercisable, as from the date of completion of the work. (7) Despite any change in the ownership or occupation of the premises after the completion of the work, the charge and the powers and remedies mentioned in subsection (6) may be exercised against the premises or against any movable property or crops for the time being found on the premises. (8) An occupier who, when requested by or on behalf of the Board to state the name of the owner of the premises, refuses or wilfully omits to disclose or wilfully mis‑states the name shall, unless the occupier shows cause to the satisfaction of the court for the refusal or mis‑statement, be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000."
    },
    {
      "provision_ref": "s51",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "51",
      "title": "Recovery of costs and expenses by instalments",
      "content": "51. —(1) When the Board has incurred costs and expenses in or about the execution of any work, which are, under this Act, payable by or recoverable from an owner, the Board may — ( a ) recover those costs and expenses in the manner provided in section 50; or ( b ) if it thinks fit, make an arrangement with the owner for the payment of such instalments as will be sufficient to defray the whole amount of the costs and expenses with interest thereon at the prescribed rate, within a period not exceeding 10 years. (2) If on the date appointed for payment by any such arrangement, there is default in payment of any instalment or interest, the whole of the balance then outstanding of that amount, together with any interest in arrears, immediately becomes due and payable and, despite any change in the ownership or occupation of the premises since the date of the arrangement, may be recovered in the manner provided in section 50."
    },
    {
      "provision_ref": "s52",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "52",
      "title": "Proceedings for recovery of arrears",
      "content": "52. —(1) For the recovery of arrears, the Board has and may exercise, either successively or concurrently, in addition to any other remedies conferred by this Act, the following powers: ( a ) the Board may issue a warrant of attachment and may seize by virtue of the warrant any movable property and crops of any person liable to pay the arrears and may also seize any movable property or crops belonging to anyone which are found on the premises in respect of which the arrears are due and may, after service of the prescribed notice, sell the same by public auction in any prescribed manner; ( b ) the Board may, by notice of sale to be served or published in the prescribed manner, declare its intention to sell, at the end of 3 months from the date of the notice of sale, the premises in respect of which the arrears are due and, if, at the end of that period, the arrears have not been paid or satisfied, the Board may sell by public auction, in lots or otherwise, the whole or such portion of the premises or such interest in the premises as it considers sufficient for the recovery of the arrears and costs. (2) The Board must not proceed under subsection (1)( b ) to sell the premises in respect of which the arrears are due, or any portion thereof or interest therein, where there is or are on the premises and liable to be seized and sold under subsection (1)( a ) any movable property or crops belonging to the owner of a value estimated by the Board to be sufficient to realise the sum required to satisfy the arrears and costs. (3) Any tenant, subtenant or occupier who, in order to avoid the seizure or sale of his, her or its property for arrears payable by the owner of the premises, pays the arrears and costs may thereafter, in the absence of any written agreement to the contrary — ( a ) deduct the amount so paid from the rent due or to become due by the tenant, subtenant or occupier to his, her or its immediate landlord on account of the premises or such part of the premises as is held or occupied by the tenant, subtenant or occupier; and ( b ) may retain possession until that amount has been fully reimbursed to the tenant, subtenant or occupier whether by deduction from the rent or otherwise. (4) Any tenant or subtenant who has reimbursed, whether by allowing a deduction from rent or otherwise, any subtenant or occupier holding or occupying under the tenant or firstmentioned subtenant the amount so paid by that subtenant or occupier, has a similar right to deduct the amount from the rent due or to become due to the tenant’s or firstmentioned subtenant’s immediate landlord and to retain possession until similarly reimbursed. (5) The receipt of any authorised officer for any amount so paid by any such tenant, subtenant or occupier is deemed an acquittance in full for the same amount of rent. (6) If any premises in respect of which arrears are due, or any movable property or crops mentioned in subsection (1) or the proceeds of sale thereof, are already in the custody of the law under any enforcement order by which the Board is unable to exercise the remedies conferred by this section, the Board — ( a ) may notify the Sheriff or the bailiff of the court concerned of the amount of the arrears; and ( b ) is entitled, without obtaining a judgment, to be paid that amount out of the proceeds of sale of the premises or property in priority to the judgment debtor and to the judgment creditor and to any other creditor except the Government. [Act 25 of 2021 wef 01/04/2022] (7) A certificate from the Board is, unless it is disputed by the judgment debtor, conclusive evidence of the amount of the arrears, and, in case of dispute, the amount is to be summarily determined by a Magistrate’s Court. (8) Where any premises (not being registered land) are sold under subsection (1)( b ), the Board has the power to execute the conveyance and the purchaser of the premises need not be concerned to inquire whether the provisions of this Act relating to the sale and the conveyance have been complied with nor otherwise to inquire into the regularity or validity of the sale and conveyance. (9) Section 144 of the Land Titles Act 1993 applies, with the necessary modifications, to any premises sold under subsection (1)( b ) which is registered land."
    },
    {
      "provision_ref": "s53",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "53",
      "title": "Attachment",
      "content": "53. —(1) The attachment referred to in section 52(1)( a ) may be made by a person appointed for the purpose by the Board who must give public notice of the attachment in the prescribed manner and must take an inventory of the property attached. (2) A person appointed under subsection (1) is deemed to be a public servant within the meaning of the Penal Code 1871. (3) Such a person may break open in the daytime any house or building for the purpose of effecting the attachment."
    },
    {
      "provision_ref": "s54",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "54",
      "title": "Application of proceeds of sale",
      "content": "54. —(1) The proceeds of a sale under section 52(1) and (2) must be applied in the first place in satisfaction of the arrears together with interest thereon at the prescribed rates and costs. (2) Where there is any surplus remaining, the Board must — ( a ) if satisfied as to the right of any person claiming the surplus, pay the amount of the surplus to that person; or ( b ) if not so satisfied, hold the amount in trust for the person who may ultimately succeed in due course of law in establishing that person’s title to the surplus. (3) If no title is established to the surplus within a period of 5 years from the date of the sale, it must be paid into the funds of the Board."
    },
    {
      "provision_ref": "s55",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "55",
      "title": "Title acquired by purchaser at sale by Board",
      "content": "55. —(1) The purchaser at a sale held under section 52(1)( b ) is deemed to have acquired the right offered for sale free from all encumbrances created over it and from all subordinate interests derived from it except that which is expressly reserved by the Board at the time of sale. (2) The Board must notify, by an advertisement published in the Gazette , the result of the sale and the conveyance to the purchaser of the property or right offered for sale."
    },
    {
      "provision_ref": "s56",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "56",
      "title": "Costs of proceedings for recovery of arrears",
      "content": "56. All costs of any proceedings for the recovery of arrears may be recovered as if they formed part of the arrears."
    },
    {
      "provision_ref": "s57",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "57",
      "title": "Power to stop sale",
      "content": "57. If any person having any interest in any property liable to be sold at any time previous to such sale tenders to the Board the arrears with interest and costs, the Board must then cease all further proceedings in respect of the sale."
    },
    {
      "provision_ref": "s58",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "58",
      "title": "Application to court",
      "content": "58. —(1) If any person whose movable property, crop or land has been attached or offered for sale disputes the attachment or sale, the person may apply to the General Division of the High Court or a District Court for an order to stay the proceedings. [40/2019] (2) The General Division of the High Court or District Court, after hearing the Board and making such further inquiry as is necessary, is to make such order as is just. [40/2019] (3) No application is to be entertained by the General Division of the High Court or District Court under this section unless the applicant has deposited in court the amount of the arrears and costs or furnished security for them to the satisfaction of the General Division of the High Court or District Court. [40/2019]"
    },
    {
      "provision_ref": "s59",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "59",
      "title": "Liability of transferor who has not given notice",
      "content": "59. —(1) Every person who sells or transfers any property in respect of which costs and expenses have been incurred by the Board in connection with the execution of any work which are, under this Act, recoverable from the owner or owners of the property, continues to be liable for — ( a ) the payment of all the costs and expenses payable in respect of the property which become payable; and ( b ) the performance of all other obligations imposed by this Act upon the owner of the property which are to be performed, at any time before the notice of transfer required by section 19 of the Property Tax Act 1960 has been given. (2) Nothing in subsection (1) affects the liability of the purchaser or transferee to pay such costs and expenses in respect of the property or affects the right of the Board to recover such costs and expenses or to enforce any obligation under this Act."
    },
    {
      "provision_ref": "s60",
      "chapter": "PART 8 - COMPENSATION, DAMAGES,",
      "section": "60",
      "title": "Proceedings where occupier opposes execution of work",
      "content": "60. —(1) If the occupier of any premises prevents the owner of the premises from carrying into effect in respect of the premises any of the provisions of this Act after notice of the owner’s intention to do so has been given by the owner to that occupier, a Magistrate’s Court, upon proof thereof and upon application by the owner, may — ( a ) make a written order, requiring the occupier to permit the owner to execute all such works with respect to the premises as are necessary for carrying into effect the provisions of this Act; and ( b ) if it thinks fit, order the occupier to pay to the owner the costs relating to the application or order. (2) If after the end of 8 days from the date of the order the occupier continues to refuse to permit the owner to execute the works, the occupier shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $500 for every day during which the occupier so continues to refuse. (3) Every such owner is, during the continuance of such refusal, discharged from any penalty to which the owner might otherwise have become liable by reason of the owner’s default in executing the works."
    },
    {
      "provision_ref": "s60A",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "60A",
      "title": "Certain sewers and drains not fixtures and not subject to distress",
      "content": "60A. —(1) This section applies to — ( a ) any public sewerage system which is situated at premises that are not in the possession of the Government or the Board; and ( b ) any stormwater drainage system or drain that — (i) is vested in the Government and which is situated in or upon premises not being in the possession of the Government; or (ii) is constructed, owned or managed by the Board and which is situated at premises that are not in the possession of the Board. (2) The public sewerage system, stormwater drainage system or drain — ( a ) is deemed not to be a fixture, and does not vest in the owner of the premises; and ( b ) is not to be subject to distress or be liable to be taken under or pursuant to an enforcement order of any court or any proceedings in bankruptcy against the person in whose possession it is. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s61",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "61",
      "title": "Notices, orders and other documents may be given by authorised officer",
      "content": "61. All notices, orders, receipts, warrants and other documents of any nature which the Board is empowered to give by this Act may, subject to the direction of the Board, be given by any authorised officer on behalf of the Board."
    },
    {
      "provision_ref": "s62",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "62",
      "title": "Service of documents",
      "content": "62. —(1) Where a document that is permitted or required by this Act to be served on a person (whether the expression “serve” or “give” or any other expression is used), the document may be served as described in this section. (2) A document permitted or required by this Act to be served on an individual may be served — ( a ) by giving it to the individual personally; ( b ) by sending it by post to the address specified by the individual for the service of documents or, if no address is so specified, the individual’s residential address or business address; ( c ) by leaving it at the individual’s residential address with an adult apparently resident there, or at the individual’s business address with an adult apparently employed there; ( d ) by affixing a copy of the document in a conspicuous place at the individual’s residential address or business address; ( e ) by sending it by fax to the fax number last known to the person giving or serving the document as the fax number for the service of documents on the individual; or ( f ) by sending it by email to the individual’s last email address. (3) A document permitted or required by this Act to be served on a partnership (other than a limited liability partnership) may be served — ( a ) by giving it to any partner, secretary or other similar officer of the partnership; ( b ) by leaving it at, or by sending it by post to, the partnership’s business address; ( c ) by sending it by fax to the fax number used at the partnership’s business address; or ( d ) by sending it by email to the partnership’s last email address. (4) A document permitted or required by this Act to be served on a body corporate (including a limited liability partnership) or an unincorporated association may be served — ( a ) by giving it to the secretary or other similar officer of the body corporate or unincorporated association, or the limited liability partnership’s manager; ( b ) by leaving it at, or by sending it by post to, the registered office or principal office in Singapore of the body corporate or unincorporated association; ( c ) by sending it by fax to the fax number used at the registered office or principal office in Singapore of the body corporate or unincorporated association; or ( d ) by sending it by email to the last email address of the body corporate or unincorporated association. (5) In addition, a document permitted or required by this Act to be served on an individual, a partnership, a body corporate or an unincorporated association may be served — ( a ) by giving an electronic notice to the individual, partnership, body corporate or unincorporated association (called in this section an addressee) by the addressee’s chosen means of notification, stating that the document is available and how the addressee may use the addressee’s chosen means of access to access the document’s contents; or ( b ) by any other method authorised by any regulations for the service of documents of that kind if the addressee consents in the manner provided in the regulations to service of a document of that kind in that way. (6) Service of a document takes effect — ( a ) if the document is sent by fax and a notification of successful transmission is received, on the day of transmission; ( b ) if the document is sent by email, at the time that the email becomes capable of being retrieved by the person to whom it is sent; or ( c ) if the document is sent by post, 2 days after the day the document was posted (even if it is returned undelivered). (7) However, service of any document under this Act on a person by email or by an electronic notice at the person’s chosen means of notification may be effected only with the person’s prior written consent to service in that way. (8) This section does not apply to documents to be served in proceedings in court. (9) In this section — “business address” means — ( a ) in the case of an individual, the individual’s usual or last known place of business in Singapore; or ( b ) in the case of a partnership (other than a limited liability partnership), the partnership’s principal or last known place of business in Singapore; “chosen means of access”, for an addressee on whom is or is to be served a document permitted or required by this Act, means an electronic means the addressee agrees with the person giving or serving the document as the means by which the addressee may access that document’s contents; “chosen means of notification”, for an addressee on whom is or is to be served a document permitted or required by this Act, means an electronic means that the addressee nominates to the person giving or serving the document as the means by which the addressee may be notified that such a document has been served on the addressee; “document” includes a notice or an order permitted or required by this Act to be served; “last email address” means the last email address given by the addressee concerned to the person giving or serving the document as the email address for the service of documents under this Act; “residential address” means an individual’s usual or last known place of residence in Singapore. [Act 27 of 2023 wef 01/01/2024]"
    },
    {
      "provision_ref": "s62A",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "62A",
      "title": "Use of electronic service for making applications",
      "content": "62A. —(1) The Board may permit an application to it mentioned in section 33 to be made through the electronic service described in section 42AA of the Building Control Act 1989. (2) Where a person uses the electronic service mentioned in subsection (1) to make an application to the Board, the Board may serve on the person any acknowledgment, approval, certificate, direction, notice, permit or other document in connection with the application, by sending it to the person’s account with the electronic service. (3) Service of a document on a person under subsection (2) takes effect at the time when an electronic record of the document reaches the person’s account with the electronic service. (4) This section applies despite anything to the contrary in this Act. (5) In this section, “electronic record” has the meaning given by section 2(1) of the Electronic Transactions Act 2010. [Act 27 of 2023 wef 01/01/2024]"
    },
    {
      "provision_ref": "s63",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "63",
      "title": "General penalties",
      "content": "63. Unless a penalty has otherwise been expressly provided, any person who — ( a ) contravenes any of the provisions of this Act; or ( b ) fails to comply with any condition subject to which any clearance certificate is issued or approval is granted by the Board under section 33, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $15,000 or to imprisonment for a term not exceeding 3 months or to both, and in the case of a continuing offence, to a further fine not exceeding $500 for every day or part of a day during which the offence continues after conviction."
    },
    {
      "provision_ref": "s64",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "64",
      "title": "Furnishing of deposits",
      "content": "64. —(1) Where any clearance certificate is issued or approval is granted by the Board under section 33 for the execution of any works, the Board may require a deposit to be furnished by the person applying for the certificate or approval to secure the execution of the works. (2) Where any such works are not executed to the satisfaction of the Board, it may utilise the whole or any part of the deposit to make good the defects."
    },
    {
      "provision_ref": "s65",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "65",
      "title": "Inaccuracies in document",
      "content": "65. —(1) No misnomer or inaccurate description of any person, premises, building, holding, street or place named or described in any document prepared, issued or served under, by virtue of or for the purposes of this Act in any way affects the operation of this Act as respects that person or place if that person or place is so designated in the document as to be identifiable. (2) No proceedings taken under or by virtue of this Act are invalid for want of form. [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s66",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "66",
      "title": "Evidence of analyst",
      "content": "66. —(1) The Board may appoint persons who in its opinion are qualified to be analysts for the purposes of this Act. (2) Subject to subsection (3), a certificate of an analyst appointed under subsection (1) stating that the analyst has analysed or examined a substance and stating the result of his or her analysis or examination is admissible in evidence in any proceedings for an offence under this Act as prima facie evidence of the facts stated in the certificate and of the correctness of the result of the analysis or examination. (3) A certificate of an analyst mentioned in subsection (2) must not be received in evidence pursuant to that subsection unless the person charged has been given a copy of the certificate together with reasonable notice of the intention of the prosecution to produce the certificate as evidence in the proceedings. (4) Where a certificate of an analyst appointed under subsection (1) is admitted in evidence under subsection (2), the person charged may require the analyst to be called as a witness for the prosecution and the analyst may be cross‑examined as if the analyst had given evidence of the matters stated in the certificate. (5) For the purposes of this section, a document purporting to be a certificate mentioned in subsection (2) on its production by the prosecution is, unless the contrary is proved, deemed to be such a certificate."
    },
    {
      "provision_ref": "s67",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "67",
      "title": "Offence by body corporate",
      "content": "67. Where a body corporate is guilty of an offence under this Act, and that offence is proved to have been committed with the consent or connivance of, or to be attributable to any act or default on the part of, any director, manager, secretary or other similar officer of that body corporate, or any person who was purporting to act in any such capacity, he or she as well as the body corporate shall be guilty of that offence and shall be liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "s67A",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "67A",
      "title": "Liability for offence committed by agent or employee",
      "content": "67A. Where an offence under this Act is committed by any person — ( a ) acting as an agent or employee of another person; or ( b ) being otherwise subject to the supervision or instruction of another person for the purposes of any employment in the course of which the offence was committed, that other person shall, without prejudice to the liability of the firstmentioned person, be liable for that offence in the same manner and to the same extent as if that other person had personally committed the offence unless that other person proves to the satisfaction of the court that the offence was committed without that other person’s consent or connivance and that it was not attributable to any neglect on that other person’s part. [10/2012]"
    },
    {
      "provision_ref": "s68",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "68",
      "title": "Jurisdiction of court",
      "content": "68. A District Court or a Magistrate’s Court has jurisdiction to hear and determine all proceedings under this Act and, despite anything to the contrary in the Criminal Procedure Code 2010, has power to impose the full punishment in respect of any offence under this Act."
    },
    {
      "provision_ref": "s69",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "69",
      "title": "Saving of prosecutions under other written laws",
      "content": "69. Nothing in this Act prevents any person from being prosecuted under any other written law for any act or omission which constitutes an offence under this Act or from being liable under that other law to any other or higher punishment or penalty than that provided by this Act, except that no person shall be punished twice for the same offence."
    },
    {
      "provision_ref": "s70",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "70",
      "title": "Composition of offences",
      "content": "70. —(1) The Board may compound any offence under this Act that may be prescribed as an offence which may be compounded by collecting from the person reasonably suspected of having committed the offence a sum of money not exceeding $5,000. (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of that offence except that any compensation, damages, fees, costs or expenses which are provided to be paid under this Act remain payable. (2A) All sums collected under this section must be paid into the Consolidated Fund. [Act 38 of 2024 wef 01/04/2025] (3) Nothing in this section prevents the Board from issuing any further notice referred to in section 41 in respect of the same matter to the person who has paid the sum of money."
    },
    {
      "provision_ref": "s71",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "71",
      "title": "Protection from liability",
      "content": "71. —(1) No liability shall lie against the Government, the Board or any authorised officer by reason of the fact that any works are carried out in accordance with the provisions of this Act or that such works or plans of the works are subject to inspection, approval or certification by the Board or any authorised officer. (2) Nothing in this Act makes it obligatory for the Board or any authorised officer to inspect any building or works or the site of any proposed works to ascertain whether the provisions of this Act are complied with or whether any plans, certificates, reports, notices or other documents submitted to the Board are accurate. (3) No matter or thing done by any authorised officer shall, if it is done in good faith for the purpose of carrying out the provisions of this Act, subject him or her personally to any action, liability, claim or demand. (4) Where the Board or any authorised officer provides any information to any person in respect of any building or works by electronic or other means, neither the Board nor any authorised officer shall be liable for any loss or damage suffered by any person by reason of any error or omission of any nature or in any way caused, including any defect or breakdown in the equipment used for providing the information, if such error or omission is made in good faith and in the ordinary course of duties of the Board or authorised officer. 72. [ Repealed by Act 10 of 2012 ]"
    },
    {
      "provision_ref": "s73",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "73",
      "title": "Exemption",
      "content": "73. The Board may, with the approval of the Minister, by notification in the Gazette , exempt, either generally or for such time as it may specify, any person, thing, premises or works or any class of person, thing, premises or works from any provision of this Act."
    },
    {
      "provision_ref": "s73A",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "73A",
      "title": "Administrative exemption",
      "content": "73A. —(1) The Board may, upon the application of a particular person, exempt the particular person from the operation of any of the provisions of — ( a ) this Act (including any material incorporated by reference under section 32A); or ( b ) any specifications or codes of practice mentioned in section 32, if the Board is satisfied that all of the following apply: ( c ) the particular person has undertaken safeguards to mitigate flooding, health and safety risks; ( d ) the exemption does not detrimentally affect the public sewerage system, stormwater drainage system or drain in question, as the case may be; ( e ) the particular person has undertaken safeguards to mitigate risks to the Board’s operations and maintenance of the public sewerage system, stormwater drainage system or drain in question, as the case may be. (2) The Board may grant an exemption under subsection (1) generally or for a period specified in the exemption, and subject to any conditions that the Board thinks necessary. (3) The Board may at any time add any condition to, or modify or remove any condition of, an exemption under subsection (1). (4) An exemption under subsection (1) — ( a ) must be in writing and given to the particular person concerned; and ( b ) need not be published in the Gazette . (5) The Board may at any time revoke any exemption under subsection (1). [Act 38 of 2024 wef 01/03/2025]"
    },
    {
      "provision_ref": "s74",
      "chapter": "PART 9 - MISCELLANEOUS PROVISIONS",
      "section": "74",
      "title": "Regulations",
      "content": "74. —(1) The Board may, with the approval of the Minister, make regulations for or in respect of every purpose which the Board considers necessary or convenient for carrying out the provisions of this Act and, in particular, may — ( a ) prescribe the standards and specifications for, and the requirements for the use of, private sewers and sewerage systems (including drain‑lines and their connections to the public sewerage system), the public sewerage system, water reclamation facilities, sanitary appliances, sanitary facilities, stormwater drainage systems and flood protection measures; [Act 38 of 2024 wef 01/03/2025] ( aa ) require owners or occupiers of premises to implement and maintain any flood protection measures at the premises that may be prescribed; [Act 38 of 2024 wef 01/03/2025] ( b ) prescribe matters relating to the requirement for a clearance certificate or the approval of the Board under section 33 in respect of the works mentioned in section 11(1)( a ) and ( b ), including — (i) the persons who are required to submit applications for the clearance certificate or approval (as the case may be), the qualifications required of those persons and the duties of those persons in submitting the applications; (ii) the types of works that require the clearance certificate or approval (as the case may be); and (iii) the persons who are required to carry out works that require the clearance certificate or approval (as the case may be) and the duties of those persons in carrying out such works; ( c ) regulate the discharge of trade effluent into sewers; ( ca ) require — (i) any conveyance transporting used water, sewage, waste matter or effluent to be fitted with any tracking device or locking device approved by the Board; and (ii) the information or data collected by the device to be kept, and provided to the Board, for or in such time (including as and when the Board requires) and in such manner as may be prescribed; [Act 38 of 2024 wef 01/03/2025] ( cb ) require — (i) any mechanical equipment or tool used in the course of any works mentioned in section 14 to be fitted with any tracking device that is approved by the Board; and (ii) the information or data collected by the device to be kept, and provided to the Board, for or in such time (including as and when the Board requires) and in such manner as may be prescribed; [Act 38 of 2024 wef 01/03/2025] ( d ) prohibit the discharge of silt or debris into stormwater drainage systems and reservoirs; [Act 38 of 2024 wef 01/03/2025] ( e ) prescribe additional requirements for the protection of the public sewerage system and any proposed public sewerage system that has been or is being constructed; [Act 38 of 2024 wef 01/03/2025] ( ea ) provide for the issue of an order by the Board to stop any works or other activity (including discharging or causing the discharge of any used water, sewage, waste matter or effluent) that has caused damage, or is likely to cause damage, to any or any part of the public sewerage system or a proposed public sewerage system that has been or is being constructed, or which may disrupt any process of treating the used water, sewage, waste matter or effluent or any process of water reclamation; [Act 38 of 2024 wef 01/03/2025] ( f ) prescribe fees and charges for the purposes of this Act, including for — (i) the disposal (including any treatment necessary or incidental to the disposal) of any used water, sewage, waste matter or effluent discharged from any premises that fails to meet the standards imposed by the Board under or pursuant to this Act on such used water, sewage, waste matter or effluent; and (ii) the late payment of prescribed fees and charges; ( g ) prescribe such service relating to sewage provided by the Board for which the Board may charge prices by way of agreement with the person to whom the service is provided in lieu of prescribing such prices; and ( h ) prescribe anything required or permitted to be prescribed under this Act. [10/2012; 11/2018] (2) The Board may, in making any regulations, provide that any contravention of the regulations shall be an offence — ( a ) punishable with a fine not exceeding $15,000 or with imprisonment for a term not exceeding 3 months or with both and, in the case of a continuing offence, with a further fine not exceeding $500 for every day or part of a day during which the offence continues after conviction; or ( b ) punishable — (i) on the first conviction, with a fine not exceeding $15,000 or with imprisonment for a term not exceeding 3 months or with both and, in the case of a continuing offence, with a further fine not exceeding $500 for every day or part of a day during which the offence continues after conviction; and (ii) on a second or subsequent conviction, with a fine not exceeding $30,000 or with imprisonment for a term not exceeding 3 months or with both and, in the case of a continuing offence, with a further fine not exceeding $1,000 for every day or part of a day during which the offence continues after conviction. [Act 38 of 2024 wef 01/03/2025] (3) Any regulations made under this Act must be presented to Parliament as soon as possible after publication in the Gazette ."
    }
  ],
  "definitions": [
    {
      "term": "authorised officer",
      "definition": "“authorised officer” means any person appointed as an authorised officer under section 3(2);",
      "source_provision": "s2"
    },
    {
      "term": "Board",
      "definition": "“Board” means the Public Utilities Board continued under section 3 of the Public Utilities Act 2001;",
      "source_provision": "s2"
    },
    {
      "term": "building",
      "definition": "“building” has the meaning given by the Building Control Act 1989;",
      "source_provision": "s2"
    },
    {
      "term": "competent authority",
      "definition": "“competent authority” means an authority appointed under section 5 of the Planning Act 1998;",
      "source_provision": "s2"
    },
    {
      "term": "drain",
      "definition": "“drain” includes any canal, culvert, conduit, river or watercourse;",
      "source_provision": "s2"
    },
    {
      "term": "drain‑line",
      "definition": "“drain‑line” means any pipe or sewer which is connected to the sewerage system of any premises;",
      "source_provision": "s2"
    },
    {
      "term": "drainage reserve",
      "definition": "“drainage reserve” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "drainage works",
      "definition": "“drainage works” includes any engineering works for the construction, alteration and maintenance of any stormwater drainage system;",
      "source_provision": "s2"
    },
    {
      "term": "earth retaining structure",
      "definition": "“earth retaining structure” means any structure, structural system or other means used to maintain the shape of excavation to enable the access to, repair of or replacement of a sewerage system or part thereof; [Act 38 of 2024 wef 01/03/2025]",
      "source_provision": "s2"
    },
    {
      "term": "fittings",
      "definition": "“fittings” means any apparatus or parts used for any sanitary facility or drain‑line of any premises;",
      "source_provision": "s2"
    },
    {
      "term": "flood protection measure",
      "definition": "“flood protection measure” means any measure or system, or any specification required for any premises, for the purpose of — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "industrial water",
      "definition": "“industrial water” means any water reclaimed from the sewage treatment works for use in industries that do not require high grade potable water;",
      "source_provision": "s2"
    },
    {
      "term": "licensed plumber",
      "definition": "“licensed plumber” means an individual who holds a plumber’s licence as defined in section 2 of the Public Utilities Act 2001;",
      "source_provision": "s2"
    },
    {
      "term": "Magistrate’s Court limit",
      "definition": "“Magistrate’s Court limit” has the meaning given by the State Courts Act 1970;",
      "source_provision": "s2"
    },
    {
      "term": "occupier",
      "definition": "“occupier” , in relation to any premises, includes any person having the charge, management or control of the premises or any part thereof;",
      "source_provision": "s2"
    },
    {
      "term": "owner",
      "definition": "“owner” , in relation to any premises, means — ( a )",
      "source_provision": "s47E"
    },
    {
      "term": "premises",
      "definition": "“premises” includes messuages, houses, buildings, lands, tenements, easements and hereditaments of any tenure, whether open or enclosed, whether built or not, whether public or private, and whether maintained under statutory authority or not;",
      "source_provision": "s2"
    },
    {
      "term": "public sewerage system",
      "definition": "“public sewerage system” includes — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "public sewers",
      "definition": "“public sewers” includes — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "qualified person",
      "definition": "“qualified person” means a person who is registered as — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "reclaimed water",
      "definition": "“reclaimed water” means treated water which has been recovered from a public sewerage system;",
      "source_provision": "s2"
    },
    {
      "term": "Registrar of Deeds",
      "definition": "“Registrar of Deeds” means the Registrar of Deeds appointed under the Registration of Deeds Act 1988;",
      "source_provision": "s2"
    },
    {
      "term": "Registrar of Titles",
      "definition": "“Registrar of Titles” means the Registrar of Titles appointed under the Land Titles Act 1993;",
      "source_provision": "s2"
    },
    {
      "term": "reservoir",
      "definition": "“reservoir” means a body of water maintained as a reservoir by the Board in any Catchment Area Park or Central Water Catchment Area (as defined in regulations made under section 72 of the Public Utilities Act 2001); [Act 38 of 2024 wef 01/03/2025]",
      "source_provision": "s2"
    },
    {
      "term": "sanitary appliances",
      "definition": "“sanitary appliances” includes washbasins, bathtubs, sinks, urinals, toilet bowls, bidets and other similar fixtures;",
      "source_provision": "s2"
    },
    {
      "term": "sanitary facilities",
      "definition": "“sanitary facilities” includes bathrooms, toilets, facilities for washing and sanitary appliances, together with the associated pipework, whether above or below the ground, which connect, directly or otherwise, to a private sewage treatment plant or a public sewerage system;",
      "source_provision": "s2"
    },
    {
      "term": "sanitary works",
      "definition": "“sanitary works” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "sewage",
      "definition": "“sewage” includes waterborne domestic waste and trade effluent;",
      "source_provision": "s2"
    },
    {
      "term": "sewerage system",
      "definition": "“sewerage system” means a system of sewers, pipes, drain-lines, pumping systems, sumps, tanks, flow control systems, sensors, odour control and ventilating systems, chambers, manholes, sewage treatment systems or water reclamation facilities, or other appurtenances, for use in connection with one or both of the following purposes: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "sewerage works",
      "definition": "“sewerage works” includes engineering works for the construction, alteration and maintenance of any sewerage system or any part thereof; [Act 38 of 2024 wef 01/03/2025]",
      "source_provision": "s2"
    },
    {
      "term": "stormwater",
      "definition": "“stormwater” means rainwater and surface water but does not include sewage;",
      "source_provision": "s2"
    },
    {
      "term": "stormwater drainage system",
      "definition": "“stormwater drainage system” means a system of drains for the conveyance or storage of stormwater and includes — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "temporary building",
      "definition": "“temporary building” has the meaning given by the Building Control Act 1989;",
      "source_provision": "s2"
    },
    {
      "term": "Town Council",
      "definition": "“Town Council” means any Town Council established under section 4 of the Town Councils Act 1988;",
      "source_provision": "s2"
    },
    {
      "term": "trade effluent",
      "definition": "“trade effluent” means any liquid, including particles of matter and other substances in suspension in the liquid, which is the outflow from any trade, business or manufacture or of any works of engineering or building construction;",
      "source_provision": "s2"
    },
    {
      "term": "works",
      "definition": "“works” has the same meaning as “building works” in the Building Control Act 1989 and includes sewerage works, drainage works and sanitary works. [Act 38 of 2024 wef 01/03/2025] [*Updated to be consistent with the 2020 Revised Edition]",
      "source_provision": "s2"
    },
    {
      "term": "conveyance",
      "definition": "“conveyance” includes any vessel, train, aircraft, vehicle or trailer, and any fixed or floating platform in a marine environment;",
      "source_provision": "s18"
    },
    {
      "term": "mobile toilet",
      "definition": "“mobile toilet” means a sanitary convenience which is not part of a sewerage system, including a sanitary convenience which is mobile or in a conveyance.",
      "source_provision": "s18"
    },
    {
      "term": "parcel of land",
      "definition": "“parcel of land” means the whole area of land that — ( a )",
      "source_provision": "s47E"
    },
    {
      "term": "business address",
      "definition": "“business address” means — ( a )",
      "source_provision": "s62"
    },
    {
      "term": "chosen means of access",
      "definition": "“chosen means of access” , for an addressee on whom is or is to be served a document permitted or required by this Act, means an electronic means the addressee agrees with the person giving or serving the document as the means by which the addressee may access that document’s contents;",
      "source_provision": "s62"
    },
    {
      "term": "chosen means of notification",
      "definition": "“chosen means of notification” , for an addressee on whom is or is to be served a document permitted or required by this Act, means an electronic means that the addressee nominates to the person giving or serving the document as the means by which the addressee may be notified that such a document has been served on the addressee;",
      "source_provision": "s62"
    },
    {
      "term": "document",
      "definition": "“document” includes a notice or an order permitted or required by this Act to be served;",
      "source_provision": "s62"
    },
    {
      "term": "last email address",
      "definition": "“last email address” means the last email address given by the addressee concerned to the person giving or serving the document as the email address for the service of documents under this Act;",
      "source_provision": "s62"
    },
    {
      "term": "residential address",
      "definition": "“residential address” means an individual’s usual or last known place of residence in Singapore. [Act 27 of 2023 wef 01/01/2024]",
      "source_provision": "s62"
    }
  ]
}