{
  "id": "sda-1929",
  "type": "statute",
  "title": "Stamp Duties Act 1929",
  "title_en": "Stamp Duties Act 1929",
  "short_name": "SDA1929",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SDA1929",
  "description": "An Act relating to stamp duties.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Stamp Duties Act 1929."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “bare trust beneficiary”, in relation to a trust over property, means a person — ( a ) who is identified in the declaration of trust as a beneficiary of that property; and ( b ) who, upon the declaration of the trust, has beneficial ownership of that property; [Act 22 of 2022 wef 10/05/2022] “Commissioner” means the Commissioner of Stamp Duties appointed under this Act; “company” means any company incorporated or registered under any law in force in Singapore or elsewhere; “conveyance on sale” includes every instrument and every decree or order of any court, by which any property, or any estate or interest in any property, upon the sale thereof is transferred to or vested in a purchaser or any other person on the purchaser’s behalf or by the purchaser’s direction; “duly stamped”, as applied to an instrument chargeable with duty, means — ( a ) that the instrument bears an adhesive or impressed stamp of not less than the proper amount, and that stamp has been affixed in accordance with the provisions of this Act for the time being in force at the time of stamping; or ( b ) that the instrument, if stamped using the E‑Stamping system, has attached to it a stamp certificate issued for the instrument by the Commissioner in accordance with the provisions of this Act for the time being in force at the time of stamping; “duty” means any stamp duty for the time being chargeable under this Act or any other Act; “E‑Stamping system” means the computer service mentioned in section 6B(1); “equitable mortgage” means an agreement or a memorandum under hand only, relating to the deposit of any title deeds or instruments constituting or being evidence of the title to any property whatever (other than stock or marketable securities), or creating a charge on such property; “executed” and “execution”, used with reference to instruments not under seal, mean “signed” and “signature”; “instrument” includes every written document; “lease” means a lease of immovable property, and includes the following: ( a ) any undertaking in writing to cultivate, occupy or pay or deliver rent for immovable property; ( b ) any instrument by which tolls, rents or profits of any description are let to farm; ( c ) any writing on an application for a lease intended to signify that the application is granted; “limited liability partnership” has the meaning given by the Limited Liability Partnerships Act 2005; “marketable security” means a security of such a description as to be capable of being sold or negotiated in any stock market; “Master Plan” has the meaning given by section 2 of the Planning Act 1998; “money” includes all sums whether expressed in the currency of Singapore or in any other currency; “mortgage” means a security by way of mortgage for the payment of any definite and certain sum of money advanced or lent at the time, or previously due or forborne to be paid, being payable, or for the repayment of money to be thereafter lent, advanced or paid, or which may become due upon an account current, together with any sum already advanced or due, or without (as the case may be), and includes — ( a ) any conveyance of any property in trust to be sold or otherwise converted into money intended only as a security, and redeemable before the sale or other disposal of the property, either by express stipulation or otherwise; ( b ) any instrument in writing for defeating or making redeemable, or explaining or qualifying any conveyance of property, apparently absolute, but intended only as a security; ( c ) any agreement for a mortgage or any agreement (other than an agreement chargeable with duty as an equitable mortgage), contract or bond accompanied with a deposit of title deeds or with other instruments evidencing a right to property, for making a mortgage or any other security or conveyance as aforesaid of any property comprised in the title deeds or other instruments or for pledging or charging the same as a security; and ( d ) any deed operating as a mortgage of any stock or marketable security; “paper” includes every material upon which words or figures can be expressed; “proper officer” means the Commissioner and such other officer as may be authorised by the Commissioner to impress stamps or to issue stamp certificates; “residential property” means — ( a ) any house, building or other premises or any part thereof which is permitted to be used under the Planning Act 1998 or any other written law as a dwelling house or which is lawfully so used; or ( b ) any land zoned in the Master Plan for solely residential purposes or for mixed purposes, one of which is residential, and includes any estate or interest therein; “settlement” means any non‑testamentary disposition in writing whether made voluntarily or upon a good or valuable consideration other than a bona fide pecuniary consideration by which any definite and certain property is settled, or agreed to be settled, in any manner for any purpose; “stamp certificate” means a certificate that is issued electronically in respect of any instrument chargeable with duty denoting the amount of duty payable in respect of that instrument or that the duty otherwise chargeable in respect of that instrument is remitted; “stock” includes any share in the capital stock or funded debt of a company, corporation, society or VCC in Singapore or elsewhere and stocks or funds of the Government or of any other government or country; “VCC Act” means the Variable Capital Companies Act 2018. [33/99; 36/2008; 37/2018; 28/2019; 40/2019] (2) The following terms have the meanings given by the VCC Act: ( a ) share, in relation to a VCC; ( b ) sub‑fund; ( c ) non‑umbrella VCC; ( d ) umbrella VCC; ( e ) VCC. [28/2019]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Commissioner and Deputy Commissioners of Stamp Duties",
      "content": "3. —(1) The Minister may appoint an officer to carry out the provisions of this Act, to be called the Commissioner of Stamp Duties, and such number of Deputy Commissioners of Stamp Duties as the Minister thinks fit. [Act 5 of 2025 wef 09/03/2025] (1A) An appointment under subsection (1) must be published in the Gazette . [Act 5 of 2025 wef 09/03/2025] (2) Every Deputy Commissioner of Stamp Duties has and may exercise all the powers of the Commissioner under the provisions of this Act except subsection (3) and sections 40(3) and 68(1). (3) The Commissioner may, subject to such conditions or restrictions as the Commissioner thinks fit, delegate to any person having official duty or employed in the administration of this Act, all or any of the powers, functions and duties vested in the Commissioner by this Act."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "4",
      "title": "Instruments chargeable with duty",
      "content": "4. —(1) Subject to the provisions of this Act and any other written law, every instrument mentioned in the First Schedule, being an instrument — ( a ) which, not having been previously executed by any person, is executed in Singapore; or ( b ) which is executed outside Singapore, and relates to any property situated, or to any matter or thing done or to be done, in Singapore, and is received in Singapore, is chargeable with duty of the amount specified in that Schedule as the proper duty for that instrument. (2) All instruments chargeable with duty must be duly stamped. Payment of duty"
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "5",
      "title": "All facts and circumstances to be set out",
      "content": "5. —(1) All the facts and circumstances affecting the liability of any instrument to duty or the amount of the duty with which any instrument is chargeable are to be fully and truly set out in the instrument. (2) Where the liability of an instrument to duty or any amount of duty, is determined by facts or circumstances that are not set out in the instrument, those facts or circumstances must be provided to the Commissioner in such form and manner as the Commissioner may specify. [13/2017] (3) The Commissioner may require to be furnished with such evidence as the Commissioner may consider necessary to prove that all such facts and circumstances are truly set out in the instrument or provided under subsection (2). [13/2017]"
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "6",
      "title": "Instrument relating to distinct matters",
      "content": "6. Except where express provision to the contrary is made by this Act or any other Act — ( a ) an instrument containing or relating to several distinct matters is to be separately and distinctly charged, as if it were a separate instrument, with duty in respect of each of the matters; and ( b ) an instrument made for any consideration in respect of which it is chargeable with ad valorem duty, and also for any further or other valuable consideration or considerations, is to be separately and distinctly charged, as if it were a separate instrument, with duty in respect of each of the considerations."
    },
    {
      "provision_ref": "s6A",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "6A",
      "title": "How duties are denoted",
      "content": "6A. Except where express provision is made to the contrary in this Act, all duties chargeable on any instrument are to be paid and denoted by attaching to the instrument a stamp certificate relating to the instrument."
    },
    {
      "provision_ref": "s6B",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "6B",
      "title": "E‑Stamping system",
      "content": "6B. —(1) The computer service known as the E‑Stamping system and established under section 6B as in force immediately before 4 October 2018, may be used for the purposes mentioned in subsection (2). [37/2018] (2) The purposes are to enable any person, in accordance with the arrangements made under this section — ( a ) to do the following without the need to present the instrument concerned to the Commissioner or a proper officer in charge of the stamp office: (i) obtain an assessment of stamp duty (and any penalty) on an instrument; (ii) pay stamp duty (and any penalty) on the instrument by electronic funds transfer in accordance with the assessment; (iii) stamp the instrument by attaching a stamp certificate to it or (in the case of an electronic instrument within the meaning of section 59) obtaining a stamp certificate for it, which bears an authorisation number issued for the instrument and such other particulars as are determined by the Commissioner; and ( b ) to apply to the Commissioner for the adjudication of an instrument under section 37 and to obtain a certificate of adjudication from the Commissioner under section 38. [37/2018] (3) The Commissioner may — ( a ) determine the information and particulars that may be electronically transmitted under the E‑Stamping system, including the form and manner they are to be transmitted; ( b ) determine the procedure for use of the E‑Stamping system, including the procedure in circumstances where there is a breakdown or an interruption in the computer service; and ( c ) generally do such other things for the better provision of the computer service. [37/2018]"
    },
    {
      "provision_ref": "s6C",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "6C",
      "title": "Electronic assessment and stamping of instruments",
      "content": "6C. —(1) For the purposes of this Act, the issue, using the E‑Stamping system, of a stamp certificate for an instrument must comprise an assessment of the duty (and any penalty) in relation to the instrument. (2) A person must, on receipt of a stamp certificate issued for the instrument by the Commissioner, immediately attach the stamp certificate to the instrument. [37/2018]"
    },
    {
      "provision_ref": "s6D",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "6D",
      "title": "Electronic funds transfer of duty",
      "content": "6D. —(1) A person using the E‑Stamping system may maintain an electronic banking facility with a bank to enable the transfer of funds from the person’s designated account with the bank to an account specified by the Commissioner. [37/2018] (2) The Commissioner must, on issuing to a person a stamp certificate in respect of any instrument that is chargeable with duty, immediately deduct through electronic funds transfer the full amount of duty chargeable from the designated account of the person. [37/2018] (3) Nothing in subsection (2) requires the Commissioner to deduct any money from the designated account of the person if the funds in that designated account are less than the full amount of duty chargeable on the instrument. [37/2018] 7. [ Repealed by Act 33 of 1999 ] 8. [ Repealed by Act 33 of 1999 ]"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "9",
      "title": "Composition of duty",
      "content": "9. —(1) Where the Commissioner is of the opinion that it is impracticable or inexpedient to require that the duty payable under this Act should be charged and paid on each separate instrument, the Commissioner may by order authorise any person to compound the payment of duty on such instruments as may be specified in the order on the following conditions: ( a ) that the person delivers to the Commissioner accounts in respect of the instruments at a date to be specified by the Commissioner in such form and containing such particulars as the Commissioner may direct; ( b ) that, on delivery of the accounts required under paragraph ( a ), the person pays to the Commissioner the amount of duty due on all the instruments; and ( c ) that the person complies with such other requirements as the Commissioner may impose. [37/2018] (2) The Commissioner may, if the Commissioner thinks fit, waive any of the conditions in subsection (1). (3) Instruments in respect of which payment of duty by way of composition has been made under this section are, despite any other provision of this Act, deemed to be duly stamped. (4) The Commissioner may, by notice and for any reason the Commissioner deems fit, cancel any authorisation granted under subsection (1) and must, in such notice, specify the date from which the authorisation is cancelled. (5) Where a person fails or neglects to pay the whole of the amount of duty within the time required by subsection (1), the person shall be liable to pay, in addition to the unpaid amount of duty, a penalty under section 46. 10. [ Repealed by Act 33 of 1999 ]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "11",
      "title": "Where duty chargeable depends on duty paid on another instrument",
      "content": "11. Where the duty with which an instrument is chargeable, or its exemption from duty, depends in any manner upon the duty actually paid in respect of another instrument, the payment of such last mentioned duty may, if application is made to the Commissioner for that purpose, and on production of both the instruments, be denoted upon such firstmentioned instrument in such manner as the Minister may by rules prescribe."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "12",
      "title": "Counterparts",
      "content": "12. —(1) The duplicate or counterpart of an instrument chargeable with duty (except the counterpart of an instrument chargeable as a lease, such counterpart not being executed by or on behalf of any lessor or grantor) is not to be deemed duly stamped unless it is stamped as an original instrument. [23/2011] (2) Without affecting subsection (1), the duplicate or counterpart of an instrument executed before 19 February 2011 and chargeable with duty is deemed duly stamped if it appears from the stamp certificate for the instrument that the instrument is a duplicate or counterpart. [23/2011]"
    },
    {
      "provision_ref": "s12A",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "12A",
      "title": "Instrument exempt from duty if its original is stamped, etc.",
      "content": "12A. An instrument (whether it is the original or a duplicate or counterpart of an instrument) executed on or after 19 February 2011 is exempt from duty if the original or a duplicate or counterpart (as the case may be) of that instrument has been duly stamped. [23/2011] Valuation for duty"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "13",
      "title": "Currency and securities",
      "content": "13. —(1) Where an instrument is chargeable with ad valorem duty in respect of — ( a ) any money expressed in any currency other than that of Singapore; or ( b ) any stock or marketable or other security, the duty is to be calculated on the value, on the day of the date of the instrument, of the money in the currency of Singapore according to the current rate of exchange, or of the stock or security according to the average price of the stock or security or, if there is no price, according to the value of the stock or security. (2) Where an instrument contains a statement of current rate of exchange or average price (as the case may require) and is stamped in accordance with that statement, the instrument, so far as regards the subject matter of the statement, is presumed, until the contrary is proved, to be duly stamped."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 2 - PROVISIONS APPLICABLE TO",
      "section": "14",
      "title": "Instruments reserving interest",
      "content": "14. When interest or goods and services tax is expressly made payable by the terms of an instrument, the instrument is not chargeable with duty higher than that with which the instrument would have been chargeable if no mention of interest or goods and services tax had been made in the instrument."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "15",
      "title": "Relief from ad valorem stamp duty",
      "content": "15. —(1) If it is shown to the Commissioner’s satisfaction that the prescribed conditions have been fulfilled, ad valorem stamp duty under Articles 3( a ), ( b ), ( ba ), ( bb ) and ( c ) and 9( c ) in the First Schedule is not chargeable on any instrument executed on or after 1 July 2000 for the purposes of or in connection with — ( a ) the transfer of the undertaking or shares in respect of a scheme for the reconstruction of any company or companies, or the amalgamation of companies; ( b ) the transfer, conveyance or assignment of any beneficial interest in any asset between such entities that are associated in such manner as may be prescribed; or ( c ) the conversion of a firm to a limited liability partnership under section 26 of the Limited Liability Partnerships Act 2005. [36/2008; 23/2011; 30/2014] (2) Subsection (1) does not apply to an instrument that is executed for the purpose of or in connection with the transfer, conveyance or assignment of any equity interest in an entity that is chargeable with any duty under section 23, except where it is executed for the purposes of or in connection with a matter in subsection (1)( c ). [13/2017; 37/2018] (3) If it is shown to the Commissioner’s satisfaction that the prescribed conditions have been fulfilled, then ad valorem stamp duty under Articles 3( a ), ( b ), ( ba ), ( bb ) and ( c ) and 9( c ) in the First Schedule is not chargeable on any instrument executed on or after 19 February 2011 for the purposes of or in connection with the conversion of a private company to a limited liability partnership under section 27 of the Limited Liability Partnerships Act 2005. [23/2011] (4) If it is shown to the Commissioner’s satisfaction that the prescribed conditions have been fulfilled, then ad valorem stamp duty under Article 3( bd ) and ( be ) in the First Schedule is not chargeable on any instrument executed on or after 12 January 2013 for the purposes of or in connection with — ( a ) the transfer of the undertaking or shares in respect of a scheme for the reconstruction of any company or companies, or the amalgamation of companies; ( b ) the transfer, conveyance or assignment of any beneficial interest in any asset between such entities that are associated in such manner as may be prescribed; ( c ) the conversion of a firm to a limited liability partnership under section 26 of the Limited Liability Partnerships Act 2005; or ( d ) the conversion of a private company to a limited liability partnership under section 27 of the Limited Liability Partnerships Act 2005. [30/2014] (5) If it is shown to the Commissioner’s satisfaction that the prescribed conditions have been fulfilled, then ad valorem stamp duty under Article 3( bg ) in the First Schedule is not chargeable on any instrument executed on or after 11 March 2017 for the purposes of or in connection with — ( a ) the transfer of the undertaking or shares in respect of a scheme for the reconstruction of any company or companies, or the amalgamation of companies; ( b ) the transfer, conveyance or assignment of any beneficial interest in any asset between such entities that are associated in such manner as may be prescribed; ( c ) the conversion of a firm to a limited liability partnership under section 26 of the Limited Liability Partnerships Act 2005; or ( d ) the conversion of a private company to a limited liability partnership under section 27 of the Limited Liability Partnerships Act 2005. [37/2018] (6) No instrument mentioned in this section is deemed to be duly stamped unless — ( a ) it is stamped with the duty to which it would but for this section be liable; or ( b ) it has been brought to the Commissioner under section 37 and the Commissioner has certified under section 38 that the full duty with which it is chargeable has been paid or that it is not chargeable with duty. (7) Where any claim for relief from duty under this section has been allowed for an instrument and it is subsequently found that — ( a ) any declaration or other evidence furnished in support of the claim was untrue in any material particular; or ( b ) any prescribed matter has occurred, the claim is deemed to have been disallowed and an amount equal to the amount of relief from duty — ( c ) becomes payable by the transferee entity to the Commissioner immediately; and ( d ) is recoverable from that entity as a debt due to the Government, together with interest on the amount at the rate of 6% per annum — (i) in a case where duty was paid on the instrument and then refunded after a claim for relief was allowed under this section, from the date on which the refund was made; or (ii) in any other case — (A) if the instrument is executed by any person in Singapore, from the date of its execution; or (B) if the instrument is executed outside Singapore, from the date the instrument is first received in Singapore. [28/2010; 23/2011; 30/2014] (8) The amount recoverable under subsection (7) is payable at the place stated in a notice served by the Commissioner on the entity, within one month after the service of the notice by the Commissioner on that entity. [28/2010] (9) If any amount recoverable from the entity under subsection (7) is not paid within the period specified in subsection (8), the following penalties shall be imposed on the entity: ( a ) where the outstanding amount is paid to the Commissioner within 3 months from the end of such period, a penalty of $10 or the outstanding amount, whichever is the greater; ( b ) where the outstanding amount is not paid to the Commissioner within 3 months from the end of such period, a penalty of $25 or 4 times the outstanding amount, whichever is the greater. [28/2010] (10) The Commissioner may reduce or remit any penalty imposed under this section. [28/2010] (11) Sections 50 and 70AA apply to the collection and recovery by the Commissioner of the amount recoverable under subsection (7) and any penalty imposed under subsection (9) as they apply to the collection and recovery of duty and penalty required to be paid under this Act. [28/2010] (12) In this section — “entity” means any of the following: ( a ) a company; ( b ) a registered business trust; ( c ) a statutory body; ( d ) a limited liability partnership; “firm” has the meaning given by section 2(1) of the Business Names Registration Act 2014; “limited liability partnership” has the meaning given by the Limited Liability Partnerships Act 2005 and includes any similar partnership formed or incorporated outside Singapore; “private company” has the meaning given by section 4(1) of the Companies Act 1967; “registered business trust” has the meaning given by section 2 of the Business Trusts Act 2004; “statutory body” means any body corporate established by any written law. [36/2008; 23/2011; 29/2014]"
    },
    {
      "provision_ref": "s15A",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "15A",
      "title": "Relief from ad valorem stamp duty for acquisition of shares of companies",
      "content": "15A. —(1) Subject to this section and the prescribed conditions being fulfilled, ad valorem stamp duty under Article 3( c ) in the First Schedule is not chargeable on any instrument executed during the period from 1 April 2010 to 31 March 2020 (both dates inclusive) for the purposes of or in connection with a qualifying acquisition of ordinary shares in a company (called in this section the target company) by a Singapore company (called in this section the acquiring company) or a subsidiary of the Singapore company that satisfies subsection (3) (called in this section the acquiring subsidiary). [28/2010; 2/2016] (2) Subsection (1) does not apply to an instrument that is executed for the purpose of or in connection with an acquisition of shares in a company, that is chargeable with any duty under section 23. [13/2017] (3) For the purposes of subsection (1), the acquiring subsidiary — ( a ) must be incorporated for the primary purpose of acquiring and holding shares in other companies; and ( b ) must be — (i) where the date of the acquisition is during the period from 1 April 2010 to 16 February 2012 (both dates inclusive), directly and wholly owned by the acquiring company at the date of the acquisition; and (ii) where the date of the acquisition is during the period from 17 February 2012 to 31 March 2020 (both dates inclusive), wholly owned (whether directly or indirectly) by the acquiring company at the date of the acquisition. [28/2010; 1/2013; 2/2016] (4) No instrument mentioned in subsection (1) is deemed to be duly stamped unless — ( a ) it is stamped with the duty to which it would but for this section be liable; or ( b ) the acquiring company has brought it to the Commissioner under section 37, and the Commissioner has certified under section 38 that any duty chargeable on the instrument has been paid or that it is not chargeable with duty to the extent provided in this section. [23/2011] (5) In this section, a qualifying acquisition of ordinary shares in a target company by an acquiring company or an acquiring subsidiary is any of the following: ( a ) an acquisition made during the period from 1 April 2010 to 31 March 2015 (both dates inclusive) that results in the acquiring company and its acquiring subsidiaries owning together in total more than 50% of the total number of ordinary shares in the target company where, before the date of the acquisition, such total ownership was 50% or less of the total number of ordinary shares in the target company; ( b ) an acquisition made during the period from 1 April 2010 to 31 March 2015 (both dates inclusive) that results in the acquiring company and its acquiring subsidiaries owning together in total 75% or more of the total number of ordinary shares in the target company where — (i) before the date of the acquisition, such total ownership was more than 50% but less than 75% of the total number of ordinary shares in the target company; and (ii) the date of the acquisition does not fall within the financial year of the acquiring company in which the acquisition mentioned in paragraph ( a ) is made; ( c ) any other acquisition the date of which falls within the qualifying period in which the acquisition mentioned in paragraph ( a ) is made; ( d ) any other acquisition the date of which falls within the qualifying period in which the acquisition mentioned in paragraph ( b ) is made and is before 1 April 2016. [28/2010; 23/2011; 1/2013; 2/2016] (6) For the purposes of subsection (5), the qualifying period is determined as follows: ( a ) in the first instance, the qualifying period is the financial year of the acquiring company in which the acquisition mentioned in subsection (5)( a ) or ( b ) (as the case may be) is made; ( b ) following the end of the financial year mentioned in paragraph ( a ), the acquiring company may elect, in such form and manner and within such time as the Commissioner may specify, to replace the qualifying period mentioned in that paragraph with a prescribed period (which must be a period within which the acquisition mentioned in subsection (5)( a ) or ( b ) (as the case may be) is made); and ( c ) where the acquiring company claims a deduction under section 37O of the Income Tax Act 1947 in connection with the acquisition mentioned in subsection (5)( a ) or ( b ) (as the case may be), then, whether or not an election was made under paragraph ( b ), the qualifying period is, in place of the period mentioned in paragraph ( a ) or ( b ) (as the case may be), the same period as that for which acquisitions are qualifying acquisitions for the purposes of its claim under section 37O of that Act. [23/2011; 1/2013] (7) In this section, each of the following is also a qualifying acquisition of ordinary shares in a target company by an acquiring company or an acquiring subsidiary: ( a ) an acquisition made during the period from 1 April 2015 to 31 March 2020 (both dates inclusive) that results in the acquiring company and its acquiring subsidiaries owning together in total 20% or more but 50% or less of the total number of ordinary shares in the target company where — (i) before the date of the acquisition, such total ownership was less than 20% of the total number of ordinary shares in the target company; and (ii) in the financial year of the acquiring company in which the date of the acquisition falls, there is no acquisition mentioned in paragraph ( b ); ( b ) an acquisition made during the period from 1 April 2015 to 31 March 2020 (both dates inclusive) that results in the acquiring company and its acquiring subsidiaries owning together in total more than 50% of the total number of ordinary shares in the target company where, before the date of the acquisition, such total ownership was 50% or less of the total number of ordinary shares in the target company; ( c ) any other acquisition the date of which falls within the qualifying period in which the acquisition mentioned in paragraph ( a ) or ( b ) (as the case may be) is made; ( d ) an acquisition made on or after 1 April 2015 but before 1 April 2016 that results in the acquiring company and its acquiring subsidiaries owning together in total 75% or more of the total number of ordinary shares in the target company where — (i) before the date of the acquisition, such total ownership was more than 50% but less than 75% of the total number of ordinary shares in the target company; (ii) in the financial year of the acquiring company in which the date of the acquisition falls, there is no acquisition mentioned in paragraph ( a ) or ( b ); and (iii) before 1 April 2015 and not earlier than 12 months before the acquisition, the acquiring company or its acquiring subsidiary had made an acquisition of ordinary shares of any amount in the target company; ( e ) any other acquisition the date of which falls within the qualifying period in which the acquisition mentioned in paragraph ( d ) is made, and is before 1 April 2016. [2/2016] (8) For the purposes of subsection (7)( c ) and ( e ), the qualifying period is determined as follows: ( a ) in the first instance, the qualifying period is the financial year of the acquiring company in which the acquisition mentioned in subsection (7)( a ), ( b ) or ( d ) (as the case may be) is made; ( b ) where the other acquisition mentioned in subsection (7)( c ) or ( e ) relates to an acquisition in subsection (7)( b ) or ( d ) and the acquisition mentioned in subsection (7)( b ) (if applicable) is made before 1 April 2016, the acquiring company may elect, in such form and manner and within such time as the Commissioner may specify (which must be after the financial year mentioned in paragraph ( a )), to replace the qualifying period mentioned in paragraph ( a ) with a prescribed period (which must be a period within which the acquisition mentioned in subsection (7)( b ) or ( d ) (as the case may be) is made); ( c ) where the acquiring company claims a deduction under section 37O of the Income Tax Act 1947 in connection with the acquisition mentioned in subsection (7)( a ), ( b ) or ( d ) (as the case may be), then the qualifying period is, instead of the period mentioned in paragraph ( a ) or ( b ) (as the case may be), the same period as that for which acquisitions are qualifying acquisitions for the purposes of its claim under section 37O of that Act. [2/2016] (9) The maximum amount of relief from duty to be allowed under subsection (1) with respect to all qualifying acquisitions of ordinary shares in all target companies by an acquiring company and all its acquiring subsidiaries in a financial year of the acquiring company is determined in accordance with subsections (10) to (22). [2/2016; 34/2016] (10) Subject to subsection (11), where the qualifying acquisitions in the financial year — ( a ) include an acquisition mentioned in subsection (5)( a ) or ( b ); and ( b ) do not include an acquisition mentioned in subsection (7)( a ), ( b ) or ( d ), the maximum amount of relief from duty allowed is $200,000. [2/2016] (11) Where the qualifying period is the financial year of the acquiring company and the financial year exceeds 12 months, the maximum amount of relief from duty to be allowed to the acquiring company with respect to all the acquisitions to which subsection (10) applies for each of the following periods must not exceed $200,000: ( a ) the first 12 months of that financial year; ( b ) the remaining period of that financial year. [2/2016] (12) Subject to subsection (13), where the qualifying acquisitions in the financial year — ( a ) include an acquisition mentioned in subsection (7)( a ), ( b ) or ( d ) that is made before 1 April 2016; and ( b ) do not include an acquisition mentioned in subsection (5)( a ) or ( b ), or an acquisition mentioned in subsection (7)( a ) or ( b ) that is made on or after 1 April 2016, the maximum amount of relief from duty allowed is $40,000. [2/2016; 34/2016] (13) Where the qualifying period is the financial year of the acquiring company and the financial year exceeds 12 months, the maximum amount of relief from duty to be allowed to the acquiring company with respect to all the acquisitions to which subsection (12) applies for each of the following periods must not exceed $40,000: ( a ) the first 12 months of that financial year; ( b ) the remaining period of that financial year. [2/2016] (14) Subject to subsection (15), where the qualifying acquisitions in the financial year — ( a ) include an acquisition in subsection (7)( a ) or ( b ) that is made on or after 1 April 2016; and ( b ) do not include an acquisition in subsection (5)( a ) or ( b ), or an acquisition in subsection (7)( a ), ( b ) or ( d ) that is made before 1 April 2016, the maximum amount of relief from duty allowed is $80,000. [34/2016] (15) Where the qualifying period is the financial year of the acquiring company and the financial year exceeds 12 months, the maximum amount of relief from duty to be allowed to the acquiring company with respect to all the acquisitions to which subsection (14) applies for each of the following periods must not exceed $80,000: ( a ) the first 12 months of that financial year; ( b ) the remaining period of that financial year. [34/2016] (16) For the purposes of subsection (10), where subsection (6)( b ) or ( c ) applies, the qualifying acquisitions to which subsection (10) applies are treated as made in the financial year of the acquiring company in which the acquisitions mentioned in subsection (10)( a ) are made. [2/2016] (17) For the purposes of subsection (12), where subsection (8)( b ) or ( c ) applies, the qualifying acquisitions to which subsection (12) applies are treated as made in the financial year of the acquiring company in which the acquisitions mentioned in subsection (12)( a ) are made. [2/2016] (18) For the purposes of subsection (14), where subsection (8)( c ) applies, the qualifying acquisitions to which subsection (14) applies are treated as made in the financial ye"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "16",
      "title": "Voluntary conveyance inter vivos",
      "content": "16. —(1) Any conveyance or transfer operating as a voluntary disposition inter vivos is chargeable with the like stamp duty as if it were a conveyance or transfer on sale, with the substitution in each case of the value of the property conveyed or transferred for the amount or value of the consideration of the sale. (2) Any conveyance or transfer (not being a disposition made in favour of a purchaser or incumbrancer or other person in good faith and for valuable consideration) is, for the purposes of this section, deemed to be a conveyance or transfer operating as a voluntary disposition inter vivos, and (except where marriage is the consideration) the consideration for any conveyance or transfer is not for this purpose deemed to be valuable consideration where the Commissioner is of the opinion that by reason of the inadequacy of the sum paid as consideration or other circumstances the conveyance or transfer confers a substantial benefit on the person to whom the property is conveyed or transferred. (3) For the purpose of subsection (2) — ( a ) a conveyance or transfer is treated as a conveyance or transfer made in consideration of marriage if — (i) the transferor is a party to the marriage or is a parent, grandparent or sibling of a party to the marriage; (ii) the transferee is a party to the marriage; (iii) the property or interest in the property conveyed or transferred is the matrimonial home of the parties to the marriage; (iv) the property or interest in the property is conveyed or transferred within the specified time period; and (v) there is no other property or interest in the property conveyed or transferred to the parties on the occasion of that marriage in respect of which ad valorem duty has not been charged because marriage was the consideration; and ( b ) a conveyance or transfer is not to be treated as a conveyance or transfer made in consideration of marriage if — (i) the marriage is between 2 parties who had previously been married to each other; and (ii) ad valorem duty was not charged on any property or interest in the property conveyed or transferred to the parties on the occasion of the previous marriage because marriage was the consideration. (4) In subsection (3) — “parent”, in relation to a party to the marriage, means — ( a ) a natural parent of the party; ( b ) a person by whom the party was adopted in accordance with any written law relating to the adoption of children; or ( c ) a step‑parent of the party, and “grandparent” is to be construed accordingly; “specified time period” means — ( a ) one year before or after the date of solemnisation of a marriage; or ( b ) such other time period as may be prescribed in lieu of the time period specified in paragraph ( a ). (5) A conveyance or transfer made — ( a ) for nominal consideration for the purpose of securing the repayment of an advance or loan; ( b ) for effectuating the appointment of a new trustee or the retirement of a trustee, whether the trust is expressed or implied; ( c ) under which no beneficial interest passes in the property conveyed or transferred; or ( d ) to a beneficiary by a trustee or other person in a fiduciary capacity under any trust, whether expressed or implied, is not chargeable with duty under this section. (6) Subsection (5) has effect even though the circumstances exempting the conveyance or transfer from charge under this section are not set out in the conveyance or transfer. (7) Where equity interests in an entity were conveyed or transferred on or after 10 May 2022 to a trustee to hold on trust for a beneficiary who is not a bare trust beneficiary, then subsection (5)( d ) does not apply to a conveyance or transfer, executed on or after that date, by the trustee of those equity interests to the beneficiary. [Act 22 of 2022 wef 10/05/2022] (8) In subsection (7), “entity” and “equity interest” have the meanings given by section 23(21). [Act 22 of 2022 wef 10/05/2022] (9) To avoid doubt, this section applies to a settlement that is made voluntarily. [Act 22 of 2022 wef 10/05/2022]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "17",
      "title": "How conveyance in consideration of debt or subject to future payment, etc., to be charged",
      "content": "17. —(1) When any property is conveyed to any person in consideration, wholly or in part, of any debt due to the person or subject either certainly or contingently to the payment or transfer of any money or stock or other property whether being or constituting a charge or incumbrance upon the property or not, such debt, money, stock or other property is deemed to be the whole or part (as the case may be) of the consideration in respect of which the conveyance is chargeable with ad valorem duty. Explanation. — In the case of a sale of property subject to a mortgage or other incumbrance, any unpaid mortgage money or money charged, together with the interest, if any, due on it is deemed to be part of the consideration for the sale. (2) A conveyance on sale made for any consideration in respect of which it is chargeable with ad valorem duty, and in further consideration of a covenant by the purchaser to make or of the purchaser having previously made, any substantial improvement of or addition to the property conveyed to the purchaser, or of any covenant relating to the subject matter of the conveyance, is not chargeable, and is deemed not to have been chargeable with any duty in respect of such further consideration. Illustrations ( a ) A owes B $1,000. A sells a property to B , the consideration being $500 and the release of the previous debt of $1,000. Stamp duty is payable on $1,500. ( b ) A sells a property to B for $500 which is subject to a mortgage to C for $1,000 and unpaid interest $200. Stamp duty is payable on $1,700. ( c ) A mortgages a house to B for $5,000. B afterwards buys the house from A for $5,000 and a release of the mortgage debt. Stamp duty is payable on $10,000."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "18",
      "title": "Duties on foreclosure orders",
      "content": "18. —(1) Subject to section 17, a decree or an order for, or having the effect of an order for, foreclosure in respect of mortgaged property is chargeable with duty as if it were a conveyance of that property on sale. (2) The ad valorem stamp duty upon any decree or order under subsection (1) must not exceed the duty on a sum equal to the value of the property to which the decree or order relates, and where the decree or order states that value, such statement is conclusive for the purpose of determining the amount of the duty. (3) Where ad valorem stamp duty is paid upon any decree or order under subsection (1), any conveyance following upon that decree or order is exempt from the ad valorem stamp duty."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "19",
      "title": "Valuation in case of annuity",
      "content": "19. —(1) Where the consideration, or any part of the consideration, for a conveyance on sale consists of money payable periodically for a definite period not exceeding 20 years, so that the total amount to be paid can be previously ascertained, the conveyance is chargeable in respect of that consideration with ad valorem duty on the total amount. (2) Where the consideration, or any part of the consideration, for a conveyance on sale consists of money payable periodically — ( a ) for a definite period exceeding 20 years or in perpetuity; or ( b ) for any indefinite period not terminable with life, the conveyance is chargeable in respect of that consideration with ad valorem duty on the total amount which will or may, according to the terms of sale, be payable during the period of 20 years next after the day of the date of the instrument. (3) Where the consideration, or any part of the consideration, for a conveyance on sale consists of money payable periodically during any life or lives, the conveyance is chargeable in respect of that consideration with ad valorem duty on the amount which will or may, according to the terms of sale, be payable during the period of 12 years next after the day of the date of the instrument. 20. [ Repealed by Act 26 of 1996 ]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "21",
      "title": "Conveyances and transfers in contemplation of sale",
      "content": "21. —(1) Subject to this section, any instrument by which property is conveyed or transferred to any person in contemplation of a sale of that property is treated for the purpose of this Act as a conveyance or transfer on sale of that property for a consideration equal to the value of that property. (2) If, on a claim made to the Commissioner not later than one year after the making or execution of an instrument chargeable with duty in accordance with subsection (1), it is shown to the Commissioner’s satisfaction — ( a ) that the sale in contemplation of which the instrument was made or executed has not taken place and the property has been reconveyed or retransferred to the person ( P ) from whom it was conveyed or transferred, or to a person to whom P ’s rights have been transmitted on death or bankruptcy; or ( b ) that the sale has taken place for a consideration which is less than the value in respect of which duty was paid on the instrument by virtue of this section, the Commissioner must repay the duty paid by virtue of this section — ( c ) in a case falling under paragraph ( a ), so far as it exceeds the duty which would have been payable apart from this section; and ( d ) in a case falling under paragraph ( b ), so far as it exceeds the duty which would have been payable if the instrument had been stamped in accordance with subsection (1) in respect of a value equal to the consideration in question. (3) In a case falling under subsection (2)( b ), duty is not repayable if it appears to the Commissioner that the circumstances are such that a conveyance or transfer on the sale in question would have been chargeable with duty under section 16(2). (4) No instrument chargeable with duty in accordance with subsection (1) is deemed to be duly stamped unless the Commissioner has been required to express an opinion thereon under section 37 and has expressed his or her opinion in accordance with that section. (5) Subsections (1) to (4) apply whether or not an instrument conveys or transfers other property in addition to the property in contemplation of the sale of which the instrument is made or executed, but the provisions of those subsections do not affect the duty chargeable on the instrument in respect of that other property. (6) For the purpose of subsection (1), the value of property conveyed or transferred by an instrument chargeable with duty is to be determined without regard to — ( a ) any power (whether or not contained in the instrument) on the exercise of which the property, or any part of or any interest in the property, may be revested in the person from whom it was conveyed or transferred ( P ) or in any person on P ’s behalf; or ( b ) any annuity reserved out of the property or any part of it, or any life or other interest so reserved, being an interest which is subject to forfeiture. (7) If, on a claim made to the Commissioner not later than one year after the making or execution of the instrument, it is shown to the Commissioner’s satisfaction that any such power mentioned in subsection (6)( a ) has been exercised in relation to the property and the property or any property representing it has been reconveyed or retransferred in whole or in part in consequence of that exercise, the Commissioner must repay the duty paid by virtue of subsection (6) — ( a ) in a case where the whole of such property has been so reconveyed or retransferred, so far as it exceeds the duty which would have been payable apart from subsection (6); and ( b ) in any other case, so far as it exceeds the duty which would have been payable if the instrument had operated to convey or transfer only such property as is not so reconveyed or retransferred."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "22",
      "title": "Contracts, etc., to be chargeable as conveyances on sale",
      "content": "22. —(1) Every contract or agreement for the sale of — ( a ) any equitable estate or interest in any property; or ( b ) any estate or interest in any property except property situated outside Singapore, is chargeable with the same ad valorem duty, payable by the purchaser, as if it were an actual conveyance on sale of the estate, interest or property contracted or agreed to be sold. [1/2013; 13/2017] (2) Where such ad valorem duty has been paid in accordance with subsection (1) and, before having obtained a conveyance or transfer of the property, the purchaser assigns the purchaser’s equitable estate or interest in that property or enters into any contract or agreement for the sale of that property, the assignment, contract or agreement is chargeable with ad valorem duty in respect of the consideration moving from the sub‑purchaser of that estate, interest or property as if it were an actual conveyance on sale to the sub‑purchaser. (3) Where any purchaser or sub‑purchaser has paid ad valorem duty upon any assignment, contract or agreement in accordance with subsection (1) or (2), the conveyance or transfer made to the purchaser or sub‑purchaser (as the case may be) is, if executed on or after 19 February 2011, exempt from duty. [23/2011] (4) Where a person, having contracted jointly or otherwise for the purchase of any property but not having obtained a conveyance of the property, directs the vendor of the property in writing to convey or transfer the property or any share in the property — ( a ) to another person; or ( b ) where the person contracted for the purchase of the property jointly with another, to the joint purchasers in shares other than as specified in the contract for the purchase of the property, the direction is, for the purpose of this Act, treated as a contract or an agreement for the sale of that property or share in that property for a consideration equal to the value of that property or share in that property and is chargeable with duty as if it were an actual conveyance on sale of that property or share in that property. (5) Where more than one contract or agreement for sale is executed by a purchaser in respect of the same sale of the same property, only one such contract or agreement for sale of the property is chargeable with ad valorem duty under this section and any other contract or agreement for the same sale of the same property is, if executed on or after 19 February 2011, exempt from duty. [23/2011] (6) Subject to subsection (7), the ad valorem duty paid under this section upon any contract or agreement for the sale of property must, on application, be refunded by the Commissioner where the contract or agreement is later rescinded or annulled on the ground that — ( a ) the vendor is unable to prove the vendor’s title to the property; ( b ) a purchaser, being a foreign person, is unable to obtain approval under the Residential Property Act 1976 to acquire or purchase the property; ( c ) the property is acquired or is proposed for acquisition by any public authority pursuant to the provisions of any written law authorising or empowering the public authority to acquire land compulsorily; ( d ) the purchase of the property is conditional upon permission by the competent authority to develop or subdivide the property and such permission is refused; ( e ) either vendor or purchaser fails to obtain the approval of any public authority to sell or purchase (as the case may be) the property; ( f ) the Commissioner of Building Control made an order under section 24 of the Building Control Act 1989 in respect of the property; or ( g ) a Strata Titles Board or the General Division of the High Court (as the case may be) refused an application for an order for the sale of the property under section 84A, 84D, 84E or 84FA of the Land Titles (Strata) Act 1967. [13/2010; 23/2011; 40/2019] (7) The refund under subsection (6) is to be made if and only if — ( a ) the application for refund is made by the person who paid or is liable to pay the duty within — (i) 6 months after the date of the stamp, or in the case of an executed instrument, after the date of the instrument; (ii) if the instrument is not dated, 6 months after the execution of the instrument; (iii) in the case of a contract or an agreement that is rescinded or annulled on the ground mentioned in subsection (6)( g ), 2 months after the refusal of a Strata Titles Board or the General Division of the High Court, as the case may be; or (iv) such further time as the Commissioner may deem reasonable when, in unavoidable circumstances, the instrument cannot be produced within that period; and ( b ) in the case of an executed instrument, the instrument is surrendered to the Commissioner, unless the Commissioner dispenses with such surrender in a particular case. [23/201l; 30/2014; 40/2019] (8) Subject to the provisions of this Act, this section applies to instruments made on or after 15 May 1996. (9) In this section — “Commissioner of Building Control” has the meaning given by the Building Control Act 1989; “competent authority” has the meaning given by the Planning Act 1998; “public authority” means the Housing and Development Board constituted by the Housing and Development Act 1959 or the Jurong Town Corporation constituted by the Jurong Town Corporation Act 1968; “Strata Titles Board” means a Strata Titles Board constituted under the Building (Strata Management) Act 2004. [Act 12 of 2020 wef 01/10/2025] [13/2010]"
    },
    {
      "provision_ref": "s22A",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "22A",
      "title": "Additional duty on instruments for disposal of immovable property within specified holding period",
      "content": "22A. —(1) Subject to the provisions of this Act, every contract or agreement for the sale of any specified immovable property (or any part thereof) which is chargeable with duty pursuant to section 22 (including any instrument chargeable in like manner) is chargeable with additional ad valorem duty (the amounts of which are indicated in the First Schedule), payable by the vendor of the property, in respect of the consideration for that sale as if it were an actual conveyance on sale of immovable property, if the property or part thereof is disposed of under that contract or agreement — ( a ) while this section is in force; and ( b ) before the end of the period prescribed in the section 22A Order in relation to the specified immovable property (called in this section the specified holding period) from the date on which the vendor acquired that property or any part thereof. [6/2010; 28/2010] (2) Subject to the provisions of this Act, every conveyance on sale of any specified immovable property (or any part thereof) is chargeable with the same additional ad valorem duty under subsection (1), payable by the vendor of the property, in respect of the consideration for that sale, if the property or part thereof is disposed of under that instrument — ( a ) while this section is in force; and ( b ) before the end of the specified holding period from the date on which the vendor acquired that property or part thereof. [28/2010] (3) Subject to the provisions of this Act, every instrument — ( a ) which is a conveyance or transfer operating as a voluntary disposition inter vivos of any specified immovable property (or any part thereof) and which is chargeable with duty under section 16 as if it were a conveyance or transfer on sale of that property; ( b ) which is a conveyance or transfer of any specified immovable property (or any part thereof) — (i) by way of release or settlement; or (ii) pursuant to a declaration of trust where the beneficial interest in the property passes; or ( c ) by which any specified immovable property (or any part thereof) is transferred, by way of distribution in specie upon the voluntary winding up of a private company, to a person in the person’s capacity as shareholder in that company, is treated for the purpose of this section as a conveyance on sale of immovable property and chargeable with the same additional ad valorem duty under subsection (1), payable by the transferor, in respect of the value of the property or part thereof so conveyed or transferred, if the property or part thereof is disposed of under that instrument — ( d ) while this section is in force; and ( e ) before the end of the specified holding period from the date on which the transferor acquired that property or any part thereof. [6/2010] (4) Subject to the provisions of this Act and unless the section 22A Order specifies otherwise, every instrument which is a lease or an agreement for lease of any specified immovable property (or any part thereof) for a term equal to or exceeding the prescribed term, is treated for the purpose of this section as a conveyance on sale of immovable property and chargeable with the same additional ad valorem duty under subsection (1), payable by the lessor, in respect of the consideration for the lease, if the property or part thereof is disposed of under that instrument — ( a ) while this section is in force; and ( b ) before the end of the specified holding period from the date on which the lessor acquired that property or any part thereof. [6/2010] (5) For the purposes of subsection (4) — ( a ) the fact that the term of a lease or an agreement for lease may be extended pursuant to an option is to be taken into consideration in determining whether its term is equal to or exceeds the prescribed term; and ( b ) the fact that a lease or an agreement for lease for a specified period of time is determinable on the happening of an event within that time is not to be taken into consideration in determining its term. [6/2010] (6) Subject to the provisions of this Act, an instrument by which an exchange of any specified immovable property (or any part thereof) is effected is treated for the purpose of this section as a conveyance on sale of immovable property if the property or part thereof is disposed of under the instrument — ( a ) while this section is in force; and ( b ) before the end of the specified holding period from the date on which the party who disposes of the property or part thereof acquired that property or any part thereof, and is chargeable with the same additional ad valorem duty under subsection (1), payable by that party, in respect of the value of the property or part thereof being exchanged that is of the greater value. [6/2010] (7) In subsection (6), where a party disposes of 2 or more properties or parts thereof to another party under the instrument, those properties or parts are treated as one property or part, and their values are aggregated, for the purpose of determining the value of the property or part thereof being exchanged that is of the greater value. [6/2010] (8) Where in any conveyance on sale of immovable property or any part thereof (including any instrument which is chargeable in like manner) the vendors, lessors or transferors of the property or part are joint owners of that property or part, the duty payable by each vendor, lessor or transferor under this section is a proportion of the duty commensurate with their respective shares in that property or part; and for this purpose, joint tenants of any property or part are presumed, until the contrary is proved, to have equal shares in the property or part. [6/2010] (9) For the purposes of determining the additional duty chargeable on a conveyance on sale of immovable property or any part thereof (including any instrument which is chargeable in like manner) — ( a ) the consideration or value (whichever is applicable) on which the duty is based, is reduced by such amount as the Commissioner considers to be attributable to such part of the specified immovable property that is permitted to be used under the Master Plan or the Planning Act 1998 (as the case may be) for a purpose that is not a prescribed purpose; and ( b ) where parts of the property were acquired by the vendor, lessor or transferor at different times, the duty is reduced by such amount as the Commissioner determines to be in excess of the duty which would have been chargeable under this section if the property had been conveyed in separate parts. [6/2010; 1/2013] (10) The Commissioner’s decisions under subsection (9)( a ) and ( b ), respectively, are final. [6/2010] (11) Section 22(3) applies to a vendor, lessor or transferor of specified immovable property or a part thereof as if — ( a ) the first reference in that provision to purchaser or sub‑purchaser is substituted with a reference to such vendor, lessor or transferor; and ( b ) the references in that provision to duty under that section are substituted with references to the additional duty under this section. [6/2010; 28/2010] (12) Section 22(5) applies to a vendor, lessor or transferor of specified immovable property or a part thereof as if — ( a ) the references in that provision to a contract or agreement for sale include a conveyance on sale; and ( b ) the references in that provision to duty under that section are substituted with references to the additional duty under this section. [28/2010] (13) Where any duty paid under section 22 in respect of any contract or agreement is refunded under that section, any additional duty paid under this section in respect of that same contract or agreement must likewise be refunded. [6/2010] (14) Subject to subsection (15) and the section 22A Order, where any specified immovable property or part thereof is acquired or disposed of — ( a ) under contract, the time at which the acquisition or disposal is made is the time the contract is made (and not, if different, the time at which the property or part is conveyed or transferred), and if the contract is conditional on the exercise of an option, the time at which the acquisition or disposal is made is the time when the option is exercised; ( b ) by way of gift, release or settlement or under a declaration of trust, the time at which the acquisition or disposal is made is the time when the property or part or any beneficial interest therein passes; or ( c ) by any other means, the time at which the acquisition or disposal is made is the time the property or part or any interest therein is vested or divested (as the case may be) by operation of law or otherwise. [6/2010] (15) In this section — ( a ) a reference to the section 22A Order is a reference to the order made under section 22B bringing this section into force; ( b ) a reference to specified immovable property is a reference to immovable property — (i) that is either — (A) zoned in the Master Plan in a manner specified in the section 22A Order; or (B) permitted under the Planning Act 1998 for use for a purpose specified in the section 22A Order; and (ii) unless the section 22A Order specifies otherwise, that is acquired by the person liable to pay the additional ad valorem duty under the relevant subsection on or after the date of coming into operation of this section as specified in the Order; ( c ) a reference to acquisition or disposal of any property does not include a reference to a conveyance or transfer by way of security of any property (including a retransfer on redemption of the security); ( d ) where a person ( Q ) entitled to any property by way of security or to the benefit of a charge or incumbrance on any property deals with the property for the purposes of enforcing or giving effect to the security, charge or incumbrance, Q ’s dealings with the property are treated as if they were done through Q as nominee by the person entitled to the property subject to the security, charge or incumbrance; ( e ) a reference to disposal of any property does not include a reference to a disposal as a result of bankruptcy, dissolution, receivership or winding up of the owner of the property, other than a voluntary winding up; ( f ) a reference to a person acquiring any property includes a reference to a situation where — (i) subsequent to the person’s acquisition of the immovable property, being such vacant land or land with one or more buildings thereon as may be prescribed, the land is zoned in the Master Plan in a prescribed manner, or any building or part thereof on the land is permitted under the Planning Act 1998 to be used for a prescribed purpose, whichever is specified in the section 22A Order in respect of that immovable property; or (ii) subsequent to the person’s acquisition of any part of a building, the part is permitted under the Planning Act 1998 to be used for a prescribed purpose, and (unless the section 22A Order specifies otherwise) the time at which the acquisition is made is the time when the zoning in the Master Plan is altered in such manner or when the permission under that Act is granted, as the case may be; and ( g ) a reference to a purpose permitted by the Planning Act 1998 is a reference to — (i) a purpose permitted by a written permission granted under section 14(4) of that Act, other than one that is granted for a period of 10 years or less; (ii) a purpose authorised by a notification under section 21(6) of that Act; or (iii) such other purpose as may be prescribed. [6/2010; 1/2013] (16) Despite anything in this section — ( a ) every conveyance on sale of property and every contract or agreement for the sale of any equitable estate or interest in any property or for the sale of any estate or interest in any property, being a conveyance, a contract or an agreement made before the date of coming into operation of this section; and ( b ) every exempt instrument specified for the purposes of this section by rules made under section 77, is chargeable with duty under this Act as"
    },
    {
      "provision_ref": "s22B",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "22B",
      "title": "Power to bring section 22A into operation",
      "content": "22B. —(1) Section 22A does not come into operation except at the time and in the manner mentioned in subsection (2). [6/2010] (2) The Minister may, from time to time, by order in the Gazette , declare that section 22A comes into operation on a date specified in the order, and that section comes into operation on that date and remains in force until the order is revoked by the Minister. [6/2010] (3) The order must specify — ( a ) the immovable property to which section 22A applies by — (i) the manner it is zoned under the Master Plan; or (ii) the purpose for which it is permitted to be used under the Planning Act 1998, as defined under section 22A(15)( g ); ( b ) the holding period for the purposes of that section; and ( c ) other matters required to be prescribed by that section. [6/2010; 1/2013] (4) The order may specify different holding periods for different classes of immovable property. [6/2010] (5) The order may — ( a ) prescribe a different time at which immovable property is acquired or disposed of under any particular class of instruments or any instruments executed by or in favour of any person or class of persons; and ( b ) specify other matters authorised to be prescribed or specified under section 22A. [6/2010] (6) The Minister may, in respect of the first order made after 20 February 2010, specify in the order a date of commencement for section 22A that is before the date of publication of the order in the Gazette but no earlier than 20 February 2010. [6/2010] (7) All orders made under this section must be presented to Parliament as soon as possible after publication in the Gazette . [6/2010]"
    },
    {
      "provision_ref": "s22C",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "22C",
      "title": "Duty on renunciation of interest in trust over residential property by beneficiary",
      "content": "22C. —(1) This section applies in a case where — ( a ) a person (called in this section the settlor) declared a bare trust over residential property or any interest in residential property on or after 10 May 2022; and ( b ) a beneficiary of the trust disclaims or renounces on or after that date the beneficiary’s interest in the residential property under the trust, and a resulting trust arises in favour of the settlor of the interest so disclaimed or renounced (called in this section the renounced interest). (2) The beneficiary must, within the prescribed period after the date of the disclaimer or renunciation, give to the Commissioner and the settlor in the prescribed manner a notice in the prescribed form that this section applies to the renounced interest (called in this section and Article 3 of the First Schedule a section 22C notice). (3) A beneficiary who contravenes subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000. (4) If the beneficiary fails to comply with subsection (2), the Commissioner may at any time give a section 22C notice to the beneficiary and the settlor. (5) A section 22C notice is chargeable with the same ad valorem duty under this Act that is payable by a grantee as if it were a conveyance or transfer operating as a voluntary disposition inter vivos of the renounced interest to the settlor, except that the duty is payable by the settlor as if the settlor were the grantee. (6) If the disclaimer or renunciation takes effect — ( a ) whilst section 22A is in force; and ( b ) before the end of the specified holding period mentioned in section 22A after the date the beneficiary first has beneficial ownership of the renounced interest, then duty under section 22A is also chargeable on a section 22C notice, and payable by the beneficiary, as if it were a conveyance or transfer operating as a voluntary disposition inter vivos of the renounced interest under section 22A, and the renounced interest were disposed of on the effective date of the disclaimer or renunciation. (7) For the purpose of determining the amount of duty chargeable under subsection (5) or (6), the value of the property is determined as follows: ( a ) if the section 22C notice is given by the beneficiary — the value of the property is its value as at the last day of the prescribed period in subsection (2) or, if the notice is given before the end of the prescribed period, the date the notice is given to the Commissioner; ( b ) if the section 22C notice is given by the Commissioner — the value of the property is its value as at the last day of the prescribed period in subsection (2). (8) Section 46 applies in relation to the duties in subsections (5) and (6) as if the section 22C notice were — ( a ) if given by the beneficiary — an instrument first executed in Singapore on the last day of the prescribed period in subsection (2) or, if the beneficiary gives the notice before the end of the prescribed period, the date the notice is given to the Commissioner; or ( b ) if given by the Commissioner — an instrument first executed in Singapore on the last day of the prescribed period in subsection (2). (9) In this section — ( a ) “residential property” has the meaning given by paragraph ( b ) of the definition of that term in paragraph (1) of Article 3 of the First Schedule; and ( b ) a reference to the beneficiary is, in a case where the beneficiary is an individual below 21 years of age or lacks capacity, to the guardian, donee, deputy or other person having the direction, control or management of the renounced interest on the beneficiary’s behalf. (10) This section is subject to section 9 of the Stamp Duties (Amendment) Act 2022. [Act 22 of 2022 wef 10/05/2022]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "23",
      "title": "Duty on conveyance of equity interests in property‑holding entities",
      "content": "23. —(1) This section applies to a conveyance — ( a ) executed while this section is in operation; ( b ) of equity interests in an entity; and ( c ) whether or not the conveyance is — (i) on a sale or otherwise; [Act 22 of 2022 wef 10/05/2022] (ii) by way of gift, release or settlement; or (iii) pursuant to a declaration of trust. [Act 22 of 2022 wef 10/05/2022] [13/2017] (2) If — ( a ) the grantee is a significant owner of the entity immediately before the execution of the conveyance, or becomes one upon the execution of the conveyance; and ( b ) the entity is a property‑holding entity or PHE at the time of the execution, then the conveyance is chargeable with ad valorem duty (called duty A in this section, sections 23B, 23BA and 23C, Article 3A of the First Schedule and Article 2A of the Third Schedule) that is payable by the grantee. [Act 22 of 2022 wef 10/05/2022] [13/2017] (3) Subject to subsection (4), if — ( a ) the grantor is a significant owner of the entity immediately before the effective date or becomes one on or after the effective date; ( b ) the conveyance is executed at any time on or after the effective date and whether at a time when the grantor is still such significant owner or after the grantor ceases to be one; ( c ) the entity is a PHE at the time of the execution; and ( d ) the equity interests conveyed comprise or include equity interests in the entity specified in subsection (8), then the conveyance is chargeable with ad valorem duty (called duty B in this section, sections 23B, 23BA and 23C, Article 3A of the First Schedule and Article 2A of the Third Schedule) that is payable by the grantor. [Act 22 of 2022 wef 10/05/2022] [13/2017] (4) Subsection (3) does not apply to any conveyance that is executed in the period between the time the grantor (including the grantor’s associates) ceases to own any equity interests in the entity and the time the grantor becomes a significant owner of the entity again. [13/2017] (5) If, at the time of the execution of the conveyance — ( a ) the entity (called in this subsection the target entity) is not a PHE; and ( b ) the grantee beneficially owns equity interests in another entity or entities in circumstances where, had the target entity and the other entity or entities been a single entity — (i) that single entity would have been a Type 2 PHE; and (ii) the grantee would have been a significant owner of that single entity or would have become such significant owner upon the execution of the conveyance, then the conveyance is chargeable with ad valorem duty (called duty C in this section, sections 23B, 23BA and 23C, Article 3A of the First Schedule and Article 2A of the Third Schedule) that is payable by the grantee. [Act 22 of 2022 wef 10/05/2022] [13/2017] (6) Subject to subsection (7), if — ( a ) immediately before the effective date or at any time on or after that date, the grantor beneficially owns equity interests in 2 or more entities in circumstances where, had those entities been a single entity — (i) the single entity would have been a Type 2 PHE; and (ii) the grantor would have been a significant owner of the single entity; ( b ) the conveyance is executed at any time on or after the effective date and whether at a time when the grantor would still be such significant owner or after the grantor has ceased to be one; and ( c ) the equity interests conveyed comprise or include equity interests in any of those entities and are equity interests specified in subsection (8), then the conveyance is chargeable with ad valorem duty (called duty D in this section, sections 23B, 23BA and 23C, Article 3A of the First Schedule and Article 2A of the Third Schedule) that is payable by the grantor. [Act 22 of 2022 wef 10/05/2022] [13/2017] (7) Subsection (6) does not apply to any conveyance that is executed in the period between — ( a ) the time the grantor (including the grantor’s associates) ceases to own any equity interests in any of the entities that comprise the single entity mentioned in that subsection; and ( b ) the time the grantor beneficially owns equity interests in 2 or more of those entities again in circumstances where, had those entities been a single entity, the grantor would have been a significant owner of that single entity. [13/2017] (8) The equity interests specified for subsections (3)( d ) and (6)( c ) are those that the grantor acquired — ( a ) on or after the effective date; and ( b ) within the prescribed holding period before the execution of the conveyance, and, for this purpose, where the grantor acquired the equity interests at different times, then the equity interests first acquired by the grantor are treated as being disposed of first by the grantor. [13/2017] (9) To avoid doubt, both duty A and duty B, or both duty C and duty D (as the case may be), may be charged on the same instrument, and are in addition to any duty chargeable on the conveyance of shares in Article 3( c ) of the First Schedule. [13/2017] (10) The amounts of duty A, duty B, duty C and duty D are indicated in Article 3A of the First Schedule. [13/2017] (11) For the purposes of this section and Article 3A of the First Schedule, a significant owner of an entity is a person who beneficially owns a percentage of the equity interests in the entity — ( a ) that is equal to or more than the percentage prescribed in the section 23 Order as the equity‑owning percentage; or ( b ) that carries voting power in the entity that is equal to or more than the percentage prescribed in the section 23 Order as the voting power percentage. [13/2017] (12) For the purposes of this section and Article 3A of the First Schedule — ( a ) in determining whether a person is a significant owner of an entity, equity interests beneficially owned by each of the person’s associates in the entity are treated as beneficially owned by the person; and ( b ) in determining whether a grantee becomes a significant owner of an entity upon the execution of a conveyance, equity interests beneficially owned by each of the grantee’s associates in the entity (including those conveyed, transferred, assigned or agreed to be sold to any of the grantee’s associates at or about the same time as the time of execution of the conveyance) are treated as beneficially owned by the grantee. [13/2017] (13) In this section, sections 23A and 23C and Article 3A of the First Schedule, an entity is a PHE if — ( a ) the percentage of the market value of the total tangible assets of the entity as at the end of the most recent completed accounting period of the entity that comprise prescribed immovable property, is equal to or more than the percentage prescribed in the section 23 Order as the Type 1 PHE percentage; or ( b ) where the entity has a significant stake in one or more entities each of which is a Type 1 PHE, the percentage calculated by the formula is equal to or more than the percentage that is prescribed in the section 23 Order as the Type 2 PHE percentage, and the entity is not an entity prescribed as a non‑PHE under the section 23 Order. [13/2017] (14) For the purposes of subsection (13)( b ), the amount E is determined by adding both of the following: ( a ) the sum of the market values of all prescribed immovable properties that form part of the entity’s total tangible assets as at the end of its most recent completed accounting period; ( b ) the sum of all amounts calculated for each Type 1 PHE in which the entity has a significant stake, using the formula G &#215; H, where — (i) G is the percentage of equity interests in the Type 1 PHE beneficially owned by the entity; and (ii) H is the sum of the market values of all prescribed immovable properties that form part of the total tangible assets of the Type 1 PHE as at the end of the most recent completed accounting period of the Type 1 PHE. [13/2017] (15) For the purposes of subsection (13)( b ), the amount F is determined by adding both of the following: ( a ) the market value of the total tangible assets of the entity as at the end of its most recent completed accounting period; ( b ) the sum of all amounts calculated for each entity (called in this subsection the 2nd entity) in which the entity has a significant stake, using the formula G1 &#215; I, where — (i) G1 is the percentage of equity interests in the 2nd entity beneficially owned by the entity; and (ii) I is the market value of the total tangible assets of the 2nd entity as at the end of the most recent completed accounting period of the 2nd entity. [13/2017] (16) For the purposes of subsections (13), (14) and (15), an entity has a significant stake in another entity if the percentage of equity interests in the other entity which it beneficially owns is not less than the percentage prescribed in the section 23 Order as the significant stake percentage. [13/2017] (17) For the purposes of subsections (14)( b ), (15)( b ) and (16), in a case where an entity ( X ) (being a partnership or limited partnership) beneficially owns equity interests in another entity ( Y ), a partner of X that is itself an entity is taken to beneficially own a percentage of equity interests in Y that is calculated according to the formula L &#215; M, where — ( a ) L is the percentage of the partner’s share in the partnership; and ( b ) M is the percentage which the value of equity interests in Y owned by X bears to the total value of all equity interests in Y . [13/2017] (18) For the purposes of subsections (14)( b ), (15)( b ), (16) and (17), if — ( a ) an entity (called in this subsection the subject entity) beneficially owns (including by reason of one or more applications of this subsection) equity interests in another entity (called in this subsection the 1st level entity); and ( b ) the 1st level entity beneficially owns equity interests in another entity (called in this subsection the 2nd level entity), then the subject entity is taken to beneficially own a percentage of equity interests in the 2nd level entity that is calculated according to the formula N &#215; O, where — ( c ) N is the percentage which the value of equity interests beneficially owned by the subject entity in the 1st level entity bears to the total value of all equity interests in the 1st level entity; and ( d ) O is the percentage which the value of equity interests beneficially owned by the 1st level entity in the 2nd level entity bears to the total value of all equity interests in the 2nd level entity. [13/2017] (19) To avoid doubt, in determining, for the purposes of subsections (14)( b ), (15)( b ), (16), (17) and (18), the percentage of the equity interests in an entity that are beneficially owned by another entity, all of the equity interests that the other entity owns, whether directly, or indirectly under subsection (18) through one or more chains of ownership, are to be added together. [13/2017] (20) In this section, section 23A and Article 3A of the First Schedule, a person ( X ) is an associate of another person ( Y ) if — ( a ) X is the spouse, a parent, a grandparent, a child, a grandchild or a child of a parent of Y ; ( b ) X and Y are partners in a partnership, limited partnership or limited liability partnership; ( c ) X is a person with whom Y has an agreement or arrangement, whether oral or in writing and whether express or implied, to act together with respect to the acquisition, holding or disposal of equity interests in, or with respect to the exercise of their votes in relation to, the entity in question; or ( d ) X is associated with Y in such manner as may be prescribed in the section 23 Order. [13/2017] (20A) However, subsection (20) does not apply in a case mentioned in subsection (22)( aa )(i) or (ii); and in such a case, a person ( X ) is an associate of the trustee of the trust concerned if X is associated with the trustee in such manner as may be prescribed in the section 23 Order. [Act 22 of 2022 wef 10/05/2022] (21) In this section, sections 23A to 23D and Article 3A of the"
    },
    {
      "provision_ref": "s23A",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "23A",
      "title": "Offences for section 23",
      "content": "23A. —(1) If — ( a ) the grantee of a conveyance of equity interests in an entity asks the grantor whether the entity is a PHE or for any information concerning the PHE’s underlying property; ( b ) the grantor falsely informs the grantee that the entity is not a PHE, or provides false or misleading information concerning the PHE’s underlying property; and ( c ) the information results in a failure to pay or an underpayment of ad valorem duty chargeable under section 23 on the conveyance, then the grantor shall be guilty of an offence and shall be liable on conviction to a fine not exceeding 4 times the amount of duty not paid or underpaid. [13/2017] (2) It is a defence to a charge under subsection (1) for the grantor to prove on a balance of probabilities that the grantor had used reasonable efforts in finding the required information, and in verifying the truth of the information before providing it to the grantee. [13/2017] (3) If — ( a ) before a conveyance of equity interests in an entity, the grantor or grantee asks an associate of the grantor or grantee (as the case may be) for information on the equity interests in the entity which the associate beneficially owns; ( b ) the associate provides false or misleading information to the grantor or grantee; and ( c ) the information results in a failure to pay or an underpayment of ad valorem duty chargeable under section 23 on the conveyance, then the associate shall be guilty of an offence and shall be liable on conviction to a fine not exceeding 4 times the amount of duty not paid or underpaid. [13/2017]"
    },
    {
      "provision_ref": "s23B",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "23B",
      "title": "Section 23, etc., applies also to transfers, assignments and contracts",
      "content": "23B. —(1) Sections 23 and 23A apply to a transfer or assignment of equity interests in an entity as they apply to a conveyance of those equity interests, and for this purpose — ( a ) a reference in those sections, Article 3A of the First Schedule and Article 2A of the Third Schedule to the grantee of a conveyance is a reference to the transferee or assignee; ( b ) a reference in those sections, Article 3A of the First Schedule and Article 2A of the Third Schedule to a grantor of a conveyance is a reference to the transferor or assignor; and ( c ) a reference in section 23 and Article 3A of the First Schedule to the date of execution of a conveyance is a reference to the date of execution of the transfer or assignment. [13/2017] (2) Sections 23 and 23A apply to a contract or agreement for the sale of equity interests in an entity as they apply to a conveyance of those equity interests, and for this purpose — ( a ) a reference in those sections, Article 3A of the First Schedule and Article 2A of the Third Schedule to a grantee of a conveyance is a reference to the purchaser; ( b ) a reference in those sections, Article 3A of the First Schedule and Article 2A of the Third Schedule to a grantor of a conveyance is a reference to the vendor; and ( c ) a reference in section 23 and Article 3A of the First Schedule to the date of execution of a conveyance is a reference to the date of execution of the contract or agreement. [13/2017] (3) Where duty A, duty B, duty C or duty D has been paid upon any contract or agreement by reason of subsection (2), the conveyance, transfer or assignment is exempt from that duty. [13/2017]"
    },
    {
      "provision_ref": "s23BA",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "23BA",
      "title": "Modification of section 23, etc., where grantee, etc., holds on trust for bare trust beneficiary",
      "content": "23BA. In sections 23, 23A and 23B, Article 3A of the First Schedule and Article 2A of the Third Schedule, in the case of an instrument executed on or after 10 May 2022 where the equity interests being conveyed, transferred, assigned or sold — ( a ) are (in the case of duty A or duty C) to be held on trust by the grantee, transferee, assignee or purchaser for a bare trust beneficiary; or ( b ) were (in the case of duty B or duty D) conveyed to the grantor, transferor, assignor or seller on or after 10 May 2022 to be held on trust by him, her or it for a bare trust beneficiary, then a reference to the grantee, transferee, assignee, purchaser, grantor, transferor, assignor or seller (as the case may be) is to the bare trust beneficiary. [Act 22 of 2022 wef 10/05/2022]"
    },
    {
      "provision_ref": "s23C",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "23C",
      "title": "Instruments effecting certain arrangements regarded as conveyances chargeable with section 23 duties, etc.",
      "content": "23C. —(1) Where — ( a ) an arrangement mentioned in subsection (3) has the effect of a person ( X ) beneficially owning equity interests, more equity interests or a higher percentage of equity interests in an entity (called in this section acquired equity interests), or a person ( Y ) beneficially owning no equity interest, less equity interests or a lower percentage of equity interests in an entity (called in this section disposed equity interests), or both; and ( b ) had the acquired equity interests been conveyed to X , or the disposed equity interests been conveyed by Y , or both (as the case may be), the conveyance would have been chargeable with duty A, duty B, duty C, duty D or ad valorem duty under Article 3( c ) of the First Schedule, or one or more of these, then the arrangement is treated as a conveyance of equity interests to X or a conveyance of equity interests by Y , or from X to Y (as the case may be). [13/2017] (2) In the case mentioned in subsection (1), duty A, duty B, duty C, duty D or ad valorem duty under Article 3( c ) of the First Schedule, or 2 or more of these (whichever is applicable), are chargeable on the following instrument as if it were such a conveyance: ( a ) any instrument that, in the Commissioner’s opinion, effects (whether directly or indirectly and whether wholly or partially) or is evidence of the arrangement; or ( b ) in the absence of any such instrument, a notice prescribed in the section 23 Order for the purposes of this paragraph. [13/2017] (3) The arrangements in subsection (1) are — ( a ) an acquisition by an entity of its equity interests; ( b ) an issue by an entity of equity interests; ( c ) a cancellation or redemption of equity interests in an entity; ( d ) the conversion of — (i) equity interests into instruments that are not equity interests; (ii) instruments that are not equity interests into equity interests; or (iii) equity interests from one class to another class; ( e ) the conversion of an entity to another type of entity; ( f ) a change of partners of a partnership, limited partnership or limited liability partnership; ( g ) an amalgamation of entities; and ( h ) any other arrangement that, in the Commissioner’s opinion, has as its purpose or one of its purposes the effect mentioned in subsection (1)( a ). [13/2017] (4) Despite subsection (2), ad valorem duty under Article 3( c ) of the First Schedule is not chargeable on an instrument under that subsection in relation to any arrangement to which section 31, 32A, 32C or 33 applies, if the instrument in relation to that arrangement is chargeable with the same duty by reason of that section. [13/2017] (5) If the Commissioner is of the opinion that the effect mentioned in subsection (1)( a ) could not reasonably have been prevented by any person who is liable (if not for this subsection) to pay any duty chargeable under subsection (2), then that duty is not chargeable on the instrument, or the amount of that duty is reduced by the amount of the duty that the person is liable to pay. [13/2017] (6) Where — ( a ) an arrangement in subsection (7) results in an entity ceasing to be a PHE; ( b ) had the entity been a PHE at the time of the execution of a conveyance, transfer or assignment of equity interests in it, or of a contract or agreement for the sale of equity interests in it, that instrument would have been chargeable with duty A or duty B, or both (as the case may be); and ( c ) the arrangement takes place at any time within such period as may be prescribed by the section 23 Order before the time of execution of that instrument, then duty A or duty B, or both (as the case may be) are chargeable on that instrument as if it were a conveyance of equity interests in a PHE. [13/2017] (7) The arrangements in subsection (6) are — ( a ) a change in the composition of the tangible assets of an entity; and ( b ) any other arrangement that, in the Commissioner’s opinion, has as its purpose or one of its purposes the effect mentioned in subsection (6)( a ). [13/2017] (8) If the Commissioner is of the opinion that the arrangement under subsection (6) was not (whether solely or partly) carried out for the purpose of avoiding the liability to pay that duty, then the instrument is not chargeable with that duty. [13/2017] (9) Sections 23, 23A and 23B also apply (with such modifications as may be prescribed in the section 23 Order) to any other instrument that, in the Commissioner’s opinion, effects (whether directly or indirectly and whether wholly or partially) or is evidence of any arrangement that the section 23 Order prescribes as an equivalent arrangement, as they apply to an instrument chargeable with duty under section 23. [13/2017] (10) The section 23 Order may prescribe, as an equivalent arrangement for the purposes of subsection (9), any arrangement the purpose or effect of which is to (directly or indirectly) — ( a ) alter the incidence of any duty which is payable or which would otherwise have been payable by any person under section 23; ( b ) relieve any person from any liability to pay such duty; or ( c ) reduce or avoid any liability imposed or which would otherwise have been imposed on any person by section 23. [13/2017] (11) In this section, “arrangement” means any scheme, trust, grant, covenant, agreement, disposition or transaction, whether or not it is or is part of a business or family dealing or is carried out for a bona fide commercial reason, and includes all steps by which it is carried into effect. [13/2017] (12) The section 23 Order may — ( a ) require a specified person to give notice in a specified form to the Commissioner of an arrangement to which subsection (1) applies; ( b ) treat the notice as an instrument for the purposes of subsection (2)( b ); ( c ) provide that any contravention of a requirement under paragraph ( a ) shall be an offence punishable with a fine of up to 4 times the amount of ad valorem duty that is chargeable on the instrument; and ( d ) exempt specified arrangements from this section. [13/2017]"
    },
    {
      "provision_ref": "s23D",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "23D",
      "title": "Power to bring sections 23 to 23C into operation",
      "content": "23D. —(1) Sections 23 to 23C only come into operation at the time and in the manner mentioned in subsection (2). [13/2017] (2) The Minister may, from time to time, by order in the Gazette , declare that sections 23 to 23C come into operation on a date specified in the order, and those sections come into operation on that date and remain in force until the section 23 Order is revoked by the Minister. [13/2017] (3) The section 23 Order must prescribe — ( a ) the holding period for the purpose of section 23(8)( b ); ( b ) the equity‑owning percentage, the voting power percentage, the Type 1 PHE percentage, the Type 2 PHE percentage, and the significant stake percentage for the purposes of section 23(11), (13) and (16); ( c ) the type of prescribed immovable property for the purposes of the definition of that term in section 23(21); ( d ) the period in section 23C(6)( c ); and ( e ) any other matter required or permitted to be prescribed by section 23 or 23C, or that are necessary or expedient for the purposes of giving effect to section 23, 23A, 23B or 23C. [13/2017] (4) The section 23 Order may specify the prescribed immovable property mentioned in subsection (3)( c ) by — ( a ) the manner it is zoned under the Master Plan; or ( b ) the purpose for which it is — (i) permitted to be used by a written permission granted under section 14(4) of the Planning Act 1998 (not being one that is granted for a period of 10 years or less); (ii) permitted to be used by a notification under section 21(6) of the Planning Act 1998; or (iii) used, in a case where the property was put to such use on 1 February 1960 and has not been put to any other use since that date, and where such use is not the subject of a written permission mentioned in sub‑paragraph (i) or a notification mentioned in sub‑paragraph (ii). [13/2017] (5) The section 23 Order may — ( a ) specify 2 or more types of prescribed immovable property under subsection (3)( c ); and ( b ) specify different holding periods for different descriptions of property‑holding entities. [13/2017] (6) The Minister may, in respect of the first section 23 Order made on or after 11 March 2017, specify in the Order a date of commencement for sections 23 to 23C that is before the date of publication of the Order in the Gazette but no earlier than 11 March 2017. [13/2017] (7) All orders made under this section are to be presented to Parliament as soon as possible after publication in the Gazette . [13/2017]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "24",
      "title": "What is deemed a conveyance, not being a sale or mortgage",
      "content": "24. —(1) Every instrument and every decree or order of any court, by which any property on any occasion, except a sale or mortgage, is transferred to or vested in any person, is chargeable as a conveyance or transfer of property. (2) To avoid doubt, every instrument filed in the land registry by a personal representative declaring himself or herself to be absolute owner of any land is chargeable as a conveyance or transfer of property. [28/2010]"
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "25",
      "title": "Leases, how to be charged in respect of produce, etc.",
      "content": "25. —(1) Where the consideration or any part of the consideration for which a lease is granted or agreed to be granted consists of any produce or other goods, the value of the produce or goods is deemed a consideration in respect of which the lease or agreement is chargeable with ad valorem duty. (2) If the rent or any other consideration payable by the lessee under a lease cannot be ascertained or estimated at the time that the lease is presented for stamping (whether because the consideration depends on some future contingency or for any other reason), the Commissioner may assess the duty payable based on the open market rent for the leased property as if the open market rent were the rate or average rate of rent per annum under the lease and there were no other consideration payable under the lease. (3) If the consideration payable by the lessee under a lease can be ascertained or estimated at the time that the lease is presented for stamping but the duty that may be charged on the instrument (whether as a lease or a conveyance on sale or both) apart from this section is less than the duty that would be payable based on the open market rent for the property, the Commissioner may assess the duty payable based on the open market rent as if the open market rent were the rate or average rate of rent per annum under the lease and there were no other consideration payable under the lease. (4) For the purposes of this section, the Commissioner may cause a valuation to be made by the Chief Valuer of any property that is the subject of a lease for the purpose of determining the open market rent for the property. (5) In this section, “open market rent” for property means the consideration (including rent, payment for the hire of any furniture, chattels, fittings or equipment or for the provision of services, facilities or other things in connection with the property, and any other form of valuable consideration) that a lessee might reasonably be expected to pay under a lease of the property, if it were unoccupied and offered for renting, expressed as a rate of rent per annum."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "26",
      "title": "Directions as to duty upon leases, etc.",
      "content": "26. —(1) A lease or an agreement for a lease or with respect to any letting is not chargeable with any duty in respect of any penal rent, or increased rent in the nature of a penal rent, thereby reserved or agreed to be reserved or made payable or by reason of being made in consideration of the surrender or abandonment of any existing lease, or agreement of or relating to the same subject matter. (2) A lease made for any consideration in respect of which it is chargeable with ad valorem duty, and in further consideration either of a covenant by the lessee to make, or of the lessee having previously made, any substantial improvement of or addition to the property demised to the lessee, or of any covenant relating to the matter of the lease, is not chargeable with any duty in respect of such further consideration, except where such further consideration consists of a covenant which if it were contained in a separate deed would be chargeable with ad valorem duty. (3) An instrument by which the rent reserved by any other instrument chargeable with duty and duly stamped as a lease is increased is not chargeable with duty otherwise than as a lease in consideration of the additional rent thereby made payable."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "27",
      "title": "Directions as to duty upon mortgages, etc.",
      "content": "27. —(1) A security for the transfer or retransfer of any stock is chargeable with the same duty as a similar security for a sum of money equal in amount to the value of the stock. (2) A transfer, assignment or disposition of any security mentioned in subsection (1) and a reconveyance, release, discharge, surrender, resurrender or renunciation of any such security is chargeable with the same duty as an instrument of the same description relating to a sum of money equal in amount to the value of the stock. (3) A security for the payment of any rentcharge, annuity or periodical payments by way of repayment, or in satisfaction or discharge of any loan, advance or payment, intended to be so repaid, satisfied or discharged, is chargeable with the same duty as a similar security for the payment of the sum of money so lent, advanced or paid. (4) A transfer of a duly stamped security, and a security by way of further charge for money or stock, added to money or stock previously secured by a duly stamped instrument, is not chargeable with any duty by reason of its containing any further or additional security for the money or stock transferred or previously secured, or the interest or dividends thereof, or any new covenant, proviso, power, stipulation or agreement in relation thereto, or any further assurance of the property comprised in the transferred or previous security. (5) An instrument chargeable with ad valorem duty as a mortgage is not chargeable with any further duty by reason of the equity of redemption in the mortgaged property being thereby conveyed or limited in any other manner than to a purchaser, or in trust for, or according to the direction of, a purchaser. 28. [ Repealed by Act 33 of 1999 ]"
    },
    {
      "provision_ref": "s29",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "29",
      "title": "Security for future advances, how to be charged",
      "content": "29. —(1) A security for the payment or repayment of money to be lent, advanced or paid, or which may become due upon an account current either with or without money previously due, is chargeable, where the total amount secured or to be ultimately recoverable is in any way limited, with the same duty as a security for the amount so limited. (2) Where such total amount is unlimited, the security is to be available for such an amount only as the ad valorem duty impressed on the security or denoted by the stamp certificate attached to the security (as the case may be) extends to cover; but where any advance or loan is made in excess of the amount covered by that duty, the security is for the purpose of stamp duty deemed to be a new and separate instrument bearing the date on the day on which the advance or loan is made. [1/2013]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "30",
      "title": "Certain mortgages of stock to be exempt from duty",
      "content": "30. —(1) Every instrument under hand only given upon the occasion of the deposit of any stock certificate to bearer, or any security for money transferable by delivery, by way of security for any loan, is exempt from duty. (2) Every instrument under hand only making redeemable or qualifying a transfer, intended as a security, of any registered stock or marketable security, is exempt from duty, and the transfer, if executed on or after 19 February 2011, is also exempt from duty. [23/2011]"
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "31",
      "title": "Conversion of firm and private company to limited liability partnership",
      "content": "31. —(1) Every notice of registration issued by the Registrar upon the conversion of a firm to a limited liability partnership under section 26 of the Limited Liability Partnerships Act 2005 is treated for the purposes of this Act as a conveyance on sale from the firm to the limited liability partnership of the chargeable property vested in the limited liability partnership upon such conversion, for a consideration equal to the value of the chargeable property so vested. (2) Every notice of registration issued by the Registrar upon the conversion of a private company to a limited liability partnership under section 27 of the Limited Liability Partnerships Act 2005 is treated for the purposes of this Act as a conveyance on sale from the private company to the limited liability partnership of the chargeable property vested in the limited liability partnership upon such conversion, for a consideration equal to the value of the chargeable property so vested. (3) In this section — “chargeable property” means — ( a ) immovable property situated in Singapore, or any beneficial interest in the immovable property; and ( b ) stocks and shares registered in a register kept in Singapore, or any beneficial interest in the stocks and shares, other than stocks and shares deposited with and registered in the name of the Central Depository System established under section 81SH of the Securities and Futures Act 2001 or its nominee; “firm” has the meaning given by section 2(1) of the Business Names Registration Act 2014; “private company” has the meaning given by section 4(1) of the Companies Act 1967; “Registrar” has the meaning given by the Limited Liability Partnerships Act 2005. [29/2014; 35/2014]"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "32",
      "title": "Significant change of partners of limited liability partnership",
      "content": "32. —(1) This section applies for the purposes of sections 32A and 32B in determining whether a change of partners of a limited liability partnership as a result of — ( a ) any person becoming a partner of the limited liability partnership; or ( b ) any person ceasing to be a partner of the limited liability partnership, (called in this section and sections 32A and 32B a change of partners) amounts to a significant change of partners of the limited liability partnership (called in this section and sections 32A and 32B a significant change of partners). (2) A change of partners amounts to a significant change of partners in either of the following cases: ( a ) where the composition of the partners of the limited liability partnership upon the change of partners in question is such that, when compared to the composition of the partners of the limited liability partnership on one or more specified dates (as defined in subsection (3)) — (i) half or more of the partners of the limited liability partnership on any of those specified dates are no longer partners of the limited liability partnership upon the change of partners in question; or (ii) half or more of the partners upon the change of partners in question were not partners of the limited liability partnership on any of those specified dates; ( b ) where the asset share of the partners of the limited liability partnership upon the change of partners in question is such that, when compared to the asset share of the partners of the limited liability partnership on one or more specified dates, the sum of all relevant increases in asset share of the partners of the limited liability partnership upon the change of partners in question amounts to 50% or more of the interest in the limited liability partnership. (3) In subsection (2), “specified date” means — ( a ) where one or more significant changes of partners took place within a period of 2 years before the change of partners in question — (i) the date of any change of partners that took place between the significant change of partners closest in time to the change of partners in question and the change of partners in question; and (ii) the date of the significant change of partners closest in time to the change of partners in question; and ( b ) where no significant change of partners took place within a period of 2 years before the change of partners in question — (i) in the case of a limited liability partnership formed 2 or more years before the change of partners in question — (A) the date of any change of partners that took place within the period of 2 years before the change of partners in question; and (B) as at 2 years before the change of partners in question; and (ii) in the case of a limited liability partnership formed less than 2 years before the change of partners in question — (A) the date of any change of partners that took place between the formation of the limited liability partnership and the change of partners in question; and (B) the date of the formation of the limited liability partnership. (4) For the purpose of subsection (2)( b ), the relevant increase in asset share of a partner of a limited liability partnership is — ( a ) where the partner upon the change of partners in question was also a partner of a limited liability partnership on the specified date, the difference between the asset share of the partner upon the change of partners in question and the asset share of the partner on the specified date; and ( b ) where the partner upon the change of partners in question was not a partner of the limited liability partnership on the specified date, the asset share of the partner upon the change of partners in question. (5) In this section, “asset share”, in relation to a partner of a limited liability partnership, means any of the following: ( a ) in the case of an asset share upon a change of partners (whether significant or otherwise) — (i) the proportion of the chargeable property held by the limited liability partnership that the partner is entitled to on the winding up of the limited liability partnership, as specified in any instrument effecting or evidencing the change of partners; or (ii) if any instrument effecting or evidencing a change of partners does not specify the proportion mentioned in sub‑paragraph (i) or if there is no such instrument, the proportion of the profits of the limited liability partnership that the partner is entitled to on the date of the change of partners; ( b ) in the case of an asset share upon the formation of the limited liability partnership — (i) the proportion of the chargeable property held by the limited liability partnership that the partner is entitled to on the winding up of the limited liability partnership, as specified in any instrument evidencing the formation of the limited liability partnership; or (ii) if any instrument evidencing the formation of the limited liability partnership does not specify the proportion mentioned in sub‑paragraph (i) or if there is no such instrument, the proportion of the profits of the limited liability partnership that the partner is entitled to upon the formation of the limited liability partnership; ( c ) in the case of an asset share on any other date — (i) the proportion of the chargeable property held by the limited liability partnership that the partner is entitled to on the winding up of the limited liability partnership, as specified in — (A) where one or more changes of partners took place before that date, any instrument effecting or evidencing the change of partners closest in time to that date; and (B) where no change of partners took place before that date, any instrument evidencing the formation of the limited liability partnership; or (ii) if any instrument effecting or evidencing the change of partners or the formation of the limited liability partnership (as the case may be) does not specify the proportion mentioned in sub‑paragraph (i) or if there is no such instrument, the proportion of the profits of the limited liability partnership that the partner is entitled to on that date."
    },
    {
      "provision_ref": "s32A",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "32A",
      "title": "Transfer of interest in limited liability partnership",
      "content": "32A. —(1) This section applies to any limited liability partnership holding any chargeable property. (2) Where a change of partners amounts to a significant change of partners, every one of the following partners (called in this section a designated partner) must notify the Commissioner of the change of partners in question in such form as the Commissioner may require within 14 days of the change of partners in question: ( a ) every person who, not being a partner of the limited liability partnership before the change of partners in question, becomes a partner of the limited liability partnership upon the change of partners in question; ( b ) every partner of the limited liability partnership whose asset share upon the change of partners in question has increased when compared with the partner’s asset share on any of the following dates: (i) upon an earlier change of partners — (A) which is closest in time to the change of partners in question; and (B) in which the composition of the partners or asset share of the partners of the limited liability partnership, when compared to the composition of the partners or asset share of the partners upon the change of partners in question, results in the change of partners in question amounting to a significant change of partners under section 32; (ii) where there is no such earlier change of partners — (A) in the case of a limited liability partnership formed 2 or more years before the change of partners in question, as at 2 years before the change of partners in question; and (B) in the case of a limited liability partnership formed less than 2 years before the change of partners in question, upon the formation of the limited liability partnership. (3) Any person who fails or neglects without reasonable excuse to comply with subsection (2) shall be guilty of an offence. (4) Any instrument effecting or evidencing a significant change of partners of a limited liability partnership is treated for the purposes of this Act as a conveyance on sale from the limited liability partnership to each designated partner of an interest in the chargeable property held by the limited liability partnership for a consideration equal to the value of the interest as determined under subsection (6) or (7). (5) Where any significant change of partners of a limited liability partnership is not effected or evidenced by any instrument, the notification to the Commissioner made under subsection (2) is treated for the purposes of this Act as such an instrument. (6) Subject to subsection (7), for the purpose of subsection (4), the value of the interest, in relation to any designated partner, is an amount ascertained in accordance with the formula — ( a ) in the case of a person who is a designated partner mentioned in subsection (2)( a ), A &#215; B, where — (i) A is the asset share of the person upon the person becoming a designated partner; and (ii) B is the value of the chargeable property held by the limited liability partnership upon the person becoming a designated partner; and ( b ) in the case of a person who is a designated partner mentioned in subsection (2)( b ), (C ‑ D) &#215; E, where — (i) C is the asset share of the designated partner upon the significant change of partners in question; (ii) D is — (A) the asset share of the designated partner upon a significant change of partners closest in time to the significant change of partners in question; and (B) if there is no such significant change of partners, the asset share of the designated partner upon the formation of the limited liability partnership; and (iii) E is the value of the chargeable property held by the limited liability partnership upon the significant change of partners in question. (7) Despite subsection (6), where there is any instrument mentioned in subsection (4) which states the amount of the consideration specifically for the transfer of the interest in the chargeable property of the limited liability partnership to the designated partner, the value of the interest for the purpose of subsection (4) is the amount stated in the instrument or the amount ascertained under subsection (6), whichever is the higher. (8) In this section — “asset share” has the meaning given by section 32(5); “chargeable property” has the meaning given by section 31(3)."
    },
    {
      "provision_ref": "s32B",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "32B",
      "title": "Conveyance between limited liability partnership and partner",
      "content": "32B. —(1) Subject to subsection (3), the ad valorem stamp duty chargeable on any instrument made for the purposes of or in connection with the transfer, conveyance or assignment of any beneficial interest in any asset — ( a ) by a limited liability partnership to a partner thereof; ( b ) by a partner of a limited liability partnership to the limited liability partnership; or ( c ) by a person who becomes a partner of a limited liability partnership to the limited liability partnership, is reduced by the proportion determined in accordance with subsection (2). (2) The proportion by which the ad valorem stamp duty is reduced under subsection (1) is the same proportion as the following: ( a ) in the case of a transfer, a conveyance or an assignment of any beneficial interest in any asset between a limited liability partnership and a partner thereof — (i) where one or more significant changes of partners took place before the transfer, conveyance or assignment, the asset share of the partner upon the significant change of partners closest in time to the transfer, conveyance or assignment; or (ii) where no significant change of partners took place before the transfer, conveyance or assignment, the asset share of the partner upon the formation of the limited liability partnership; ( b ) in the case of a transfer, a conveyance or an assignment of any beneficial interest in any asset between a limited liability partnership and a person becoming a partner thereof, the asset share of that person upon the person becoming a partner thereof. (3) Despite subsection (1), the minimum ad valorem stamp duty chargeable on any instrument made for the purposes of or in connection with the transfer, conveyance or assignment of any beneficial interest in any asset mentioned in that subsection is $10. (4) In this section, “asset share” has the meaning given by section 32(5)."
    },
    {
      "provision_ref": "s32C",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "32C",
      "title": "Amalgamation of companies under sections 215A to 215H of Companies Act 1967",
      "content": "32C. —(1) This section applies to an amalgamation of companies in accordance with sections 215A to 215H of the Companies Act 1967, where applicable. (2) Every notice of amalgamation issued by the Registrar of Companies under section 215F of the Companies Act 1967 upon an amalgamation mentioned in subsection (1) is treated for the purposes of this Act as a conveyance on sale — ( a ) by each amalgamating company (called in this section the transferor) in respect of the chargeable property held by that transferor which is transferred to and vested in the amalgamated company (called in this section the transferee) upon the amalgamation; and ( b ) for a consideration equal to the higher of the following: (i) the value of the chargeable property so vested; (ii) where the amount of consideration is specified in any instrument relating to the transfer of the chargeable property by the transferor to, and the vesting of the chargeable property in, the transferee, that amount. (3) In this section, “chargeable property” means — ( a ) immovable property situated in Singapore, or any beneficial interest in the immovable property; and ( b ) stocks and shares registered in a register kept in Singapore, or any beneficial interest in the stocks and shares, other than stocks and shares deposited with and registered in the name of the Central Depository System established under section 81SH of the Securities and Futures Act 2001 or its nominee. [35/2014]"
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "33",
      "title": "Directions as to disposal of shares in certain circumstances",
      "content": "33. —(1) Subject to subsection (2), where a disposal of shares in a company by a transferor to a transferee is effected by — ( a ) the cancellation of the shares of the transferor in the company; and ( b ) the issue of new shares in that company to the transferee, such disposal of shares is treated as a transfer of shares from the transferor directly to the transferee and ad valorem duty is chargeable on any instrument that, in the Commissioner’s opinion, effects, whether directly or indirectly and whether wholly or partially, any arrangement for the disposal of the shares. [35/2014] (2) Subsection (1) does not apply to a disposal of shares made for the purpose of effecting an amalgamation of companies under section 215D of the Companies Act 1967. [35/2014]"
    },
    {
      "provision_ref": "s33A",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "33A",
      "title": "Commissioner to disregard certain transactions and dispositions",
      "content": "33A. —(1) Subsection (2) applies where the Commissioner is satisfied that the purpose or effect of any arrangement is, directly or indirectly — ( a ) to alter the incidence of any duty that is payable or that would otherwise have been payable by any person; ( b ) to relieve any person from any liability to pay duty; or ( c ) to reduce or avoid any liability imposed or that would otherwise have been imposed on any person by this Act. [41/2020] (2) Without affecting any validity the arrangement may have in any other respect or for any other purpose, the Commissioner must disregard or vary the arrangement and make any adjustment that the Commissioner considers appropriate, including the amount of duty payable, or the imposition of liability to duty, so as to counteract any reduction in or avoidance of duty payable by that person from or under that arrangement. [41/2020] (3) In this section, “arrangement” means any scheme, trust, grant, covenant, agreement, disposition, transaction and includes all steps by which it is carried into effect. [41/2020] (4) This section applies to any arrangement made or entered into before, on or after 7 December 2020, but not one made or entered into before 1 September 1999. [41/2020] (5) This section does not apply to any arrangement carried out for bona fide commercial reasons and had not as one of its main purposes the avoidance or reduction of duty. [41/2020]"
    },
    {
      "provision_ref": "s33B",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "33B",
      "title": "Surcharge on adjustments under section 33A",
      "content": "33B. —(1) This section applies to any instrument, or any thing treated as an instrument, that is executed or treated as executed on or after 7 December 2020. [41/2020] (2) Where the Commissioner makes any adjustment under section 33A, a surcharge equal to 50% of the amount of — ( a ) the additional duty payable by a person; or ( b ) (where a liability to duty is imposed) the duty payable by a person, as a result of the adjustment is imposed on the person, and is recoverable by the Commissioner from the person as a debt due to the Government. [41/2020]"
    },
    {
      "provision_ref": "s33C",
      "chapter": "PART 3 - PROVISIONS APPLICABLE TO PARTICULAR INSTRUMENTS",
      "section": "33C",
      "title": "Payment, collection and recovery of duty and surcharge imposed under sections 33A and 33B and remission of surcharge, etc.",
      "content": "33C. —(1) Despite any objection under section 39A to an adjustment under section 33A or an appeal against it under section 40 — ( a ) the duty or additional duty resulting from the adjustment; and ( b ) the surcharge, (collectively called the amounts due) must be paid — ( c ) within one month after the date of the notice of the amounts due from the Commissioner to the person liable for the amounts due; and ( d ) in the manner stated in the notice. [41/2020] (2) The Commissioner may, in the Commissioner’s discretion and subject to any term and condition (including the imposition of interest) as the Commissioner may impose, extend the time specified in subsection (1) within which payment is to be made. [41/2020] (3) If any part of the amounts due and any interest imposed under subsection (2) is not paid within the period specified in subsection (1) or extended under subsection (2), the person is liable to pay the following penalties: ( a ) where the outstanding amount is paid to the Commissioner within 3 months after the date of expiry of such period — a penalty of $10 or the outstanding amount, whichever is the greater; ( b ) where the outstanding amount is not paid to the Commissioner within 3 months after the date of expiry of such period — a penalty of $25 or 4 times the outstanding amount, whichever is the greater. [41/2020] (4) Sections 50 and 70AA apply to the collection and recovery by the Commissioner of the amounts due, interest imposed under subsection (2) and any penalty imposed under subsection (3) as they apply to the collection and recovery of duty and penalty required to be paid under this Act. [41/2020] (5) The Commissioner may, for good cause, remit wholly or in part the surcharge imposed under section 33B(2) or penalty imposed under subsection (3). [41/2020] (6) If, upon an objection under section 39A or an appeal under section 40, an adjustment made under section 33A is increased, reduced or annulled, then the surcharge is correspondingly increased, reduced or annulled (as the case may be), and — ( a ) if the amounts due are increased, subsections (1) to (5) apply to the increased amounts as they apply to the amounts due; or ( b ) if the amounts due are reduced or annulled and they or any part of them have already been paid to the Commissioner, the amount of the reduction or the entire amount (including any interest paid on the amount) must be refunded. [41/2020]"
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 4 - LIABILITY FOR PAYMENT OF DUTY",
      "section": "34",
      "title": "Duty by whom payable",
      "content": "34. In the absence of an agreement to the contrary, the expense of providing the proper stamp duty is to be borne — ( a ) in the case of the instruments described in the second column of the Third Schedule, by the person mentioned in the third column of that Schedule; and ( b ) in the case of every other instrument, by the person drawing, making or executing the instrument. 35. [ Repealed by Act 26 of 1996 ]"
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 4 - LIABILITY FOR PAYMENT OF DUTY",
      "section": "36",
      "title": "Exemptions",
      "content": "36. No duty is chargeable in respect of — ( a ) any instrument executed by or on behalf of or in favour of the Government in cases where, but for this exemption, the Government would be liable under section 34 to pay the duty chargeable in respect of that instrument; ( b ) any instrument for the sale, transfer, lease or other disposition, either absolutely or by way of mortgage or otherwise, of land situated outside Singapore or any share, estate or interest in land situated outside Singapore; ( c ) any instrument which relates exclusively to things to be done outside Singapore; ( d ) any instrument for the transfer on sale or transfer by way of gift of any stock issued by or on behalf of any government or State, other than the Government of Singapore, or of any stock issued by or on behalf of any corporation, company, or body of persons incorporated, formed or established outside Singapore, except stock registered in a register kept in Singapore; ( e ) any instrument executed by or on behalf of or in favour of a co‑operative society registered under the Co‑operative Societies Act 1979 or executed by an officer or a member of any such co‑operative society and relating solely to the business of the co‑operative society where, but for this exemption, the co‑operative society would be liable under section 34 to pay the duty chargeable on that instrument; ( f ) any instrument by which any security is assigned, transferred or negotiated to the Monetary Authority of Singapore (whether on sale or otherwise) under the Exchange Control Act 1953; ( g ) any instrument made by the Collector of Land Revenue under the Land Acquisition Act 1966; ( h ) any deed, conveyance, assignment or other assurance which relates solely to immovable property or to any mortgage, charge or other encumbrances on, or any estate, right or interest in, any immovable property or stock or shares which are part of the estate of any bankrupt (including any debtor proceeded against under the Insolvency, Restructuring and Dissolution Act 2018), and which, after the execution of the instrument, either at law or in equity, is or remains the estate of the bankrupt (including any debtor proceeded against under that Act) or of the Official Assignee, and any bond or other instrument relating solely to the property of any bankrupt; and ( i ) any instrument of transfer lodged under section 125 or 126 of the Land Titles (Strata) Act 1967. [40/2018; 4/2021]"
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 5 - ADJUDICATION, OBJECTION AND APPEAL",
      "section": "37",
      "title": "Mode of adjudication as to proper stamp duty",
      "content": "37. —(1) Where — ( a ) any instrument (whether executed or not and whether previously stamped or not) is brought to the Commissioner; or ( b ) a copy of any instrument (whether executed or not and whether previously stamped or not) is sent to the Commissioner using the E‑Stamping system or other means approved by the Commissioner, and the person bringing or sending it applies to the Commissioner for adjudication on whether the instrument is chargeable with duty and (if so) the amount chargeable, the Commissioner must adjudicate and assess the duty with which, in the Commissioner’s judgment, the instrument is chargeable. [37/2018] (2) Where the person seeks the Commissioner’s opinion under subsection (1) as to the amount of duty chargeable, the person must in making the application for adjudication set out the value upon which in the person’s opinion duty is chargeable. (3) The person seeking the Commissioner’s opinion under subsection (1) as to the amount of duty chargeable must pay the relevant adjudication fee prescribed in the Fourth Schedule at such time as the Commissioner may determine, and such fee remains payable even if the person subsequently withdraws the application for adjudication. (4) For the purpose of the adjudication under subsection (1), the Commissioner may require any of the following: ( a ) an abstract of the instrument; ( b ) an affidavit setting out all the facts and circumstances affecting the liability of the instrument to duty or the amount of such duty; ( c ) any other evidence which the Commissioner considers necessary for the adjudication or determination of duty. (5) The Commissioner may refuse to proceed upon any application under subsection (1) until such abstract and evidence mentioned in subsection (4) have been furnished accordingly. (6) Despite any other provisions of this section, the Commissioner may himself or herself require in the case of a conveyance, lease, assignment or transfer of immovable property a certificate of the value of such property from the Chief Valuer. (7) The request for a certificate from the Chief Valuer must be made to the Chief Valuer directly by the Commissioner but the Commissioner is entitled (in addition to the fee payable under subsection (1)) to charge the person seeking the adjudication of such property or regarding whose property the Commissioner requires a certificate, a fee as specified in the Fifth Schedule. (8) Evidence furnished under this section must not be used against any person in any civil proceedings, except in an inquiry as to the duty with which the instrument to which it relates is chargeable."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 5 - ADJUDICATION, OBJECTION AND APPEAL",
      "section": "38",
      "title": "Certificate of adjudication by Commissioner",
      "content": "38. —(1) When an instrument brought to, or a copy of which sent to, the Commissioner under section 37 is in the Commissioner’s opinion one of a description chargeable with duty, and — ( a ) the Commissioner determines that the instrument is already fully stamped; or ( b ) the duty assessed by the Commissioner under section 37, or such a sum as, with the duty already paid in respect of the instrument, is equal to the duty so assessed, has been paid, the Commissioner must certify by issuing and attaching to the instrument a certificate of adjudication, stating that the full duty, with which it is chargeable, has been paid. [37/2018] (2) Subject to subsection (3), when the instrument is in the Commissioner’s opinion not chargeable with duty or with full duty, the Commissioner must certify in the manner mentioned in subsection (1) that the instrument is not so chargeable. [28/2010] (3) Where the instrument is one mentioned in section 15A(1), the Commissioner may base his or her opinion on a statutory declaration in such form as he or she may direct, made by or on behalf of the target company, the acquiring company or the acquiring subsidiary, or all of them, mentioned in that provision, and such further evidence as the Commissioner considers necessary. [28/2010] (4) Any instrument in respect of and to which a certificate of adjudication has been issued and attached under this section is deemed to be duly stamped or not chargeable with duty (as the case may be); and, if chargeable with duty, is receivable in evidence or otherwise and may be acted upon and registered as if that instrument had been originally duly stamped. (5) Nothing in this section is deemed to require the Commissioner to certify that the full duty with which an instrument is chargeable has been paid — ( a ) unless any penalty chargeable in respect of the instrument under this Act has been paid; or ( b ) if the instrument cannot by law be stamped."
    },
    {
      "provision_ref": "s39",
      "chapter": "PART 5 - ADJUDICATION, OBJECTION AND APPEAL",
      "section": "39",
      "title": "Exception to sections 37 and 38",
      "content": "39. Nothing in sections 37 and 38 extends to any instrument chargeable with ad valorem duty and made as a security for money or stock without limit."
    },
    {
      "provision_ref": "s39A",
      "chapter": "PART 5 - ADJUDICATION, OBJECTION AND APPEAL",
      "section": "39A",
      "title": "Notice of objection",
      "content": "39A. —(1) Any person who is dissatisfied with an assessment of the Commissioner under any provision of this Act may, by written notice (called in this Act a notice of objection), object to the assessment and apply to the Commissioner to review the assessment. (2) Every notice of objection must state the grounds of objection to the Commissioner’s assessment and must be made within 30 days after the date of the assessment or such further period as the Commissioner may allow in any particular case. (3) The person giving a notice of objection must furnish further particulars and information in relation to the grounds of the objection if required to do so by the Commissioner in writing. (4) The Commissioner must, on receipt of a notice of objection and such further particulars and information as the Commissioner may require under subsection (3), review the assessment. (5) As soon as practicable after the objection is determined, the Commissioner must inform the person concerned in writing of the Commissioner’s decision on the objection and the reasons for his or her decision. (6) Where, on review, it appears to the Commissioner that the amount of duty originally assessed is excessive, the Commissioner may cancel the original assessment and make such other assessment in substitution of the original assessment as he or she considers proper. (7) The Commissioner must serve a notice of amended assessment on the person concerned of the assessment substituted in accordance with subsection (6). (8) The making of an objection does not relieve the person of liability to pay the duty or surcharge on the duty (if applicable) as required by this Act. [41/2020] (9) Any reference in this Act to an assessment includes a substituted assessment under subsection (6) and an adjustment under section 33A. [41/2020]"
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 5 - ADJUDICATION, OBJECTION AND APPEAL",
      "section": "40",
      "title": "Appeal to General Division of High Court",
      "content": "40. —(1) Any person who is dissatisfied with the Commissioner’s decision under section 39A(5) on a notice of objection may — ( a ) within 30 days after the person is informed of that decision and upon payment of duty, and surcharge (if applicable), in conformity with that decision, appeal against the decision to the General Division of the High Court; and ( b ) for that purpose, require the Commissioner to state and sign a case, setting out the question upon which the Commissioner’s opinion was required, and the decision made by the Commissioner. [1/2013; 40/2019;41/2020] (2) Any appeal under subsection (1) is not effective unless written notice of the appeal is served on the Commissioner within 30 days of the person being informed of the Commissioner’s decision under section 39A(5) on the notice of objection. [1/2013] (3) The Commissioner must thereupon state and sign a case and deliver it to the person by whom it is required, and the case may, within 7 days thereafter, be set down by that person for hearing. (4) Upon hearing the case, the General Division of the High Court is to determine the question submitted and — ( a ) in the case of a decision on a notice of objection to an adjustment under section 33A — if the General Division of the High Court is of the opinion that the purpose or effect of the arrangement in question is that specified in section 33A(1), and section 33A(5) does not apply, the General Division of the High Court is to either confirm or vary the adjustment; and ( b ) in any other case — if the General Division of the High Court is of the opinion that the instrument in question is chargeable with duty, the General Division of the High Court is to assess the duty with which it is chargeable. [40/2019; 41/2020] (5) If it is decided by the General Division of the High Court that the Commissioner’s decision is erroneous, any excess of duty which may have been paid in conformity with the erroneous decision, together with any interest, surcharge, fine or penalty which may have been paid in consequence of the erroneous decision, is to be ordered by the General Division of the High Court to be repaid to the appellant, with or without costs as the General Division of the High Court may determine. [40/2019; 41/2020] (6) If the Commissioner’s decision is confirmed, the General Division of the High Court may make an order for payment to the Commissioner of the costs incurred by the Commissioner in relation to the appeal. [40/2019] (7) In this section — “arrangement” has the meaning given by section 33A(3); “surcharge” means a surcharge imposed under section 33B. [41/2020]"
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 5 - ADJUDICATION, OBJECTION AND APPEAL",
      "section": "41",
      "title": "Stamping after adjudication",
      "content": "41. When the Commissioner’s opinion with respect to the amount of duty with which an instrument is chargeable has been obtained, the instrument must be stamped in accordance with the assessment of the Commissioner within 14 days after notice of the assessment, and in the case of an application to the General Division of the High Court under section 40 within 14 days after the issue of the order of the General Division of the High Court, or within such further period, in either case, as the Commissioner when giving notice of assessment or the General Division of the High Court when making the order, may specify. [40/2019]"
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "42",
      "title": "Instruments executed in Singapore",
      "content": "42. Except where express provision to the contrary is made in this Act, all instruments chargeable with duty and executed by any person in Singapore must be stamped before being executed."
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "43",
      "title": "Instruments executed outside Singapore",
      "content": "43. Every instrument chargeable with duty executed only outside Singapore may be stamped within 30 days after it has first been received in Singapore. 44. [ Repealed by Act 26 of 1996 ]"
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "45",
      "title": "Transfers of shares",
      "content": "45. —(1) Transfers of shares must not be stamped until the numbers of the shares are entered. (2) The Commissioner may, if he or she is satisfied that the numbers of the shares cannot be obtained or cannot be obtained without undue delay and expense, permit a transfer of shares to be stamped although the numbers of the shares are not entered on the transfer."
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "46",
      "title": "Stamping of instruments after execution",
      "content": "46. —(1) Except where other express provision is made by this Act or any other Act, any unstamped or insufficiently stamped instrument may be stamped after the first execution of the instrument, subject to the following: ( a ) where the instrument drawn or made within Singapore, is stamped within 14 days after it has been first executed in Singapore or, if first executed outside Singapore, within 30 days after it has been first received in Singapore, on payment of the duty only; ( b ) when the instrument is stamped within 3 months after such execution or receipt as mentioned in paragraph ( a ), on payment in addition to the stamp duty of a penalty of $10 or of the amount of deficient duty, whichever penalty is the greater; ( c ) when the instrument is not stamped within 3 months after such execution or receipt as mentioned in paragraph ( a ), on payment in addition to the stamp duty of a penalty of $25 or 4 times the amount of deficient duty, whichever penalty is the greater. (2) The Commissioner may reduce or remit any penalty imposed under this section. [28/2010] (3) For the purposes of this section, an instrument is deemed to be unstamped or insufficiently stamped even though a stamp certificate is attached to the instrument if, by reason of the circumstances mentioned in section 6D(3), the duty chargeable on the instrument was not deducted by the Commissioner from the designated account of a person. [37/2018]"
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "47",
      "title": "Period of time for stamping to start on day after execution",
      "content": "47. Where it is provided in this Act that an instrument is to be stamped within a certain period of time after execution, such period is reckoned as starting on the day after the execution of the instrument by the person who first executed the instrument, unless otherwise stated in this Act."
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "48",
      "title": "Denoting penalty",
      "content": "48. The payment of any penalty prescribed under section 46 must be denoted — ( a ) by a receipt issued by the Commissioner; or ( b ) by notation on the stamp certificate relating to the instrument. [1/2013]"
    },
    {
      "provision_ref": "s49",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "49",
      "title": "Persons liable to penalty",
      "content": "49. The person liable to any penalty under section 46 is the person by whom the duty is payable in accordance with Part 4."
    },
    {
      "provision_ref": "s50",
      "chapter": "PART 6 - TIME OF STAMPING INSTRUMENTS",
      "section": "50",
      "title": "Suit for recovery of duty, etc., by Commissioner",
      "content": "50. —(1) Despite the provisions of any other written law, all duty and penalty required to be paid under this Act may be sued for by way of a specially endorsed originating claim. [Act 25 of 2021 wef 01/04/2022] (2) The Commissioner may, in his or her own name, sue for any such duty or penalty and is entitled to all costs allowed by law against the person liable thereto. (3) The Commissioner may appear personally or by counsel in any suit instituted under this section. (4) In any suit under this section, the production of a certificate signed by the Commissioner giving the name and address of the defendant and the amount of duty or penalty due by the defendant is sufficient evidence of the amount so due and sufficient authority for the court to give judgment for that amount. (5) Any penalty required to be paid under this Act is recoverable as if it were duty due and payable under this Act and accordingly, section 6(4) of the Limitation Act 1959 does not apply to such penalty."
    },
    {
      "provision_ref": "s51",
      "chapter": "PART 7 - INSTRUMENTS NOT DULY STAMPED",
      "section": "51",
      "title": "Examination and impounding of instruments",
      "content": "51. —(1) Every person having by law or consent of parties authority to receive evidence, and every public officer or officer of a statutory body, before whom any instrument, chargeable in his or her opinion with duty, is produced or comes in the performance of his or her functions, must, if it appears to him or her that such instrument is not duly stamped, impound the same. [23/2011] (2) For the purpose of subsection (1), every such person must examine every instrument so chargeable and so produced or coming before the person in order to ascertain whether it is stamped with a stamp of the value and description required by the law in force in Singapore when such instrument was executed or first executed. (3) Subsection (1) does not apply to — ( a ) a police officer; or ( b ) such other public officer or officer of a statutory body as the Minister may by order in the Gazette exempt from that subsection. [23/2011] (4) Nothing in this section is deemed to require any Magistrate or Judge of a criminal court to examine or impound, if he or she does not think fit to do so, any instrument coming before him or her in the course of any criminal proceeding. (5) In the case of a Supreme Court Judge, the duty of examining and impounding any instrument under this section is to be performed by the Registrar or Deputy Registrar. [40/2019]"
    },
    {
      "provision_ref": "s52",
      "chapter": "PART 7 - INSTRUMENTS NOT DULY STAMPED",
      "section": "52",
      "title": "Instruments not duly stamped inadmissible in evidence",
      "content": "52. —(1) Subject to this section, an instrument chargeable with duty must not be admitted in evidence for any purpose by any person having by law or consent of parties authority to receive evidence, and must not be acted upon, registered or authenticated by any such person or by any public officer, unless the instrument is duly stamped. (2) Any instrument mentioned in subsection (1) must, subject to all just exceptions, be admitted in evidence on payment of the duty and the penalty (if any) chargeable in respect of that instrument under section 46. (3) When a contract or agreement of any kind is effected by correspondence consisting of 2 or more letters and any one of the letters bears the proper stamp, the contract or agreement is deemed to be duly stamped. (4) Nothing in this section prevents the admission of any instrument in evidence — ( a ) in any criminal court; or ( b ) in any court when the instrument has been executed by or on behalf of the Government, or of any other government or country, or where it bears the certificate of the Commissioner as provided by this Act."
    },
    {
      "provision_ref": "s53",
      "chapter": "PART 7 - INSTRUMENTS NOT DULY STAMPED",
      "section": "53",
      "title": "Instruments impounded how dealt with",
      "content": "53. —(1) When the person impounding an instrument under section 51 has by law or consent of parties authority to receive evidence and admits the instrument in evidence on payment of duty and penalty (if any), the person must, as soon as may be convenient, send the instrument, together with the amount of the duty and penalty (if any) paid in respect of the instrument, to the Commissioner. (2) The Commissioner must stamp the instrument in accordance with section 46 and must return it to the person who sent it to the Commissioner. (3) In every other case in which an instrument is impounded under section 51, the person impounding the instrument must send it immediately to the Commissioner. (4) The Commissioner, on payment of the duty and penalty (if any) chargeable in respect of the instrument under section 46, must stamp the instrument and must return it to the person who sent it to the Commissioner, but if such duty and penalty (if any) is not paid, the Commissioner must retain the instrument. 54. [ Repealed by Act 26 of 1996 ]"
    },
    {
      "provision_ref": "s55",
      "chapter": "PART 7 - INSTRUMENTS NOT DULY STAMPED",
      "section": "55",
      "title": "Recovery of duty and penalty",
      "content": "55. —(1) When any duty or penalty has been paid in respect of any instrument by any person ( X ), and by agreement or under the provisions of this Act or of any other law in force at the time when the instrument was executed or first executed some other person ( Y ) was liable to pay the duty on the instrument, X is entitled to recover from Y the amount of the duty or penalty so paid. (2) For the purpose of any recovery mentioned in subsection (1), any certificate granted in respect of the instrument by the Commissioner is conclusive evidence as to the amount of the duty and penalty paid and the person by whom they were paid."
    },
    {
      "provision_ref": "s56",
      "chapter": "PART 7 - INSTRUMENTS NOT DULY STAMPED",
      "section": "56",
      "title": "Liability of any person to pay full duty or penalty unaffected by erroneous assessment",
      "content": "56. The liability of any person to pay the full amount of duty or penalty due on any instrument is not affected by any erroneous or under assessment of that duty or penalty or the failure to assess that duty or penalty by the Commissioner, and the correct amount of duty or penalty due on the instrument is recoverable by the Commissioner."
    },
    {
      "provision_ref": "s57",
      "chapter": "PART 8 - ALLOWANCE FOR DUTY PAID OR OVERPAID",
      "section": "57",
      "title": "Allowance for duty paid for certain instruments",
      "content": "57. —(1) Subject to the conditions specified in subsection (2) and to such rules as the Minister may make and to the production of such evidence by statutory declaration or otherwise as the Commissioner may require, allowance is to be made by the Commissioner for the duty paid in respect of any of the following instruments: ( a ) an instrument executed by any party thereto, but afterwards found to be absolutely void from the beginning; ( b ) an instrument executed by any party thereto, but afterwards found unfit, by reason of any error or mistake in the instrument, for the purpose originally intended; ( c ) an instrument executed by any party thereto, which has not been made use of for any purpose whatever, and which by reason of the inability or refusal of some necessary party to sign the instrument or to complete the transaction according to the instrument is incomplete and insufficient for the purpose for which it was intended; ( d ) an instrument executed by any party thereto, which by reason of the inability or refusal of any person to act under the instrument, or for want of registration within the time required by law, fails of the intended purpose or becomes void; ( e ) an instrument executed by any party thereto, which is inadvertently and undesignedly spoiled, and in lieu of which another instrument made between the same parties and for the same purpose is executed and duly stamped, or which becomes useless in consequence of the transaction intended to be thereby effected being effected by some other instrument duly stamped. [1/2013] (2) The conditions mentioned in subsection (1) are — ( a ) the application for allowance is made within 6 months after the date of the stamp or in the case of an executed instrument after the date of the instrument or if it is not dated within 6 months after the execution thereof by the person by whom it was first or alone executed or within such further time as the Commissioner may prescribe in the case of any instrument sent abroad for execution or when from unavoidable circumstances any instrument for which another has been substituted cannot be produced within that period; and ( b ) in the case of an executed instrument no legal proceeding has been commenced in which the instrument could or would have been given or offered in evidence, and that the instrument is surrendered to the Commissioner, unless the Commissioner dispenses with such surrender in a particular case. [1/2013; 30/2014]"
    },
    {
      "provision_ref": "s58",
      "chapter": "PART 8 - ALLOWANCE FOR DUTY PAID OR OVERPAID",
      "section": "58",
      "title": "Allowance for duty paid or overpaid",
      "content": "58. —(1) When any person — ( a ) has inadvertently paid duty of a greater value than was necessary; or ( b ) has inadvertently paid duty in respect of an instrument not liable to any duty, and has been issued with a stamp certificate denoting the duty so paid in respect of the instrument, the Commissioner may — ( c ) on an application made within 6 months after the date of the instrument; or ( d ) if the instrument is not dated, on an application made within 6 months after the execution of the instrument by the person by whom it was first or alone executed, and upon the instrument, if liable to duty, being stamped with the proper duty, cancel that certificate and make an allowance for the duty overpaid or paid (as the case may be). [1/2013; 30/2014] (2) When as a result of unavoidable circumstances an application under subsection (1) cannot be made within the period of 6 months, the Commissioner may, in his or her discretion, allow the application to be made within such further period as the Commissioner considers reasonable. (3) Despite subsection (1), where the Commissioner has reasonable cause to believe that a person — ( a ) has inadvertently paid duty of a greater value than was necessary; or ( b ) has inadvertently paid duty in respect of an instrument not liable to any duty, the Commissioner may, on the Commissioner’s own initiative, make an allowance for the duty overpaid or paid (as the case may be). [30/2014]"
    },
    {
      "provision_ref": "s59",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "59",
      "title": "Interpretation of this Part",
      "content": "59. —(1) In this Part — “electronic” and “electronic record” have the meanings given by section 2(1) of the Electronic Transactions Act 2010; Example Anything sent by e‑mail, SMS or any Internet‑based messaging service is an electronic record. “electronic instrument” means — ( a ) an electronic record, or a combination of an electronic record and a physical document, mentioned in section 60A(1)( a ) or ( b ); or ( b ) an electronic record mentioned in section 60A(2); “electronic signature” means any electronic method used to identify a person and to indicate the person’s intention in respect of the information contained in an electronic record. [37/2018] (2) In this Part, a stamp certificate or certificate of adjudication is duly issued for an electronic instrument if it is issued by the Commissioner for the electronic instrument — ( a ) using the E‑Stamping system in accordance with the provisions of this Act; or ( b ) in such other manner as the Commissioner may determine. [37/2018]"
    },
    {
      "provision_ref": "s60",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60",
      "title": "Application",
      "content": "60. This Part applies to electronic instruments that are executed, in accordance with section 60C, on or after 4 October 2018. [37/2018]"
    },
    {
      "provision_ref": "s60A",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60A",
      "title": "Electronic instruments treated as instruments",
      "content": "60A. —(1) For the purposes of this Act, a reference to an instrument or a description of instrument that effects a transaction includes — ( a ) an electronic record that effects, or an electronic record and a physical document that together effect, the same transaction, whether directly or indirectly; and ( b ) if the same transaction is effected whether directly or indirectly by a verbal communication and an electronic record, the electronic record, but only if the transaction is concluded by means of the electronic record. [37/2018] (2) For the purposes of this Act, a reference to an instrument or a description of instrument that is evidence of, or that signifies any matter includes, in a case where the transaction concerned is effected by electronic means and there is no physical document that evidences or signifies such matter, any electronic record that evidences or signifies the same matter. [37/2018] (3) To avoid doubt — ( a ) an instrument mentioned in subsection (1) includes an instrument between sub‑funds mentioned in section 60I(1) and an instrument with a sub‑fund mentioned in section 60J(1); and ( b ) an instrument mentioned in subsection (2) includes an instrument between sub‑funds mentioned in section 60I(2) and an instrument with a sub‑fund mentioned in section 60J(2). [28/2019]"
    },
    {
      "provision_ref": "s60B",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60B",
      "title": "Application of Act to electronic instruments",
      "content": "60B. This Act applies in relation to an electronic instrument subject to the modifications set out in sections 60C to 60F and such other modifications as may be prescribed by rules under section 60H(2). [37/2018]"
    },
    {
      "provision_ref": "s60C",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60C",
      "title": "Execution of electronic instruments",
      "content": "60C. —(1) An electronic instrument that is an electronic record is treated as executed or signed when an electronic signature is applied to it. [37/2018] (2) An electronic instrument that comprises an electronic record and a physical document is treated as executed or signed — ( a ) if the transaction is concluded by means of an electronic record, when an electronic signature is applied to the electronic record; or ( b ) if the transaction is concluded by means of a physical document, when the physical document is signed. [37/2018] (3) In a case in subsection (1) or (2)( a ), the time when and the place where the signing party does an act that results in the application of the electronic signature to the electronic record are treated respectively as the time and place of the execution or signing of the electronic instrument. Examples 1. A sends an e‑mail from a place in Malaysia offering to sell property to B . B sends an e‑mail from a place in Singapore accepting A ’s offer. If a contract is concluded by means of the second e‑mail, the electronic instrument comprising the 2 e‑mails is treated as executed in Singapore, and at the time B sends the second e‑mail. 2. A makes an offer to sell property on an Internet website. B , using a computer in a place in Singapore, transmits to the computer hosting the website B ’s acceptance of A ’s offer. If a contract is thereby concluded, the electronic instrument comprising the electronic records of the offer and acceptance is treated as executed in Singapore and at the time B transmits B ’s acceptance. [37/2018] (4) In a case in subsection (2)( b ), the time when and the place where the signing party signs the physical document are treated respectively as the time and place of the execution or signing of the electronic instrument. [37/2018] (5) The reference in subsection (3) to the signing party includes a person authorised by the signing party to apply the electronic signature on the signing party’s behalf, but excludes a person that merely provides any facility for the application of the electronic signature, such as an online intermediary. [37/2018]"
    },
    {
      "provision_ref": "s60D",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60D",
      "title": "Meaning of “duly stamped” and denoting of duties for electronic instruments",
      "content": "60D. —(1) An electronic instrument is duly stamped if a stamp certificate is duly issued for it. [37/2018] (2) All duties chargeable on an electronic instrument are paid and denoted by the due issue of a stamp certificate for it. [37/2018]"
    },
    {
      "provision_ref": "s60E",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60E",
      "title": "No double duty",
      "content": "60E. If there is more than one copy of an electronic instrument and any one of them has been duly stamped, then the other copy or copies is or are exempt from duty. [37/2018]"
    },
    {
      "provision_ref": "s60F",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60F",
      "title": "Other modifications of Act for electronic instruments",
      "content": "60F. —(1) A reference in this Act to the attachment or impression of a stamp certificate or certificate of adjudication to or on an instrument is, in the case of an electronic instrument, a reference to the due issue of such a certificate for the instrument. [37/2018] (2) A reference in this Act to a stamp certificate or certificate of adjudication that is attached to an instrument is, in the case of an electronic instrument, a reference to such a certificate that is duly issued for the instrument. [37/2018] (3) In this Act, an electronic instrument that is executed outside Singapore is received in Singapore if — ( a ) it is retrieved or accessed by a person in Singapore; ( b ) an electronic copy of it is stored on a device (including a computer) and brought into Singapore; or ( c ) an electronic copy of it is stored on a computer in Singapore. Examples 1. A and B effect outside Singapore a transaction by means of electronic records. The electronic records are saved on a server in a country outside Singapore. B downloads a copy of the electronic record in Singapore. The electronic instrument comprising those electronic records, having been retrieved by a person in Singapore, is received in Singapore. 2. A and B effect outside Singapore a transaction by means of electronic records. The electronic records are stored on a server in a country outside Singapore. B uses an electronic device to view a copy of those electronic records in Singapore. The electronic instrument comprising those electronic records, having been accessed by a person in Singapore, is received in Singapore. 3. A and B effect outside Singapore a transaction by means of electronic records. The electronic records are stored on a server in Singapore. The electronic instrument comprising those electronic records, having been stored on a computer in Singapore, is received in Singapore. [37/2018] (4) A reference in section 25(2) and (3) to the time a lease is presented for stamping is, if the lease is an electronic instrument, a reference to the time it is sent to the Commissioner for adjudication in accordance with section 37. [37/2018] (5) A reference in section 38(1) and (4) to the attachment of a certificate of adjudication to an instrument is to be disregarded in the case of an electronic instrument that is an electronic record. [37/2018] (6) Sections 51, 52(3) and 53 do not apply to an electronic instrument. [37/2018]"
    },
    {
      "provision_ref": "s60G",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60G",
      "title": "Exempt electronic records and transactions",
      "content": "60G. Sections 60B to 60F do not apply to any electronic record, or to any transaction effected (whether wholly or partly) by electronic means, that is prescribed by rules made under section 60H(1) as an exempt record or exempt transaction. [37/2018]"
    },
    {
      "provision_ref": "s60H",
      "chapter": "PART 8A - APPLICATION OF ACT TO ELECTRONIC INSTRUMENTS",
      "section": "60H",
      "title": "Rules",
      "content": "60H. —(1) The Minister may make rules — ( a ) to prescribe anything that is authorised to be prescribed under this Part; and ( b ) to provide that any electronic record of a particular description is an electronic record that is evidence of or that signifies a particular transaction or matter for the purposes of section 60A(2). [37/2018] (2) [ Omitted as spent ]"
    },
    {
      "provision_ref": "s60I",
      "chapter": "PART 8B - APPLICATION OF ACT TO VCCS",
      "section": "60I",
      "title": "Application of Act to instrument between sub‑funds",
      "content": "60I. —(1) A reference in this Act to an instrument or a description of instrument that effects a transaction, includes an instrument (called in this Part an instrument between sub‑funds) that effects a transaction between sub‑funds of an umbrella VCC that would have been the same transaction had the sub‑funds been legal persons. [28/2019] (2) A reference in this Act to an instrument or a description of instrument that is evidence of, or that signifies any matter relating to a transaction, includes an instrument (also called in this Part an instrument between sub‑funds) that is evidence of, or that signifies the same matter relating to a transaction between sub‑funds of an umbrella VCC, that would have been the same transaction had the sub‑funds been legal persons. [28/2019] (3) In the case of an instrument between sub‑funds, a reference in this Act to — ( a ) a party (however described) to an instrument; or ( b ) a party who executes an instrument, is to the umbrella VCC in relation to the relevant sub‑fund. [28/2019] (4) Accordingly — ( a ) any right of the party in subsection (3)( a ) or ( b ) under this Act is a right of the umbrella VCC that is to be exercised for the purpose of the relevant sub‑fund; and ( b ) any liability or duty of that party under this Act is considered (for the purpose of section 29 of the VCC Act) a liability or duty of the umbrella VCC that is incurred, and to be discharged, for the purpose of the relevant sub‑fund. [28/2019] (5) To avoid doubt, the time and place of the execution of an instrument between sub‑funds is the time and place at which the umbrella VCC executes the instrument. [28/2019] (6) Where — ( a ) an umbrella VCC effects a transaction between its sub‑funds otherwise than by way of an instrument, or that is not evidenced or signified by an instrument; and ( b ) had the transaction been effected, evidenced or signified by an instrument, the instrument would have been chargeable with duty under this Act, the umbrella VCC must give notice to the Commissioner of the transaction, in such form as the Commissioner may require, within 14 days of the transaction. [28/2019] (7) The notice mentioned in subsection (6) is treated for the purposes of this Act as an instrument mentioned in subsection (6)( b ) and chargeable with duty accordingly. [28/2019] (8) To avoid doubt, a reference to an instrument in subsections (6) and (7) includes an electronic instrument as defined in section 59(1). [28/2019] (9) An umbrella VCC that contravenes subsection (6) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding 4 times the amount of duty that is otherwise chargeable on the notice. [28/2019]"
    },
    {
      "provision_ref": "s60J",
      "chapter": "PART 8B - APPLICATION OF ACT TO VCCS",
      "section": "60J",
      "title": "Application of Act to instrument with a sub‑fund",
      "content": "60J. —(1) A reference in this Act to an instrument or a description of instrument that effects a transaction, includes an instrument (called in this Part an instrument with a sub‑fund) that effects a transaction between an umbrella VCC and any of its sub‑funds that would have been the same transaction had the sub‑fund been a separate legal person. [28/2019] (2) A reference in this Act to an instrument or a description of instrument that is evidence of, or that signifies any matter relating to a transaction, includes an instrument (also called in this Part an instrument with a sub‑fund) that is evidence of, or that signifies the same matter relating to a transaction between an umbrella VCC and any of its sub‑funds, that would have been the same transaction had the sub‑fund been a separate legal person. [28/2019] (3) In the case of an instrument with a sub‑fund, a reference in this Act to — ( a ) a party (however described) to an instrument; or ( b ) a party who executes an instrument, is to the umbrella VCC or the umbrella VCC in relation to the relevant sub‑fund, as the case may be. [28/2019] (4) Where an umbrella VCC is a party to an instrument, or executes an instrument, for the purpose of a sub‑fund — ( a ) any right of that party in subsection (3)( a ) or ( b ) under this Act is a right of the umbrella VCC that is to be exercised for the purpose of the relevant sub‑fund; and ( b ) any liability or duty of that party under this Act is considered (for the purpose of section 29 of the VCC Act) a liability or duty of the umbrella VCC that is incurred, and to be discharged, for the purpose of the relevant sub‑fund. [28/2019] (5) To avoid doubt, the time and place of the execution of an instrument with a sub‑fund is the time and place at which the umbrella VCC executes the instrument. [28/2019] (6) Where — ( a ) an umbrella VCC effects a transaction with any of its sub‑funds otherwise than by way of an instrument, or that is not evidenced or signified by an instrument; and ( b ) had the transaction been effected, evidenced or signified by an instrument, the instrument would have been chargeable with duty under this Act, the umbrella VCC must give notice to the Commissioner of the transaction, in such form as the Commissioner may require, within 14 days of the transaction. [28/2019] (7) The notice mentioned in subsection (6) is treated for the purposes of this Act as an instrument mentioned in subsection (6)( b ) and chargeable with duty accordingly. [28/2019] (8) To avoid doubt, a reference to an instrument in subsections (6) and (7) includes an electronic instrument as defined in section 59(1). [28/2019] (9) An umbrella VCC that contravenes subsection (6) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding 4 times the amount of duty that is otherwise chargeable on the notice. [28/2019]"
    },
    {
      "provision_ref": "s60K",
      "chapter": "PART 8B - APPLICATION OF ACT TO VCCS",
      "section": "60K",
      "title": "Modifications to section 22A",
      "content": "60K. —(1) In the application of section 22A to an instrument between sub‑funds, the disposal under that instrument of specified immovable property or part of such property is treated as a disposal of the property or part of such property for the purposes of that section. [28/2019] (2) In the application of section 22A to an instrument with a sub‑fund, the disposal under that instrument of specified immovable property or part of such property is treated as a disposal of the property or part of such property for the purposes of that section. [28/2019] (3) In the application of section 22A to an instrument (including an instrument between sub‑funds or an instrument with a sub‑fund) under which an umbrella VCC disposes of any specified immovable property or part of such property that, immediately before such disposal, was held by the VCC for the purpose of any of its sub‑funds because of an earlier instrument between sub‑funds or an earlier instrument with a sub‑fund, the reference in that section to the date or time of acquisition of the property or part of such property is to the date or time the umbrella VCC first holds the property or part for the purpose of the sub‑fund as a result of the earlier instrument, and section 22A(14) applies accordingly. [28/2019] (4) The reference to the voluntary winding up of a private company in section 22A(3)( c ) includes the voluntary winding up of a VCC or a sub‑fund under the VCC Act. [28/2019] (5) The reference to the winding up of the owner of the property in section 22A(15) is, where the property is held by an umbrella VCC for the purpose of a sub‑fund, to the winding up of the VCC or the sub‑fund under the VCC Act. [28/2019]"
    },
    {
      "provision_ref": "s60L",
      "chapter": "PART 8B - APPLICATION OF ACT TO VCCS",
      "section": "60L",
      "title": "Modifications to sections 23, 23A, 23B, 23C and 23D",
      "content": "60L. —(1) A reference in sections 23, 23A, 23B, 23C and 23D to an entity includes — ( a ) a VCC; and ( b ) a sub‑fund of an umbrella VCC. [28/2019] (2) For the purposes of subsection (1)( a ), a reference in sections 23, 23A, 23B and 23C to equity interests in an entity that is a non‑umbrella VCC is to its shares. [28/2019] (3) For the purposes of subsection (1)( b ) — ( a ) a reference in those sections to any asset or other property of an entity that is a sub‑fund of an umbrella VCC is to such asset or property held by the umbrella VCC for the purpose of or that is attributable to the sub‑fund; ( b ) a reference in those sections to an entity beneficially owning equity interests in another entity is, if the first entity is a sub‑fund of an umbrella VCC, to the umbrella VCC holding equity interests in the other entity for the purpose of the sub‑fund; ( c ) a reference in those sections to equity interests in an entity that is a sub‑fund of an umbrella VCC is to shares of the umbrella VCC in respect of that sub‑fund; ( d ) a reference in those sections to an accounting period of an entity that is a sub‑fund of an umbrella VCC is to the accounting period of the umbrella VCC; ( e ) the following are arrangements to which section 23C(1) applies in a case where the entity is a sub‑fund of an umbrella VCC, and section 23C(1), (2), (4) and (5) applies accordingly: (i) an acquisition by the umbrella VCC of equity interests of the sub‑fund; (ii) an issue by the umbrella VCC of such equity interests; (iii) a cancellation or redemption of such equity interests; (iv) the conversion of — (A) such equity interests into instruments that are not equity interests; (B) instruments that are not equity interests into such equity interests; or (C) such equity interests from one class to another class; (v) an amalgamation of the sub‑fund with another sub‑fund, whether or not of the same umbrella VCC; (vi) any other arrangement that, in the Commissioner’s opinion, has as its purpose or one of its purposes the effect mentioned in section 23C(1)( a ) in relation to the sub‑fund. [28/2019] (4) The following paragraphs apply when applying sections 23, 23A and 23B in relation to an instrument to which an umbrella VCC is a party in relation to a sub‑fund: ( a ) the umbrella VCC beneficially owns equity interests in an entity if it holds equity interests in that entity for the purpose of the sub‑fund, and section 23(22)( a ) is to be read accordingly; ( b ) the umbrella VCC ceases to own any equity interest in an entity if it ceases to hold equity interests in that entity for the purpose of the sub‑fund; ( c ) the umbrella VCC is a significant owner of an entity if it holds, for the purpose of the sub‑fund, a percentage of the equity interests in the entity that satisfies section 23(11)( a ) or ( b ); ( d ) where the umbrella VCC is the grantor, transferor, assignor or vendor (as the case may be) under the instrument, the reference in section 23(8) to equity interests acquired by such party is to equity interests acquired by the VCC for the purpose of the sub‑fund; ( e ) section 23(12) applies for the purposes of paragraph ( a ) as if a reference to an associate of the person mentioned in section 23(12) is to a person that is an associate of the umbrella VCC in relation to the sub‑fund in accordance with the section 23 Order; ( f ) section 23A(3) applies as if a reference to an associate of the grantor or grantee mentioned in that provision is to a person that is an associate of the umbrella VCC in relation to the sub‑fund in accordance with the section 23 Order. [28/2019] (5) The determination under section 23(20)( d ) of whether an umbrella VCC is an associate of a party to an instrument is to be made in relation to each sub‑fund, as if the umbrella VCC has only that one sub‑fund. [28/2019] (6) The following paragraphs apply for the purpose of determining the beneficial ownership of equity interests in an entity of an associate of another person, where the associate is an umbrella VCC in relation to any of its sub‑funds: ( a ) the umbrella VCC beneficially owns equity interests in that entity if it holds equity interests in that entity for the purpose of that sub‑fund; ( b ) the umbrella VCC ceases to own any equity interest in the entity if it ceases to hold equity interests in that entity for the purpose of that sub‑fund. [28/2019] (7) In determining, for the purpose of section 23C, whether an arrangement is to be treated as a conveyance of equity interests in an entity to or by an umbrella VCC for the purpose of a sub‑fund, only equity interests in the entity that are held by the umbrella VCC for the purpose of or that are attributable to the sub‑fund are treated as beneficially owned by the umbrella VCC. [28/2019]"
    },
    {
      "provision_ref": "s60M",
      "chapter": "PART 8B - APPLICATION OF ACT TO VCCS",
      "section": "60M",
      "title": "Modifications to other provisions",
      "content": "60M. —(1) A reference in section 21(2) and (6) to a person from whom property was conveyed or transferred is — ( a ) in the case of an instrument between sub‑funds, to the sub‑fund from which the property was conveyed or transferred; or ( b ) in the case of an instrument with a sub‑fund, to the umbrella VCC or the sub‑fund from which the property was conveyed or transferred, as the case may be. [28/2019] (2) The following provision applies in place of section 22(2) in a case where the subsequent instrument is an instrument between sub‑funds, and section 22(3) applies accordingly: “ Where — “ ( a ) the purchaser under the contract or agreement to which subsection (1) applies is an umbrella VCC that acted for the purpose of a sub‑fund; ( b ) ad valorem duty has been paid in accordance with subsection (1) on that instrument; and ( c ) before having obtained a conveyance or transfer of the property, the umbrella VCC assigns the equitable estate or interest in that property, or enters into any contract or agreement for the sale of that property, to any of its sub‑funds, the assignment, contract or agreement is chargeable with ad valorem duty in respect of the consideration moving from the sub‑fund mentioned in paragraph ( c ) as if it were an actual conveyance on sale to the sub‑purchaser. ”. [28/2019] (3) The following provision applies in place of section 22(2) in a case where the subsequent instrument is an instrument with a sub‑fund, and section 22(3) applies accordingly: “ Where — “ ( a ) the purchaser under the contract or agreement to which subsection (1) applies is an umbrella VCC that acted for itself or for the purpose of a sub‑fund; ( b ) ad valorem duty has been paid in accordance with subsection (1) under that instrument; and ( c ) before having obtained a conveyance or transfer of the property, the umbrella VCC — (i) in the case where it entered into the contract or agreement to which subsection (1) applies for itself, assigns the equitable estate or interest in that property, or enters into a contract or an agreement for the sale of that property, to the umbrella VCC for the purpose of a sub‑fund; or (ii) in the case where it entered into the contract or agreement to which subsection (1) applies for the purpose of a sub‑fund, assigns the equitable estate or interest in that property, or enters into a contract or an agreement for the sale of that property, to and for itself, the assignment, contract or agreement is chargeable with ad valorem duty in respect of the consideration moving from the sub‑fund or the umbrella VCC (as the case may be) as if it were an actual conveyance on sale to the sub‑purchaser. ”. [28/2019] (4) Section 22(4) applies with the necessary modifications in relation to a variation of a contract or an agreement for the sale of any estate or interest in property to an umbrella VCC for the purpose of a sub‑fund, where the variation is for the purpose of substituting one sub‑fund with another or substituting the sub‑fund with the umbrella VCC, as it applies to a direction mentioned in that provision. [28/2019] (5) Section 22(4) applies with the necessary modifications in relation to a variation of a contract or an agreement for the sale of any estate or interest in property to an umbrella VCC acting for itself, where the variation is for the purpose of substituting the umbrella VCC with one of its sub‑funds, as it applies to a direction mentioned in that provision. [28/2019] (6) Section 33 applies in relation to shares in a VCC as it applies in relation to shares in a company. [28/2019] (7) Section 70B applies in relation to a VCC and a sub‑fund of an umbrella VCC as it applies in relation to a company. [28/2019] (8) A reference to shares in the First Schedule includes shares of a VCC. [28/2019]"
    },
    {
      "provision_ref": "s60N",
      "chapter": "PART 8B - APPLICATION OF ACT TO VCCS",
      "section": "60N",
      "title": "Fines on umbrella VCC considered liability of its sub‑funds in certain cases",
      "content": "60N. Any fine imposed on an umbrella VCC, and any composition sum that may be paid by it, for an offence under this Act that is committed — ( a ) in respect of any instrument executed for the purpose of a sub‑fund; or ( b ) in respect of any information, or other matter relating to a sub‑fund, are considered (for the purpose of section 29 of the VCC Act) liability incurred by the umbrella VCC for the purpose of the sub‑fund. [28/2019]"
    },
    {
      "provision_ref": "s60O",
      "chapter": "PART 8B - APPLICATION OF ACT TO VCCS",
      "section": "60O",
      "title": "Rules",
      "content": "60O. —(1) The Minister may make rules to prescribe anything that is authorised to be prescribed under this Part. [28/2019] (2) For a period of 2 years starting on 15 January 2020, the Minister may make rules to prescribe further modifications to the provisions of this Act in their application in relation to VCCs, instruments between sub‑funds and instruments with a sub‑fund. [28/2019]"
    },
    {
      "provision_ref": "s62",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "62",
      "title": "Penalty for evasion of duty",
      "content": "62. Any person who with intent to evade the payment of duty — ( a ) executes any instrument in which all the facts and circumstances are not fully and truly set out as required by section 5; ( b ) being employed or concerned in or about the preparation of any instrument, neglects or omits to set out fully or truly in the instrument all those facts and circumstances; ( c ) draws, makes, executes or signs, otherwise than as a witness, any instrument chargeable with duty without the instrument being duly stamped; or ( d ) fails to comply with section 32A(2), shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both."
    },
    {
      "provision_ref": "s63",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "63",
      "title": "Penalty for executing instruments not duly stamped, etc.",
      "content": "63. Any person who — ( a ) having drawn, made, executed or signed, otherwise than as a witness, any instrument that is chargeable with duty without the instrument being duly stamped and fails, without lawful excuse, to procure the due stamping of the instrument within the time within which the instrument may be stamped without penalty under this Act; ( b ) not being a person authorised under section 9(1) or an employee of such person, represents himself, herself or itself to be such a person; or ( c ) being a person authorised under section 9(1) — (i) fails to deliver to the Commissioner accounts as required by section 9(1)( a ); (ii) delivers to the Commissioner accounts which are false in any material particular; or (iii) contravenes or fails to comply with any condition in section 9(1) not waived by the Commissioner, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000. [37/2018]"
    },
    {
      "provision_ref": "s64",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "64",
      "title": "Penalties relating to stamp certificates, etc.",
      "content": "64. Any person who — ( a ) sells or offers for sale a stamp certificate or certificate of adjudication; ( b ) falsifies any part of a stamp certificate or certificate of adjudication; ( c ) fraudulently attaches a stamp certificate or certificate of adjudication to an instrument other than the instrument for which the stamp certificate or certificate of adjudication was issued; ( d ) fraudulently detaches a stamp certificate or certificate of adjudication or fraudulently causes a stamp certificate or certificate of adjudication to be detached from an instrument; ( e ) counterfeits, or knowingly performs any part of the process of counterfeiting, any stamp certificate or certificate of adjudication issued by the Commissioner; ( f ) sells or offers for sale any certificate which the person knows or ought reasonably to know to be a counterfeit of any stamp certificate or certificate of adjudication issued by the Commissioner; ( g ) has in the person’s possession any certificate which the person knows to be a counterfeit of any stamp certificate or certificate of adjudication, intending to use or dispose of it as a genuine stamp certificate or certificate of adjudication, or in order that it may be used as a genuine stamp certificate or certificate of adjudication; or ( h ) uses as genuine a stamp certificate or certificate of adjudication, knowing it to be a counterfeit of any stamp certificate or certificate of adjudication, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both. [37/2018]"
    },
    {
      "provision_ref": "s65",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "65",
      "title": "Penalty for obstructing Commissioner and similar offences",
      "content": "65. —(1) A person must not — ( a ) resist or obstruct the Commissioner or any officer in the performance of any duty or the exercise of any power under this Act; or ( b ) wilfully mislead the Commissioner or any officer in any particular likely to affect the discharge of the Commissioner’s or officer’s duty. (2) Subject to subsection (3), a person must not, being lawfully asked any question by the Commissioner or any officer under this Act, give an answer (whether orally or in writing) to the question or, in furnishing information, make any statement or representation that is false or misleading in any material particular. (3) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both. [34/2016] (4) Any person who contravenes subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both. [34/2016] (5) It is a defence to a charge under subsection (2) to prove that, when the answer, statement or representation was given or made, the defendant believed on reasonable grounds that it was neither false nor misleading. (6) In this section, “officer” means any Deputy Commissioner of Stamp Duties and any officer of the Commissioner’s staff assisting the Commissioner in the administration of this Act."
    },
    {
      "provision_ref": "s65A",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "65A",
      "title": "General penalty",
      "content": "65A. Any person guilty of an offence under this Act for which no other penalty is provided shall be liable on conviction to a fine not exceeding $1,000 and in default to imprisonment for a term not exceeding 6 months."
    },
    {
      "provision_ref": "s66",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "66",
      "title": "Penalty for enrolling, etc., instrument not duly stamped",
      "content": "66. —(1) If any person whose office it is to enrol, register or enter in or upon any rolls, books or records any instrument chargeable with duty, enrols, registers or enters any such instrument not being duly stamped, the person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000. [23/2011] (2) Subsection (1) does not apply to such person as the Minister may by order in the Gazette exempt from that subsection. [23/2011]"
    },
    {
      "provision_ref": "s67",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "67",
      "title": "Fraud in relation to duty",
      "content": "67. Any person who practises or is concerned in any fraudulent act, contrivance or device not specially provided for by law, with intent to defraud the Government of any duty, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both."
    },
    {
      "provision_ref": "s68",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "68",
      "title": "Institution and conduct of prosecution",
      "content": "68. —(1) No prosecution in respect of any offence punishable under this Act is to be instituted without the consent of either the Commissioner or the Public Prosecutor. [15/2010] (2) The Commissioner may compound any offence under this Act that is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum not exceeding $2,000. (3) The Minister may make rules to prescribe the offences which may be compounded."
    },
    {
      "provision_ref": "s68A",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "68A",
      "title": "Service of summons",
      "content": "68A. —(1) Every summons issued by a court against any person in connection with any offence under this Act may be served on the person — ( a ) by delivering the summons to the person or to some adult member or employee of the person’s family at the person’s usual or last known place of residence; ( b ) by leaving the summons at the person’s usual or last known place of residence or business in an envelope addressed to the person; ( c ) by sending the summons by registered post addressed to the person at the person’s usual or last known place of residence or business; or ( d ) where the person is a body of persons or a company — (i) by delivering the summons to the secretary or other similar officer of the body of persons or company at its registered office or principal place of business; or (ii) by sending the summons by registered post addressed to the body of persons or company at its registered office or principal place of business. (2) Any summons sent by registered post to any person in accordance with subsection (1) is deemed to be duly served on the person to whom the letter is addressed at the time when the letter would in the ordinary course of post be delivered. (3) In proving service of the summons by registered post, it is sufficient to prove that the envelope containing the summons was properly addressed, stamped and posted by registered post."
    },
    {
      "provision_ref": "s68B",
      "chapter": "PART 9 - OFFENCES AND PENALTIES",
      "section": "68B",
      "title": "Protection of informers",
      "content": "68B. —(1) Except as provided in subsection (3), no witness in any civil or criminal proceedings commenced on or after 16 November 2021 is obliged or permitted — ( a ) to disclose the identity of an informer who has given any information (whether the information is given before, on or after that date) with respect to an offence under this Act; or ( b ) to answer any question if the answer to the question would lead, or would tend to lead, to the discovery of the identity of the informer. [27/2021] (2) If any document which is in evidence or liable to inspection in any civil or criminal proceedings contains any entry in which any informer is named or described or which may lead to the discovery of the informer’s identity, the court must cause the entry to be concealed from view or to be obliterated so far only as may be necessary to protect the informer from discovery. [27/2021] (3) If — ( a ) in any proceedings for an offence under any written law, the court, after full enquiry into the case, believes that the informer wilfully made a material statement which the informer knew or believed to be false or did not believe to be true; or ( b ) in any other proceedings, the court is of the opinion that justice cannot be fully done between the parties to the proceedings without the discovery of the informer, the court may permit enquiry and require full disclosure concerning the informer. [27/2021]"
    },
    {
      "provision_ref": "s69",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "69",
      "title": "Books, etc., in custody of public officers may be inspected without fee",
      "content": "69. Every public officer having in his or her custody any register, book, record, paper, document or proceeding the inspection of which may tend to secure any duty, or to prove or lead to the discovery of any fraud or omission in relation to any duty, must at all reasonable times permit any person authorised in writing by the Commissioner — ( a ) to inspect for such purpose the register, book, record, paper, document or proceeding; and ( b ) to take such notes and extracts as he or she may consider necessary without fee or charge."
    },
    {
      "provision_ref": "s70",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "70",
      "title": "Power to declare agent, etc., for recovery of duty",
      "content": "70. —(1) The Commissioner may, by written notice, declare any person to be the agent of any other person for the purposes of this Act, and may require the agent so declared to pay any duty due under this Act from any moneys (including sale proceeds, rents, bank balances, pensions, salary, wages or any other remuneration) which, at the date of receipt of the notice or at any time during a period of 90 days after that date, may be held by the agent for or due by the agent to the other person. [36/2008] (2) In default of payment by an agent declared under subsection (1), the duty may be sued for by way of a specially endorsed originating claim in the name of the Commissioner who is entitled to all costs allowed by law against the person liable thereto. [Act 25 of 2021 wef 01/04/2022] (3) For the purposes of this section, the Commissioner may require any person to give the Commissioner information as to any moneys, funds or other assets which may be held by the person for, or of any moneys due by the person to, any other person. (4) Where any person declared by the Commissioner to be the agent of any other person under subsection (1) is aggrieved by such declaration, the agent so declared may, by written notice to the Commissioner within 14 days after the date of the declaration, or within such further time as the Commissioner may allow, object to the declaration. (5) The Commissioner must examine the objection and may cancel, vary or reconfirm the declaration. (6) For the purposes of payment of any duty due from any moneys mentioned in subsection (1) in a joint account in any bank or from the proceeds of sale of any immovable property owned by 2 or more persons as joint owners, the following provisions apply: ( a ) the person ( X ) declared by the Commissioner under subsection (1) to be the agent of any person who is an owner of such moneys must — (i) within 14 days of the receipt of the notice under subsection (1), send a notice by registered post addressed to every owner of such moneys at the address last known to X informing the owner of such declaration; and (ii) retain such amount of the moneys as is presumed under paragraph ( b ) to be owned by the person from whom the duty is due and, subject to paragraph ( e ), within 42 days of the receipt of the notice under subsection (1) pay over the duty due from such amount to the Commissioner; ( b ) it is presumed, until the contrary is proved, that — (i) the holders of a joint account at any bank have equal share of the moneys in the account as at the date of receipt of the notice under subsection (1); and (ii) the owners of any immovable property share the proceeds of sale of the property equally; ( c ) any owner of such moneys who objects to the share presumed under paragraph ( b ) must give written notice of the owner’s objection to X within 28 days of the receipt of the notice sent by X under paragraph ( a )(i), or within such further period as the Commissioner may allow, and furnish proof as to the owner’s share of the moneys; ( d ) where an objection under paragraph ( c ) has been received, X must — (i) retain the amount of such moneys mentioned in paragraph ( a )(ii) until such time as the Commissioner by notice under paragraph ( e ) informs X of the Commissioner’s decision on the objection; and (ii) inform the Commissioner of the objection within 7 days of the receipt of the objection; and ( e ) the Commissioner must consider the objection and by written notice inform X of his or her decision and X must pay over any duty due from the share of the moneys decided by the Commissioner as the amount, not exceeding the amount presumed under paragraph ( b ) to be the share of the person by whom the duty is payable, held by X for or due by X to the person. (7) Where an agent makes any payment of moneys to the Commissioner under this section — ( a ) the agent is deemed to have been acting under the authority of the person by whom the duty is payable (called in this section the person in default); ( b ) the agent is indemnified in respect of the payment to the Commissioner; ( c ) the amount of the duty due from the person in default is reduced by the amount paid by the agent to the Commissioner; and ( d ) the amount of the reduction is, to the extent of that amount, deemed to have been paid to the person in default in accordance with any law, contract or scheme governing the payment of moneys held by the agent for or due from the agent to the person in default. [36/2008] (8) Where — ( a ) an amount of duty is due from any person under this Act otherwise than as an agent under this section; ( b ) except for this subsection, an amount is or would, at any time during the period of 90 days after the date of the receipt of the notice in paragraph ( c ), be payable by the Government to the person in default by or under any written law, contract or scheme; and ( c ) before payment of the amount mentioned in paragraph ( b ) is made to the person in default, the Commissioner serves notice on any public officer (including an employee appointed under section 9(3) of the Inland Revenue Authority of Singapore Act 1992) by whom the payment is to be made that the duty is due from the person in default, then the public officer is, despite any other written law, contract or scheme, entitled to reduce the amount mentioned in paragraph ( b ) by the amount of the whole or any part of the duty mentioned in paragraph ( a ). (9) If the public officer makes the reduction mentioned in subsection (8) — ( a ) the amount of the duty mentioned in subsection (8)( a ) is reduced by the amount of the reduction; and ( b ) the amount of the reduction is, to the extent of such amount, deemed to have been paid to the person in default in accordance with any law, contract or scheme governing the payment of moneys mentioned in subsection (8)( b ) to the person in default. [36/2008; 21/2013] (10) In this section — “duty” includes any penalty or any other money which a person is liable to pay to the Commissioner under this Act; “joint account” means any account in the names of 2 or more persons but excludes any partnership account, trust account and any account where a minor is one of the account holders."
    },
    {
      "provision_ref": "s70A",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "70A",
      "title": "Recovery of duty from deceased individual",
      "content": "70A. —(1) Where, at the time of a person’s death, any duty or penalty is due from the person under this Act and has not been paid, the Commissioner has the same powers and remedies for recovering the duty or penalty so payable from the person’s estate as the Commissioner would have in relation to the person if the person were alive. (2) Any such duty or penalty or both are payable by the executor or administrator in respect of the deceased person’s estate to the same extent as it would be payable by the person if he or she were alive. (3) This section does not apply if the duty is assessed after the end of the third year following the year in which the person died."
    },
    {
      "provision_ref": "s70AA",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "70AA",
      "title": "Recovery of duty, etc., from persons leaving Singapore",
      "content": "70AA. —(1) Where the Commissioner is of the opinion that any person is about or likely to leave Singapore without paying all the duty or penalty recoverable from the person under any provisions of this Act, the Commissioner may issue a certificate containing particulars of the duty or penalty and a direction to the Commissioner of Police or the Controller of Immigration, or both, that such person be prevented from leaving Singapore without paying the duty or penalty or furnishing security to the Commissioner’s satisfaction for payment of the duty or penalty. [28/2010] (2) Subject to the provisions of any order issued or made under any law for the time being in force relating to banishment or immigration, the Commissioner of Police or the Controller of Immigration, or both (as the case may be) must thereupon take, or cause to be taken by any police officer or immigration officer, such measures as may be necessary to prevent the person named in the direction from leaving Singapore until payment of the duty or penalty has been made or secured as aforesaid, including the use of such force as may be necessary and, if appropriate, the detention of any Singapore passport, certificate of identity or travel document and any exit permit or other document authorising such person to leave Singapore. [28/2010] (3) At the time of issue of the certificate, the Commissioner must issue to such person a notification thereof by personal service or registered post; but the non‑receipt of the notification does not invalidate any proceedings under this section. [28/2010] (4) Payment of the duty or penalty to an officer in charge of a police station or to an immigration officer or production of a statement signed by the Commissioner stating that the duty or penalty has been paid or secured as aforesaid is sufficient authority for allowing such person to leave Singapore. [28/2010] (5) Any person who, knowing that a direction has been issued under this section for the prevention of his or her departure from Singapore, voluntarily leaves or attempts to leave Singapore without — ( a ) paying the duty or penalty payable by him or her; or ( b ) furnishing security to the Commissioner’s satisfaction for payment of the duty or penalty, shall be guilty of an offence and may be arrested, without warrant, by any police officer or immigration officer. [28/2010] (6) No civil or criminal proceedings shall be instituted or maintained against the Commissioner of Police, the Controller of Immigration or any other police officer or immigration officer, in respect of anything lawfully done under the authority of this section. [28/2010]"
    },
    {
      "provision_ref": "s70B",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "70B",
      "title": "Company wound‑up",
      "content": "70B. Where a company is being wound up, the liquidator of the company must not distribute any of the assets of the company to the shareholders of the company unless the liquidator has made provision for the payment in full of any duty or penalty which may be found payable by the company."
    },
    {
      "provision_ref": "s70C",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "70C",
      "title": "Power to call for any instrument, book, document, account or other record, or to obtain information",
      "content": "70C. —(1) For the purposes of this Act, the Commissioner may by notice require any person to attend personally before the Commissioner or an authorised officer, at a place and time specified in the notice, to do one or both of the following: ( a ) provide, to the best of that person’s knowledge, information and belief, any information concerning the liability of any instrument to duty; ( b ) produce for examination any instrument, book, document, account or other record (each called in this section a record) concerning such liability. [34/2016] (2) Where records are maintained by computer, the person required to make them available for examination must provide all facilities necessary for obtaining the computer records. (3) The Commissioner has at all times full and free access to all buildings, places and records for any of the purposes of this Act, and may, without fee or reward, inspect, copy or make extracts from any such records. [34/2016] (4) In addition to the powers under subsection (3), the Commissioner may also require a person in or at the building or place and who appears to the Commissioner to be acquainted with any facts or circumstances concerning the liability of any instrument to duty — ( a ) to answer any question to the best of that person’s knowledge, information and belief; or ( b ) to take reasonable steps to produce any record for examination. [34/2016] (5) The Commissioner or the authorised officer may take possession of any record produced in purported compliance with a requirement under subsection (1) or (4), or which the Commissioner finds in the building or place under subsection (3), where in his or her opinion — ( a ) the inspection or copying of or extraction from the record cannot reasonably be performed without taking possession; ( b ) the record may be interfered with or destroyed unless possession is taken; or ( c ) the record may be required as evidence in proceedings for an offence under this Act or in proceedings for the recovery of duty or penalty, or in proceedings by way of an appeal against the assessment. [34/2016] (6) A statement made by any person asked when in attendance before the Commissioner or an authorised officer under subsection (1), or under subsection (4), must — ( a ) be reduced to writing; ( b ) be read over to the person; ( c ) if the person does not understand English, be interpreted for the person in a language that the person understands; and ( d ) be signed by the person. [34/2016] (7) The Commissioner may by notice require any person to give orally or in writing, as may be required, all such information, facts and circumstances affecting the liability of any instrument to duty. [34/2016] (8) The power to require a person to provide information or produce a record under subsection (4) or (7), or when in attendance before the Commissioner or an authorised officer pursuant to a notice under subsection (1), includes the power — ( a ) to require that person, or any person who is or was an officer or employee of that person, to provide an explanation of the information or record; ( b ) if the information is not provided or the record is not produced, to require that person to state, to the best of the person’s knowledge and belief, where it is; and ( c ) if the information is recorded otherwise than in legible form, to require the information to be made available to the Commissioner or authorised officer (as the case may be) in legible form. [34/2016] (9) Any person who, without reasonable excuse, fails, neglects or refuses to comply with — ( a ) a notice or requirement of the Commissioner under this section; or ( b ) a demand by the Commissioner or an authorised officer to answer a question when in attendance before the Commissioner or officer pursuant to a notice under subsection (1), shall be guilty of an offence, and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $100 for every day or part of a day during which the offence continues after conviction. [34/2016] (10) In this section, “authorised officer” means any Deputy Commissioner of Stamp Duties and any officer of the Inland Revenue Authority of Singapore assisting the Commissioner in the administration of this Act. [34/2016] (11) Any person who, for the purpose of evading any duty under this Act, falsifies or destroys any document, book, account, record or other instrument shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 3 years or to both."
    },
    {
      "provision_ref": "s71",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "71",
      "title": "Commissioner may require declaration, etc.",
      "content": "71. —(1) The Commissioner may require any person to produce evidence by way of statutory declaration or otherwise for any purpose connected with the administration of this Act. [13/2017] (2) The Commissioner may by notice require any person to provide to the Commissioner by a specified time an appropriate valuation of any property that is the subject of an instrument (including any underlying property of a PHE within the meaning of section 23) for the purposes of determining the liability or the extent of the liability of the instrument to duty. [13/2017] (3) A person who, without reasonable excuse, fails to comply with the notice in subsection (2) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 and, in the case of a continuing offence, to a further fine not exceeding $100 for every day or part of a day during which the offence continues after conviction. [13/2017] (4) In subsection (2), an appropriate valuation is a valuation by a valuer who is independent of any party to the instrument, and has qualifications and experience that are relevant to the valuation sought by the Commissioner. [13/2017]"
    },
    {
      "provision_ref": "s72",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "72",
      "title": "Commissioner may impound instrument",
      "content": "72. The Commissioner may impound any instrument presented to the Commissioner for stamping where the Commissioner is of the opinion that it has not been duly stamped or it has been insufficiently stamped, and detain such instrument until the proper amount of stamp duty on the instrument has been paid."
    },
    {
      "provision_ref": "s73",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "73",
      "title": "Responsibility for loss or damage",
      "content": "73. —(1) Neither the Government nor the Commissioner is responsible for the loss of or for damage to any instrument tendered for stamping while in the Commissioner’s custody. (2) No officer of the stamp office is responsible for any loss or damage mentioned in subsection (1), unless the officer has caused it wilfully, fraudulently or by gross negligence."
    },
    {
      "provision_ref": "s74",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "74",
      "title": "Power to reduce or remit duties",
      "content": "74. —(1) The Minister may, in his or her discretion and subject to such conditions as he or she may impose, reduce or remit, prospectively or retrospectively, in the whole or any part of Singapore, the duties with which any instrument or any particular class of instruments, or any of the instruments belonging to such class, or any instrument when executed by or in favour of any particular class of persons, or by or in favour of any members of such class, are chargeable. [28/2010] (2) The Minister may impose a condition under subsection (1) that a person who fails to comply with any condition imposed under that subsection, must pay interest on any amount recoverable under subsection (6) for the following period: ( a ) in a case where duty was paid on the instrument and then refunded, the period starting on the date on which the refund was made and ending on the expiry of the one month period mentioned in subsection (8) or earlier; ( b ) in any other case, the period starting on — (i) the date of execution of the instrument, if it is executed in Singapore; or (ii) the date the instrument is first received in Singapore, if it is executed outside Singapore, and ending on the expiry of the one month period mentioned in subsection (8) or earlier. [37/2018] (3) A reduction or remission of duty in relation to a class of instruments, or any instrument belonging to such class, or any instrument when executed by or in favour of a class of persons, or by or in favour of members of such class, must be made by rules, and the conditions (if any) must be specified in the rules. [28/2010; 23/2011] (4) Orders made under subsection (3) in force immediately before 1 January 2012 are deemed to be rules made under subsection (3). [1/2013] (5) The Minister may, in any particular case, in his or her discretion and at any time, waive in whole or in part any condition imposed under subsection (1). [23/2011; 1/2013] (6) Where the Minister is satisfied that a person to whom a remission or reduction of duty is granted fails to comply with any condition imposed under subsection (1) (whether a condition precedent or a condition subsequent), an amount equal to the amount of duty so remitted or reduced, together with any interest that the person is to pay under a condition mentioned in subsection (2), is recoverable as a debt due to the Government. [28/2010; 37/2018] (7) Subsection (6) does not apply to any condition which has been, or to the extent that it has been, waived in the person’s case under subsection (5). [23/2011; 1/2013] (8) The amount recoverable under subsection (6) is payable at the place stated in a notice served by the Commissioner on the person, within one month after the service of the notice by the Commissioner on that person. [28/2010] (9) The Commissioner may, subject to such terms and conditions (including the imposition of interest) as the Commissioner may impose, extend the time delimited by subsection (8) within which payment is to be made. [28/2010] (10) If any amount recoverable from a person under subsection (6) and any interest imposed under subsection (9) is not paid within the period specified in subsection (8) or extended under subsection (9), the following penalties shall be imposed on the person: ( a ) where the outstanding amount is paid to the Commissioner within 3 months from the end of such period, a penalty of $10 or the outstanding amount, whichever is the greater; and ( b ) where the outstanding amount is not paid to the Commissioner within 3 months from the end of such period, a penalty of $25 or 4 times the outstanding amount, whichever is the greater. [28/2010] (11) The Commissioner may reduce or remit any penalty imposed under this section. [28/2010] (12) Sections 50 and 70AA apply to the collection and recovery by the Commissioner of the amount recoverable under subsection (6), any interest imposed under subsection (9) and any penalty imposed under subsection (10) as they apply to the collection and recovery of duty and penalty required to be paid under this Act. [28/2010]"
    },
    {
      "provision_ref": "s75",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "75",
      "title": "Refund and repayment of duty",
      "content": "75. —(1) The Commissioner may certify any amount of money to be refunded and cause the refund to be made immediately under any of the following circumstances: ( a ) a claim that the amount of money has been overpaid as duty under this Act is lodged with the Commissioner within 6 months after the date of the overpayment or within such longer period as the Commissioner may allow, and the Commissioner is satisfied that the money has been overpaid as duty under this Act; ( b ) the Commissioner has reasonable cause to believe in any particular case that the amount of money has been overpaid as duty under this Act. [30/2014] (2) Without prejudice to any other remedy provided for under the provisions of this Act for the recovery of any duty, where, for any reason, the whole or any part of any duty (after having been paid) has been erroneously refunded, the person to whom such refund was erroneously made must repay the amount refunded to the person in excess, within 15 days of receiving a demand from the Commissioner for the amount."
    },
    {
      "provision_ref": "s76",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "76",
      "title": "Moneys to be paid into Consolidated Fund",
      "content": "76. All moneys collected under the provisions of this Act must be paid into the Consolidated Fund."
    },
    {
      "provision_ref": "s77",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "77",
      "title": "Rules",
      "content": "77. The Minister may make rules to carry out generally the purposes of this Act, and may by such rules prescribe the fines, which shall in no case exceed $1,000, to be incurred on breach of those rules."
    },
    {
      "provision_ref": "s78",
      "chapter": "PART 10 - MISCELLANEOUS",
      "section": "78",
      "title": "Power to amend Schedules",
      "content": "78. —(1) The Minister may by notification in the Gazette add to, vary or revoke the whole or any part of the First, Third, Fourth or Fifth Schedule. [1/2013] (2) Where a notification adds to, varies or revokes any part of the First or Third Schedule, that notification or any subsequent notification may also make provisions to modify the application of one or more of the following provisions in relation to such addition, variation or revocation: Sections 16, 18, 21, 22, 24, 31, 32A(4) to (7), 32C and 33. [1/2013] (3) All notifications making provisions as described in subsection (2) must be presented to Parliament as soon as possible after publication in the Gazette . [1/2013]"
    }
  ],
  "definitions": [
    {
      "term": "bare trust beneficiary",
      "definition": "“bare trust beneficiary” , in relation to a trust over property, means a person — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "Commissioner",
      "definition": "“Commissioner” means the Commissioner of Stamp Duties appointed under this Act;",
      "source_provision": "s2"
    },
    {
      "term": "company",
      "definition": "“company” means any company incorporated or registered under any law in force in Singapore or elsewhere;",
      "source_provision": "s2"
    },
    {
      "term": "conveyance on sale",
      "definition": "“conveyance on sale” includes every instrument and every decree or order of any court, by which any property, or any estate or interest in any property, upon the sale thereof is transferred to or vested in a purchaser or any other person on the purchaser’s behalf or by the purchaser’s direction;",
      "source_provision": "s2"
    },
    {
      "term": "duly stamped",
      "definition": "“duly stamped” , as applied to an instrument chargeable with duty, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "duty",
      "definition": "“duty” includes any penalty or any other money which a person is liable to pay to the Commissioner under this Act;",
      "source_provision": "s70"
    },
    {
      "term": "E‑Stamping system",
      "definition": "“E‑Stamping system” means the computer service mentioned in section 6B(1);",
      "source_provision": "s2"
    },
    {
      "term": "equitable mortgage",
      "definition": "“equitable mortgage” means an agreement or a memorandum under hand only, relating to the deposit of any title deeds or instruments constituting or being evidence of the title to any property whatever (other than stock or marketable securities), or creating a charge on such property;",
      "source_provision": "s2"
    },
    {
      "term": "executed",
      "definition": "“executed” and “execution”, used with reference to instruments not under seal, mean “signed” and “signature”;",
      "source_provision": "s2"
    },
    {
      "term": "instrument",
      "definition": "“instrument” includes every written document;",
      "source_provision": "s2"
    },
    {
      "term": "lease",
      "definition": "“lease” means a lease of immovable property, and includes the following: ( a )",
      "source_provision": "s2"
    },
    {
      "term": "limited liability partnership",
      "definition": "“limited liability partnership” has the meaning given by the Limited Liability Partnerships Act 2005 and includes any similar partnership formed or incorporated outside Singapore;",
      "source_provision": "s15"
    },
    {
      "term": "marketable security",
      "definition": "“marketable security” means a security of such a description as to be capable of being sold or negotiated in any stock market;",
      "source_provision": "s2"
    },
    {
      "term": "Master Plan",
      "definition": "“Master Plan” has the meaning given by section 2 of the Planning Act 1998;",
      "source_provision": "s2"
    },
    {
      "term": "money",
      "definition": "“money” includes all sums whether expressed in the currency of Singapore or in any other currency;",
      "source_provision": "s2"
    },
    {
      "term": "mortgage",
      "definition": "“mortgage” means a security by way of mortgage for the payment of any definite and certain sum of money advanced or lent at the time, or previously due or forborne to be paid, being payable, or for the repayment of money to be thereafter lent, advanced or paid, or which may become due upon an account current, together with any sum already advanced or due, or without (as the case may be), and includes — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "paper",
      "definition": "“paper” includes every material upon which words or figures can be expressed;",
      "source_provision": "s2"
    },
    {
      "term": "proper officer",
      "definition": "“proper officer” means the Commissioner and such other officer as may be authorised by the Commissioner to impress stamps or to issue stamp certificates;",
      "source_provision": "s2"
    },
    {
      "term": "residential property",
      "definition": "“residential property” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "settlement",
      "definition": "“settlement” means any non‑testamentary disposition in writing whether made voluntarily or upon a good or valuable consideration other than a bona fide pecuniary consideration by which any definite and certain property is settled, or agreed to be settled, in any manner for any purpose;",
      "source_provision": "s2"
    },
    {
      "term": "stamp certificate",
      "definition": "“stamp certificate” means a certificate that is issued electronically in respect of any instrument chargeable with duty denoting the amount of duty payable in respect of that instrument or that the duty otherwise chargeable in respect of that instrument is remitted;",
      "source_provision": "s2"
    },
    {
      "term": "stock",
      "definition": "“stock” includes any share in the capital stock or funded debt of a company, corporation, society or VCC in Singapore or elsewhere and stocks or funds of the Government or of any other government or country;",
      "source_provision": "s2"
    },
    {
      "term": "VCC Act",
      "definition": "“VCC Act” means the Variable Capital Companies Act 2018. [33/99; 36/2008; 37/2018; 28/2019; 40/2019]",
      "source_provision": "s2"
    },
    {
      "term": "entity",
      "definition": "“entity” means any of the following: ( a )",
      "source_provision": "s15"
    },
    {
      "term": "firm",
      "definition": "“firm” has the meaning given by section 2(1) of the Business Names Registration Act 2014;",
      "source_provision": "s15"
    },
    {
      "term": "private company",
      "definition": "“private company” has the meaning given by section 4(1) of the Companies Act 1967;",
      "source_provision": "s15"
    },
    {
      "term": "registered business trust",
      "definition": "“registered business trust” has the meaning given by section 2 of the Business Trusts Act 2004;",
      "source_provision": "s15"
    },
    {
      "term": "statutory body",
      "definition": "“statutory body” means any body corporate established by any written law. [36/2008; 23/2011; 29/2014]",
      "source_provision": "s15"
    },
    {
      "term": "financial year",
      "definition": "“financial year” , in relation to a company, means the period in respect of which any profit and loss account of the company laid before it in general meeting is made up, whether that period is a year or not;",
      "source_provision": "s15A"
    },
    {
      "term": "FRS 28",
      "definition": "“FRS 28” , “SFRS(I) 1‑28” and “SFRS for Small Entities” mean the financial reporting standards known respectively as — ( a )",
      "source_provision": "s15A"
    },
    {
      "term": "group of companies",
      "definition": "“group of companies” means 2 or more companies each of which is either a holding company or subsidiary of the other or any of the others;",
      "source_provision": "s15A"
    },
    {
      "term": "holding company",
      "definition": "“holding company” and “subsidiary” have the meanings given by section 5 of the Companies Act 1967;",
      "source_provision": "s15A"
    },
    {
      "term": "Singapore company",
      "definition": "“Singapore company” means a company incorporated in Singapore and resident in Singapore within the meaning of section 2(1) of the Income Tax Act 1947. [28/2010; 2/2016; 32/2019]",
      "source_provision": "s15A"
    },
    {
      "term": "parent",
      "definition": "“parent” , in relation to a party to the marriage, means — ( a )",
      "source_provision": "s16"
    },
    {
      "term": "specified time period",
      "definition": "“specified time period” means — ( a )",
      "source_provision": "s16"
    },
    {
      "term": "Commissioner of Building Control",
      "definition": "“Commissioner of Building Control” has the meaning given by the Building Control Act 1989;",
      "source_provision": "s22"
    },
    {
      "term": "competent authority",
      "definition": "“competent authority” has the meaning given by the Planning Act 1998;",
      "source_provision": "s22"
    },
    {
      "term": "public authority",
      "definition": "“public authority” means the Housing and Development Board constituted by the Housing and Development Act 1959 or the Jurong Town Corporation constituted by the Jurong Town Corporation Act 1968;",
      "source_provision": "s22"
    },
    {
      "term": "Strata Titles Board",
      "definition": "“Strata Titles Board” means a Strata Titles Board constituted under the Building (Strata Management) Act 2004. [Act 12 of 2020 wef 01/10/2025] [13/2010]",
      "source_provision": "s22"
    },
    {
      "term": "child",
      "definition": "“child” , in relation to a person, means a legitimate child or stepchild of the person or a child adopted by the person in accordance with any written law relating to adoption;",
      "source_provision": "s23"
    },
    {
      "term": "effective date",
      "definition": "“effective date” means the most recent date on which this section and sections 23A, 23B and 23C come into operation;",
      "source_provision": "s23"
    },
    {
      "term": "equity interest",
      "definition": "“equity interest” , in relation to an entity, means — ( a )",
      "source_provision": "s23"
    },
    {
      "term": "limited partnership",
      "definition": "“limited partnership” means a limited partnership registered under the Limited Partnerships Act 2008;",
      "source_provision": "s23"
    },
    {
      "term": "prescribed immovable property",
      "definition": "“prescribed immovable property” means the type of immovable property prescribed as prescribed immovable property by the section 23 Order;",
      "source_provision": "s23"
    },
    {
      "term": "property trust",
      "definition": "“property trust” means a trust that holds or invests in — ( a )",
      "source_provision": "s23"
    },
    {
      "term": "section 23 Order",
      "definition": "“section 23 Order” means the order made under section 23D bringing this section and sections 23A, 23B and 23C into operation;",
      "source_provision": "s23"
    },
    {
      "term": "share",
      "definition": "“share” , in relation to a partnership, limited partnership or limited liability partnership, means — ( a )",
      "source_provision": "s23"
    },
    {
      "term": "Type 1 PHE",
      "definition": "“Type 1 PHE” means an entity that is a PHE by reason of subsection (13)( a );",
      "source_provision": "s23"
    },
    {
      "term": "Type 2 PHE",
      "definition": "“Type 2 PHE” means an entity that is a PHE by reason of subsection (13)( b );",
      "source_provision": "s23"
    },
    {
      "term": "underlying property",
      "definition": "“underlying property” , in relation to a PHE, means — ( a )",
      "source_provision": "s23"
    },
    {
      "term": "unit",
      "definition": "“unit” , in relation to a property trust, means — ( a )",
      "source_provision": "s23"
    },
    {
      "term": "chargeable property",
      "definition": "“chargeable property” has the meaning given by section 31(3).",
      "source_provision": "s32A"
    },
    {
      "term": "Registrar",
      "definition": "“Registrar” has the meaning given by the Limited Liability Partnerships Act 2005. [29/2014; 35/2014]",
      "source_provision": "s31"
    },
    {
      "term": "asset share",
      "definition": "“asset share” has the meaning given by section 32(5);",
      "source_provision": "s32A"
    },
    {
      "term": "arrangement",
      "definition": "“arrangement” has the meaning given by section 33A(3);",
      "source_provision": "s40"
    },
    {
      "term": "surcharge",
      "definition": "“surcharge” means a surcharge imposed under section 33B. [41/2020]",
      "source_provision": "s40"
    },
    {
      "term": "electronic",
      "definition": "“electronic” and “electronic record” have the meanings given by section 2(1) of the Electronic Transactions Act 2010; Example",
      "source_provision": "s59"
    },
    {
      "term": "electronic instrument",
      "definition": "“electronic instrument” means — ( a )",
      "source_provision": "s59"
    },
    {
      "term": "electronic signature",
      "definition": "“electronic signature” means any electronic method used to identify a person and to indicate the person’s intention in respect of the information contained in an electronic record. [37/2018]",
      "source_provision": "s59"
    },
    {
      "term": "joint account",
      "definition": "“joint account” means any account in the names of 2 or more persons but excludes any partnership account, trust account and any account where a minor is one of the account holders.",
      "source_provision": "s70"
    }
  ]
}