{
  "id": "slaa-2001",
  "type": "statute",
  "title": "Singapore Land Authority Act 2001",
  "title_en": "Singapore Land Authority Act 2001",
  "short_name": "SLAA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SLAA2001",
  "description": "An Act to establish and incorporate the Singapore Land Authority, to provide for its functions and powers, and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Singapore Land Authority Act 2001."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Authority” means the Singapore Land Authority established under section 3; “Chairperson” means the Chairperson of the Authority and includes any temporary Chairperson of the Authority; “Chief Executive” means the Chief Executive of the Authority, and includes any individual acting in that capacity; “debenture” includes debenture stock; “Deputy Chairperson” means the Deputy Chairperson of the Authority and includes any temporary Deputy Chairperson of the Authority; “land” includes foreshores and any interest in land; “member” means any member of the Authority; “public authority” means any board, body or authority established by or under any written law to perform or discharge any public function; “securities”, in relation to a company, includes shares, debentures, bonds and other securities of the company, whether or not constituting a charge on the assets of the company; “shares” includes stock; “State land” means all land in Singapore except — ( a ) land lawfully granted, or contracted to be granted, in fee simple or estate in perpetuity by or on behalf of the Government; ( b ) land subject to any agreement, lease or licence lawfully granted by or on behalf of the Government; and ( c ) land dedicated as national parks or nature reserves, and includes any land which, having been granted or held under any agreement, lease or licence, has been lawfully surrendered or resumed or compulsorily acquired, and any land which, having been lawfully held by any person for any estate or interest, has been or is lawfully forfeited to, or by any means has reverted or reverts to, the Government; “State title” includes any grant in fee simple or estate in perpetuity, any State lease (of whatever tenure) and any temporary occupation licence. [5/2018]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "3",
      "title": "Establishment and incorporation of Singapore Land Authority",
      "content": "3. A body called the Singapore Land Authority is established, which is a body corporate with perpetual succession and is, by that name, capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing or disposing of property, both movable and immovable; and ( c ) doing and suffering all such other acts or things as a body corporate may lawfully do or suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "4",
      "title": "Common seal",
      "content": "4. —(1) The Authority must have a common seal and the seal may be broken, changed, altered or made anew as the Authority thinks fit. (2) All deeds and other documents requiring the seal of the Authority must be sealed with the common seal of the Authority. (3) All instruments to which the common seal is affixed must be signed by any 2 members generally or specially authorised by the Chief Executive for the purpose or by one member and the Chief Executive. (4) All courts, judges and persons acting judicially are to take notice of the imprint of the common seal of the Authority appearing on any document and presume that it was duly affixed."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "5",
      "title": "Constitution of Authority",
      "content": "5. —(1) The Authority consists of the following members: ( a ) a Chairperson; ( b ) a Deputy Chairperson; ( c ) not less than 8 but not more than 20 other members as the Minister may determine. (2) The First Schedule has effect with respect to the Authority, its members and its proceedings."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "6",
      "title": "Functions and duties of Authority",
      "content": "6. —(1) Subject to the provisions of this Act, it is the function and duty of the Authority — ( a ) to optimise land resources; ( b ) to provide secure, reliable and effective registration systems for recording transactions relating to land in Singapore in accordance with the Land Titles Act 1993, the Land Titles (Strata) Act 1967 and the Registration of Deeds Act 1988; ( c ) to manage and maintain the cadastral survey system in Singapore as a foundation for land title, any spatial reference database or information system and for the purposes of any written law, including regulating the conduct of cadastral survey in Singapore; ( d ) to promote, develop or contribute to the development of an integrated spatial reference database or information system relating to land tenure, land transactions, land ownership, land boundaries and other related geographical information so as to facilitate the exchange and dissemination between the Government, public authorities, educational institutions and persons in the private sector of such information; ( e ) to act as agent of the Government in — (i) the acquisition of land under the Land Acquisition Act 1966 or any other method, or the resumption or forfeiture of land under the State Lands Act 1920, the State Lands Protection Act 2022 or any other law; [Act 42 of 2022 wef 01/11/2024] (ii) the administration and management of all State lands and buildings on State lands in accordance with the Foreshores Act 1920, the Sand and Granite Quarries Act 1970, the State Lands Act 1920, the State Lands Protection Act 2022 and any other written law; [Act 42 of 2022 wef 01/11/2024] (iii) the allocation and disposal of State land or grant of any State title to any person or public authority in accordance with the Foreshores Act 1920, the State Lands Act 1920 and any other written law; and (iv) the assessment, collection and recovery of any land betterment charge payable under the Land Betterment Charge Act 2021, and any premium (including differential premium), rent, royalty, fee or charge for or in connection with the mining or working of land for minerals, or with the disposition of any State land or grant of any State title or the exercise of any rights under any State title; [Act 11 of 2021 wef 01/08/2022] ( ea ) to cooperate and collaborate with the competent authority in the discharge of its functions under the Planning Act (Cap. 232) or the Planning Act 1998, when it is revised and citable by that short title; [Act 11 of 2021 wef 01/08/2022] ( f ) to administer the Residential Property Act 1976; ( g ) to report to and advise the Government on matters relating to land survey, land tenure, land transactions, land ownership, land boundaries and the administration, management, allocation, acquisition and disposition of State land; ( h ) to maintain and provide access by the public to documents and information relating to land survey, land tenure, land transactions, land ownership, land boundaries, State lands, State titles and other related matters kept or maintained by the Authority; ( i ) to manage technical cooperation and exchange in the area of land survey and land resource administration and management with other persons and organisations, including foreign organisations and international intergovernmental organisations, on its own or on behalf of the Government; ( j ) to represent the Government internationally in respect of matters relating to land survey and land resource administration and management; ( k ) to provide training, advice and assistance in relation to land survey and land resource administration and management to any Government department or any public authority, or to authorities of other countries and territories which administer and manage public lands and resources; ( l ) to provide administrative support services to the Land Surveyors Board in the performance of its functions under the Land Surveyors Act 1991; and ( m ) to exercise any other functions and duties conferred on the Authority by or under this Act or any other written law. (2) In carrying out its functions, the Authority must — ( a ) have regard to efficiency and economy and to the social, industrial, commercial and economic needs of Singapore; and ( b ) as far as practicable, promote, develop and provide facilities or services that facilitate or are necessary for land planning, land infrastructure development and maintenance, and economic growth in Singapore. (3) In addition to the functions and duties imposed by this section, the Authority may undertake any other functions that the Minister may assign to the Authority and in so doing, the Authority is deemed to be fulfilling the purposes of this Act, and the provisions of this Act apply to the Authority in respect of those functions. (4) Nothing in this section is to be construed as imposing on the Authority, directly or indirectly, any form of duty or liability enforceable by proceedings before any court."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "7",
      "title": "Powers of Authority",
      "content": "7. —(1) The Authority has power to do anything for the purpose of discharging its functions under this Act or under any other written law, or which it may consider advantageous, necessary or convenient to the discharge of those functions and in particular, may — ( a ) formulate and implement policies to optimise land resources and build up the supporting infrastructure; ( b ) administer systems for the recording and registration of transactions relating to land under the Land Titles Act 1993, the Land Titles (Strata) Act 1967 and the Registration of Deeds Act 1988; ( c ) collect, compile and analyse information relating to land tenure, geography, transactions relating to land or other subject matter necessary or connected with the establishment and maintenance of an integrated spatial reference database or information system (and related products and services) or the performance of any of its other functions, and make available, publish or disseminate such information, products or services or the results of such compilation or analysis; ( d ) prescribe, regulate or implement measures, guidelines and standards on any matter related to or connected with land survey and land registration; ( e ) prescribe policies, standards and common methods of capturing geographical and other information and information relating to land tenure, land transactions, land ownership, land boundaries and other related matters so as to facilitate the mutual exchange and dissemination of such information; ( f ) levy any charges or fees that are reasonable for services and facilities provided by the Authority; ( g ) form or participate in the formation of any company or in any joint venture as a shareholder or partner or in any other capacity, with any firm, body corporate, society or institution for the purposes of this Act or any other written law and to share profits; ( h ) subscribe for or acquire any securities and shares of an incorporated company or other body corporate, procure its admission to membership of an incorporated company limited by guarantee, promote the formation of or participate in the promotion of an incorporated company or acquire an undertaking or part of an undertaking; ( i ) engage in conjunction with other authorities, international agencies or organisations in any study or cooperation project related to or connected with land resource administration and management or in the promotion of land administration and management; ( j ) regulate and control any activity related to or connected with the network of survey control marks in Singapore; ( k ) enter into contracts for itself or for the Government for the supply of goods or materials or for the execution of works or any other contract as may be necessary for the discharge of its duties and functions under this Act or any other written law; ( l ) lease, let, develop or otherwise utilise any property, movable or immovable, vested in or acquired by the Authority on the terms and conditions that the Authority thinks fit; ( m ) provide financial loans, advances, grants, aid or assistance to any person for all or any of the purposes of this Act; ( n ) provide bursaries, scholarships and training grants in the field of land administration and management; ( o ) receive donations, grants, gifts, subsidies and contributions from any source and raise funds by all lawful means; ( p ) make provision for pensions, gratuities, allowances or other benefits for employees or former employees of the Authority; ( q ) grant or guarantee loans to officers or employees of the Authority for any purpose specifically approved by the Authority; ( r ) provide recreational facilities and promote recreational activities for, and activities conducive to, the welfare of officers and employees of the Authority and members of their families; and ( s ) do any other acts incidental to any of its functions and powers. (2) This section is not to be construed as limiting any power of the Authority conferred by or under any other written law."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "8",
      "title": "Power to request for information",
      "content": "8. —(1) Without affecting section 7, the Authority, or any officer authorised on its behalf, may request any person to provide the Authority with information relating to land tenure, land transactions, land ownership, land boundaries or other geographical information. (2) A request under subsection (1) — ( a ) must be in writing; ( b ) must be served on the person to whom it is addressed; ( c ) must specify the particulars of information required; ( d ) may specify the form in which and the time within which the information is to be provided; ( e ) may require the information to be provided periodically at or within the time or times and in the form or forms specified in the request; and ( f ) may specify the place or manner at or in which the information is to be delivered. (3) Any person who — ( a ) wilfully refuses or without lawful excuse (the proof of which lies on the person) neglects — (i) to provide the information required within the time allowed in any request under subsection (1) for providing the information; (ii) to provide the information in the form specified in any request under subsection (1); or (iii) to deliver the information at the place or in the manner specified in any request under subsection (1) for the delivery thereof; or ( b ) wilfully provides or causes to be provided any false information in respect of any matter specified in a request under subsection (1), shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 and, in the case of a continuing offence, to a further fine not exceeding $100 for every day or part of a day during which the offence continues after conviction. (4) Nothing in this section obliges or binds any person to provide any information not in the person’s possession or which the person is prohibited by law from disclosing."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "9",
      "title": "Directions by Minister",
      "content": "9. —(1) The Minister may give to the Authority any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (2) The Authority must provide the Minister with any information in respect of its property and activities in the manner and at the times that the Minister may require."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AUTHORITY",
      "section": "10",
      "title": "Appointment of committees and delegation of powers",
      "content": "10. —(1) The Authority may appoint from among its own members or from other persons who are not members any number of committees that it thinks fit for purposes which, in the opinion of the Authority, would be better regulated and managed by means of those committees. (2) The Authority may, subject to any conditions or restrictions that it thinks fit, delegate to any committee appointed under subsection (1) or to the Chairperson or Chief Executive or to any other member, officer or employee of the Authority any of the functions or powers of the Authority under this Act or any other written law. [5/2018] (3) Any function or power delegated under subsection (2) to any committee or person may be performed or exercised by the committee or person to whom it has been delegated in the name and on behalf of the Authority."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "11",
      "title": "Chief Executive, officers and employees, etc.",
      "content": "11. —(1) There must be a Chief Executive of the Authority, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Authority may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive during any period, or during all periods, when the Chief Executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018] (3) The Authority may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on any terms and conditions that the Authority determines, any other officers, employees, consultants and agents that may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "12",
      "title": "Protection from personal liability",
      "content": "12. —(1) No suit or other legal proceedings shall lie personally against any member, officer or employee of the Authority or any other person acting under the direction of the Authority for anything which is in good faith and with reasonable care done or omitted to be done in the execution or purported execution of this Act or any other written law. [Act 42 of 2022 wef 01/11/2024] (2) Where the Authority provides a service to the public by which information is supplied to the public pursuant to any written law, neither the Authority nor any of its members, officers or employees involved in the supply of the information shall be liable for any loss or damage suffered by any member of the public by reason of any error or omission of any nature appearing in the information or however caused if made in good faith and in the ordinary course of the discharge of the duties of that member, officer or employee. 13. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "14",
      "title": "Funds and property of Authority",
      "content": "14. The funds and property of the Authority consist of — ( a ) grants made under section 19; ( b ) all moneys paid to the Authority by way of grants, subsidies, donations, gifts and contributions; ( c ) all fees and charges payable to the funds of the Authority under any written law; [Act 42 of 2022 wef 01/11/2024] ( d ) all moneys received by the Authority by way of charges and fees for services rendered by the Authority to any person, including any collection agency fee; ( e ) all moneys derived from the disposal, lease or hire of, or any other dealing with, any property vested in or acquired by the Authority; ( f ) all accumulations of income derived from any such property or money, including any gains made on the sale of any investment of such money, and interest or gains thereon; ( g ) all moneys borrowed by the Authority under this Act; and ( h ) all other moneys and property lawfully received by the Authority for the purposes of the Authority."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "15",
      "title": "Application of moneys",
      "content": "15. The moneys of the Authority for any financial year must be applied in defraying the following charges: ( a ) the remuneration, fees and allowances of the members of the Authority; ( b ) the salaries, fees, remuneration, pensions, superannuation allowances and gratuities of the officers, agents, employees, advisers and former employees of the Authority; ( c ) working and establishment expenses and expenditure on, or provision for, the maintenance of any of the property of the Authority, and the discharge of the functions of the Authority properly chargeable to revenue account; ( d ) expenses incurred or incidental to the investment or management of the moneys or property of the Authority; ( e ) interest on any loan raised by the Authority; ( f ) sums required to be transferred to a sinking fund or otherwise set aside for the purpose of making provision for the repayment of borrowed money; ( g ) any sums that may be deemed appropriate to set aside in respect of depreciation or renewal of the property of the Authority, having regard to the amount set aside out of revenue under paragraphs ( c ) and ( f ); ( h ) the cost, or any portion of the cost, of any new works, plant, vessels or appliances not being a renewal of the property of the Authority, which the Authority may determine to charge to revenue; ( i ) any sums by way of contribution, for the purposes associated with the objects of this Act that the Authority may determine, to the public or for charities; and ( j ) any other expenditure authorised by the Authority and properly chargeable to revenue account."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "16",
      "title": "Bank accounts",
      "content": "16. —(1) The Authority must open and maintain an account or accounts with such bank or banks as the Authority thinks fit. (2) Every such account must be operated by such person or persons authorised to do so by the Authority."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "17",
      "title": "Minister’s approval of estimates",
      "content": "17. —(1) A copy of all annual estimates of revenue and expenditure and supplementary estimates must, upon their adoption by the Authority, be sent without delay to the Minister. [5/2018] (2) The Minister may approve or disallow any item or portion of any item shown in the annual estimates or supplementary estimates. [5/2018] (3) The Minister must return the annual estimates or supplementary estimates as amended under subsection (2) to the Authority, and the Authority is bound by the Minister’s decision. [5/2018]"
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "18",
      "title": "Power of investment",
      "content": "18. The Authority may invest its funds in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [45/2004]"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "19",
      "title": "Grants",
      "content": "19. For the purpose of enabling the Authority to carry out its functions under this Act, the Minister may make grants to the Authority of such sums of money as the Minister may determine out of moneys to be provided by Parliament."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "20",
      "title": "Power to borrow",
      "content": "20. For the discharge of its functions or duties under this Act or any other written law, the Authority may raise loans from the Government or, with the approval of the Minister for Finance, raise loans from banks or other financial institutions (whether in Singapore or elsewhere) by — ( a ) mortgage, overdraft or otherwise; ( b ) charge, whether legal or equitable, on any property vested in the Authority or on any other revenue receivable by the Authority under this Act or any other written law; or ( c ) the creation and issue of debentures or bonds."
    },
    {
      "provision_ref": "s20A",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "20A",
      "title": "Issue of shares, etc.",
      "content": "20A. As a consequence of — ( a ) the vesting of any property, rights or liabilities of the Government in the Authority under this Act; or ( b ) any capital injection or other investment by the Government in the Authority in accordance with any written law, the Authority must issue such shares or other securities to the Minister for Finance as that Minister may direct. [5/2002]"
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "21",
      "title": "Financial year",
      "content": "21. The financial year of the Authority begins on 1 April of each year and ends on 31 March of the succeeding year. [5/2018]"
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "30",
      "title": "Symbol or representation of Authority",
      "content": "30. —(1) The Authority has the exclusive right to the use of any symbol or representation that the Authority may select or devise and to display or exhibit the symbol or representation in connection with its activities or affairs. (2) Any person who uses a symbol or representation identical with that of the Authority or which so resembles the Authority’s symbol or representation as to deceive or cause confusion, or to be likely to deceive or cause confusion, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s31",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "31",
      "title": "Powers of enforcement",
      "content": "31. —(1) In addition to the powers conferred by this Act or any other written law, an officer or employee of the Authority may, in relation to any offence under this Act or any written law set out in the Third Schedule, on declaration of his or her office and production to the person against whom he or she is acting of the identification card directed by the Chief Executive to be carried by officers or employees of the Authority — ( a ) require any person whom the officer or employee reasonably believes to have committed that offence to furnish evidence of the person’s identity; ( b ) require any person to furnish any information or produce any book, document or copy thereof in the possession of that person, and may, without fee or reward, inspect, copy or make extracts from such book or document; and ( c ) require, by written order, the attendance before the officer or employee of any person within the limits of Singapore who, from any information given or otherwise obtained by the officer or employee, appears to be acquainted with the circumstances of the case. (2) Any person who — ( a ) refuses to give access to, or assaults, obstructs, hinders or delays, an officer or employee of the Authority in the discharge of the duties by that officer or employee under this Act or that other written law; ( b ) wilfully misstates or without lawful excuse refuses to give any information or produce any book, document or copy thereof required of the person by an officer or employee of the Authority under subsection (1); or ( c ) fails to comply with a lawful demand of an officer or employee of the Authority in the discharge of the duties by that officer or employee under this Act or that other written law, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "32",
      "title": "Offences committed by bodies corporate, etc.",
      "content": "32. —(1) Where an offence under this Act which has been committed by a body corporate is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of, a director, manager, secretary or any similar officer of the body corporate, or any person who was purporting to act in any such capacity, he or she, as well as the body corporate, shall be guilty of that offence and shall be liable to be proceeded against and punished accordingly. (2) Where the affairs of a body corporate are managed by its members, subsection (1) applies in relation to the acts and defaults of a member in connection with the member’s functions or management as if the member were a director of the body corporate. (3) Proceedings for an offence under this Act alleged to have been committed by a partnership must be brought in the name of the partnership and not in that of the partners; but without affecting any liability of the partners under subsection (5). (4) A fine imposed on a partnership on its conviction in such proceedings must be paid out of the partnership assets. (5) Where a partnership is guilty of an offence under this Act, every partner, other than a partner who is proved to have been ignorant of or to have attempted to prevent the commission of the offence, is also guilty of the offence and liable to be proceeded against and punished accordingly."
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "33",
      "title": "Composition of offences",
      "content": "33. —(1) The Chief Executive or any officer authorised by the Chief Executive may compound any offence under this Act which is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum not exceeding $1,000. (2) On payment of the sum, no further proceedings are to be taken against that person in respect of the offence. (3) All sums collected under this section must be paid into the Consolidated Fund. [Act 42 of 2022 wef 01/11/2024]"
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "34",
      "title": "Proceedings conducted by officers of Authority",
      "content": "34. —(1) Proceedings in respect of an offence under this Act or under any written law set out in the Third Schedule may, with the authorisation of the Public Prosecutor, be conducted by an officer of the Authority who is authorised in writing in that behalf by the Chief Executive. [15/2010] (2) Despite any written law, a legal officer of the Authority who has been admitted as an advocate and solicitor under the Legal Profession Act 1966 may — ( a ) appear in any civil proceedings involving the Authority or any Registrar in the performance of the Registrar’s functions or duties under any written law so specified; and ( b ) make and do all acts and applications in respect of such proceedings on behalf of the Authority or any Registrar, as the case may be. (3) [ Deleted by Act 42 of 2022 wef 01/11/2024 ] (4) The Minister may, by order in the Gazette , amend the Third Schedule. (5) For the purposes of this section, “Registrar” means — ( a ) the Registrar of Titles appointed under the Land Titles Act 1993; ( b ) the Registrar of Deeds appointed under the Registration of Deeds Act 1988; or ( c ) the Controller of Residential Property appointed under the Residential Property Act 1976."
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "35",
      "title": "Preservation of secrecy",
      "content": "35. —(1) Except for the purpose of the performance of his or her duties or the exercise of his or her functions or when lawfully required to do so by any court or where required or allowed by any written law, a person who is or has been a member, an officer, employee or an agent of the Authority or a member of a committee of the Authority must not disclose any information or matter relating to the affairs of the Authority or of any other person which has been obtained by the person in the performance of the person’s duties or the exercise of the person’s functions. [5/2018] (2) A person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "36",
      "title": "Rules",
      "content": "36. —(1) The Authority may make rules for carrying out the purposes and provisions of this Act. (2) Without limiting subsection (1), the Authority may make rules for or with respect to all or any of the following matters: ( a ) the manner of appointment, conduct and discipline and the terms and conditions of service of the employees of the Authority; ( b ) the establishment of funds for the payment of gratuities and other benefits to employees of the Authority."
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "37",
      "title": "References in other written law",
      "content": "37. —(1) Where in any written law reference is made to the Land Office, the Survey Department or the Singapore Land Registry, the reference is to be read as a reference to the Authority. (2) The Registry of Deeds mentioned in the Registration of Deeds Act 1988 and the Land Titles Registry mentioned in the Land Titles Act 1993 are transferred to the Authority and all references in any written law to the Registry of Deeds or the Land Titles Registry are to be read as references to the Registry of Deeds or the Land Titles Registry (as the case may be) of the Authority."
    }
  ],
  "definitions": [
    {
      "term": "Authority",
      "definition": "“Authority” means the Singapore Land Authority established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Authority and includes any temporary Chairperson of the Authority;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive",
      "definition": "“Chief Executive” means the Chief Executive of the Authority, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "debenture",
      "definition": "“debenture” includes debenture stock;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means the Deputy Chairperson of the Authority and includes any temporary Deputy Chairperson of the Authority;",
      "source_provision": "s2"
    },
    {
      "term": "land",
      "definition": "“land” includes foreshores and any interest in land;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means any member of the Authority;",
      "source_provision": "s2"
    },
    {
      "term": "public authority",
      "definition": "“public authority” means any board, body or authority established by or under any written law to perform or discharge any public function;",
      "source_provision": "s2"
    },
    {
      "term": "securities",
      "definition": "“securities” , in relation to a company, includes shares, debentures, bonds and other securities of the company, whether or not constituting a charge on the assets of the company;",
      "source_provision": "s2"
    },
    {
      "term": "shares",
      "definition": "“shares” includes stock;",
      "source_provision": "s2"
    },
    {
      "term": "State land",
      "definition": "“State land” means all land in Singapore except — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "State title",
      "definition": "“State title” includes any grant in fee simple or estate in perpetuity, any State lease (of whatever tenure) and any temporary occupation licence. [5/2018]",
      "source_provision": "s2"
    }
  ]
}