{
  "id": "smvsa-2020",
  "type": "statute",
  "title": "Small Motorised Vehicles (Safety) Act 2020",
  "title_en": "Small Motorised Vehicles (Safety) Act 2020",
  "short_name": "SMVSA2020",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SMVSA2020",
  "description": "An Act to control the import of motorised personal mobility devices, power‑assisted bicycles and other similar motorised vehicles, and to make related amendments to certain other land transport Acts regarding the payment of moneys into the Consolidated Fund.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title and commencement",
      "content": "1. —(1) This Act is the Small Motorised Vehicles (Safety) Act 2020. (2) Paragraph ( c ) of the definition of “personal mobility device” or “PMD” in section 2(1) and paragraph ( c ) of the definition of “power‑assisted bicycle” or “PAB” in section 2(1) come into operation on a date that the Minister appoints by notification in the Gazette . [Act 31 of 2022 wef 01/11/2022]"
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. —(1) In this Act, unless the context otherwise requires — “authorised officer”, for any provision of this Act, means an individual who is appointed under section 17 as an authorised officer for the purposes of that provision; “Authority” means the Land Transport Authority of Singapore constituted under the Land Transport Authority of Singapore Act 1995; “conveyance” includes any vessel, train, vehicle or aircraft in which persons or goods can be carried; “customs territory” means any part of Singapore and her territorial waters but excludes any free trade zone; “export”, in relation to any goods, means — ( a ) to take or cause to be taken out of the customs territory by land, water or air to any place, including a free trade zone; or ( b ) to place goods in any form of conveyance for the purpose of taking the goods out of the customs territory by land, water or air to any place, including a free trade zone, but does not include the taking out from the customs territory of any goods in transit unless those goods have been landed or transhipped within the customs territory; “free trade zone” means any area in Singapore declared to be a free trade zone under the Free Trade Zones Act 1966; “identification card”, in relation to an authorised officer, means an identification card issued under section 18 to the authorised officer; “import” means to bring or cause to be brought into the customs territory by land, water or air from — ( a ) any place outside Singapore; or ( b ) a free trade zone, but does not include to tranship or to transit; “import approval” means an import approval under section 5(2)( a ); “limited liability partnership” has the meaning given by the Limited Liability Partnerships Act 2005; “notice” does not include giving notice orally; “offence under this Act” includes an offence under any regulations; “personal mobility device” or “PMD” means — ( a ) a wheeled vehicle that — (i) is built to transport people only (with or without carry‑on baggage); (ii) is suitable for use on land other than a railway; and (iii) is propelled by an electric motor attached to the vehicle or by human power and such a motor; ( b ) a partly assembled and substantially complete vehicle that would otherwise be covered by paragraph ( a ) if fully assembled and completed; or ( c ) an unassembled or a completely knocked‑down vehicle that would otherwise be covered by paragraph ( a ) if fully assembled and completed, but does not include a power‑assisted bicycle, trolley, inline skates or a wheeled toy, and such other vehicle as the Minister may, by order in the Gazette , exclude from this definition; “power-assisted bicycle” or “PAB” means — ( a ) a bicycle that — (i) is equipped with an electric motor; and (ii) may be propelled by human power or by the electric motor with which it is equipped, or by both; ( b ) a partly assembled and substantially complete vehicle that would otherwise be covered by paragraph ( a ) if fully assembled and completed; or ( c ) an unassembled or a completely knocked‑down vehicle that would otherwise be covered by paragraph ( a ) if fully assembled and completed; “premises” means a building or structure (whether permanent or temporary) or part of a building or structure; “regulations” means regulations made under section 27; “small motorised vehicle” means — ( a ) a personal mobility device; ( b ) a power-assisted bicycle; or ( c ) a type of motorised vehicle intended ordinarily for use on land (other than railway) to transport people or people and goods, that is prescribed as a small motorised vehicle for the purposes of this Act; “tranship” means to bring any goods into the customs territory solely for the purpose of taking them out of the customs territory (whether on the same conveyance on which they were brought in or on another conveyance) where the goods are landed and kept at any place in the customs territory pending their being taken out of the customs territory; “transit” means to bring goods into the customs territory from a place outside the customs territory for the purpose of taking them out of the customs territory on the same conveyance on which they were brought into the customs territory; “vessel” includes any ship or boat or other description of vessel used in navigation on water. (2) Unless expressly provided otherwise in this Act, any word or expression in this Act that is defined in section 2(1) of the Active Mobility Act 2017 has the meaning given to it by that section. (3) For the purposes of this Act, any notice or other document that is required by or under this Act to be sent or given to the Authority is taken to be sent or given only when it is actually received by the Authority."
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "3",
      "title": "Purposes of Act",
      "content": "3. The purposes of this Act are to provide consumers in Singapore with a choice of small motorised vehicles that meet safety standards and that are able to make use of technological advancements by — ( a ) prohibiting the import into Singapore of small motorised vehicles that do not comply with vehicle standards (except in limited circumstances); and ( b ) distinguishing those which are non‑compliant."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "4",
      "title": "Act binds Government",
      "content": "4. —(1) This Act binds the Government. (2) However, nothing in this Act — ( a ) renders the Government liable to prosecution for an offence under this Act; or ( b ) prevents any public officer from exercising his or her powers or carrying out his or her duties under this Act or any other written law. (3) To avoid doubt, no person is immune from prosecution for any offence under this Act by reason only that the person is engaged to provide services to or on behalf of the Government."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - IMPORT CONTROLS",
      "section": "5",
      "title": "Importing small motorised vehicle needs approval",
      "content": "5. —(1) A person commits an offence if — ( a ) the person imports a small motorised vehicle; and ( b ) at the time of import, the person is not permitted to import the small motorised vehicle. (2) A person is permitted to import a small motorised vehicle if — ( a ) at the time of import, all of the following apply: (i) the person is granted an import approval; (ii) the import approval is in force; (iii) the small motorised vehicle is specified or described in the import approval; ( b ) at the time of import, all of the following apply: (i) the person is authorised, in writing, by the person who is granted an import approval to import the small motorised vehicle; (ii) the import approval is in force; (iii) the small motorised vehicle is specified or described in the import approval; or ( c ) at the time of import, a circumstance prescribed in the regulations applies. (3) A person who is guilty of an offence under subsection (1) shall be liable on conviction — ( a ) where the person is an individual — (i) to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both; but (ii) where the individual is a repeat offender, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both; or ( b ) in any other case — (i) to a fine not exceeding $10,000; but (ii) where the person is a repeat offender, to a fine not exceeding $20,000. (4) In subsection (3), “repeat offender” means a person who — ( a ) is convicted, or found guilty, of an offence under subsection (1) (called the current offence); and ( b ) has been convicted or found guilty, on at least one other earlier occasion within the period of 5 years immediately before the date on which the person is convicted or found guilty of the current offence, of the same offence."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - IMPORT CONTROLS",
      "section": "6",
      "title": "Approvals for import",
      "content": "6. An import approval for the import of any small motorised vehicle, and the transfer of such approval, may be applied for, and granted or refused by the Authority, only in accordance with the regulations."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - IMPORT CONTROLS",
      "section": "7",
      "title": "Cancellation of import approval",
      "content": "7. —(1) The Authority may, in the prescribed manner, cancel an import approval for the import of a small motorised vehicle if the Authority — ( a ) becomes aware of a circumstance that would have required or permitted the Authority to refuse to grant the approval, had it been aware of the circumstance immediately before granting the approval; ( b ) is satisfied that a condition of the approval for the import of the small motorised vehicle has been contravened or is being contravened; or ( c ) is satisfied that the approval was granted as a result of any declaration, statement, representation or information which is false in a material particular. (2) Where the Authority cancels under subsection (1) an import approval granted to a person, the person may, if aggrieved by that decision, appeal to the Minister against the decision, within a prescribed period after the date the decision appealed against is given to the person, and in accordance with the regulations. (3) The Minister may reject an appeal of an appellant who fails to comply with subsection (2). (4) After considering an appeal, the Minister may — ( a ) reject the appeal and confirm the decision appealed against; or ( b ) allow the appeal and reverse the decision appealed against. (5) The Minister’s decision on an appeal is final. (6) Every appellant must be notified of the Minister’s decision under subsection (5). (7) An appeal under subsection (2) against a decision of the Authority under subsection (1) does not affect the operation of the decision appealed against or prevent the taking of action to implement the decision, and unless otherwise directed by the Minister under this subsection, the decision appealed against must be complied with until the determination of the appeal. (8) In this section, “Minister”, in relation to any appeal under subsection (2), includes a Second Minister, Minister of State or Parliamentary Secretary designated by the Minister to hear that appeal."
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - IMPORT CONTROLS",
      "section": "8",
      "title": "Breach of purpose of imported vehicle",
      "content": "8. —(1) A person commits an offence if — ( a ) the person is granted an import approval to import a small motorised vehicle for a purpose specified in the import approval that — (i) is not a sale, letting for hire or other distribution by way of trade of the vehicle in Singapore; and (ii) is not one that requires the person to export or destroy the vehicle; and ( b ) the person intentionally or negligently uses, or allows to be used, the small motorised vehicle for another purpose. (2) A person commits an offence if — ( a ) the person is granted an import approval to import a small motorised vehicle for a purpose specified in the import approval that requires the person to export or destroy the vehicle; and ( b ) the person intentionally or negligently does not export or destroy or cause the export or destruction of the small motorised vehicle within the period specified in the import approval. (3) A person commits an offence if — ( a ) the person is granted an import approval to import a small motorised vehicle subject to a condition that does not require the person to export or destroy the vehicle; and ( b ) the person intentionally or negligently contravenes or fails to comply with the condition. (4) A person who is guilty of an offence under subsection (1), (2) or (3) shall be liable on conviction — ( a ) where the person is an individual — (i) to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 3 months or to both; but (ii) where the individual is a repeat offender, to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both; or ( b ) in any other case — (i) to a fine not exceeding $5,000; but (ii) where the person is a repeat offender, to a fine not exceeding $10,000. (5) In subsection (4), “repeat offender” means a person who — ( a ) is convicted, or found guilty, of an offence under subsection (1), (2) or (3) (called the current offence); and ( b ) has been convicted or found guilty, on at least one other earlier occasion within the period of 5 years immediately before the date on which the person is convicted or found guilty of the current offence, of the same offence. (6) In proceedings for an offence under subsection (1) or (3), it is a defence to the charge for the accused to prove, on a balance of probabilities, that — ( a ) the use of the small motorised vehicle for another purpose was authorised by the Authority; or ( b ) the contravention or failure to comply with a condition of an import approval was authorised by the Authority."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - ENFORCEMENT",
      "section": "9",
      "title": "Purpose for which enforcement powers are exercisable by authorised officers",
      "content": "9. —(1) An authorised officer may exercise the powers set out in sections 10 and 11 for any of the following purposes: ( a ) to investigate an offence under this Act reasonably believed to have been committed; ( b ) to determine compliance with any condition of an import approval for the import of any small motorised vehicle; ( c ) to determine whether information provided to the Authority under this Act is correct; ( d ) to investigate whether there are grounds for taking any action under section 7 against a person granted an import approval. (2) To avoid doubt, nothing in this Part limits section 39 of the Land Transport Authority of Singapore Act 1995 with respect to an offence under this Act."
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - ENFORCEMENT",
      "section": "10",
      "title": "Powers of entry, etc., at premises",
      "content": "10. —(1) An authorised officer may, subject to subsection (2), enter and inspect any relevant premises and do all or any of the following: ( a ) to examine any thing or observe any activity conducted in or on the premises, including — (i) to detain any package, box, container or other thing in or on the premises until any person in charge of the package, box, container or thing has opened it for examination and search; (ii) to mark, lock, seal or otherwise secure the package, box, container or other thing pending examination and search; and (iii) if the thing appears to be a small motorised vehicle, to order any person in charge of the vehicle to deliver the vehicle (in that state it is found on the date of the order) for weighing or an inspection by a person and at a time and place specified by the authorised officer; ( b ) to search the premises and any thing in or on the premises; ( c ) to make a still or moving image or recording of the premises and any thing in or on the premises; ( d ) to inspect any document in the premises and take extracts from, or make copies of, any such document; ( e ) to take into or onto the premises such equipment and materials as the authorised officer requires for the purpose of exercising powers in relation to the premises; ( f ) to operate electronic equipment in or on the premises; ( g ) to secure a thing for a period not exceeding 24 hours if the thing is found in or on the premises, where the authorised officer believes on reasonable grounds that — (i) the thing is evidential material relevant to an offence under this Act; and (ii) it is necessary to secure the thing in order to prevent it from being concealed, lost or destroyed before a warrant to seize the thing is obtained; ( h ) to seize any thing found in or on the premises which the authorised officer reasonably suspects is as described in paragraph ( g )(i); ( i ) to require any relevant person, or any individual found in or on the relevant premises, to answer any question (to the best of that person’s or individual’s knowledge, information and belief) and to provide any document or information that the authorised officer reasonably requires for any of the purposes of section 9. (2) However, an authorised officer is not authorised by subsection (1) — ( a ) to enter and search any relevant premises that is a place of accommodation or residence, except — (i) with the consent of the occupier; or (ii) under a warrant of a Magistrate’s Court or District Court; or ( b ) to seize any thing in or on any relevant premises unless the seizure is made under a warrant of a Magistrate’s Court or District Court, being a thing other than a vehicle or vehicle component mentioned in section 11. (3) A warrant mentioned in subsection (2) may be issued if a Magistrate’s Court or District Court is satisfied that it is necessary for the authorised officer to enter any relevant premises, search any relevant premises or seize any thing (as the case may be) for any of the purposes of section 9. (4) The power under subsection (1)( f ) to operate electronic equipment in or on any relevant premises includes the power — ( a ) to use a disk, tape or other storage device that is in or on the premises and can be used with the equipment or in association with the equipment; ( b ) to operate electronic equipment in or on the premises to put the relevant data in documentary form and remove the documents so produced from those premises; and ( c ) to operate electronic equipment in or on the premises to transfer the relevant data to a disk, tape or other storage device that — (i) is brought to the premises for the exercise of the power; or (ii) is in or on the premises and the use of which for that purpose has been agreed in writing by the occupier of the premises, and to remove the disk, tape or other storage device from those premises. (5) The power under subsection (1)( g ) to secure any thing which is found during the exercise of enforcement powers in or on any relevant premises includes the power — ( a ) to secure the thing by locking it up, placing a guard or any other means; and ( b ) to prohibit any person from dealing with such thing. (6) The power to require an individual to provide any document or information under subsection (1)( i ) includes the power — ( a ) to require that individual to provide an explanation of the document or information; ( b ) if the document or information is not provided, to require that individual to state, to the best of the individual’s knowledge and belief, where it is; and ( c ) if the information is recorded otherwise than in legible form, to require the information to be made available to the authorised officer or the Authority in legible form. (7) The Authority is entitled without payment to keep any document or information, or any copy or extract thereof, provided to an authorised officer under subsection (1)( i ). (8) In this section — “relevant person” means — ( a ) a person to whom an import approval is or was granted under this Act; ( b ) an individual who is or was an officer or a representative of a person mentioned in paragraph ( a ); ( c ) an individual who is or was an employee of a person mentioned in paragraph ( a ); or ( d ) a person whom an authorised officer suspects on reasonable grounds is or was an importer of small motorised vehicles, or an agent of such a person; “relevant premises” means any premises in Singapore that an authorised officer believes on reasonable grounds — ( a ) is used for or in connection with — (i) the import of small motorised vehicles; or (ii) the storage or supply of small motorised vehicles that are being, or are about to be, or have recently been imported; or ( b ) is under the control or management of a relevant person in paragraph ( a ) or ( d ) of the definition of “relevant person”."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - ENFORCEMENT",
      "section": "11",
      "title": "Power to seize vehicles",
      "content": "11. —(1) Where an authorised officer has reason to believe that a small motorised vehicle or vehicle component is a vehicle or component in connection with which an offence under section 5 or 8 has been or is being committed, the authorised officer may, without warrant — ( a ) seize the vehicle or vehicle component and take it to a holding yard; or ( b ) require the owner or person in charge of the vehicle or vehicle component to take the vehicle or component (as the case may be) to and surrender it at a specified holding yard. (2) The power conferred on an authorised officer under subsection (1)( a ) may be exercised whether or not the owner or person in charge of the vehicle or vehicle component is present at the time of its seizure. (3) When a vehicle or vehicle component is seized under this section by an authorised officer, the authorised officer concerned must, as soon as practicable, give notice of the seizure and the grounds of doing so to the owner of the vehicle or component (if known) except that the notice is not required to be given where the seizure is made in the presence of the owner or the owner’s agent. (4) A person who, without reasonable excuse, refuses or neglects to comply with any requirement under subsection (1)( b ) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000 or to imprisonment for a term not exceeding 3 months or to both."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - ENFORCEMENT",
      "section": "12",
      "title": "Offence of non-compliance, etc.",
      "content": "12. —(1) A person commits an offence if the person — ( a ) without prior permission of an authorised officer, opens, breaks, alters or removes any mark, lock, seal or other safeguard used to secure a package, box, container or other thing under section 10(1)( a )(ii) or ( g )(ii); or ( b ) without reasonable excuse, fails to do anything required of the person by an authorised officer under section 10(1). (2) A person commits an offence if the person intentionally alters, suppresses or destroys any document or information which the person has been required by an authorised officer under section 10(1)( i ) to provide. (3) A person who is guilty of an offence under subsection (1) shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both. (4) A person who is guilty of an offence under subsection (2) shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both. (5) In any proceedings for an offence under subsection (1), it is a defence for the accused to prove, on a balance of probabilities, that — ( a ) the person does not possess the document or information required; or ( b ) the person has taken all reasonable steps available to the person to obtain the document or information required and has been unable to obtain it. (6) To avoid doubt, for the purposes of subsection (1), it is a reasonable excuse for a person to refuse or fail to provide any information, produce any document or answer any question if doing so might tend to incriminate that person."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - ENFORCEMENT",
      "section": "13",
      "title": "Offence of providing false information, etc.",
      "content": "13. —(1) If — ( a ) a person provides a document, or makes a statement (whether orally, in writing or any other way) or gives information, to the Authority or an authorised officer; ( b ) the document, statement or information is false or misleading, or the statement or information omits any matter or thing without which the statement or information (as the case may be) is misleading; ( c ) the person knows, or ought reasonably to know, that the document is false or misleading, or that the statement or information is as described in paragraph ( b ); and ( d ) the document is provided, or the statement is made or the information is given, for or in connection with — (i) an application for or relating to an import approval under this Act; or (ii) a question or request of the Authority or an authorised officer made under this Act, the person shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both. (2) Subsection (1) does not apply if the document, statement or information — ( a ) is not false or misleading in a material particular; or ( b ) did not omit any matter or thing without which the statement or information (as the case may be) is misleading in a material particular."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - ENFORCEMENT",
      "section": "14",
      "title": "Composition of offences",
      "content": "14. —(1) The Chief Executive of the Authority, or any employee of the Authority authorised in writing by the Authority for the purpose of this section, may compound any offence under this Act that is prescribed as a compoundable offence. (2) A compoundable offence may be compounded under this section by collecting from a person reasonably suspected of having committed the offence a sum not exceeding the lower of the following: ( a ) one half of the amount of the maximum fine that is prescribed for the offence; ( b ) $5,000. (3) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence. (4) All sums collected under this section must be paid into the Consolidated Fund."
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - ENFORCEMENT",
      "section": "15",
      "title": "Forfeiture of vehicles, etc.",
      "content": "15. —(1) Subject to this section, all things seized or surrendered under the provisions of this Act are liable to forfeiture by a court. (2) An order for the forfeiture may be made by the Authority in respect of a vehicle or vehicle components seized or surrendered under this Act if the Authority is satisfied that — ( a ) the vehicle is a non‑compliant personal mobility device or non‑compliant power‑assisted bicycle or the vehicle components if assembled result in a non‑compliant personal mobility device or non‑compliant power‑assisted bicycle; ( b ) an offence under this Act has been committed and the vehicle was or vehicle components were the subject matter, or was or were used in the commission, of the offence; ( c ) at the end of 30 days after the date of the seizure or surrender, no claim to the vehicle or vehicle components is earlier made in the prescribed manner to the Authority by a person who is none of the following: (i) the person from whom the vehicle was or vehicle components were seized; (ii) the person required to surrender the vehicle or vehicle components; (iii) an agent of a person in sub‑paragraph (i) or (ii); and ( d ) a person is convicted of the offence, or a person reasonably suspected of having committed the offence has that offence compounded under section 14. (3) Despite subsection (2), the Authority may at once order the forfeiture of a vehicle or vehicle components seized or surrendered under this Act — ( a ) that is a non‑compliant personal mobility device or non‑compliant power‑assisted bicycle, or that if assembled result in a non‑compliant personal mobility device or non‑compliant power‑assisted bicycle; and ( b ) that the Authority considers is of such a nature or in such condition that it would be dangerous to retain custody, or the detention of the vehicle or vehicle components in a holding yard materially increases the likelihood of an outbreak of fire at the holding yard. (4) Sections 51, 52 and 53 of the Active Mobility Act 2017 apply to a vehicle or vehicle components seized or surrendered under this Act in the same way as those sections apply to a vehicle seized or surrendered under section 50 of that Act."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - ADMINISTRATION",
      "section": "16",
      "title": "Administration of Act",
      "content": "16. It is the function of the Authority to administer and enforce this Act."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - ADMINISTRATION",
      "section": "17",
      "title": "Authorised officers",
      "content": "17. —(1) The Authority may, in relation to any provision of this Act, appoint as authorised officers for the purposes of that provision from among any of the following who are suitably trained to be authorised officers: ( a ) any individual performing duties in the Authority; ( b ) any auxiliary police officer appointed under the Police Force Act 2004. (2) The Authority may, for any reason that appears to it to be sufficient, at any time revoke an individual’s appointment as an authorised officer. (3) The Authority may delegate the exercise of all or any of the powers conferred or duties imposed upon it by any provision of this Act (except the power of delegation conferred by this subsection) to an authorised officer, subject to such conditions or limitations as set out in this Act or as the Authority may specify; and any reference in that provision of this Act to the Authority includes a reference to such an authorised officer. (4) Any delegation under subsection (3) may be general or in a particular case and may be subject to such conditions or limitations as set out in this Act or as the Authority may specify. (5) A reference in this section to an individual performing duties in the Authority is a reference to — ( a ) an employee of the Authority; or ( b ) a public officer performing duties in the Authority under a secondment arrangement making available temporarily to the Authority the services of public officers."
    },
    {
      "provision_ref": "s18",
      "chapter": "PART 4 - ADMINISTRATION",
      "section": "18",
      "title": "Identification cards and equipment",
      "content": "18. —(1) The Authority must issue to each authorised officer an identification card. (2) Every authorised officer whose appointment as such ceases must return to the Authority any identification card issued to him or her under subsection (1). (3) An authorised officer must produce his or her identification card for inspection — ( a ) before exercising a power under this Act; and ( b ) at any time during the exercise of a power under this Act, if asked to do so. (4) Every authorised officer is to be issued with such equipment, or such description of equipment, as the Authority may determine to be necessary for the effectual discharge of the duties of an authorised officer."
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 4 - ADMINISTRATION",
      "section": "19",
      "title": "Obstructing authorised officers, etc.",
      "content": "19. —(1) A person who refuses to give access to, or obstructs, hinders or delays an authorised officer in the discharge of his or her duties under this Act shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both. (2) However, it is not an offence under subsection (1) for any person to refuse to comply with any request, demand or order made or given by an authorised officer who — ( a ) fails to declare his or her office; and ( b ) refuses to produce his or her identification card on demand being made by that person."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "20",
      "title": "Preservation of secrecy",
      "content": "20. —(1) An individual who is or has been an authorised officer must not disclose any information relating to the affairs of the Authority or of any other person which has been obtained by the individual in the performance of his or her duties or the exercise of his or her functions under this Act, except — ( a ) for the purpose of the performance of his or her duties or the exercise of his or her functions under this Act; or ( b ) when lawfully required or allowed to do so by any court or under the provisions of any written law. (2) An individual who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "21",
      "title": "Protection from personal liability",
      "content": "21. No liability shall lie against an authorised officer for anything done or intended to be done with reasonable care and in good faith in the execution or purported execution of this Act."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "22",
      "title": "Offences by corporations",
      "content": "22. —(1) Where, in a proceeding for an offence under this Act, it is necessary to prove the state of mind of a corporation in relation to a particular conduct, evidence that — ( a ) an officer, employee or agent of the corporation engaged in that conduct within the scope of his or her actual or apparent authority; and ( b ) the officer, employee or agent had that state of mind, is evidence that the corporation had that state of mind. (2) Where a corporation commits an offence under this Act, a person — ( a ) who is — (i) an officer of the corporation; or (ii) an individual involved in the management of the corporation and in a position to influence the conduct of the corporation in relation to the commission of the offence; and ( b ) who — (i) consented or connived, or conspired with others, to effect the commission of the offence; (ii) is in any other way, whether by act or omission, knowingly concerned in, or is party to, the commission of the offence by the corporation; or (iii) knew or ought reasonably to have known that the offence by the corporation (or an offence of the same type) would be or is being committed, and failed to take all reasonable steps to prevent or stop the commission of that offence, shall be guilty of that same offence as is the corporation, and shall be liable on conviction to be punished accordingly. (3) A person mentioned in subsection (2) may rely on a defence that would be available to the corporation if it were charged with the offence with which the person is charged and, in doing so, the person bears the same burden of proof that the corporation would bear. (4) To avoid doubt, this section does not affect the application of — ( a ) Chapters 5 and 5A of the Penal Code 1871; or ( b ) the Evidence Act 1893 or any other law or practice regarding the admissibility of evidence. (5) To avoid doubt, subsection (2) also does not affect the liability of the corporation for an offence under this Act, and applies whether or not the corporation is convicted of the offence. (6) In this section — “corporation” includes a limited liability partnership; “director” has the meaning given by section 4(1) of the Companies Act 1967; “officer”, in relation to a corporation, means any director, partner, chief executive, manager, secretary or other similar officer of the corporation, and includes — ( a ) any person purporting to act in any such capacity; and ( b ) for a corporation whose affairs are managed by its members, any of those members as if the member were a director of the corporation; “reasonable steps”, in relation to the commission of an offence, includes, but is not limited to, such action (if any) of the following kinds as is reasonable in all the circumstances: ( a ) action towards — (i) assessing the corporation’s compliance with the provision creating the offence; and (ii) ensuring that the corporation arranged regular professional assessments of its compliance with the provision; ( b ) action towards ensuring that the corporation’s employees, agents and contractors are provided with information, training, instruction and supervision appropriate to them to enable them to comply with the provision creating the offence so far as the provision is relevant to them; ( c ) action towards ensuring that — (i) the equipment and other resources; and (ii) the structures, work systems and other processes, relevant to compliance with the provision creating the offence are appropriate in all the circumstances; ( d ) action towards creating and maintaining a corporate culture that does not direct, encourage, tolerate or lead to non‑compliance with the provision creating the offence; “state of mind” of a person includes — ( a ) the knowledge, intention, opinion, belief or purpose of the person; and ( b ) the person’s reasons for the intention, opinion, belief or purpose. (7) The Minister may make rules to provide for the application of any provision of this section, with such modifications as the Minister considers appropriate, to any corporation formed or recognised under the law of a territory outside Singapore."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "23",
      "title": "Offences by unincorporated associations or partnerships",
      "content": "23. —(1) Where, in a proceeding for an offence under this Act, it is necessary to prove the state of mind of an unincorporated association or a partnership in relation to a particular conduct, evidence that — ( a ) an employee or agent of the unincorporated association or partnership engaged in that conduct within the scope of his or her actual or apparent authority; and ( b ) the employee or agent had that state of mind, is evidence that the unincorporated association or partnership had that state of mind. (2) Where an unincorporated association or a partnership commits an offence under this Act, a person — ( a ) who is — (i) an officer of the unincorporated association or a member of its governing body; (ii) a partner in the partnership; or (iii) an individual involved in the management of the unincorporated association or partnership and in a position to influence the conduct of the unincorporated association or partnership (as the case may be) in relation to the commission of the offence; and ( b ) who — (i) consented or connived, or conspired with others, to effect the commission of the offence; (ii) is in any other way, whether by act or omission, knowingly concerned in, or is party to, the commission of the offence by the unincorporated association or partnership; or (iii) knew or ought reasonably to have known that the offence by the unincorporated association or partnership (or an offence of the same type) would be or is being committed, and failed to take all reasonable steps to prevent or stop the commission of that offence, shall be guilty of the same offence as is the unincorporated association or partnership (as the case may be), and shall be liable on conviction to be punished accordingly. (3) A person mentioned in subsection (2) may rely on a defence that would be available to the unincorporated association or partnership if it were charged with the offence with which the person is charged and, in doing so, the person bears the same burden of proof that the unincorporated association or partnership would bear. (4) To avoid doubt, this section does not affect the application of — ( a ) Chapters 5 and 5A of the Penal Code 1871; or ( b ) the Evidence Act 1893 or any other law or practice regarding the admissibility of evidence. (5) To avoid doubt, subsection (2) also does not affect the liability of an unincorporated association or a partnership for an offence under this Act, and applies whether or not the unincorporated association or partnership is convicted of the offence. (6) In this section — “officer”, in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, and includes — ( a ) any person holding a position analogous to that of president, secretary or member of a committee of the unincorporated association; and ( b ) any person purporting to act in any such capacity; “partner” includes a person purporting to act as a partner; “reasonable steps” has the meaning given by section 22; “state of mind” of a person includes — ( a ) the knowledge, intention, opinion, belief or purpose of the person; and ( b ) the person’s reasons for the intention, opinion, belief or purpose. (7) The Minister may make rules to provide for the application of any provision of this section, with such modifications as the Minister considers appropriate, to any unincorporated association or partnership formed or recognised under the law of a territory outside Singapore."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "24",
      "title": "Jurisdiction of courts",
      "content": "24. Despite the Criminal Procedure Code 2010, a District Court or a Magistrate’s Court has jurisdiction to try any offence under this Act and has power to impose the full punishment for any such offence."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "25",
      "title": "Service of documents",
      "content": "25. —(1) A document that is permitted or required by this Act to be given to or served on a person may be given or served as described in this section. (2) A document permitted or required by this Act to be given to or served on an individual may be given or served — ( a ) by giving it to the individual personally; ( b ) by sending it by post to the address specified by the individual for the service of documents or, if no address is so specified, the individual’s residential address or business address; ( c ) by leaving it at the individual’s residential address with an adult apparently resident there, or at the individual’s business address with an adult apparently employed there; ( d ) by affixing a copy of the document in a conspicuous place at the individual’s residential address or business address; ( e ) by sending it by fax to the fax number last known to the person giving or serving the document as the fax number for the service of documents on the individual; or ( f ) by sending it by email to the individual’s last email address. (3) A document permitted or required by this Act to be given to or served on a partnership (other than a limited liability partnership) may be given or served — ( a ) by giving it to any partner, secretary or other similar officer of the partnership; ( b ) by leaving it at, or by sending it by post to, the partnership’s business address; ( c ) by sending it by fax to the fax number used at the partnership’s business address; or ( d ) by sending it by email to the partnership’s last email address. (4) A document permitted or required by this Act to be given to or served on a body corporate (including a limited liability partnership) or an unincorporated association may be given or served — ( a ) by giving it to the secretary or other similar officer of the body corporate or unincorporated association, or the limited liability partnership’s manager; ( b ) by leaving it at, or by sending it by post to, the registered office or principal office in Singapore of the body corporate or unincorporated association; ( c ) by sending it by fax to the fax number used at the registered office or principal office in Singapore of the body corporate or unincorporated association; or ( d ) by sending it by email to the last email address of the body corporate or unincorporated association. (5) In addition, a document (other than a summons) permitted or required by this Act to be given to or served on an individual, a partnership, a body corporate or an unincorporated association may be given or served — ( a ) by giving an electronic notice to the individual, partnership, body corporate or unincorporated association (called in this section an addressee) by the addressee’s chosen means of notification, stating that the document is available and how the addressee may use the addressee’s chosen means of access to access the document’s contents; or ( b ) by any other method authorised by regulations made under this Act for the service of documents of that kind if the addressee consents (expressly or impliedly) to service of a document of that kind in that way. (6) The giving or serving of a document takes effect — ( a ) if the document is sent by fax and a notification of successful transmission is received, on the day of transmission; ( b ) if the document is sent by email, at the time that the email becomes capable of being retrieved by the person to whom it is sent; and ( c ) if the document is sent by post, 2 days after the day the document was posted (even if it is returned undelivered). (7) However, the giving or serving of any document under this Act on a person by email or by an electronic notice at the person’s chosen means of notification, may be effected only with the person’s prior consent (express or implied) to service in that way. (8) This section does not apply to documents to be served in proceedings in court. (9) In this section — “business address” means — ( a ) in the case of an individual, the individual’s usual or last known place of business in Singapore; or ( b ) in the case of a partnership (other than a limited liability partnership), the partnership’s principal or last known place of business in Singapore; “chosen means of access”, for an addressee to or on whom is or is to be given or served a document permitted or required by this Act, means an electronic means the addressee agrees with the person giving or serving the document as the means by which the addressee may access that document’s contents; “chosen means of notification”, for an addressee to or on whom is or is to be given or served a document permitted or required by this Act, means an electronic means that the addressee nominates to the person giving or serving the document as the means by which the addressee may be notified that such a document has been given to or served on the addressee; “document” includes a notice or an order permitted or required by this Act to be given or served; “last email address” means the last email address given by the addressee concerned to the person giving or serving the document as the email address for the service of documents under this Act; “residential address” means an individual’s usual or last known place of residence in Singapore."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "26",
      "title": "General exemption",
      "content": "26. The Minister may, by order in the Gazette , exempt any person or class of persons from all or any of the provisions of this Act, either generally or in a particular case and subject to such conditions as the Minister may impose."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "27",
      "title": "Regulations",
      "content": "27. —(1) The Authority, with the approval of the Minister, may make regulations necessary or convenient to be prescribed for carrying out or giving effect to this Act. (2) In particular, the Authority, with the approval of the Minister, may make regulations for any of the following: ( a ) the grant of import approvals in relation to the import of small motorised vehicles; ( b ) the manner in which, and the time within which, an application for the grant of import approvals in relation to the import of small motorised vehicles is to be made, including — (i) the information that may be required, and the conditions to be satisfied, for the grant of an import approval; and (ii) the disqualification or debarment of persons for an import approval; ( c ) the conditions of import approvals that are conditions of general application; ( d ) the variation, suspension or cancellation of import approvals; ( e ) the labelling or marking of small motorised vehicles imported; ( f ) the duties of persons granted import approvals in relation to the import of small motorised vehicles, including the keeping of records and the provision of returns and other information with respect to the import of such vehicles; ( g ) the fees to be paid in respect of applications for the grant of import approvals and otherwise in connection with the administration of this Act, and for the waiver, reduction or refund of fees charged; ( h ) the offences under this Act that may be compounded. (3) Regulations made under this section may — ( a ) make different provisions with respect to different classes of small motorised vehicles, applicants for import approvals and importers of such vehicles; ( b ) create offences for a contravention of any of the regulations, which may be punishable with a fine not exceeding $10,000 or imprisonment for a term not exceeding 12 months or both; and ( c ) provide for such saving, transitional, and other consequential, incidental and supplemental provisions as are necessary or expedient for the purposes of this Act."
    },
    {
      "provision_ref": "s28",
      "chapter": "PART 5 - MISCELLANEOUS",
      "section": "28",
      "title": "Presentation to Parliament",
      "content": "28. All subsidiary legislation made under this Act must be presented to Parliament as soon as possible after publication in the Gazette ."
    },
    {
      "provision_ref": "s30",
      "chapter": "PART 6 - AMENDMENTS TO OTHER ACTS AND FINAL PROVISION",
      "section": "30",
      "title": "Saving and transitional provision",
      "content": "30. For a period of 2 years after the date of commencement of any provision of this Act, the Minister may, by regulations, prescribe such additional provisions of a saving or transitional nature consequent on the enactment of that provision as the Minister may consider necessary or expedient. [32"
    }
  ],
  "definitions": [
    {
      "term": "authorised officer",
      "definition": "“authorised officer” , for any provision of this Act, means an individual who is appointed under section 17 as an authorised officer for the purposes of that provision;",
      "source_provision": "s2"
    },
    {
      "term": "Authority",
      "definition": "“Authority” means the Land Transport Authority of Singapore constituted under the Land Transport Authority of Singapore Act 1995;",
      "source_provision": "s2"
    },
    {
      "term": "conveyance",
      "definition": "“conveyance” includes any vessel, train, vehicle or aircraft in which persons or goods can be carried;",
      "source_provision": "s2"
    },
    {
      "term": "customs territory",
      "definition": "“customs territory” means any part of Singapore and her territorial waters but excludes any free trade zone;",
      "source_provision": "s2"
    },
    {
      "term": "export",
      "definition": "“export” , in relation to any goods, means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "free trade zone",
      "definition": "“free trade zone” means any area in Singapore declared to be a free trade zone under the Free Trade Zones Act 1966;",
      "source_provision": "s2"
    },
    {
      "term": "identification card",
      "definition": "“identification card” , in relation to an authorised officer, means an identification card issued under section 18 to the authorised officer;",
      "source_provision": "s2"
    },
    {
      "term": "import",
      "definition": "“import” means to bring or cause to be brought into the customs territory by land, water or air from — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "import approval",
      "definition": "“import approval” means an import approval under section 5(2)( a );",
      "source_provision": "s2"
    },
    {
      "term": "limited liability partnership",
      "definition": "“limited liability partnership” has the meaning given by the Limited Liability Partnerships Act 2005;",
      "source_provision": "s2"
    },
    {
      "term": "notice",
      "definition": "“notice” does not include giving notice orally;",
      "source_provision": "s2"
    },
    {
      "term": "offence under this Act",
      "definition": "“offence under this Act” includes an offence under any regulations;",
      "source_provision": "s2"
    },
    {
      "term": "personal mobility device",
      "definition": "“personal mobility device” or “PMD” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "power-assisted bicycle",
      "definition": "“power-assisted bicycle” or “PAB” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "premises",
      "definition": "“premises” means a building or structure (whether permanent or temporary) or part of a building or structure;",
      "source_provision": "s2"
    },
    {
      "term": "regulations",
      "definition": "“regulations” means regulations made under section 27;",
      "source_provision": "s2"
    },
    {
      "term": "small motorised vehicle",
      "definition": "“small motorised vehicle” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "tranship",
      "definition": "“tranship” means to bring any goods into the customs territory solely for the purpose of taking them out of the customs territory (whether on the same conveyance on which they were brought in or on another conveyance) where the goods are landed and kept at any place in the customs territory pending their being taken out of the customs territory;",
      "source_provision": "s2"
    },
    {
      "term": "transit",
      "definition": "“transit” means to bring goods into the customs territory from a place outside the customs territory for the purpose of taking them out of the customs territory on the same conveyance on which they were brought into the customs territory;",
      "source_provision": "s2"
    },
    {
      "term": "vessel",
      "definition": "“vessel” includes any ship or boat or other description of vessel used in navigation on water.",
      "source_provision": "s2"
    },
    {
      "term": "relevant person",
      "definition": "“relevant person” means — ( a )",
      "source_provision": "s10"
    },
    {
      "term": "relevant premises",
      "definition": "“relevant premises” means any premises in Singapore that an authorised officer believes on reasonable grounds — ( a )",
      "source_provision": "s10"
    },
    {
      "term": "corporation",
      "definition": "“corporation” includes a limited liability partnership;",
      "source_provision": "s22"
    },
    {
      "term": "director",
      "definition": "“director” has the meaning given by section 4(1) of the Companies Act 1967;",
      "source_provision": "s22"
    },
    {
      "term": "officer",
      "definition": "“officer” , in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, and includes — ( a )",
      "source_provision": "s23"
    },
    {
      "term": "reasonable steps",
      "definition": "“reasonable steps” , in relation to the commission of an offence, includes, but is not limited to, such action (if any) of the following kinds as is reasonable in all the circumstances: ( a )",
      "source_provision": "s22"
    },
    {
      "term": "state of mind",
      "definition": "“state of mind” of a person includes — ( a )",
      "source_provision": "s22"
    },
    {
      "term": "partner",
      "definition": "“partner” includes a person purporting to act as a partner;",
      "source_provision": "s23"
    },
    {
      "term": "business address",
      "definition": "“business address” means — ( a )",
      "source_provision": "s25"
    },
    {
      "term": "chosen means of access",
      "definition": "“chosen means of access” , for an addressee to or on whom is or is to be given or served a document permitted or required by this Act, means an electronic means the addressee agrees with the person giving or serving the document as the means by which the addressee may access that document’s contents;",
      "source_provision": "s25"
    },
    {
      "term": "chosen means of notification",
      "definition": "“chosen means of notification” , for an addressee to or on whom is or is to be given or served a document permitted or required by this Act, means an electronic means that the addressee nominates to the person giving or serving the document as the means by which the addressee may be notified that such a document has been given to or served on the addressee;",
      "source_provision": "s25"
    },
    {
      "term": "document",
      "definition": "“document” includes a notice or an order permitted or required by this Act to be given or served;",
      "source_provision": "s25"
    },
    {
      "term": "last email address",
      "definition": "“last email address” means the last email address given by the addressee concerned to the person giving or serving the document as the email address for the service of documents under this Act;",
      "source_provision": "s25"
    },
    {
      "term": "residential address",
      "definition": "“residential address” means an individual’s usual or last known place of residence in Singapore.",
      "source_provision": "s25"
    }
  ]
}