{
  "id": "spa-1954",
  "type": "statute",
  "title": "Singapore Polytechnic Act 1954",
  "title_en": "Singapore Polytechnic Act 1954",
  "short_name": "SPA1954",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SPA1954",
  "description": "An Act to establish the Singapore Polytechnic and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Singapore Polytechnic Act 1954."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Board” means the Board of Governors of the Singapore Polytechnic constituted under section 4; “Board of Studies” means the Board of Studies established under section 13; “by-laws” means by-laws made by the Board under section 7; “Chairperson” means the Chairperson of the Board; “Principal” means the Principal of the Singapore Polytechnic, and includes any individual acting in that capacity. [5/2018]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Establishment of Polytechnic",
      "content": "3. For the purpose of providing for studies, training and research in technology, science, commerce and arts there is established an institution styled the Singapore Polytechnic (called in this Act the Polytechnic)."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Constitution of Board of Governors",
      "content": "4. —(1) A body called the Board of Governors of the Singapore Polytechnic is constituted, which is a body corporate having perpetual succession and a common seal and which may sue and be sued in its corporate name. (2) The Board consists of the following members: ( a ) a Chairperson; ( b ) a Deputy Chairperson; ( c ) the Principal; and ( d ) such other persons, not being less than 9 or more than 15, as the Minister may determine. (3) Every member of the Board, except the Principal, is to be appointed by the Minister and, unless the Minister otherwise directs, holds office for a period of 3 years from the date of the appointment and is eligible for re‑appointment."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Vacation of office of member of Board",
      "content": "5. —(1) The office of a member of the Board is vacated if the member — ( a ) becomes a bankrupt or suspends payment to, or makes any arrangement or composition with, his or her creditors; or ( b ) has been absent, without leave of the Board, from 3 consecutive meetings of the Board. (2) The Minister may revoke the appointment of a member of the Board, except that of the Principal, if the member becomes in the opinion of the Minister unfit to continue in office or incapable of performing the member’s duties. (3) A member of the Board, except the Principal, may resign from his or her appointment at any time by giving written notice to the Minister."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Filling of vacancy in office of member of Board",
      "content": "6. If the office of a member of the Board, other than that of the Principal, is vacant, the Minister may appoint any person to fill the vacancy and to hold the office for the remainder of the term of the person’s predecessor."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Functions of Board",
      "content": "7. —(1) It is the duty of the Board, in the exercise of its powers and in the performance of its functions, to act in the manner that appears to it best calculated to promote the aims and interests of the Polytechnic. (2) The functions of the Board include the carrying on of all activities and the doing of all things that are necessary or advantageous and proper for the government, control and administration of the Polytechnic and of the assets of the Polytechnic. (3) In particular, but without limiting subsection (2), the functions of the Board include the following: ( a ) the authorisation of appropriate and necessary expenditure within the limits of the funds available to the Polytechnic; ( b ) the preparation of an annual report on the working of the Polytechnic and the preparation of the annual estimates and of such annual statements as are required by this Act or by any regulations made under this Act; ( c ) the appointment of the members of the academic and administrative staff and the appointment of such advisers as the Board may consider necessary or desirable; ( d ) the making, after consultation with the Board of Studies, of by‑laws relating generally to the academic management of the Polytechnic and in particular to — (i) the qualifications necessary for admission to the Polytechnic, the courses of instruction to be provided for students at the Polytechnic, the duration and number of Polytechnic terms, the award of certificates or diplomas to students of the Polytechnic and the revocation of any certificates or diplomas so awarded; (ii) the grant of scholarships and studentships, and the revocation of any such grant; and (iii) the making of provision for the connection of schools and institutes with the Polytechnic; ( e ) the making of by-laws relating to — (i) the procedure in regard to meetings of the Board, the Board of Studies and of any committee duly appointed under the provisions of this Act; (ii) the setting up, membership and functions of advisory committees and the procedure in regard to the meetings of those advisory committees; (iii) the form and method of keeping the accounts of the Polytechnic; (iv) the powers and functions of the officers of the Polytechnic and of any committee duly appointed under the provisions of this Act; and (v) the fees or charges to be payable by any person to the Polytechnic, including charges for the late payment of any such fee or charge; [Act 4 of 2008 wef 01/04/2024] ( f ) the provision of pensions, superannuation or provident fund schemes for the benefit of the employees of the Polytechnic or any section of those employees and the making of arrangements for the establishment of those schemes; ( g ) the regulation and provisions of residences for officers, teachers, staff and students of the Polytechnic and the welfare and discipline of teachers, staff and students; ( h ) the demand and receipt of any fees prescribed by by‑laws. (4) The Board may appoint from among its own members such and so many committees either of a general or special nature and consisting of such number of persons as the Board thinks fit, for any purposes which in the opinion of the Board would be better regulated by means of those committees. (5) The proceedings of every committee of the Board must be recorded in writing and must be open to the inspection of any member of the Board or any member of the committee at any time. (6) Any committee of the Board has full power to act on any resolution passed by it within the scope of the powers delegated to it under subsection (4) and all decisions of the committee must be reported to the Board."
    },
    {
      "provision_ref": "s7A",
      "section": "7A",
      "title": "Validation of collection of charge for late payment of fee or charge",
      "content": "7A. Every amount collected before the date of commencement of the Statutes (Miscellaneous Amendments) Act 2008 as, or purportedly as, a charge for the late payment of any fee or charge referred to in section 7(2)( e )(v) 1 shall be deemed to be and always to have been validly collected, and no legal proceedings shall lie or be instituted or maintained in any court of law on account of or in respect of any such collection. 1 Section 7(2)( e )(v) is to be construed as section 7(3)( e )(v) of the Singapore Polytechnic Act 1954, according to section 20(1) of the Revised Edition of the Laws Act 1983. [Act 4 of 2008 wef 01/04/2024]"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Secretary of Board",
      "content": "8. The Registrar of the Polytechnic is the secretary of the Board, and must attend all meetings of the Board unless excused for good cause by the Chairperson."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Meetings of Board",
      "content": "9. —(1) The Chairperson must summon meetings of the Board as often as may be required. (2) At every meeting of the Board 6 members form a quorum. (3) Every decision at a meeting of the Board is to be adopted by a simple majority of the votes of the members present and voting, except that in the case of an equality of votes, the Chairperson or, in the Chairperson’s absence, the Deputy Chairperson of the Board has a casting vote. (4) The Chairperson or, in the Chairperson’s absence, the Deputy Chairperson presides at a meeting of the Board. (5) In the absence of the Chairperson and the Deputy Chairperson at a meeting of the Board, such member as the members present may elect presides at the meeting. (6) The Board may grant leave of absence from a meeting of the Board to a member of the Board. (7) The Board is not precluded from holding a meeting or acting in any matter merely by reason of any vacancy in its membership. (8) Subject to the provisions of this Act and the Public Sector (Governance) Act 2018, the Board may make standing orders to regulate its own procedure. [5/2018]"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Power of Board to enter into contracts and to hold property",
      "content": "10. —(1) The Board may enter into any contract that may be necessary or expedient for carrying into effect the provisions of this Act. (2) The Board may acquire and hold such movable or immovable property as may be necessary or expedient for carrying into effect the provisions of this Act, and for the same purposes may sell, lease, mortgage, or otherwise alienate or dispose of, any property so acquired."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Power of Board to borrow and invest",
      "content": "11. —(1) The Board may borrow at interest, on the security of any corporate land or of any funds of the Board, moneys that it may think necessary or expedient for carrying into effect the provisions of this Act. (2) The Board may invest its funds in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [45/2004] (3) The Board may do anything incidental or appertaining to a body corporate."
    },
    {
      "provision_ref": "s11A",
      "section": "11A",
      "title": "Issue of shares, etc.",
      "content": "11A. As a consequence of the vesting of any property, rights or liabilities of the Government in the Board under this Act, or of any capital injection or other investment by the Government in the Board in accordance with any written law, the Board must issue such shares or other securities to the Minister for Finance as that Minister may direct. [5/2002]"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Use of common seal",
      "content": "12. The common seal of the Board must be in the custody of the Principal and must not be affixed to any instrument, other than diplomas or academic certificates, except in the presence of the Chairperson or a member of the Board, and the Principal, nor until the Chairperson or the member of the Board, and the Principal, have signed their names to the instrument in token of their presence."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Establishment of Board of Studies",
      "content": "13. There is established a body called the Board of Studies of the Polytechnic and it is the duty of the Board of Studies to advise the Board and the Principal in accordance with the provisions of this Act and any regulations made under this Act."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Appointment, powers and duties of Principal",
      "content": "14. —(1) There must be a Principal of the Polytechnic who is to be appointed by the Board on the terms and conditions determined by the Board; and the Principal may for good cause be removed from office by the Board. (2) The appointment, removal, discipline and promotion of the Principal must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (3) The Principal is the chief administrative and academic officer of the Polytechnic and is responsible to the Board — ( a ) for the proper administration of the Polytechnic in accordance with the policy of the Board; ( b ) for the academic management of the Polytechnic in accordance with the policy of the Board; ( c ) for the proper enforcement of the by-laws; and ( d ) for the discipline of the students of the Polytechnic, and for such purposes the Principal has, subject to the provisions of this Act, all powers that are necessary or advantageous and proper. (4) The Principal is entitled to be present and speak at any meeting of any committee of the Board, but is not entitled to vote at the meeting unless the Principal is a member of the committee."
    },
    {
      "provision_ref": "s14A",
      "section": "14A",
      "title": "Other officers and employees, etc.",
      "content": "14A. The Board may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on the terms and conditions determined by the Board, such other officers, employees, consultants and agents as may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Singapore Polytechnic Students’ Union",
      "content": "15. —(1) There is to be a students’ association called the Singapore Polytechnic Students’ Union which is constituted by regulations made under section 23(1) and consists of the constituent bodies prescribed by those regulations. (2) The constitution, membership, functions and other matters relating to the Singapore Polytechnic Students’ Union and each of its constituent bodies are as prescribed by the regulations. (3) The Board may impose and collect from the students or any class of students such fees as it may determine for the benefit of the Singapore Polytechnic Students’ Union and its constituent bodies; and the fees may be applied in any manner that the Board thinks fit for the purposes of the Union and its constituent bodies."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Application of Societies Act 1966 to Students’ Union",
      "content": "16. —(1) Despite anything to the contrary in the Societies Act 1966, the provisions of that Act apply to the Singapore Polytechnic Students’ Union and its constituent bodies constituted by regulations made under section 23(1). (2) The Minister charged with the responsibility for societies may, by order in the Gazette , exempt the Singapore Polytechnic Students’ Union and any of its constituent bodies from all or any of the provisions of the Societies Act 1966 subject to any conditions specified in the order."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Polytechnic’s financial year",
      "content": "17. The financial year of the Polytechnic begins on 1 April of each year and ends on 31 March of the succeeding year. 18. [ Repealed by Act 5 of 2018 ] 19. [ Repealed by Act 5 of 2018 ] 20. [ Repealed by Act 5 of 2018 ] 21. [ Repealed by Act 5 of 2018 ] 22. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Regulations",
      "content": "23. —(1) The Board may, with the approval of the Minister, make regulations for any of the following matters: ( a ) the preparation, audit and submission to the Minister of estimates, budgets, statements and returns; ( b ) the membership and functions of the Board of Studies; ( c ) the conditions of transfer to the Polytechnic of pensionable officers in the public service; ( d ) the appointment, promotion, conduct, disciplinary control, dismissal and termination of service of the academic and administrative staff of the Polytechnic; ( e ) the conduct and disciplinary control of students; ( f ) any other matters which by this Act are required or may be prescribed. (2) All regulations made under this section must be published in the Gazette ."
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Board of Governors of the Singapore Polytechnic constituted under section 4;",
      "source_provision": "s2"
    },
    {
      "term": "Board of Studies",
      "definition": "“Board of Studies” means the Board of Studies established under section 13;",
      "source_provision": "s2"
    },
    {
      "term": "by-laws",
      "definition": "“by-laws” means by-laws made by the Board under section 7;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the Chairperson of the Board;",
      "source_provision": "s2"
    },
    {
      "term": "Principal",
      "definition": "“Principal” means the Principal of the Singapore Polytechnic, and includes any individual acting in that capacity. [5/2018]",
      "source_provision": "s2"
    }
  ]
}