{
  "id": "srcsa-1973",
  "type": "statute",
  "title": "Singapore Red Cross Society Act 1973",
  "title_en": "Singapore Red Cross Society Act 1973",
  "short_name": "SRCSA1973",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SRCSA1973",
  "description": "An Act to incorporate the Singapore Red Cross Society.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Singapore Red Cross Society Act 1973. [55/2007]"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Association” means the voluntary association known, immediately before 6 April 1973, as the Singapore Red Cross Society; “Society” means the Singapore Red Cross Society incorporated under this Act."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Incorporation of Society",
      "content": "3. —(1) The voluntary association known, immediately before 6 April 1973, as the Singapore Red Cross Society is constituted as a body corporate with perpetual succession and a common seal and is known as the Singapore Red Cross Society. (2) The Society may sue and be sued in its corporate name and do such acts or things incidental or appertaining to a body corporate. (3) The Society consists of all persons who immediately before 6 April 1973 were members of the Association and all such persons as may, after that date, become members of the Society pursuant to the rules for the time being in force of the Society."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Geneva Conventions",
      "content": "4. The Society is recognised by the Government as a voluntary aid society auxiliary to the public authorities exercising their obligations by virtue of the Geneva Conventions for the amelioration of the condition of the wounded and sick in armed forces in the field, for the amelioration of the condition of wounded, sick and shipwrecked members of the armed forces at sea, relative to the treatment of prisoners of war, and to the protection of civilian persons in time of war."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Objects of Society",
      "content": "5. The objects of the Society are — ( a ) the provision of assistance in relief operations in times of disaster and in auxiliary health and welfare services to the sick, the handicapped, the aged and the poor, without any distinction on grounds of race, nationality, religion or political opinions; and ( b ) the furnishing of voluntary aid to the sick and wounded in time of war and to non-belligerents, prisoners of war and civilian sufferers from the effects of war."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Patron of Society",
      "content": "6. The President is the patron of the Society."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Council",
      "content": "7. —(1) The affairs of the Society must be administered by a Council to be constituted in accordance with any rules made under section 9. (2) The Chairperson of the Council must be appointed by the President for a term of 3 years, and is eligible for re‑appointment."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Revocation and resignation of appointment",
      "content": "8. —(1) The President may at any time revoke the appointment of the Chairperson if the President considers it desirable in the interests of the Society to revoke the appointment. (2) The Chairperson may by writing addressed to the President resign such appointment. (3) If the Chairperson dies or has his or her appointment revoked or otherwise vacates his or her office before the expiry of the term for which he or she has been appointed, another person may be appointed by the President for the unexpired period of the term of office of the Chairperson in whose place the other person is appointed."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Powers of Council",
      "content": "9. —(1) The Council may — ( a ) appoint committees and allocate duties to and regulate the exercise of executive power by those committees and members of the Council; ( b ) appoint such officers and employees as it thinks fit and regulate the conduct and dismissal of those officers and employees; ( c ) recruit and train other persons to carry out such functions as may be necessary to achieve the objects of the Society, and assign those functions to such persons; ( d ) organise classes, lectures, courses and symposia on subjects falling within the objects of the Society; ( e ) disseminate information about the Society by selling or distributing books, pamphlets and papers; and ( f ) generally do all such other acts as may be necessary to achieve the objects of the Society. (2) The Council may, with the approval of the Director‑General of Health, make rules for or in respect of all or any of the following matters: ( a ) the proceedings of the Society and the Council, and the management of the affairs of the Society; ( b ) the different classes of members of the Society and the terms of admission of those members; ( c ) the appointment, election and removal of an executive committee and other officers; ( d ) the appointment and election of sub-committees and other bodies for special purposes and the delegation to them and the executive committee of any of the functions and powers of the Council; ( e ) the mode of holding meetings of the executive committee and the sub‑committees, and other bodies, mentioned in paragraph ( d ), and the right of voting at those meetings; ( f ) the keeping of the accounts of the Society and the audit of the accounts at least once a year; ( g ) the convening of the annual general meeting of the Society for the purposes of receiving a report and statement of accounts for the preceding year, electing those members of the Council who are to be elected pursuant to the rules, and deciding upon any proposal or matter, and transacting any other business which must be duly submitted to the meeting. [Act 11 of 2023 wef 01/05/2023]"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Use of the “Red Cross”",
      "content": "10. —(1) No person other than the Society and any person so authorised by the Minister may use — ( a ) the heraldic emblem of the red cross on a white ground formed by reversing the Federal Colours of Switzerland; or ( b ) the words “Red Cross” or “Geneva Cross”. (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both. [55/2007]"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Transfer of property, liabilities, etc.",
      "content": "11. On 6 April 1973 — ( a ) all the assets and movable and immovable property of every description and all the powers, rights and privileges in connection therewith or appertaining thereto which immediately before 6 April 1973 were vested in the Association vest in the Society without further assurance; ( b ) all liabilities and obligations of the Association which may have existed immediately prior to 6 April 1973 are transferred to and vest in the Society; and ( c ) every person in the service of the Association is deemed to be transferred to the service of the Society subject to any provision that may subsequently be made by the Council."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Application of income and property",
      "content": "12. The income and property of the Society from wherever derived must be applied solely towards the promotion of the objects of the Society as set out in this Act and no part thereof may be paid or transferred directly or indirectly by way of dividend, bonus or otherwise by way of profit to the members of the Society: Provided that nothing in this section precludes the payment in good faith of remuneration to any officer or employee of the Society or to any member of the Society in return for services rendered to the Society."
    }
  ],
  "definitions": [
    {
      "term": "Association",
      "definition": "“Association” means the voluntary association known, immediately before 6 April 1973, as the Singapore Red Cross Society;",
      "source_provision": "s2"
    },
    {
      "term": "Society",
      "definition": "“Society” means the Singapore Red Cross Society incorporated under this Act.",
      "source_provision": "s2"
    }
  ]
}