{
  "id": "ssca-1973",
  "type": "statute",
  "title": "Singapore Sports Council Act 1973",
  "title_en": "Singapore Sports Council Act 1973",
  "short_name": "SSCA1973",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/SSCA1973",
  "description": "An Act to establish the Singapore Sports Council and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Singapore Sports Council Act 1973."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Chairperson” means a member of the Council who is appointed under section 4A(1)( a ) as the Chairperson of the Council; “Chief Executive Officer” means the chief executive of the Council, and includes any individual acting in that capacity; “Council” means the Singapore Sports Council established under section 3; “Deputy Chairperson” means a member of the Council who is appointed under section 4A(1)( b ) as the Deputy Chairperson of the Council; “member” means a member of the Council and includes the Chairperson and the Deputy Chairperson; “National Stadium” means the National Stadium Complex at Kallang. [5/2018; 2/2020]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT AND CONSTITUTION OF COUNCIL",
      "section": "3",
      "title": "Establishment of Singapore Sports Council",
      "content": "3. —(1) A Council called the Singapore Sports Council is established. (2) The Council is a body corporate with perpetual succession and a common seal and may acquire, hold or dispose of movable and immovable property, sue and be sued in its corporation name, and do and suffer all other acts and things that bodies corporate may do and suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT AND CONSTITUTION OF COUNCIL",
      "section": "4",
      "title": "Membership of Council",
      "content": "4. —(1) The Council consists of not less than 7 and not more than 15 members, each of whom is to be appointed by the Minister. [2/2020] (2) One of the members (who is not the Chairperson) may be the Chief Executive Officer. [2/2020] (3) Every member, subject to this section, holds office for a period of 3 years, or for such shorter period as the Minister may determine, and is eligible for re‑appointment. (4) The Minister may at any time — ( a ) accept the resignation of any member; or ( b ) revoke the appointment of any member without giving any reason. (5) If any member dies, resigns, or has his or her appointment revoked under subsection (4), another person may be appointed by the Minister for the unexpired period of the term of office of the member in whose place he or she is appointed. (6) No vacancy in the membership of the Council affects its powers."
    },
    {
      "provision_ref": "s4A",
      "chapter": "PART 2 - ESTABLISHMENT AND CONSTITUTION OF COUNCIL",
      "section": "4A",
      "title": "Tenure as Chairperson or Deputy Chairperson",
      "content": "4A. —(1) The Minister may appoint — ( a ) a member (other than the Chief Executive Officer) to be the Chairperson of the Council for a period the Minister determines, being not longer than 3 years; and ( b ) a member (other than the Chairperson or Chief Executive Officer) to be the Deputy Chairperson of the Council for a period the Minister determines, being not longer than 3 years. [2/2020] (2) The Chairperson or Deputy Chairperson may be re‑appointed in accordance with this section. [2/2020] (3) The Chairperson or Deputy Chairperson holds office until whichever of the following first happens: ( a ) his or her term of office as Chairperson or Deputy Chairperson (as the case may be) expires; ( b ) he or she ceases to hold office as a member; ( c ) the Minister revokes the appointment as Chairperson or Deputy Chairperson, as the case may be. [2/2020]"
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT AND CONSTITUTION OF COUNCIL",
      "section": "5",
      "title": "Salaries, fees and allowances payable to members",
      "content": "5. There are to be paid to the members, out of the funds of the Council, such salaries, fees and allowances as the Minister may determine."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - ESTABLISHMENT AND CONSTITUTION OF COUNCIL",
      "section": "6",
      "title": "Meetings of Council",
      "content": "6. —(1) Meetings of the Council must be held at such times and places as the Council or the Chairperson may determine. (2) At any meeting of the Council, 5 members constitute a quorum. (3) The Chairperson presides at every meeting of the Council at which he or she is present, and in his or her absence the Deputy Chairperson presides at the meeting. (4) In the absence of both the Chairperson and the Deputy Chairperson, the members present must elect one of their number to preside at the meeting. (5) Every question before the Council must be decided by a majority of the votes of the members present at the meeting, and in the event of an equality of votes, the Chairperson or the member presiding at the meeting has a casting vote in addition to his or her original vote. (6) Subject to the provisions of this Act and the Public Sector (Governance) Act 2018, the Council may make standing orders to regulate its own procedure, and in particular, the holding of meetings, the notice to be given of the meetings, the keeping of minutes and the custody, production and inspection of the minutes. [5/2018] 7. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 3 - FUNCTIONS AND POWERS OF COUNCIL",
      "section": "8",
      "title": "Functions of Council",
      "content": "8. The functions of the Council are — ( a ) to plan and promote sports in Singapore for both competitive and recreational purposes; ( b ) to coordinate the activities of, and to facilitate cooperation among, all sports organisations; ( c ) to coordinate, in consultation with the Ministry of Education, the sports activities of schools with those of national sports organisations; ( d ) to encourage and organise, in consultation with the national sports organisations and the Singapore National Olympic Council, national, international and other sports, competitions and games; ( e ) to plan and promote physical education in Singapore; ( f ) to foster research and study in sports and physical education and to prepare and publish such reports or periodicals on these matters as it thinks fit; ( g ) to provide information, advice and assistance to persons and organisations concerned with sports and physical education; ( h ) to establish any sports stadium or such other sports facilities as it thinks fit and to manage and maintain them; ( i ) to establish any clubs for the promotion of sports and to manage and maintain them; ( j ) to establish and maintain hotels, hostels, restaurants, shops or other conveniences in connection with any sports stadium or other facilities under its control; and ( k ) to prepare, manufacture and supply any sports equipment and other sports items."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 3 - FUNCTIONS AND POWERS OF COUNCIL",
      "section": "9",
      "title": "Powers",
      "content": "9. The Council may do all things that are necessary or convenient to be done for or in connection with the performance of its functions and, without limiting the foregoing, may — ( a ) recommend minimum standards for participation in international sports competitions and games; ( b ) advise on the planning, promotion and standards of physical education; ( c ) appoint committees consisting of persons who may or may not be members of the Council and delegate to those committees any of its functions that the Council may determine; ( d ) raise funds by all lawful means and receive donations or contributions from any source; ( e ) make grants or contributions to any person or sports organisation subject to such conditions as it thinks fit; ( f ) enter into such contracts as the Council considers necessary for the discharge of its functions; ( g ) with the approval of the Minister — (i) impose fees or charges for services rendered by the Council and for the use of any facilities controlled or managed by the Council; and (ii) determine the amount of each such fee or charge; ( h ) lend money to, and enter into guarantees on behalf of, any person in matters relating to sports and physical education; and ( i ) with the approval of the Minister, enter into joint ventures with any person or organisation, or cause to be formed under the provisions of the Companies Act 1967 an incorporated company or companies for the purpose of carrying out any of the functions of the Council. [16/2016]"
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 3 - FUNCTIONS AND POWERS OF COUNCIL",
      "section": "10",
      "title": "Directions by Minister",
      "content": "10. —(1) The Minister may give to the Council any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018] (2) The Council must give the Minister any information with regard to its property and activities as the Minister may require."
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 4 - TRANSFER TO COUNCIL OF UNDERTAKINGS, ETC.",
      "section": "11",
      "title": "Transfer to Council of undertakings",
      "content": "11. —(1) On 1 October 1973, all movable and immovable property vested in the National Sports Promotion Board or the National Stadium Corporation are vested in the Council without conveyance, transfer or assignment. (2) All rights, privileges, obligations and liabilities which immediately before 1 October 1973 were held, enjoyed or incurred by the National Sports Promotion Board or the National Stadium Corporation are deemed to be the rights, privileges, obligations and liabilities of the Council. (3) Where anything has been commenced by the National Sports Promotion Board or the National Stadium Corporation prior to 1 October 1973, that thing may be carried on and completed by the Council."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 4 - TRANSFER TO COUNCIL OF UNDERTAKINGS, ETC.",
      "section": "12",
      "title": "Secondment and transfer of Government employees",
      "content": "12. —(1) Every person in the service of the Government who immediately before 1 October 1973 was seconded to the National Sports Promotion Board or the National Stadium Corporation is deemed to be seconded to the service of the Council on the same terms and conditions as those governing his or her secondment to the National Sports Promotion Board or the National Stadium Corporation, as the case may be. (2) Every person mentioned in subsection (1) may be transferred to the service of the Council on such terms and conditions of service as may be agreed upon between the Government, the Council and the officer concerned."
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 4 - TRANSFER TO COUNCIL OF UNDERTAKINGS, ETC.",
      "section": "13",
      "title": "Transfer of non-Government employees",
      "content": "13. Every person who immediately before 1 October 1973 was employed by the National Sports Promotion Board or the National Stadium Corporation is deemed without further appointment to be employed by the Council on the same terms and conditions as those governing his or her employment by the National Sports Promotion Board or the National Stadium Corporation, as the case may be."
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 5 - PROVISIONS RELATING TO STAFF",
      "section": "14",
      "title": "Chief Executive Officer",
      "content": "14. —(1) The Chief Executive Officer is the chief executive of the Council, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Council may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the Chief Executive Officer during any period, or during all periods, when the Chief Executive Officer — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 5 - PROVISIONS RELATING TO STAFF",
      "section": "15",
      "title": "Staff and employees",
      "content": "15. The Council may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on such terms and conditions as it may determine, any other officers, employees, consultants and agents that may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 5 - PROVISIONS RELATING TO STAFF",
      "section": "16",
      "title": "Pension schemes, provident fund, etc.",
      "content": "16. —(1) The Council may, with the approval of the Minister, make rules for the establishment of a scheme or schemes for the payment of pensions, gratuities, provident fund or other superannuation benefits to such employees or classes of employees of the Council as it may determine, or to their legal personal representatives or dependants, on the death or retirement of those employees from the service of the Council or on their otherwise leaving the service of the Council. (2) The following provisions apply to any scheme established under this section: ( a ) no assurance on the life of any contributor under any such scheme, and no moneys or other benefits payable under any such assurance, and no payment made under any such scheme to any person who has been employed by the Council, shall be assignable or transferable, or liable to be garnished, attached, sequestered or levied upon for or in respect of any debt or claim other than a debt due to the Council or to the Government; ( b ) no donation by the Council or contribution by its officers and employees made under any such scheme and no interest on such donation or contribution shall be assignable or transferable or liable to be garnished, attached, sequestered or levied upon for or in respect of any debt or claim other than a debt due to the Council or to the Government; ( c ) no such donation, contribution or interest shall be subject to the debts of the contributor, nor shall such donation, contribution or interest pass to the Official Assignee on the bankruptcy of the contributor, but, if the contributor is adjudicated a bankrupt or is declared insolvent by a court, such donation, contribution or interest shall, subject to the provisions of this Act, be deemed to be subject to a trust in favour of the persons entitled thereto on the death of the contributor; ( d ) the bankruptcy of a contributor shall not affect the making of deductions from the salary of the contributor in accordance with any such scheme, but the deductions shall continue to be made despite the provisions of any written law, and the portion of salary so deducted shall not be deemed to form part of his or her after‑acquired property; ( e ) subject to the provisions of any such scheme, all moneys paid or payable under any such scheme on the death of a contributor shall be deemed to be subject to a trust in favour of the persons entitled thereto under the will or intestacy of the deceased contributor, or under a nomination in such form as may be prescribed in such scheme, and shall not be deemed to form part of his or her estate or be subject to the payment of his or her debts but shall be deemed to be property passing on his or her death for the purposes of the Estate Duty Act 1929; ( f ) any contributor may, by a memorandum under his or her hand, appoint a trustee or trustees of the moneys payable on his or her death out of any such scheme and may make provision for the appointment of a new trustee or new trustees of the moneys and for the investment of the moneys; and the memorandum shall be in the form prescribed in such scheme and shall be deposited with the Council; ( g ) if at the time of the death of any contributor or at any time afterwards, there is no trustee of the moneys or it is expedient to appoint a new trustee or new trustees, then and in any such case a trustee or trustees or a new trustee or new trustees may be appointed by the Supreme Court; ( h ) the receipt of a trustee or trustees duly appointed or, in default of any such appointment and of written notice thereof to the Council, the receipt of the legal personal representative of a deceased contributor shall be a discharge to the Council for any moneys payable on his or her death out of any such scheme. (3) The Council in making, under subsection (1), any pension, provident fund or other superannuation rules which affect any person transferred to the service of the Council under section 12 must, in such rules, provide for the payment to that person or his or her dependants of benefits not less in value than the amount of any pension, provident fund, gratuity or allowance for which the person or his or her dependants would have been eligible under the Pensions Act 1956, had he or she continued to be in the service of the Government and any such pension, provident fund or superannuation rules relating to length of service of the person must provide for the recognition as service under the Council of service by him or her under the Government. (4) Nothing in any rules made under subsection (1) adversely affects any condition that would have been applicable to persons transferred to the service of the Council from their service with the Government under section 12 as regards any pension, gratuity or allowance under the Pensions Act 1956. (5) Where any person in the service of the Council, whose case does not come within the scope and effect of any pension or other scheme established under this section, retires or dies in the service of the Council or is discharged from such service, the Council may grant to him or her or to such other person or persons wholly or partly dependent on him or her, as the Council may think fit, such allowance or gratuity as the Council may determine. (6) In every case of a person being transferred to the service of the Council under section 12, the Government shall be liable to pay to the Council such portion of any gratuity, pension or allowance payable to that person on his or her retirement as the same shall bear to the proportion which the aggregate amount of his or her pensionable emoluments during his or her service with the Government bears to the aggregate amount of his or her pensionable emoluments during his or her service under both the Government and the Council."
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 5 - PROVISIONS RELATING TO STAFF",
      "section": "17",
      "title": "No entitlement in respect of abolition or re-organisation of office",
      "content": "17. Despite the provisions of the Pensions Act 1956, no person who is transferred to the service of the Council under section 12 is entitled to claim any benefits under that Act on the ground that he or she has been retired from the service of the Government on account of abolition or re‑organisation of office. 18. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "19",
      "title": "Funds and property of Council",
      "content": "19. The funds and property of the Council consist of — ( a ) all moneys and property which are vested in the Council by section 11; ( b ) all moneys paid to the Council by way of donations, contributions, fees, subscriptions, rents and interest; ( c ) loans or grants made to the Council by the Government or any person; ( d ) subventions and contributions from Singapore Pools (Private) Limited; and ( e ) all moneys and property which may be payable to or vested in the Council in the course of the discharge of its functions."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "20",
      "title": "Borrowing powers",
      "content": "20. —(1) The Council may raise loans — ( a ) from the Government; ( b ) with the approval in writing of the Minister, from any person, and for the purpose of securing such loans may mortgage, charge, or pledge any right, title, estate or interest in any of its property; or ( c ) with the approval in writing of the Minister, by the creation and issue of debentures or bonds. (2) The Council may borrow, by way of overdraft from a bank or otherwise, any sum which it may temporarily require — ( a ) for the purpose of defraying expenses pending the receipt of revenues receivable by it in respect of the period of account in which those expenses are chargeable; or ( b ) for the purpose of defraying, pending the receipt of money due in respect of any loan raised under subsection (1), expenses intended to be defrayed by such loan."
    },
    {
      "provision_ref": "s20A",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "20A",
      "title": "Issue of shares, etc.",
      "content": "20A. As a consequence of — ( a ) the vesting of any property, rights or liabilities of the Government in the Council under this Act; or ( b ) any capital injection or other investment by the Government in the Council in accordance with any written law, the Council must issue such shares or other securities to the Minister for Finance as that Minister may direct."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "21",
      "title": "Moneys of Council",
      "content": "21. —(1) The Council must open and maintain such accounts with a bank or banks as it considers necessary. (2) The moneys and property of the Council must be applied solely for the purpose of making payments in or in connection with the performance of its functions, powers and duties under this Act, and no portion thereof may be paid or transferred directly or indirectly by way of dividend, bonus or otherwise by way of profit to its members. (3) The Council may invest its moneys in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965."
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 6 - FINANCIAL PROVISIONS",
      "section": "22",
      "title": "Financial provisions",
      "content": "22. The financial provisions set out in the Schedule have effect with respect to the Council."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "23",
      "title": "Protection from liability for bona fide acts",
      "content": "23. No matter or thing done and no contract of any kind entered into by the Council and no matter or thing done by any member or employee of the Council shall, if the matter or thing was done or the contract was entered into bona fide for the purpose of carrying out the provisions of this Act, subject any such member or employee to any action, liability, claim or demand."
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "24",
      "title": "Regulations",
      "content": "24. —(1) The Council may, with the approval of the Minister, make regulations with respect to all or any of the following matters: ( a ) prescribing the custody and use of the common seal of the Council; ( b ) prescribing the manner in which documents, cheques and instruments of any description must be signed or executed on behalf of the Council; ( c ) prescribing the manner and terms relating to the use of the National Stadium and other sports facilities and clubs under the control of the Council; ( d ) providing for the proper and efficient functioning of sports organisations; ( e ) generally for carrying out the purposes and provisions of this Act. [16/2016] (2) All regulations made under this Act must be published in the Gazette and must be presented to Parliament as soon as possible after publication."
    }
  ],
  "definitions": [
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means a member of the Council who is appointed under section 4A(1)( a ) as the Chairperson of the Council;",
      "source_provision": "s2"
    },
    {
      "term": "Chief Executive Officer",
      "definition": "“Chief Executive Officer” means the chief executive of the Council, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Council",
      "definition": "“Council” means the Singapore Sports Council established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means a member of the Council who is appointed under section 4A(1)( b ) as the Deputy Chairperson of the Council;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means a member of the Council and includes the Chairperson and the Deputy Chairperson;",
      "source_provision": "s2"
    },
    {
      "term": "National Stadium",
      "definition": "“National Stadium” means the National Stadium Complex at Kallang. [5/2018; 2/2020]",
      "source_provision": "s2"
    }
  ]
}