{
  "id": "stba-1987",
  "type": "statute",
  "title": "Singapore Totalisator Board Act 1987",
  "title_en": "Singapore Totalisator Board Act 1987",
  "short_name": "STBA1987",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/STBA1987",
  "description": "An Act to provide for the establishment of the Singapore Totalisator Board and for matters connected therewith. [Act 14 of 2022 wef 01/08/2022]",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Singapore Totalisator Board Act 1987."
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — [ Deleted by Act 14 of 2022 wef 01/08/2022 ] “Board” means the Singapore Totalisator Board established under section 3; “chief executive” means the chief executive of the Board, and includes any individual acting in that capacity; “Gambling Regulatory Authority of Singapore” means the Casino Regulatory Authority of Singapore continued and renamed as the Gambling Regulatory Authority of Singapore under the Gambling Regulatory Authority of Singapore Act 2022; [Act 14 of 2022 wef 01/08/2022] “gaming” means the playing of any game of chance or of mixed chance and skill for money or money’s worth; “horse race” includes a pony race; [ Deleted by Act 14 of 2022 wef 01/08/2022 ] “race course” means any land used for the purpose of a race meeting; “race meeting” means a meeting for the purpose of horse racing; “totalisator” means any instrument for wagering or betting known by that name, and any other instrument, device, machine or method of a like nature and conducted on the same principles, and includes a numbers forecast totalisator paying a fixed minimum dividend; “totalisator agency” means any totalisator agency under the supervision of the Board, and includes any premises in which totalisator investments may be received; [Act 14 of 2022 wef 01/08/2022] “totalisator investment” means any money, currency note or cheque, or such other form of payment as may be approved by the Minister, received for investment on the totalisator; “turf club” means any club, association or other body of persons (whether incorporated or unincorporated) established for the purpose of promoting, conducting and controlling the sport of horse racing. [Act 14 of 2022 wef 01/08/2022] [ Deleted by Act 14 of 2022 wef 01/08/2022 ]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "3",
      "title": "Establishment and incorporation of Singapore Totalisator Board",
      "content": "3. A Board called the Singapore Totalisator Board is established, which is a body corporate with perpetual succession and a common seal and is by that name capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing or disposing of property, both movable and immovable; and ( c ) doing and suffering any other acts or things that bodies corporate may lawfully do and suffer."
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "4",
      "title": "Functions of Board",
      "content": "4. —(1) The functions of the Board are — ( a ) to supervise the affairs of a turf club operating in Singapore; [Act 14 of 2022 wef 01/08/2022] ( b ) to conduct equine research and establish, maintain and improve turf clubs, training centres for apprentices, jockeys, blacksmiths and others employed in connection with racing, and other places used in connection with racing; ( c ) [ Deleted by Act 14 of 2022 wef 01/08/2022 ] ( d ) with the approval of the Minister, to establish and maintain places and facilities for recreation on land owned or held by the Board and to carry out activities that appear to the Board to be requisite, advantageous or convenient for or in connection with its functions; ( e ) to improve racing generally; and ( f ) to work collaboratively with the Gambling Regulatory Authority of Singapore to foster responsible gambling and reduce the prevalence of unauthorised gambling. [Act 14 of 2022 wef 01/08/2022] (2) The Minister may, after consulting the Board, give to the Board such general directions, not inconsistent with the provisions of this Act, as to the policy to be followed by the Board in the exercise and performance of its powers and functions under this Act as appear to the Minister to be required in the public interest, and the Board must as soon as possible give effect to any such directions. (3) The Board must provide the Minister with information relating to its property and activities in such manner and at such times as the Minister may require. (4) However, nothing in this Act confers on the Board a function or power to conduct on its own behalf any race meeting or a totalisator for gaming in relation to any racing or otherwise. [Act 14 of 2022 wef 01/08/2022]"
    },
    {
      "provision_ref": "s4A",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "4A",
      "title": "Contributing to charitable, etc., purposes",
      "content": "4A. The Board also has the function to ensure that public benefits may be derived from any racing or gaming conducted by a turf club or totalisator agency which is under the supervision of the Board, through regular contributions out of their proceeds or profits so as to fund distributions under section 5 by the Board. [Act 14 of 2022 wef 01/08/2022]"
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "5",
      "title": "Powers of Board",
      "content": "5. —(1) Subject to the provisions of this Act, the Board has power to do all such things as are in its opinion necessary for or conducive to the proper discharge of its functions under this Act and, in particular, the Board has power — ( a ) to distribute sums, out of moneys forming part of the funds of the Board and not required by it in the exercise of its functions under section 4, for all or any of the following purposes: (i) public, social or charitable purposes relating to Singapore; (ii) the promotion of culture, art and sport generally in Singapore; [Act 14 of 2022 wef 01/08/2022] ( b ) to subscribe for or acquire any securities, stocks or shares of any company or to form or participate in the formation of any company, partnership or joint venture for the purpose of carrying out any function of the Board or for such other purposes as the Minister may approve; and ( c ) to suspend or revoke any totalisator or gaming activity established by any totalisator agency under the supervision of the Board. [Act 14 of 2022 wef 01/08/2022] (2) [ Deleted by Act 14 of 2022 wef 01/08/2022 ]"
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "6",
      "title": "Directions by Minister",
      "content": "6. The Minister may give to the Board any direction under section 5 of the Public Sector (Governance) Act 2018. [5A [5/2018]"
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "7",
      "title": "Members of Board",
      "content": "7. —(1) The Board consists of — ( a ) a Chairperson; and ( b ) not less than 4 and not more than 11 other members as the Minister may determine. (2) The Schedule has effect with respect to the Board, its members and proceedings. [6"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "8",
      "title": "Chief executive",
      "content": "8. —(1) There must be a chief executive of the Board, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Board may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the chief executive during any period, or during all periods, when the chief executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [6A [5/2018]"
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "9",
      "title": "Appointment of officers, etc.",
      "content": "9. —(1) Subject to subsection (2) and the Public Sector (Governance) Act 2018, the Board may, on such terms and conditions as it may determine — ( a ) appoint and employ such officers, employees, consultants or agents; and ( b ) appoint such totalisator agencies, as may be necessary for the effective performance of its functions. [5/2018] (2) The Board must obtain the approval of the Minister for the appointment of — ( a ) [ Deleted by Act 14 of 2022 wef 01/08/2022 ] ( b ) any totalisator agency. [7"
    },
    {
      "provision_ref": "s10",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "10",
      "title": "Bank accounts and application of revenue",
      "content": "10. —(1) The Board must open and maintain an account or accounts with such bank or banks as the Board thinks fit. (2) Every account under subsection (1) must be operated by such person or persons authorised to do so by the Board. (3) The moneys of the Board must be applied only in payment or discharge of the expenses, obligations and liabilities of the Board and in making any payments that the Board is authorised or required to make. [8"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "11",
      "title": "Power of investment",
      "content": "11. The Board may invest its moneys in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. [9"
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "12",
      "title": "Issue of shares, etc.",
      "content": "12. As a consequence of — ( a ) the vesting of any property, rights or liabilities of the Government in the Board under this Act; or ( b ) any capital injection or other investment by the Government in the Board in accordance with any written law, the Board must issue such shares or other securities to the Minister for Finance as that Minister may direct. [9A"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "13",
      "title": "Power to borrow",
      "content": "13. —(1) For the purposes of this Act, the Board may raise loans from the Government or, with the approval of the Minister, raise loans within or outside Singapore from such source as the Minister may direct by — ( a ) mortgage, overdraft or other means, with or without security; ( b ) charge, whether legal or equitable, on any property vested in the Board or on any other revenue receivable by the Board under this Act or any other written law; or ( c ) the creation and issue of debentures, bonds or any other instrument as the Minister may approve. (2) For the purposes of this section, the power to raise loans includes the power to make any financial agreement whereby credit facilities are granted to the Board for the purchase of goods or services. [9B"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 2 - SINGAPORE TOTALISATOR BOARD",
      "section": "14",
      "title": "Financial year",
      "content": "14. The financial year of the Board begins on 1 April of each year and ends on 31 March of the succeeding year. [10 [5/2018]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - TOTALISATORS AND TOTALISATOR AGENCIES",
      "section": "15",
      "title": "Calculation of dividend",
      "content": "15. —(1) It is the duty of every totalisator agency operating a totalisator to pay out by way of dividend all moneys received from investments on the totalisator after deducting — ( a ) the amount of any gambling duty charged under the Gambling Duties Act 2022; and [Act 1 of 2022 wef 29/07/2022] ( b ) the amount of any commission prescribed, or determined in any manner prescribed, in any regulations made under section 24. [Act 14 of 2022 wef 01/08/2022] (2) It is not necessary to pay out fractions of a dollar. (3) [ Deleted by Act 14 of 2022 wef 01/08/2022 ]"
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 3 - TOTALISATORS AND TOTALISATOR AGENCIES",
      "section": "16",
      "title": "Proportion of deduction from investment to belong to Board",
      "content": "16. The sums deducted by way of commission in accordance with section 15(1)( b ), together with any fractional money arising pursuant to the operation of section 15(2), are deemed for all purposes to belong to and form part of the general funds of the Board and may be apportioned between the Board and the totalisator agency in such proportion and in such manner as the Minister may approve. [13"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "17",
      "title": "Admission to race courses",
      "content": "17. —(1) A turf club may admit members of the public to any race course or premises under the control or supervision of the club or of any one or more of the officers of such club on payment of an admission fee. (2) A turf club may make by‑laws controlling the admission of persons to any race course or premises used or occupied by such club for race meetings or for the placing of investments on the totalisator. (3) Any by-laws made under this section may provide for the exclusion from a race course or such premises of any specified class or description of persons, either absolutely or subject to the conditions prescribed (if any) by such by‑laws. (4) This section — ( a ) is applicable to any race course despite the fact that it is or forms part of a reserve or other place in respect of which there exists a right of public use or entry; and ( b ) is not deemed to limit the power of any club to exclude or remove any person from any race course occupied by the club and which is free from such right of public use or entry. (5) An officer of the turf club may remove from the race course or such premises any person who contravenes any by‑law made under this section and who fails or refuses to leave the race course or such premises after being requested by such officer to do so. (6) Every by-law or amendment of or addition to or revocation of or substitution for any by-law made under this section must, within 30 days of its coming into operation — ( a ) be published on the website of the Singapore Turf Club (the publication cost of which must be borne by the turf club which made, amended, added to, revoked or substituted the by-laws); and ( b ) be displayed prominently within the premises of the turf club. (7) By-laws made under this section must not be inconsistent with any law for the time being in force in Singapore and any such by‑law which is so inconsistent is, to the extent of the inconsistency, void. [14 18. [Repealed by Act 14 of 2022 wef 01/08/2022] 19. [Repealed by Act 14 of 2022 wef 01/08/2022] 20. [Repealed by Act 14 of 2022 wef 01/08/2022] 21. [Repealed by Act 14 of 2022 wef 01/08/2022] 22. [Repealed by Act 14 of 2022 wef 01/08/2022]"
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "23",
      "title": "General exemption",
      "content": "23. The Minister may, by order in the Gazette and subject to such conditions as the Minister may impose, exempt any person or class of persons from all or any of the provisions of this Act. [20B"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "24",
      "title": "Power to make regulations",
      "content": "24. The Minister may make such regulations as the Minister considers necessary or expedient to give effect to the provisions and for the due administration of this Act. [Act 14 of 2022 wef 01/08/2022]"
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 4 - MISCELLANEOUS",
      "section": "25",
      "title": "Property of Singapore Turf Club to be held on trust for Board",
      "content": "25. —(1) The following property and funds of the Singapore Turf Club, a society registered under the Societies Act 1966, is with effect from 9 November 1987 deemed to be held by the Club on trust for the purposes of the Board and the Board may at any time require the Club to transfer to the Board any such property or funds for those purposes: ( a ) all immovable property owned by the Club on that date; ( b ) all funds and investments belonging to the Club on that date. (2) If any question arises as to whether any particular property, fund or investment is held on trust for the Board, the matter is to be determined by the Minister and a certificate under the hand of the Minister is conclusive evidence of the matter certified in the certificate. (3) The Board may grant to the Singapore Turf Club out of the funds deemed to be held by the Club on trust for the Board such sums of money as the Board may determine to enable the Club to meet the expenses of carrying out its operations and to maintain or improve its facilities and for such other purpose as the Board thinks fit. [22"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Singapore Totalisator Board established under section 3;",
      "source_provision": "s2"
    },
    {
      "term": "chief executive",
      "definition": "“chief executive” means the chief executive of the Board, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Gambling Regulatory Authority of Singapore",
      "definition": "“Gambling Regulatory Authority of Singapore” means the Casino Regulatory Authority of Singapore continued and renamed as the Gambling Regulatory Authority of Singapore under the Gambling Regulatory Authority of Singapore Act 2022; [Act 14 of 2022 wef 01/08/2022]",
      "source_provision": "s2"
    },
    {
      "term": "gaming",
      "definition": "“gaming” means the playing of any game of chance or of mixed chance and skill for money or money’s worth;",
      "source_provision": "s2"
    },
    {
      "term": "horse race",
      "definition": "“horse race” includes a pony race;",
      "source_provision": "s2"
    },
    {
      "term": "race course",
      "definition": "“race course” means any land used for the purpose of a race meeting;",
      "source_provision": "s2"
    },
    {
      "term": "race meeting",
      "definition": "“race meeting” means a meeting for the purpose of horse racing;",
      "source_provision": "s2"
    },
    {
      "term": "totalisator",
      "definition": "“totalisator” means any instrument for wagering or betting known by that name, and any other instrument, device, machine or method of a like nature and conducted on the same principles, and includes a numbers forecast totalisator paying a fixed minimum dividend;",
      "source_provision": "s2"
    },
    {
      "term": "totalisator agency",
      "definition": "“totalisator agency” means any totalisator agency under the supervision of the Board, and includes any premises in which totalisator investments may be received; [Act 14 of 2022 wef 01/08/2022]",
      "source_provision": "s2"
    },
    {
      "term": "totalisator investment",
      "definition": "“totalisator investment” means any money, currency note or cheque, or such other form of payment as may be approved by the Minister, received for investment on the totalisator;",
      "source_provision": "s2"
    },
    {
      "term": "turf club",
      "definition": "“turf club” means any club, association or other body of persons (whether incorporated or unincorporated) established for the purpose of promoting, conducting and controlling the sport of horse racing. [Act 14 of 2022 wef 01/08/2022]",
      "source_provision": "s2"
    }
  ]
}