{
  "id": "tpa-1990",
  "type": "statute",
  "title": "Temasek Polytechnic Act 1990",
  "title_en": "Temasek Polytechnic Act 1990",
  "short_name": "TPA1990",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/TPA1990",
  "description": "An Act for the establishment and incorporation of a polytechnic to be known as Temasek Polytechnic and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Temasek Polytechnic Act 1990."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Board” means the Board of Governors of the Polytechnic established pursuant to this Act; “officers” means the officers of the Polytechnic; “Polytechnic” means the Temasek Polytechnic established and incorporated under this Act; “Polytechnic Constitution” means the Constitution of the Polytechnic set out in the Schedule; “Principal” means the Principal of the Polytechnic, and includes any individual acting in that capacity; “registered student” means a student registered for a course or subject in the Polytechnic leading to the award of a diploma or certificate of the Polytechnic; “Registrar” means the Registrar of the Polytechnic; “regulations” means the regulations made under the Polytechnic Constitution; “Senate” means the Senate of the Polytechnic established pursuant to this Act. [5/2018]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Establishment and incorporation of Temasek Polytechnic",
      "content": "3. —(1) A Polytechnic called the Temasek Polytechnic is established, consisting of a Board of Governors, a Senate, the members of the academic staff and the officers of the Polytechnic. (2) The Polytechnic is a body corporate with perpetual succession and a common seal and is by that name capable in law of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing or disposing of property, both movable and immovable; and ( c ) doing and suffering all other acts or things that bodies corporate may lawfully do or suffer."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Objects and powers of Polytechnic",
      "content": "4. —(1) The objects of the Polytechnic are — ( a ) to provide instruction and training in technology, science, commerce, arts and other subjects of learning; ( b ) to aid by research and other means the advancement of knowledge and its practical application; and ( c ) to promote the exchange of knowledge and skills with business and industry. (2) The Polytechnic may — ( a ) provide any facilities for its students that it considers desirable; ( b ) institute and make appointments to lectureships and other posts and offices and employ any other staff that the Polytechnic considers necessary; ( c ) fix, demand and receive fees and other charges, including charges for the late payment of any such fee or charge; [Act 4 of 2008 wef 01/04/2024] ( d ) promote the formation of or acquire any interest in any undertaking; and ( e ) do all things that may be necessary, incidental or conducive to the attainment of all or any of its objects."
    },
    {
      "provision_ref": "s4A",
      "section": "4A",
      "title": "Validation of collection of charge for late payment of fee or charge",
      "content": "4A. Every amount collected before the date of commencement of the Statutes (Miscellaneous Amendments) Act 2008 as, or purportedly as, a charge for the late payment of any fee or charge referred to in section 4(2)( c ) shall be deemed to be and always to have been validly collected, and no legal proceedings shall lie or be instituted or maintained in any court of law on account of or in respect of any such collection. [Act 4 of 2008 wef 01/04/2024]"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Board of Governors and Senate, their constitutions, powers and duties",
      "content": "5. —(1) The respective constitutions, functions, powers and duties of the Board and the Senate are prescribed by this Act and the Polytechnic Constitution. (2) The Board is, subject to the provisions of this Act and the Polytechnic Constitution, the supreme governing body of the Polytechnic and, subject to the provisions of this Act and the Polytechnic Constitution, it must administer the property and manage the affairs of the Polytechnic. (3) Subject to the provisions of this Act, the Public Sector (Governance) Act 2018 and the Polytechnic Constitution and to the financial control of the Board, the Senate has the regulation of all matters relating to education in the Polytechnic. [5/2018] (4) No act or resolution of the Board or the Senate is invalid by reason only of any vacancy in, or any want to qualification by or invalidity in the election or appointment of any member of, the Board or the Senate."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Schools of Polytechnic",
      "content": "6. —(1) There are to be Schools of Science and Technology, Business and Design and any other Schools constituted by the Board on the recommendation of the Senate. (2) There is to be a head of each School with the powers conferred by the Board. (3) The Board may, on the recommendation of the Senate, form, dissolve or reform any School and any department, centre, unit and other subdivisions of any School as it may consider desirable."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Committees generally",
      "content": "7. —(1) The Board, the Senate and the Principal respectively may establish any committees that they think fit. (2) Unless otherwise expressly provided, any committee may consist partly of persons who are not members of the Board or the Senate or officers of the Polytechnic, as the case may be. (3) Subject to the provisions of this Act, the Public Sector (Governance) Act 2018 and the Polytechnic Constitution, the Board, the Senate and the Principal respectively may, with or without restrictions or conditions as they think fit, delegate any of their powers and duties to any committee. [5/2018]"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Officers and academic staff, their appointments, powers, duties and emoluments",
      "content": "8. —(1) The officers of the Polytechnic are the Principal, one or more Deputy Principals, the heads of the Schools, the Registrar and any other persons who are appointed by the Board as officers of the Polytechnic. (2) The Principal, the Deputy Principals and the Registrar and other officers must be appointed by the Board in accordance with the Polytechnic Constitution. (3) The academic staff of the Polytechnic are the heads of the Schools, lecturers and any other persons designated as members of the academic staff by the Polytechnic Constitution and they are to be appointed by the Board on the recommendation of the Principal. (4) The powers and duties of the officers and members of the academic staff, the periods and conditions for and upon which they hold office and their emoluments are as prescribed by this Act, the Polytechnic Constitution and the terms of their respective appointments; but the Board may assign to any officer, and in the case of any member of the academic staff on the recommendation of the Principal, such further powers and duties as the Board may think fit. 8A. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Polytechnic Constitution",
      "content": "9. —(1) Subject to the provisions of this Act, the Polytechnic is governed in accordance with the provisions of the Polytechnic Constitution set out in the Schedule. (2) The Minister may, after consulting the Board, make any addition or amendment to or re‑enact with amendments the Polytechnic Constitution. (3) Every addition, amendment and re‑enactment of the Polytechnic Constitution made in accordance with subsection (2) must be published in the Gazette and may be published in such other manner as the Board may direct. (4) The Interpretation Act 1965 applies for the purposes of the interpretation of the Polytechnic Constitution as it applies for the purposes of the interpretation of an Act, and all expressions defined in this Act bear the same meaning when used in the Polytechnic Constitution, unless other provision is made in the Polytechnic Constitution, or a contrary intention otherwise appears. (5) Regulations made under the Polytechnic Constitution need not be published in the Gazette and are not subsidiary legislation."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Examinations",
      "content": "10. All examinations held by the Polytechnic must be conducted in the manner prescribed by the Polytechnic Constitution and the regulations."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Power to confer diplomas, etc.",
      "content": "11. The Polytechnic has power — ( a ) to award diplomas and certificates and any other academic distinctions specified in the regulations; and ( b ) to provide such lectures and instruction for persons who are not registered students as the Polytechnic may determine, and to grant certificates to those persons."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Form of contracts",
      "content": "12. —(1) Contracts on behalf of the Polytechnic may be made as follows: ( a ) a contract which, if made between private persons, would be required by law to be in writing, and if made according to law to be under seal, may be made on behalf of the Polytechnic in writing under the common seal of the Polytechnic; ( b ) a contract which, if made between private persons, would be required by law to be in writing, and signed by the parties to be charged with the contract, may be made on behalf of the Polytechnic in writing signed by any person acting under the express or implied authority of the Board; ( c ) a contract which, if made between private persons would be valid by law, although made by parol only and not reduced into writing, may be made by parol on behalf of the Polytechnic by any person acting under the express or implied authority of the Board. (2) A contract made according to this section is effectual in law and binds the Polytechnic and its successors and all other parties to the contract. (3) A contract made according to this section may be varied or discharged in the same manner in which it is authorised by this section to be made."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Common seal",
      "content": "13. —(1) The common seal of the Polytechnic may be broken, changed, altered and made anew as the Board thinks fit and must be kept in such custody as the Board directs. (2) The common seal of the Polytechnic must not be used except by resolution of the Board or in any other manner authorised by the Polytechnic Constitution. (3) All courts and persons acting judicially are to take judicial notice of the common seal of the Polytechnic affixed to any document and, until the contrary is proved, are to assume that it was duly affixed."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Grants-in-aid",
      "content": "14. —(1) The Minister must pay to the Polytechnic such moneys as may be provided by Parliament as grants‑in‑aid to the Polytechnic. (2) All moneys paid to the Polytechnic under subsection (1) may be applied or expended by the Polytechnic for the attainment of all or any of the objects of the Polytechnic."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Issue of shares, etc.",
      "content": "15. As a consequence of the vesting of any property, rights or liabilities of the Government in the Polytechnic under this Act, or of any capital injection or other investment by the Government in the Polytechnic in accordance with any written law, the Polytechnic must issue such shares or other securities to the Minister for Finance as that Minister may direct. [14A [5/2002]"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Application of Societies Act 1966 to Students’ Union",
      "content": "16. —(1) Despite anything to the contrary in the Societies Act 1966, the provisions of that Act apply to the Temasek Polytechnic Students’ Union and its constituent bodies constituted by the regulations. (2) The Minister charged with the responsibility for societies may, by order in the Gazette , exempt the Temasek Polytechnic Students’ Union and any of its constituent bodies from all or any of the provisions of the Societies Act 1966 subject to any conditions specified in the order. [20"
    }
  ],
  "definitions": [
    {
      "term": "Board",
      "definition": "“Board” means the Board of Governors of the Polytechnic established pursuant to this Act;",
      "source_provision": "s2"
    },
    {
      "term": "officers",
      "definition": "“officers” means the officers of the Polytechnic;",
      "source_provision": "s2"
    },
    {
      "term": "Polytechnic",
      "definition": "“Polytechnic” means the Temasek Polytechnic established and incorporated under this Act;",
      "source_provision": "s2"
    },
    {
      "term": "Polytechnic Constitution",
      "definition": "“Polytechnic Constitution” means the Constitution of the Polytechnic set out in the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "Principal",
      "definition": "“Principal” means the Principal of the Polytechnic, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "registered student",
      "definition": "“registered student” means a student registered for a course or subject in the Polytechnic leading to the award of a diploma or certificate of the Polytechnic;",
      "source_provision": "s2"
    },
    {
      "term": "Registrar",
      "definition": "“Registrar” means the Registrar of the Polytechnic;",
      "source_provision": "s2"
    },
    {
      "term": "regulations",
      "definition": "“regulations” means the regulations made under the Polytechnic Constitution;",
      "source_provision": "s2"
    },
    {
      "term": "Senate",
      "definition": "“Senate” means the Senate of the Polytechnic established pursuant to this Act. [5/2018]",
      "source_provision": "s2"
    }
  ]
}