{
  "id": "tsmrma-2017",
  "type": "statute",
  "title": "Terrorism (Suppression of Misuse of Radioactive Material) Act 2017",
  "title_en": "Terrorism (Suppression of Misuse of Radioactive Material) Act 2017",
  "short_name": "TSMRMA2017",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/TSMRMA2017",
  "description": "An Act to give effect to the International Convention for the Suppression of Acts of Nuclear Terrorism and to provide for connected matters.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Terrorism (Suppression of Misuse of Radioactive Material) Act 2017."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “armed conflict” does not include internal disturbances and tensions, such as riots, isolated and sporadic acts of violence, and other acts of a similar nature; “Convention” means the International Convention for the Suppression of Acts of Nuclear Terrorism done in New York on 13 April 2005; “Convention country” means a foreign country that is a Party to the Convention; “Convention device” means — ( a ) an explosive or incendiary device that releases or disseminates radioactive material or emits radiation; or ( b ) a device that releases or disseminates radioactive material or emits radiation, and that may, owing to its radiological properties, cause — (i) the death of, or serious bodily injury to, any individual; or (ii) substantial damage to property or to the environment; “conveyance” includes any vessel, vehicle, train, aircraft or other mode of transport; “country” includes a State or territory; “government” means the government of a country, and includes the legislature and judiciary of the country; “ionising radiation” means any electromagnetic radiation or corpuscular radiation that gives rise to the formation of ion pairs on interaction with matter; “military forces of a State” means — ( a ) the armed forces of a country, which are organised, trained and equipped under its internal law for the primary purpose of national defence or security; ( b ) civilians who direct or organise the official activities of those armed forces; or ( c ) civilians acting in support of the official activities of those armed forces, if those civilians are under the formal command, control and responsibility of those forces; “nuclear facility” means — ( a ) any nuclear reactor (including a nuclear reactor installed on any vessel, vehicle, aircraft or space object for use as an energy source for propelling that vessel, vehicle, aircraft or space object, or for any other purpose); or ( b ) any plant or conveyance used for the production, storage, processing or transport of radioactive material; “nuclear material” means — ( a ) plutonium, except plutonium with an isotopic concentration of plutonium‑238 exceeding 80%; ( b ) uranium‑233; ( c ) uranium containing uranium‑233 or uranium‑235 or both in such an amount that the abundance ratio of the sum of those isotopes to uranium‑238 is greater than the ratio of uranium‑235 to uranium‑238 occurring in nature; ( d ) uranium with an isotopic concentration equal to that occurring in nature, but not in the form of ore or ore residue; or ( e ) any material containing one or more of the materials mentioned in paragraphs ( a ) to ( d ); “nuclear terrorism offence” means — ( a ) an offence under section 4, 5, 6, 7, 8, 9 or 10; ( b ) an abetment of or a conspiracy to commit an offence under section 4, 5, 6, 7, 8 or 9; or ( c ) an act by a person that would make the person liable for an offence mentioned in paragraph ( a ) by virtue of section 34 or 35 of the Penal Code 1871; “radioactive material” means any nuclear material or any other radioactive substance; “radioactive substance” means any substance — ( a ) that contains one or more nuclides that undergo spontaneous disintegration accompanied by the emission of one or more types of ionising radiation; and ( b ) that, owing to its radiological or fissile properties, may cause — (i) the death of, or serious bodily injury to, any individual; or (ii) substantial damage to property or to the environment."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Application",
      "content": "3. This Act does not apply to the following activities: ( a ) the activities of armed forces during an armed conflict, as those terms are understood under international humanitarian law, which are governed by that law; ( b ) the activities undertaken by military forces of a State in the exercise of their official duties, to the extent that those activities are governed by other rules of international law."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Possessing radioactive material or Convention device",
      "content": "4. A person shall be guilty of an offence, and shall be liable on conviction to imprisonment for a term which may extend to life imprisonment, if — ( a ) the person, intentionally and without lawful authority, possesses any radioactive material or Convention device; and ( b ) the person intends that the radioactive material or Convention device be used to cause — (i) the death of, or serious bodily injury to, any individual; or (ii) substantial damage to property or to the environment."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Making Convention device",
      "content": "5. A person shall be guilty of an offence, and shall be liable on conviction to imprisonment for a term which may extend to life imprisonment, if — ( a ) the person, intentionally and without lawful authority, makes any Convention device; and ( b ) the person intends that the Convention device be used to cause — (i) the death of, or serious bodily injury to, any individual; or (ii) substantial damage to property or to the environment."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Using radioactive material or Convention device",
      "content": "6. —(1) A person shall be guilty of an offence if — ( a ) the person, intentionally and without lawful authority, uses in any way any radioactive material or Convention device; and ( b ) the person intends the use of the radioactive material or Convention device — (i) to cause the death of, or serious bodily injury to, any individual; (ii) to cause substantial damage to property or to the environment; or (iii) to compel any other person, or any international organisation or government, to do or refrain from doing any act. (2) A person guilty of an offence under subsection (1) shall on conviction — ( a ) in any case where the person intends the use of the radioactive material or Convention device to cause the death of any individual, and death is caused — be subject to the same punishment as an act under section 300( a ) of the Penal Code 1871; or ( b ) in any other case — be punished with imprisonment for life."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Using or damaging nuclear facility",
      "content": "7. —(1) A person shall be guilty of an offence if — ( a ) the person, intentionally and without lawful authority, uses or damages a nuclear facility in a manner that causes, or creates a risk of, the release of radioactive material; and ( b ) the person intends the use of, or damage to, the nuclear facility — (i) to cause the death of, or serious bodily injury to, any individual; (ii) to cause substantial damage to property or to the environment; or (iii) to compel any other person, or any international organisation or government, to do or refrain from doing any act. (2) A person guilty of an offence under subsection (1) shall on conviction — ( a ) in any case where the person intends the use of, or damage to, the nuclear facility to cause the death of any individual, and death is caused — be subject to the same punishment as an act under section 300( a ) of the Penal Code 1871; or ( b ) in any other case — be punished with imprisonment for life."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Threatening to do act that would be offence under section 6 or 7",
      "content": "8. Any person who threatens to do any act that would be an offence under section 6 or 7 shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 10 years."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Demands relating to radioactive material, Convention device or nuclear facility",
      "content": "9. A person (called in this section the offender) shall be guilty of an offence, and shall be liable on conviction to imprisonment for a term not exceeding 10 years, if — ( a ) the offender, intentionally and without lawful authority, demands that another person — (i) make available to the offender, or to any other person, any radioactive material, Convention device or nuclear facility; or (ii) give the offender, or any other person, access to any radioactive material, Convention device or nuclear facility; and ( b ) the demand is made or accompanied by the use of force or by threats of any kind."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Attempting to commit offence under section 4, 5, 6 or 7",
      "content": "10. Any person who attempts to commit an offence under section 4, 5, 6 or 7, or attempts to cause such an offence to be committed, and in such attempt does any act towards the commission of the offence, shall be guilty of an offence and shall be liable on conviction to imprisonment for a term not exceeding 15 years."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Extraterritoriality",
      "content": "11. Any person who, outside Singapore, commits an act that, if committed in Singapore, would constitute a nuclear terrorism offence is deemed to commit the act in Singapore and may be proceeded against, charged, tried and punished accordingly."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Assistance under Mutual Assistance in Criminal Matters Act 2000",
      "content": "12. —(1) For the purposes of the provision of assistance under Part 3 of the Mutual Assistance in Criminal Matters Act 2000 to a Convention country for a criminal matter involving a relevant offence of that country, the relevant offence is deemed not to be an offence of a political character. (2) In this section — “criminal matter” has the meaning given by section 2(1) of the Mutual Assistance in Criminal Matters Act 2000; “relevant offence”, in relation to a Convention country, means an offence against the law of that country that consists of or includes conduct which, if the conduct occurred in Singapore, would constitute a nuclear terrorism offence."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Extradition",
      "content": "13. —(1) Every nuclear terrorism offence is deemed to be an extradition offence for the purposes of Parts 3, 4 and 5 of the Extradition Act 1968. [Act 17 of 2022 wef 01/07/2022] (2) For the purposes of the Extradition Act 1968, the term “extradition offence”, in relation to a Convention country that is a declared Commonwealth territory, is deemed to include a relevant offence. [Act 17 of 2022 wef 01/07/2022] (3) Where no extradition treaty is in force between Singapore and a Convention country that is not a declared Commonwealth territory — ( a ) a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act as if there were an extradition treaty between Singapore and that Convention country; but ( b ) subject to subsection (4), where the Extradition Act 1968 is applied under paragraph ( a ), that Act has effect in relation to that Convention country as if the only extradition offences under that Act were the relevant offences of that country. [Act 17 of 2022 wef 01/07/2022] [Act 17 of 2022 wef 01/07/2022] (4) Subsection (3) does not affect any other notification made under section 4 of the Extradition Act 1968. (5) Where — ( a ) an extradition treaty is in force between Singapore and a Convention country; and ( b ) the treaty does not provide for the extradition of persons accused of or convicted of a relevant offence of that country, a notification in the Gazette under section 4 of the Extradition Act 1968 may be made applying that Act in relation to that country as if the treaty provided for the matter mentioned in paragraph ( b ). (6) Where a notification mentioned in subsection (5) is made, any limitation, condition, exception or qualification specified in any other notification made under section 4 of the Extradition Act 1968, or in any Order in Council mentioned in section 3 of that Act, in relation to the Convention country mentioned in subsection (5), to the extent that the limitation, condition, exception or qualification prevents the relevant offence from being considered an extradition offence in relation to that country, is to be disregarded in the application of that Act in relation to that country. [Act 17 of 2022 wef 01/07/2022] (7) For the purposes of the Extradition Act 1968 — ( a ) any act, wherever committed, is deemed to be an offence within the jurisdiction of a Convention country that is a declared Commonwealth territory, if that act is a relevant offence of that Convention country; [Act 17 of 2022 wef 01/07/2022] ( b ) any act, wherever committed, is deemed to be an offence within the jurisdiction of a Convention country that is not a declared Commonwealth territory, and in relation to which the Extradition Act 1968 has been applied by a notification in the Gazette under section 4 of that Act, if that act is a relevant offence of that Convention country; and [Act 17 of 2022 wef 01/07/2022] ( c ) any such offence is deemed not to be an offence of a political character. (8) In this section — “declared Commonwealth territory” has the meaning given by section 2(1) of the Extradition Act 1968; [Act 17 of 2022 wef 01/07/2022] “relevant offence”, in relation to a Convention country, means an offence against the law of that country where the act or omission constituting the offence or the equivalent act or omission would, if it took place in Singapore — ( a ) constitute a nuclear terrorism offence; or ( b ) be a nuclear terrorism offence if the description of the offence contained a reference to any intent or state of mind on the part of the person committing the offence, or to any circumstance of aggravation, necessary to constitute the offence."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "No prosecution without Public Prosecutor’s consent",
      "content": "14. A prosecution under this Act must not be instituted except by or with the consent of the Public Prosecutor."
    }
  ],
  "definitions": [
    {
      "term": "armed conflict",
      "definition": "“armed conflict” does not include internal disturbances and tensions, such as riots, isolated and sporadic acts of violence, and other acts of a similar nature;",
      "source_provision": "s2"
    },
    {
      "term": "Convention",
      "definition": "“Convention” means the International Convention for the Suppression of Acts of Nuclear Terrorism done in New York on 13 April 2005;",
      "source_provision": "s2"
    },
    {
      "term": "Convention country",
      "definition": "“Convention country” means a foreign country that is a Party to the Convention;",
      "source_provision": "s2"
    },
    {
      "term": "Convention device",
      "definition": "“Convention device” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "conveyance",
      "definition": "“conveyance” includes any vessel, vehicle, train, aircraft or other mode of transport;",
      "source_provision": "s2"
    },
    {
      "term": "country",
      "definition": "“country” includes a State or territory;",
      "source_provision": "s2"
    },
    {
      "term": "government",
      "definition": "“government” means the government of a country, and includes the legislature and judiciary of the country;",
      "source_provision": "s2"
    },
    {
      "term": "ionising radiation",
      "definition": "“ionising radiation” means any electromagnetic radiation or corpuscular radiation that gives rise to the formation of ion pairs on interaction with matter;",
      "source_provision": "s2"
    },
    {
      "term": "military forces of a State",
      "definition": "“military forces of a State” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "nuclear facility",
      "definition": "“nuclear facility” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "nuclear material",
      "definition": "“nuclear material” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "nuclear terrorism offence",
      "definition": "“nuclear terrorism offence” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "radioactive material",
      "definition": "“radioactive material” means any nuclear material or any other radioactive substance;",
      "source_provision": "s2"
    },
    {
      "term": "radioactive substance",
      "definition": "“radioactive substance” means any substance — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "criminal matter",
      "definition": "“criminal matter” has the meaning given by section 2(1) of the Mutual Assistance in Criminal Matters Act 2000;",
      "source_provision": "s12"
    },
    {
      "term": "relevant offence",
      "definition": "“relevant offence” , in relation to a Convention country, means an offence against the law of that country where the act or omission constituting the offence or the equivalent act or omission would, if it took place in Singapore — ( a )",
      "source_provision": "s13"
    },
    {
      "term": "declared Commonwealth territory",
      "definition": "“declared Commonwealth territory” has the meaning given by section 2(1) of the Extradition Act 1968; [Act 17 of 2022 wef 01/07/2022]",
      "source_provision": "s13"
    }
  ]
}