{
  "id": "una-2001",
  "type": "statute",
  "title": "United Nations Act 2001",
  "title_en": "United Nations Act 2001",
  "short_name": "UNA2001",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/UNA2001",
  "description": "An Act to enable Singapore to fulfil its obligations respecting Article 41 of the Charter of the United Nations.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the United Nations Act 2001."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Power to make regulations to enable effect to be given to Article 41 of Charter of United Nations",
      "content": "2. —(1) Subject to subsection (2), if, under Article 41 of the Charter of the United Nations signed at San Francisco on 26 June 1945 (being the Article which relates to measures not involving the use of armed force), the Security Council of the United Nations calls upon the Government to apply any measures to give effect to any decision of that Council, the Minister may, from time to time, make regulations that appear to the Minister to be necessary or expedient for enabling those measures to be effectively applied, including (without limiting the preceding words) provisions for — ( a ) the apprehension, trial and punishment of persons offending against the regulations; and ( b ) empowering any person or class of persons to exercise, when investigating any offence under this Act or any regulations made under this Act, all or any of the powers of a police officer under the Criminal Procedure Code 2010 in relation to arrestable offences. (2) The measures to be applied under subsection (1) do not apply to any financial institution or class of financial institutions to the extent that the financial institution or class of financial institutions is or may be subject to the directions issued by the Monetary Authority of Singapore under section 15 of the Financial Services and Markets Act 2022, or regulations made by the Monetary Authority of Singapore under section 192 of the Financial Services and Markets Act 2022 for the purposes of section 15 of that Act. [16/2016] [Act 18 of 2022 wef 28/04/2023] (3) The measures to be applied under subsection (1) do not apply to any VCC or class of VCCs to the extent that the VCC or class of VCCs is or may be subject to the directions or regulations made by the Monetary Authority of Singapore under section 83 of the Variable Capital Companies Act 2018. [44/2018] (4) In subsection (3), “VCC” has the meaning given by section 2(1) of the Variable Capital Companies Act 2018. [44/2018] (5) No regulation made under this Act is deemed to be invalid because it deals with any matter provided for by any written law, or because of repugnancy to or inconsistency with any written law other than the Constitution. (6) All regulations made under this Act must be presented to Parliament as soon as possible after publication in the Gazette . (7) All expenses incurred by the Government in applying any measures that are mentioned in this section must be defrayed out of moneys provided by Parliament."
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Immunity from suit",
      "content": "3. —(1) No action, suit or other legal proceedings shall lie against — ( a ) any party to a contract for failing, neglecting or refusing to carry out any act required by the contract; or ( b ) any person for failing, neglecting or refusing to carry out any act under any written law, where the failure, neglect or refusal is solely attributable to, or occasioned by, the provisions of this Act or any regulations made under this Act. (2) This section does not affect the operation of the Frustrated Contracts Act 1959."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Protection of persons for acts done under Act",
      "content": "4. No person shall be personally liable in respect of any act done by the person in the execution or purported execution of this Act or any regulations made under this Act if the person did it in the honest belief that the person’s duty under this Act or any regulations made under this Act required or entitled the person to do it."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Liability for breach of regulations",
      "content": "5. —(1) Every person who commits, or attempts to commit, or does any act with intent to commit, or counsels, procures, aids, abets, or incites any other person to commit, or conspires with any other person (whether in Singapore or elsewhere) to commit any offence against any regulations made under this Act shall be liable on conviction — ( a ) in the case of an individual, to a fine not exceeding $500,000 or to imprisonment for a term not exceeding 10 years or to both; or ( b ) in any other case, to a fine not exceeding $1 million. [4/2014] (2) Nothing in this Act or any regulations made under this Act prevents any person from being prosecuted under any other written law for any act or omission which constitutes an offence under this Act or any regulations made under this Act, or from being liable under that other written law to any punishment or penalty higher or other than that provided by this Act or the regulations, but no person shall be punished twice for the same offence."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Liability of citizens of Singapore for offences committed outside Singapore",
      "content": "6. —(1) The provisions of this Act have effect, in relation to citizens of Singapore, outside as well as within Singapore, and where an offence under this Act or any regulations made under this Act is committed by a citizen of Singapore in any place outside Singapore, he or she may be dealt with in respect of that offence as if it had been committed within Singapore. (2) Any proceedings against any person under this section which would be a bar to subsequent proceedings against that person for the same offence, if the offence had been committed in Singapore, is a bar to further proceedings against the person, under any written law for the time being in force relating to the extradition of persons, in respect of the same offence outside Singapore."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Jurisdiction of District Court",
      "content": "7. Despite any provision to the contrary in the Criminal Procedure Code 2010, a District Court has jurisdiction to try any offence under this Act and has power to impose the full penalty or punishment in respect of the offence. [9/2003]"
    }
  ],
  "definitions": []
}