{
  "id": "vsa-1974",
  "type": "statute",
  "title": "Voluntary Sterilisation Act 1974",
  "title_en": "Voluntary Sterilisation Act 1974",
  "short_name": "VSA1974",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/VSA1974",
  "description": "An Act relating to treatment for voluntary sexual sterilisation by registered medical practitioners and for matters connected therewith.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Voluntary Sterilisation Act 1974."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “approved permanent premises” has the meaning given by section 2(1) of the Healthcare Services Act 2020; [Act 19 of 2025 wef 05/12/2025] “court” means the General Division of the High Court or a Family Court; “health institution” means — ( a ) any approved permanent premises at which the holder of a licence granted under the Healthcare Services Act 2020 is approved to provide an acute hospital service or ambulatory surgical centre service; or ( b ) any specialist medical clinic; [Act 19 of 2025 wef 05/12/2025] “registered medical practitioner” has the meaning given by the Medical Registration Act 1997; “specialist medical clinic” means any approved permanent premises at which — ( a ) the holder of a licence granted under the Healthcare Services Act 2020 is approved to provide an outpatient medical service; and ( b ) a registered medical practitioner who is registered under section 22 of the Medical Registration Act 1997 as a specialist in any prescribed branch of medicine is employed or engaged by the holder of the licence mentioned in paragraph ( a ) to practise medicine as part of the provision of the outpatient medical service; [Act 19 of 2025 wef 05/12/2025] “treatment for sexual sterilisation” means the surgical sterilisation of a male or female that does not involve removal of the reproduction glands or organs unless the removal is necessary for medical or therapeutic reasons. [27/2014; 40/2019] [*Updated to be consistent with the 2020 Revised Edition]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Treatment for sexual sterilisation",
      "content": "3. —(1) Despite any written law, but subject to this section and section 4, it is lawful for a registered medical practitioner to carry out treatment for sexual sterilisation. (2) A registered medical practitioner may carry out treatment for sexual sterilisation on any person if, and only if, the following conditions are satisfied: ( a ) subject to paragraphs ( d ) and ( e ), in the case of a married or an unmarried person who is 21 years of age or older — if the person consents to the treatment; ( b ) subject to paragraph ( d ), in the case of a married person who is below 21 years of age — if the person consents to the treatment; ( c ) subject to paragraph ( e ), in the case of an unmarried person who is below 21 years of age — if the person, and at least one parent or guardian of the person, both consent to the treatment; ( d ) in the case of a married person who lacks capacity within the meaning of section 4 of the Mental Capacity Act 2008 to consent to the treatment — if, on the application of the person’s spouse, the court makes an order declaring that the treatment is necessary in the best interests of that person; ( e ) in the case of an unmarried person who lacks capacity within the meaning of section 4 of the Mental Capacity Act 2008 to consent to the treatment — if, on the application of at least one parent or guardian of the person, the court makes an order declaring that the treatment is necessary in the best interests of that person. [27/2014] (3) Before a registered medical practitioner carries out treatment for sexual sterilisation, he or she must give to the person undergoing the treatment, not being a person who lacks capacity within the meaning of section 4 of the Mental Capacity Act 2008 to consent to the treatment, a full and reasonable explanation as to the meaning and consequences of that treatment, and that person must certify that he or she clearly understands the meaning and consequences of that treatment. (4) For the purposes of this section, Part 2 of the Mental Capacity Act 2008 applies, with the necessary modifications, for the purposes of determining — ( a ) whether a person lacks capacity within the meaning of section 4 of that Act to consent to treatment for sexual sterilisation; and ( b ) whether such treatment is in the best interests of that person. (5) Any registered medical practitioner who carries out any treatment for sexual sterilisation on a person when the requisite conditions referred to in subsection (2) in respect of that person are not satisfied shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 5 years or to both."
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Sexual sterilisation to be carried out in health institution",
      "content": "4. —(1) Subject to subsection (2), every treatment for sexual sterilisation must only be carried out — ( a ) in a health institution; and ( b ) by a registered medical practitioner who is authorised, by the person having the management or control of the health institution, to carry out such treatment. (2) Where the treatment for sexual sterilisation is carried out in a health institution that is a specialist medical clinic, the registered medical practitioner mentioned in subsection (1)( b ) must also possess the prescribed surgical or obstetric qualifications."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Privilege against disclosure of matters or treatment relating to sexual sterilisation",
      "content": "5. —(1) A person who — ( a ) is concerned with the keeping of medical records in connection with any treatment for sexual sterilisation; or ( b ) participates in any treatment for sexual sterilisation, must not, unless the person upon whom the treatment has been performed expressly consents to the disclosure, disclose any facts or information relating to that treatment except to such persons and for such purposes as may be prescribed. (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Power to inspect health institutions and examine records, etc.",
      "content": "6. For the purpose of ensuring that this Act and any regulations made under this Act are being complied with, a public officer authorised by the Minister may — ( a ) enter any health institution; and ( b ) examine and make copies of or take extracts from any records or documents connected with any treatment for sexual sterilisation."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Penalty for compelling any person to undergo treatment for sexual sterilisation",
      "content": "7. Any person who, by means of coercion or intimidation, compels or induces another person to undergo treatment for sexual sterilisation against that other person’s will shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 5 years or to both."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Immunity of registered medical practitioners",
      "content": "8. No registered medical practitioner shall be liable civilly or criminally for carrying out treatment for sexual sterilisation on any person so long as — ( a ) the conditions in section 3(2) are satisfied in respect of that person; and ( b ) the treatment is not carried out in a negligent manner."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Sexual sterilisation not to constitute grievous hurt under section 320 of Penal Code 1871",
      "content": "9. To avoid doubt, any treatment for sexual sterilisation by a registered medical practitioner does not constitute grievous hurt under section 320 of the Penal Code 1871."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Conscientious objection to participate in treatment for sexual sterilisation",
      "content": "10. No person is under any duty, whether by contract or by any statutory or legal requirement, to participate in any treatment for sexual sterilisation authorised by this Act to which the person has a conscientious objection. 11. [ Repealed by Act 26 of 2001 ] 12. [ Repealed by Act 28 of 2012 ]"
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Regulations",
      "content": "13. —(1) The Minister may make regulations for, or in respect of, every purpose which the Minister considers necessary for carrying out the provisions of this Act and for prescribing any matter which is authorised or required under this Act to be prescribed. (2) Without limiting subsection (1), the Minister may make regulations — ( a ) requiring registered medical practitioners to keep records of treatment for sexual sterilisation and to forward the records to the Director‑General of Health together with any information relating to the treatment that the Director‑General may require; [Act 11 of 2023 wef 01/05/2023] ( b ) prescribing — (i) the forms of consent to be given by a person undergoing treatment for sexual sterilisation under section 3; (ii) the form of certification required under section 3(3) to be given by a person undergoing treatment for sexual sterilisation; and (iii) such other forms of certification as may be required; ( c ) providing for the preservation and disposal of records in respect of treatment for sexual sterilisation authorised under this Act and for the use of the records for statistical or research purposes so long as such use does not disclose the identities of the persons who have received the treatment; and ( d ) prescribing the qualifications of registered medical practitioners who may carry out treatment for sexual sterilisation in specialist medical clinics, which qualifications may differ in respect of treatment for sexual sterilisation on males or on females."
    }
  ],
  "definitions": [
    {
      "term": "approved permanent premises",
      "definition": "“approved permanent premises” has the meaning given by section 2(1) of the Healthcare Services Act 2020; [Act 19 of 2025 wef 05/12/2025]",
      "source_provision": "s2"
    },
    {
      "term": "court",
      "definition": "“court” means the General Division of the High Court or a Family Court;",
      "source_provision": "s2"
    },
    {
      "term": "health institution",
      "definition": "“health institution” means — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "registered medical practitioner",
      "definition": "“registered medical practitioner” has the meaning given by the Medical Registration Act 1997;",
      "source_provision": "s2"
    },
    {
      "term": "specialist medical clinic",
      "definition": "“specialist medical clinic” means any approved permanent premises at which — ( a )",
      "source_provision": "s2"
    },
    {
      "term": "treatment for sexual sterilisation",
      "definition": "“treatment for sexual sterilisation” means the surgical sterilisation of a male or female that does not involve removal of the reproduction glands or organs unless the removal is necessary for medical or therapeutic reasons. [27/2014; 40/2019] [*Updated to be consistent with the 2020 Revised Edition]",
      "source_provision": "s2"
    }
  ]
}