{
  "id": "wopa-1904",
  "type": "statute",
  "title": "Widows’ and Orphans’ Pension Act 1904",
  "title_en": "Widows’ and Orphans’ Pension Act 1904",
  "short_name": "WOPA1904",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/WOPA1904",
  "description": "An Act to provide for widows’ and orphans’ pensions.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Widows’ and Orphans’ Pension Act 1904."
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless there is something repugnant in the subject or context — “contributor” means and includes every person from whose salary or pension deductions are made in accordance with this Act; “the Directors” means such persons not less than 3 in number as are appointed by the Minister to carry out the provisions of this Act subject to the control of, and to rules for their guidance made by, the President; “entitled officer” means an entitled officer, as defined in any of the written laws specified in the first column of the Second Schedule, who retires under the provisions of such written law specified in the second column of that Schedule; “of a pensionable age”, as applied to children, means, in the case of a male, that he is under the age of 21 years, and, in the case of a female, that she is under the age of 21 years and has not been married; “officer on the Malayan Establishment” means an officer whom the President has by notification in the Gazette declared to be on the Malayan Establishment; “Pension Fund” means the Pension Fund established by the Pension Fund Act 1995; “public servant” means an officer holding a pensionable office or an officer serving on probation or on agreement in a pensionable office, in the service of the Government, but does not include an officer — ( a ) who is not restricted by law to one wife at a time; ( b ) who, on or after 2 March 1961 — (i) is appointed to a pensionable office; or (ii) is appointed to a pensionable office on probation or on agreement, in the service of the Government; ( c ) who is transferred to the service of the Government under section 9 of the Local Government Integration Act (Cap. 166, 1985 Revised Edition) or section 5 of the Planning Act 1998; or ( d ) in the service of the Government before 2 March 1961 who becomes restricted by law to one wife at a time on or after 1 April 1965, unless, within one month from the date he becomes so restricted, he gives notice in writing to the Directors of his desire to become a contributor, whereupon the provisions of this Act shall apply to him from the date of such notice. [8/1995]"
    },
    {
      "provision_ref": "s2A",
      "section": "2A",
      "title": "Pensions, etc., to be charged on Pension Fund",
      "content": "2A. There shall be charged on and paid out of the Pension Fund all sums of money payable by way of pension in accordance with this Act. [8/1995]"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Contributions to be credited to Pension Fund",
      "content": "3. All contributions and other revenues receivable from public officers under this Act shall be carried to the credit of the Pension Fund: Provided that the sums so received shall not be assessable for military contribution. [8/1995]"
    },
    {
      "provision_ref": "s4",
      "section": "4",
      "title": "Abatements from salaries to be made",
      "content": "4. —(1) A monthly abatement shall be made from the salary or pension of every public servant and all such abatements shall be paid into the Pension Fund: Provided that where an officer was or is serving on probation or on agreement in a pensionable office on or after 11 December 1950, he may, not later than 31 December 1958, or 6 months after the commencement of such service, whichever is the later, by giving notice in writing to the Directors of his desire to do so, elect not to become or to cease to be a contributor, as the case may be, and in such case the provisions of this Act shall cease to apply to such officer in respect of the period of his service on probation or on agreement, and there shall be repayable to him the total amount of any contribution which he may have made. [8/1995] (2) Such abatements shall be calculated at the rate of 4% of the monthly salary of the contributor: Provided that, unless and until notice has been given as provided in section 9(1), the abatement to be made in the case of a contributor who has retired on pension or who has suffered reduction of salary shall be calculated upon the salary drawn by such contributor immediately prior to such retirement or reduction, as the case may be. (3) In the case of an officer holding or having held a post, the salary of which is on a sterling basis, the abatement shall be made in dollars at 4% of such sterling salary converted into dollars at the rate from time to time fixed by the Government for the payment of such salaries or pensions. (4) Contributions shall continue to be made on the full salary whenever an officer is on leave of absence with half salary or without salary. (5) An officer who held a non-pensionable office in the service of the Government and was appointed to a pensionable office before 2 March 1961 shall be deemed to have entered such service on the date of such appointment."
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Period for which abatement shall be made",
      "content": "5. —(1) Such abatement shall continue to be made until the contributor attains the age of 65 years, if he continues so long to draw salary or pension from the Government, or until such abatement has been made for 35 successive years, counting from the first abatement of his original salary, in either of which events such abatement shall cease. Abatement to be made from salary of permanent post (2) Such abatement shall be calculated on the salary of the permanent appointment of the contributor irrespective of any temporary increment of salary which he derives from an acting appointment, and irrespective of personal and other allowances except pensionable personal allowances which shall be deemed to be part of the contributor’s salary for the purpose of calculating such abatement."
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Abatement during period of enemy occupation",
      "content": "6. —(1) Notwithstanding anything in sections 3, 4 and 5, where a public servant was not during the period of enemy occupation and during any period thereafter until his re‑appointment in the service of the Government, drawing the full salary or any part of his salary, abatements calculated on the salary for which that public servant would have been eligible in accordance with his salary scheme were it not for the enemy occupation shall be deemed to have been made during such period or periods under and in accordance with the provisions of this Act: Provided that for the purpose of any repayment to contributors as provided in sections 13, 14 and 15(2)( b ) only the contributions actually made shall be taken into account. (2) In this section, “the period of enemy occupation” means the period commencing on 8 December 1941 and continuing to 31 August 1945."
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Contributor retiring under certain laws",
      "content": "7. —(1) Every contributor who is an entitled officer shall, at his option exercisable as hereinafter provided, be entitled either — ( a ) to cease to contribute, in which event his widow or children, as the case may be, shall be entitled on his death to a pension computed on the basis of the interest acquired by such contributor at the date of his ceasing to contribute in accordance with the Rules and Tables set out in the First Schedule; ( b ) to make a single contribution calculated in accordance with the Rules and Tables set out in the First Schedule, in which event his widow or children, as the case may be, shall be entitled on his death to a pension computed on the basis of the contributor having contributed for the remainder of the period of 35 years or until he had attained the age of 65 years or, in the event of the contributor dying before the expiration of that period or attaining that age, until the date of his death; or ( c ) after furnishing such proof as the Directors may require that his wife is in a normal state of health, to cease to contribute and be paid a sum calculated in accordance with the Rules and Tables set out in the First Schedule in which case the rights of the contributor and of his widow and children shall cease. (2) The option shall be exercisable before the expiration of a period of 6 months from the date of the retirement of the contributor or before 31 July 1958, whichever shall be the later. (3) The exercise by a contributor of the option shall be irrevocable. (4) The option shall be exercisable by written notification addressed to the President."
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Exercise of option",
      "content": "8. —(1) Every contributor shall, at his option exercisable as is provided in this section, be entitled to — ( a ) cease to contribute and elect that his widow or his widow and children or his children, as the case may be, shall be entitled, on his death, to a pension, computed on the basis of the interest acquired by the contributor at the date of his ceasing to contribute in accordance with the Rules and Tables set out in the First Schedule; ( b ) cease to contribute and elect that he be paid — (i) a sum calculated in accordance with the Rules and Tables set out in the First Schedule if, at the time of his election, he is a contributor with a wife or wife and children or children, as the case may be; (ii) a sum calculated in accordance with section 14( a ) if, at the time of his election, he is a bachelor; or (iii) a sum calculated in accordance with the Rules and Tables set out in the First Schedule and section 14( b ) if, at the time of his election, he is a widower without children: Provided that the rights of every such contributor under this Act shall cease; or ( c ) elect to continue to contribute in accordance with the provisions of this Act. (2) The option shall be exercisable by written notification to the Permanent Secretary to the Ministry of Finance before the expiration of 6 months from 1 April 1965, and when so exercised shall be irrevocable. (3) For the purposes of subsection (1), a contributor shall be deemed to include a person from whose salary or pension deductions had been made in accordance with the provisions of this Act, until he attained the age of 65 years or had made contributions for 35 successive years."
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Contributions where official income is reduced",
      "content": "9. —(1) If the official income of a contributor becomes reduced, whether by reduction of salary or by his retirement on pension, he may, upon giving notice in writing to the Directors of his desire to do so, contribute for the remainder of the 35 years or until he attains the age of 65 years, upon the actual amount of his salary or pension, as the case may be, in which case his widow or children shall, subject as hereinafter provided, be entitled to pension accordingly; and where the official income of a contributor becomes reduced by retirement on pension on account of ill health, he may also upon giving notice in writing to the Directors of his desire to do so, cease to contribute. (2) If a contributor who has retired on pension on account of ill health and has given notice as provided in subsection (1) that he desires to contribute on the actual amount of his pension dies within 3 years of the date of his retirement, his widow or children shall be entitled to such pension computed on the basis of the pension rights acquired by such contributor at the date of his retirement in accordance with the Rules and Tables set out in the First Schedule. (3) If a contributor who has retired on pension on account of ill health and has given notice as provided in subsection (1) that he desires to cease to contribute dies within 2 years of the date of his retirement, his widow or children shall be entitled to a pension computed on the basis of the pension rights acquired by such contributor at the date of his retirement in accordance with the Rules and Tables set out in the First Schedule. (4) Any notice given by a contributor under subsection (1) shall be irrevocable, except in the case of an entitled officer who having retired before 30 April 1958 exercises his option under section 7 before 31 July 1958. (5) Where such reduction of official income is due to retirement on a pension and the contributor draws a pension not only from Singapore, but also from Malaysia, he shall, if he elects to contribute on his reduced salary or pension in accordance with subsection (1), contribute on the aggregate amount of the pensions granted to him by Singapore and by Malaysia, and such aggregate amount shall, for the purposes of this section and subject to subsection (7), be deemed to be his reduced official income. (6) Where a contributor only contributes on his reduced official income, any pension to his widow or children shall be diminished in the same proportion as it would have been increased had his rate of contribution been raised instead of being lowered. (7) The pension of a contributor to whom a gratuity and reduced pension have been granted shall, for the purpose of calculating the amount of the abatements to be made under this section, be deemed to be the equivalent of four-thirds of such reduced pension."
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Contributor retiring on account of ill health",
      "content": "10. If a contributor who holds a pensionable office retires on account of ill health before he is entitled to a pension and dies within 2 years of the date of his retirement, his widow or children shall be entitled to a pension computed on the basis of the pension rights acquired by such contributor at the date of his retirement in accordance with the Rules and Tables set out in the First Schedule."
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Contributor retired on pension",
      "content": "11. If a contributor who has retired on a pension subsequently ceases to have a wife or child who would on his death be entitled to pension, he shall thereupon cease to contribute and his rights under this Act shall cease."
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Interest of contributors retiring without pension",
      "content": "12. —(1) A married contributor or a contributor who is a widower with children of a pensionable age who retires from the service of the Government before he is entitled to a pension may continue to contribute, from and after the date of his ceasing to draw salary, on the salary which he was receiving from the Government at such date and at the same rate and subject to the same terms and conditions as if he had continued in the service of the Government: Provided that as soon as such contributor ceases to have a wife or child who would on his death be entitled to pension he shall forthwith cease to contribute and his rights under this Act shall cease. (2) In the event of any such contributor failing to contribute, or in the event of any contribution due from him being in arrear for 6 months, it shall be considered that he has ceased to be a contributor and his widow or children, as the case may be, shall be entitled on his death to a pension computed only on the basis of the pension rights acquired by that contributor at the date of his ceasing to contribute in accordance with the Rules and Tables set out in the First Schedule."
    },
    {
      "provision_ref": "s13",
      "section": "13",
      "title": "Refund of contribution to bachelor or widower without children of a pensionable age",
      "content": "13. —(1) If a contributor being a bachelor or a widower without children of a pensionable age retires from the service of the Government, he shall cease to contribute and his rights under this Act shall cease, except as provided in subsection (2). (2) If a contributor being a bachelor or a widower without children of a pensionable age dies while in the service of the Government or retires from the service of the Government there shall be payable to him or to his legal representative — ( a ) if such contributor is a bachelor, the total amount of his contributions together with compound interest thereon calculated with annual rests at the rate of 2&#189;%; and ( b ) if such contributor is a widower without children of a pensionable age, the total amount of the contributions which he has paid since the death of his last wife or the ceasing to be of pensionable age of his last child, whichever event shall last have happened together with compound interest thereon calculated with annual rests at the rate of 2&#189;%."
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Provisions consequent upon an officer being removed",
      "content": "14. A contributor who is removed from the service of the Government shall cease to contribute under this Act, and — ( a ) where such contributor is a bachelor, the total amount of his contributions under this Act shall be repaid to him, together with compound interest thereon calculated with annual rests at the rate of 2&#189;%, subject to the deduction of any sums due by him to the Government; ( b ) where such contributor is a widower without children of a pensionable age, the total amount of the contributions which he has paid since the death of his last wife or the ceasing to be of a pensionable age of his last child, whichever event shall have last happened, shall be repaid to him, together with compound interest thereon calculated with annual rests at the rate of 2&#189;%, subject to the deduction of any sums due by him to the Government; and ( c ) where such contributor is married or is a widower with children of a pensionable age, his widow or children, as the case may be, shall be entitled to a pension computed on the basis of the pension rights acquired by such contributor at the date of the cessation of his contributions in accordance with the Rules and Tables set out in the First Schedule."
    },
    {
      "provision_ref": "s15",
      "section": "15",
      "title": "Contributor transferred to other Government employment in country where the law provides for granting pensions to widows and children",
      "content": "15. —(1) When a contributor is transferred from the service of the Government to other employment under the Government of a British Dominion, Colony, Protected State or Protectorate or a territory in respect of which a mandate, or trusteeship on behalf of the League of Nations or the United Nations is being exercised by Her Majesty, where provision is made by law for the granting of pensions to widows and children of persons employed in its service, he shall cease to contribute under this Act as soon as he becomes a contributor under the provisions of that law, but so that nevertheless — ( a ) his widow or children, as the case may be, shall be entitled on his death to a pension computed on the basis of the pension rights acquired by such contributor at the date of the cessation of his contributions in accordance with the Rules and Tables set out in the First Schedule; ( b ) if he retires or is removed from the service of such Dominion, Colony, Protected State, Protectorate or territory, or dies while in the service thereof, and is at the time of such retirement, removal or death a widower without children of a pensionable age or a bachelor, section 13 or 14, as the case may be, shall be deemed to apply; ( c ) until he ceases to contribute under the provisions of this Act, his contribution shall be on the salary of the last substantive appointment held by him in Singapore at the date of his transfer, at the same rate and subject to the same terms and conditions as if he had continued in the service of the Government. Contributor transferred to country where no such law exists (2) When a contributor is transferred to such Dominion, Colony, Protected State, Protectorate or territory other than North Borneo, where no provision has been made by law for granting such pensions as aforesaid, such contributor shall — ( a ) if married, or a widower having children of a pensionable age, be entitled, on giving notice in writing to the Directors within one month after his transfer from the service of the Government of his desire to do so, to continue to be a contributor on the salary of the last substantive appointment held by him in Singapore at the date of his transfer, at the same rate and subject to the same terms and conditions as if he had continued in the service of the Government; ( b ) if then a widower without children of a pensionable age or a bachelor, be entitled to elect, on giving the notice required to be given under paragraph ( a ), to continue to contribute as is provided in that paragraph or to be paid the total amount without interest of his contributions. (3) In the event of the contributions of any such contributor being in arrear for 6 months it shall be considered that he has ceased to be a contributor, and his widow or his widow and children, as the case may be, shall be entitled on his death to a pension computed only on the basis of the pension rights acquired by such contributor at the date of his ceasing to contribute, in accordance with the Rules and Tables set out in the First Schedule. (4) ( a ) When any such contributor, being a widower without children of a pensionable age or a bachelor, has elected to continue to contribute, then if he retires or is removed from the service of such Dominion, Colony, Protected State, Protectorate or territory, or dies while in the service thereof and is at the time of such retirement, removal or death a widower without children of a pensionable age or a bachelor, section 13 or 14, as the case may be, shall be deemed to apply. ( b ) When any such contributor, being a widower without children of a pensionable age or a bachelor, has elected to be paid the total amount without interest of his contributions, then on such payment being made his rights and liabilities under this Act shall cease. Contributor transferred to North Borneo (5) A contributor who was transferred to the Colony of North Borneo before provision was made by the law of that Colony for granting pensions to widows and children of persons employed in the service of that Colony shall continue to be a contributor under this Act on the salary which for the time being he is entitled to receive in respect of any office held by him in the service of that country at the same rate and subject to the same terms and conditions as if he had continued in the service of the Government. (6) In the event of the contribution of such contributor to the Government being in arrear, such arrears, together with interest thereon at the rate of 6%, shall be recoverable from such contributor as a debt due to the Government or shall be deducted from any salary which is subsequently payable to him from the Government. (7) Where a contributor either elects or is bound under subsections (2) to (6) to continue his contribution after being transferred as aforesaid, he may cease to contribute under this Act as soon as the Government of the Dominion, Colony, Protected State, Protectorate or territory in whose service he is employed has made provision by law for granting pensions to widows and children of persons employed in its service and he has become a contributor under the provisions of that law. (8) In the event of his so electing to cease contributing — ( a ) his widow or children, as the case may be, shall be entitled on his death to a pension computed on the basis of the pension rights acquired by such contributor at the date of his so ceasing to contribute in accordance with the Rules and Tables set out in the First Schedule; ( b ) if he retires or is removed from the service of such Dominion, Colony, Protected State, Protectorate or territory, or dies while in the service thereof, and is at the time of such retirement, removal or death a widower without children of a pensionable age or a bachelor, section 13 or 14, as the case may be, shall be deemed to apply."
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Contributor to Oversea Superannuation Scheme",
      "content": "16. —(1) If any contributor, or any officer who would, but for this section, be liable to contribute under this Act, becomes a contributor to the Oversea Superannuation Scheme in respect of dependants’ benefits he shall, on written application made within 3 months after the date on which he first became a contributor under that Scheme, or within such extended period as the Directors may, in any particular case, allow, be exempted by the Directors from contributing under this Act, so long as he continues to contribute to that Scheme. (2) An exemption granted under subsection (1) shall take effect from the date upon which such contributor or officer first became a contributor to that Scheme, and there shall be repayable to him the total amount of any contributions which he may have made under this Act since that date. (3) Section 15(1) shall apply to a contributor who has been exempted under subsection (1) as if he had been transferred to other such employment within the meaning of that subsection. (4) An officer who has contributed to the Oversea Superannuation Scheme for the full period required by the said Scheme and has by such contributions provided a pension for his widow and children, shall be deemed for the purpose of subsection (1) to be still contributing to such Scheme."
    },
    {
      "provision_ref": "s17",
      "section": "17",
      "title": "Definition of service",
      "content": "17. A public servant who is an officer on the Malayan Establishment shall be deemed for the purpose of this Act to be in the service of the Government except that for the purpose of sections 18 and 19 he shall be deemed to be in the service of Malaysia."
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Officers transferred from Malaysia",
      "content": "18. When an officer in the service of Malaysia who is a contributor under the Widows’ and Orphans’ Pension Enactment (F.M.S. Cap. 26) has been transferred to the service of the Government he shall forthwith become a contributor under this Act on the full salary to which he is from time to time entitled in the service of Singapore except that the period during which he has contributed under the Widows’ and Orphans’ Pension Enactment of Malaysia shall be taken into account in reckoning the period of 35 years referred to in section 5."
    },
    {
      "provision_ref": "s19",
      "section": "19",
      "title": "Arrears of contribution to Malaysia pension scheme",
      "content": "19. When an officer in the service of Malaysia who is a contributor under the Widows’ and Orphans’ Pension Enactment thereof, has been transferred to the service of any Malay State where no provision has been made by law for the granting of pensions to widows and children of persons employed in its service and the contribution of that contributor under the said Widows’ and Orphans’ Pension Enactment is in arrear, such arrear shall be deducted from any salary which is subsequently payable to him from the Government."
    },
    {
      "provision_ref": "s20",
      "section": "20",
      "title": "Officers contributing to approved schemes",
      "content": "20. —(1) When an officer, who is a contributor to an approved scheme, is transferred to the service of the Government, and continues after the transfer to contribute to that scheme, he shall, on written application, be exempted by the Directors from contributing under the provisions of this Act, so long as he continues to contribute to that scheme. (2) No application for exemption under subsection (1) shall be valid unless it is received by the Directors within 3 months or within such extended period as the Directors may, in any particular case, allow from the date when such officer arrives to assume duty in Singapore. (3) An officer who has contributed to an approved scheme for the full period required by that scheme and has by such contributions provided a pension for his widow or children shall be deemed for the purposes of subsection (1) to be still contributing to the scheme. (4) An officer exempted under subsection (1) shall not subsequently become a contributor under this Act unless either he ceases to contribute to such approved scheme or, having left the service of the Government, he is subsequently reappointed to it. (5) Nothing in this section shall exempt an officer who on re‑appointment to the service of the Government is already a contributor under this Act from continuing his contributions hereunder. (6) Where an officer who is a contributor to an approved scheme is transferred to the service of the Government and ceases after the transfer to contribute to that scheme, any period during which he was a contributor to that scheme shall be taken into account in reckoning the period of 35 years referred to in section 5. (7) In this section, “approved scheme” means a scheme for the granting of pensions to widows and children of officers, which has been declared by the Minister to be an approved scheme for the purposes of this section."
    },
    {
      "provision_ref": "s21",
      "section": "21",
      "title": "Rules for payment when a contributor on leave of absence or pensioner is paid by the Crown Agents",
      "content": "21. —(1) When a contributor on leave of absence is paid by the Crown Agents, he shall be entitled to receive 96% or 46% of his nominal salary according as he is on full or half pay leave converted in the case of dollar salaries into sterling at the rate of exchange at which the contributor is entitled to receive such salary. (2) When a contributor receives his pension through the Crown Agents the pension — ( a ) if a dollar pension, shall be reduced by the amount of his dollar contributions and the balance thus reduced shall be payable to him converted into sterling at the rate of exchange at which he is entitled to receive such pension; and ( b ) if a sterling pension, shall be payable to him reduced only by 4% of his sterling salary or pension, as the case may be."
    },
    {
      "provision_ref": "s22",
      "section": "22",
      "title": "Register of contributions to be kept",
      "content": "22. —(1) A register shall be kept by the Directors in which shall be entered the date of the birth of every contributor and, if he is married, the dates of the births of his wife and children, if any, and all other dates and particulars respecting contributors and their families material to be recorded for the purposes of this Act. By those hereafter appointed (2) Every public servant who enters the service of the Government shall, within 6 months after the date of so entering, notify to the Directors the date of his birth and, if he is a married man, the date of his marriage and of the births of his wife and children, if any, all duly proved to the satisfaction of the Directors by affidavit or otherwise. To notify marriage or divorce (3) Every contributor who marries or whose marriage is annulled or dissolved by the decree of a competent court shall within 3 months after the date of the marriage or the decree, as the case may be, notify the same to the Directors in writing and, in the case of his marriage, state the date of the birth of his wife, duly proved as aforesaid. To notify birth of child, marriage of daughter and death of wife or child (4) Every contributor shall notify the Directors in writing the birth of each child born to him within 3 months from the date of the birth, duly proved as aforesaid, and the marriage of any female child, under the age of 21 years, within 3 months from the date of the marriage, and also, within 3 months from the date of the event, the death of his wife or any of his pensionable children. Notice of death of contributor and birth of posthumous child and of marriage or death to be notified (5) After the death of any contributor, notice of the death and of the birth of any posthumous child born to that contributor, duly proved as aforesaid, and of the marriage of any female child of that contributor, under the age of 21 years, and of the death of any child of that contributor, under the age of 21 years, shall be given in writing by the widow of that contributor to the Directors within 3 months after the date of the event."
    },
    {
      "provision_ref": "s23",
      "section": "23",
      "title": "Penalty for non-compliance with section 22",
      "content": "23. —(1) A contributor or widow who fails or neglects to comply with any of the requirements of section 22 shall for each default pay a fine not exceeding $25 which shall be deducted from his or her salary or pension, as the case may be, by the Accountant-General on the certificate of the Directors. Penalty for false statement (2) A contributor who wilfully makes any false statement respecting any of the particulars required to be furnished by this Act shall forfeit at the discretion of the Directors all or any part of his rights under this Act."
    },
    {
      "provision_ref": "s24",
      "section": "24",
      "title": "Calculation of pensions",
      "content": "24. —(1) All pensions shall be calculated according to the Rules and Tables set out in the First Schedule. (2) The President may vary any of the Rules and Tables referred to in subsection (1). Pensions, how to be paid in case of sterling salaries (3) In the case of contributions made in the manner provided in section 4 for officers holding or having held posts the salary of which is on a sterling basis, the contributions shall for the purpose of calculating pensions be deemed to be fixed sterling contributions and the pensions shall accordingly be fixed and payable in sterling or, if paid in Singapore, shall be converted into dollars at the rate annually or periodically fixed by the Government for the payment in Singapore of officers’ salaries or pensions."
    },
    {
      "provision_ref": "s25",
      "section": "25",
      "title": "Who not entitled to pension",
      "content": "25. —(1) The following persons shall not be entitled to any pension under this Act: ( a ) a widow whose marriage was contracted after her husband had completed his 35 years of contributions or attained the age of 65 years or retired or been removed from the service of the Government; ( b ) the issue of such a marriage; ( c ) a widow whose husband dies within 12 calendar months of the marriage without issue of such marriage born in his lifetime or in due time after his death. (2) The President may, if he thinks fit, allow to such last mentioned widow all or any part of the pension to which she would have been entitled but for subsection (1)( c ). (3) References in this Act to “widow” and to “child or children of a pensionable age” shall not include a widow whose marriage was contracted in the circumstances mentioned in subsection (1) and the issue of such marriage."
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "Pension, when to commence",
      "content": "26. The pension payable to a widow or child or children under this Act shall commence upon the death of the husband or father or mother, as the case may be, shall accrue daily, and shall be payable monthly free from any deduction."
    },
    {
      "provision_ref": "s27",
      "section": "27",
      "title": "When widow’s pension ceases",
      "content": "27. —(1) A widow’s pension shall cease on her death or remarriage or on her becoming a bankrupt. (2) When a widow’s pension ceases in her lifetime she shall for the purposes of this Act be deemed to have died at the time of such cesser: Provided that if a widow’s pension ceases in her lifetime by reason of her bankruptcy the President may from time to time during the remainder of her life or during such shorter period or periods, either continuous or otherwise, as he thinks fit, direct the payment of all or any part of so much, if any, of the said pension as is not for the time being payable to any child or children of such widow or of any husband of hers under this Act to, or apply the same for the maintenance and personal support or benefit of, such widow in such manner as he thinks proper."
    },
    {
      "provision_ref": "s28",
      "section": "28",
      "title": "Dissolution of marriage",
      "content": "28. When the marriage of any contributor has been annulled or dissolved by the decree of any competent court the wife, party to such marriage, shall for all purposes of this Act be deemed to have died and the contributor to have become a widower at the date of such decree."
    },
    {
      "provision_ref": "s29",
      "section": "29",
      "title": "When children’s pensions cease",
      "content": "29. Children’s pensions shall cease, in the case of a male, on his attaining the age of 21 years and, in the case of a female, on her attaining the age of 21 years or marrying under that age."
    },
    {
      "provision_ref": "s30",
      "section": "30",
      "title": "Pension of widow where no child by previous marriage of contributor",
      "content": "30. If a contributor dies leaving a widow but no child of a pensionable age by a previous marriage, the widow shall be entitled to receive a pension calculated according to the Rules and Tables set out in the First Schedule applicable to her case under this Act."
    },
    {
      "provision_ref": "s31",
      "section": "31",
      "title": "Pension of child where no widow alive at death of contributor",
      "content": "31. If a contributor dies leaving no widow but a child or children of a pensionable age by one marriage, such child or children shall be entitled to receive the pension which his or their mother would have been entitled to, if she had survived the contributor."
    },
    {
      "provision_ref": "s32",
      "section": "32",
      "title": "Pensions of children by 2 or more marriages where no widow alive at death of contributor",
      "content": "32. If a contributor dies leaving no widow but children of a pensionable age by 2 or more marriages, the child or children of each marriage shall be entitled to receive one‑half, one‑third or one‑quarter, as the case may be, of the pension which his or their mother would have been entitled to, if she had survived the contributor and there had been no child by any other marriage."
    },
    {
      "provision_ref": "s33",
      "section": "33",
      "title": "Where contributor dies leaving a widow and a child or children by a previous marriage",
      "content": "33. If a contributor dies leaving a widow and also a child or children of a pensionable age by one previous marriage — ( a ) the widow shall be entitled to receive one-half of the pension which she would have been entitled to receive, if there had been no such child or children; and ( b ) such child or children shall be entitled to receive one‑half of the pension which his or their mother would have been entitled to, if she had survived the contributor."
    },
    {
      "provision_ref": "s34",
      "section": "34",
      "title": "Where contributor dies leaving a widow and children by 2 or more marriages",
      "content": "34. If a contributor dies leaving a widow and children of pensionable age by 2 or more marriages — ( a ) the widow shall be entitled to receive one‑third or one‑quarter, as the case may be, of the pension which she would have received, if there had been no child by a previous marriage; and ( b ) the child or children of each previous marriage shall be entitled to receive one‑third or one‑quarter, as the case may be, of the pension which his or their mother would have been entitled to, if she had survived the contributor and there had been no child by any other marriage."
    },
    {
      "provision_ref": "s35",
      "section": "35",
      "title": "Pension of child or children where widow ceases to be entitled",
      "content": "35. When a widow of a contributor ceases to be entitled to a pension, the child or children of a contributor shall be entitled to receive the pension which he or they would have been entitled to receive, if such widow had predeceased the contributor."
    },
    {
      "provision_ref": "s36",
      "section": "36",
      "title": "Pension of surviving children where child dies or ceases to be of pensionable age",
      "content": "36. If any child dies or ceases to be of pensionable age, the surviving children of the same marriage shall be entitled to receive the pension to which they would have been entitled, if such child had predeceased the contributor."
    },
    {
      "provision_ref": "s37",
      "section": "37",
      "title": "Where all the children cease to be of pensionable age",
      "content": "37. When all the children of any marriage cease to be of pensionable age, the person or persons entitled under the preceding sections shall be entitled to receive the pension which he or they would have been entitled to receive, if there had been no child of such marriage of pensionable age living at the death of the contributor."
    },
    {
      "provision_ref": "s38",
      "section": "38",
      "title": "Children to take in equal shares",
      "content": "38. Where children of any marriage are entitled to any pension they shall take the same in equal shares."
    },
    {
      "provision_ref": "s39",
      "section": "39",
      "title": "Adopted children",
      "content": "39. —(1) A child adopted by a contributor while he is married to any wife shall, for the purpose of this Act, be deemed to be the child of the contributor by that marriage if — ( a ) the contributor adopted the child before he retired from the public service; ( b ) the contributor was under the age of 55 years at the date of adoption; and ( c ) the adoption is registered under the Adoption of Children Act 1939 or is valid according to the law of the place of domicile of the contributor at the date of the adoption or is valid under any written law corresponding to that Act, of the place where the contributor was resident at the date of the adoption. (2) The child of a contributor who has been adopted by any other person in circumstances in which if the adoption had been made by a contributor it would have been valid in accordance with subsection (1)( c ) shall not be entitled to receive a pension under this Act unless the contributor so elects by notice in writing given to the Directors within 12 months of the date of the adoption or within 12 months of 1 September 1958, whichever is the later, or within such extended period as the Directors may in any particular case allow. (3) Nothing in this section shall entitle an adopted child — ( a ) to receive a pension or any share of a pension where the receipt by him of such pension or such share would diminish the pension or share which the widow or any child or children by marriage of any contributor may be entitled to receive on 31 May 1958; or ( b ) to receive a pension or any share of a pension in respect of more than one contributor."
    },
    {
      "provision_ref": "s40",
      "section": "40",
      "title": "What proof to be produced before payment of pensions",
      "content": "40. —(1) Widows and children claiming to be entitled to pension under this Act and residing outside Singapore shall from time to time produce such proof as the Directors require of their being alive and entitled to pension. (2) The payment of any pension may be refused until such proof is furnished to the satisfaction of the Directors."
    },
    {
      "provision_ref": "s41",
      "section": "41",
      "title": "Discretion as to payment of minors’ pensions",
      "content": "41. —(1) In all cases where under this Act the parties entitled to pensions are minors, such pensions may, on order of the Directors, be paid either to the legal guardian or guardians of such minors, or to such minors, or to such person or persons as the Directors in their discretion think fit and proper persons to apply the same for the benefit of such minors. (2) After payment the Directors and the Government shall be free from all responsibility in respect of such payment. (3) In the case of any pension which is paid through the Crown Agents the power given by subsection (1) to the Directors may be exercised through the Crown Agents."
    },
    {
      "provision_ref": "s42",
      "section": "42",
      "title": "Pension not to be assigned or levied upon",
      "content": "42. No pension payable under this Act nor the rights of any contributor acquired thereunder shall be assignable or transferable or liable to be attached, sequestrated or levied upon, for or in respect of any debt or claim whatsoever."
    },
    {
      "provision_ref": "s43",
      "section": "43",
      "title": "Questions and disputes to be decided by the President",
      "content": "43. All questions and disputes as to who is entitled to be deemed a contributor or as to the right of a widow or child to a pension or as to the amount of such pension or as to the rights or liabilities of any person under this Act shall be referred by the Directors to the President, whose decision shall be binding and conclusive on all parties and shall be final to all intents and purposes and shall not be subject to appeal or be questioned or revised by any court of justice."
    },
    {
      "provision_ref": "s44",
      "section": "44",
      "title": "Saving as regards contributions made before 1955",
      "content": "44. The repeal by the Widows’ and Orphans’ Pension (Amendment) Ordinance 1952 of the sections then numbered 7(1), 8, 9, 10, 11 and 12 and the substitution for them of section 9(1), (2), (3) and (4) and sections 10, 11, 12, 13 and 14 do not have effect with respect to the payment or repayment of any contributions made before 1 January 1955; and notwithstanding the repeal of the sections then numbered 8, 9, 11(3) and 12 and the amendment by that Ordinance of the section then numbered 13(2), the provisions of those sections and subsections respectively continue to have effect in relation to the payment or repayment of any such contributions as if that Ordinance had not been enacted."
    }
  ],
  "definitions": [
    {
      "term": "contributor",
      "definition": "“contributor” means and includes every person from whose salary or pension deductions are made in accordance with this Act;",
      "source_provision": "s2"
    },
    {
      "term": "the Directors",
      "definition": "“the Directors” means such persons not less than 3 in number as are appointed by the Minister to carry out the provisions of this Act subject to the control of, and to rules for their guidance made by, the President;",
      "source_provision": "s2"
    },
    {
      "term": "entitled officer",
      "definition": "“entitled officer” means an entitled officer, as defined in any of the written laws specified in the first column of the Second Schedule, who retires under the provisions of such written law specified in the second column of that Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "of a pensionable age",
      "definition": "“of a pensionable age” , as applied to children, means, in the case of a male, that he is under the age of 21 years, and, in the case of a female, that she is under the age of 21 years and has not been married;",
      "source_provision": "s2"
    },
    {
      "term": "officer on the Malayan Establishment",
      "definition": "“officer on the Malayan Establishment” means an officer whom the President has by notification in the Gazette declared to be on the Malayan Establishment;",
      "source_provision": "s2"
    },
    {
      "term": "Pension Fund",
      "definition": "“Pension Fund” means the Pension Fund established by the Pension Fund Act 1995;",
      "source_provision": "s2"
    },
    {
      "term": "public servant",
      "definition": "“public servant” means an officer holding a pensionable office or an officer serving on probation or on agreement in a pensionable office, in the service of the Government, but does not include an officer — ( a )",
      "source_provision": "s2"
    }
  ]
}