{
  "id": "wsaa-2003",
  "type": "statute",
  "title": "Workforce Singapore Agency Act 2003",
  "title_en": "Workforce Singapore Agency Act 2003",
  "short_name": "WSAA2003",
  "status": "in_force",
  "issued_date": "",
  "in_force_date": "",
  "url": "https://sso.agc.gov.sg/Act/WSAA2003",
  "description": "An Act to establish and incorporate the Workforce Singapore Agency, to provide for its functions and powers, and for matters connected therewith. [20/2016]",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "1",
      "title": "Short title",
      "content": "1. This Act is the Workforce Singapore Agency Act 2003. [20/2016]"
    },
    {
      "provision_ref": "s2",
      "chapter": "PART 1 - PRELIMINARY",
      "section": "2",
      "title": "Interpretation",
      "content": "2. In this Act, unless the context otherwise requires — “Agency” means the Workforce Singapore Agency established by section 3; “Chairperson” means the member of the Agency who is appointed under section 7A as the Chairperson of the Agency and includes any temporary Chairperson of the Agency; “chief executive” means the chief executive of the Agency, and includes any individual acting in that capacity; “Deputy Chairperson” means the member of the Agency who is appointed under section 7A as the Deputy Chairperson of the Agency and includes any temporary Deputy Chairperson of the Agency; “member” means any member of the Agency and includes any temporary member of the Agency; “permanent resident of Singapore” has the meaning given by section 2 of the Immigration Act 1959; [Act 31 of 2023 wef 01/12/2025] “transferred agency” means any transferred agency specified in the second column of the Schedule; “transferring body” means any transferring body specified in the first column of the Schedule. [20/2016; 5/2018]"
    },
    {
      "provision_ref": "s3",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "3",
      "title": "Establishment and incorporation of Workforce Singapore Agency",
      "content": "3. —(1) A body called the Workforce Singapore Agency is established, which is a body corporate with perpetual succession and is, by that name, capable of — ( a ) suing and being sued; ( b ) acquiring, owning, holding and developing, or disposing of property, both movable and immovable; and ( c ) doing and suffering all such other acts or things as a body corporate may lawfully do and suffer. [20/2016] (2) The Agency may perform any of its functions or carry out any of its duties under the business name of Workforce Singapore, or another business name that the Minister from time to time allows. [20/2016] (3) The Agency must cause notice of every business name approved under subsection (2) to be published in the Gazette ; but failure to do so does not invalidate the approval or use of that name. [20/2016]"
    },
    {
      "provision_ref": "s4",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "4",
      "title": "Common seal",
      "content": "4. —(1) The Agency must have a common seal and that seal may be broken, changed, altered or made anew as the Agency thinks fit. (2) All deeds and other documents requiring the seal of the Agency must be sealed with the common seal of the Agency. (3) All instruments to which the common seal is affixed must be signed by any 2 members generally or specially authorised by the Agency for the purpose or by one member and the chief executive. (4) The Agency may, by resolution or otherwise in writing, appoint any officer of the Agency or any other agent either generally or in any particular case to execute or sign on behalf of the Agency any agreement or other instrument not under seal in relation to any matter coming within the powers of the Agency. (5) All courts, judges and persons acting judicially are to take judicial notice of the common seal of the Agency affixed to any document and presume that it was duly affixed."
    },
    {
      "provision_ref": "s5",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "5",
      "title": "Constitution of Agency",
      "content": "5. —(1) The Agency consists of at least 9 and not more than 15 members. [20/2016] (2) Each member is to be appointed by the Minister by instrument in writing. [20/2016] (3) The Minister may appoint the chief executive to be a member."
    },
    {
      "provision_ref": "s6",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "6",
      "title": "Chairperson may delegate functions",
      "content": "6. The Chairperson may in writing authorise any member to exercise any power or perform any function conferred on the Chairperson by or under this Act."
    },
    {
      "provision_ref": "s7",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "7",
      "title": "Term of office of members",
      "content": "7. —(1) A member holds office on such conditions and for such term, not exceeding 3 years, as the Minister may specify in his or her appointment, and may be re-appointed. (2) Any member may at any time, by written notice to the Minister, resign from his or her office. (3) The Minister may at any time revoke the appointment of any member without assigning any reason. (4) If a member dies or resigns or has his or her appointment revoked, the Minister may appoint any person to fill the vacancy for the residue of the term for which the vacating member was appointed. (5) The Agency must pay to the Chairperson, the Deputy Chairperson and other members such salaries, fees and allowances as the Minister may determine."
    },
    {
      "provision_ref": "s7A",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "7A",
      "title": "Chairperson and Deputy Chairperson",
      "content": "7A. —(1) The Minister may, by instrument in writing, appoint — ( a ) a member to be the Chairperson of the Agency for the period specified in the instrument; and ( b ) a member (other than the Chairperson of the Agency) to be the Deputy Chairperson of the Agency for the period specified in the instrument. [20/2016] (2) The Chairperson or Deputy Chairperson holds office until whichever of the following first happens: ( a ) his or her term of office as Chairperson or Deputy Chairperson (as the case may be) expires; ( b ) he or she ceases to hold office as a member of the Agency; ( c ) the Minister terminates the appointment as Chairperson or Deputy Chairperson, as the case may be. [20/2016] (3) The Deputy Chairperson of the Agency has and may exercise all of the functions and powers of the Chairperson in relation to a matter if — ( a ) the Chairperson is unavailable; or ( b ) the Chairperson is interested in the matter within the meaning of section 23 of the Public Sector (Governance) Act 2018. [20/2016; 5/2018]"
    },
    {
      "provision_ref": "s8",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "8",
      "title": "Temporary Chairperson, etc.",
      "content": "8. The Minister may appoint any person to be a temporary Chairperson, temporary Deputy Chairperson or temporary member during the temporary incapacity from illness or otherwise, or during the temporary absence from Singapore, of the Chairperson, the Deputy Chairperson or any member, as the case may be."
    },
    {
      "provision_ref": "s9",
      "chapter": "PART 2 - ESTABLISHMENT, INCORPORATION AND",
      "section": "9",
      "title": "Meetings and proceedings of Agency",
      "content": "9. —(1) The quorum at every meeting of the Agency is one‑third of the total number of members. [25/2009] (2) The Chairperson or, in his or her absence, the Deputy Chairperson presides at all meetings of the Agency and, in the absence of the Chairperson and Deputy Chairperson, the members present must elect one of their number to preside. (3) Meetings of the Agency must be held at such times and places as the Chairperson may determine. (4) All questions arising at any meeting must be decided by a majority of votes of the members present and voting. (5) At any meeting of the Agency, the Chairperson or, in his or her absence, the Deputy Chairperson or member elected under subsection (2) to preside, has a deliberative vote and, in the case of an equality of votes, he or she also has a casting vote. [20/2016] (6) The validity of any proceedings of the Agency is not affected by any vacancy among its members or by any defect in the appointment of any member. (7) Subject to the provisions of this Act and the Public Sector (Governance) Act 2018, the Agency may regulate its own proceedings. [5/2018] 10. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s11",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AGENCY",
      "section": "11",
      "title": "Functions and duties of Agency",
      "content": "11. —(1) Subject to the provisions of this Act, the functions and duties of the Agency are — ( a ) to promote and facilitate employment and re‑employment in Singapore through services and facilities that help citizens of Singapore and permanent residents of Singapore find and keep jobs; [Act 31 of 2023 wef 01/12/2025] ( b ) to collaborate with and support employers, relevant representatives of commerce or industry and public sector agencies in Singapore — (i) to identify and promote the enhancement of industry‑specific skills; (ii) to enhance individuals’ employability; and (iii) to increase workforce productivity and improve the international competitiveness of commerce and industry; ( c ) to promote and facilitate productive employment and employee career development, including through review and reallocation of job duties and tasks among employees (commonly called job redesign); ( d ) to promote and facilitate the adoption of best practices in the management of human capital in Singapore; ( e ) to advise and make recommendations to the Government on policies, measures and laws connected with the Agency’s functions under this Act or any other written law; ( f ) to cooperate and collaborate with the SkillsFuture Singapore Agency in the discharge of its functions under the SkillsFuture Singapore Agency Act 2016; ( g ) to encourage, promote and facilitate the development of the human resources industry in Singapore; ( h ) to promote or undertake research in Singapore into matters relating to the Singapore workforce; ( i ) to provide financial support by way of grants, loans or otherwise so as to give effect to the functions and objects of the Agency; ( j ) to undertake, direct and support the analysis and dissemination of labour market information and trends to the public; ( k ) to represent the Government internationally in respect of matters relating to workforce development and public employment services; and ( l ) to carry out such other functions as are imposed upon the Agency by or under this Act or any other written law. [20/2016] (2) The Agency may undertake such other functions as the Minister may assign to the Agency and in so undertaking — ( a ) the Agency is deemed to be fulfilling the purposes of this Act; and ( b ) the provisions of this Act apply to the Agency in respect of those other functions. (3) Nothing in this section imposes on the Agency, directly or indirectly, any form of duty or liability enforceable by proceedings before any court to which the Agency would not otherwise be subject."
    },
    {
      "provision_ref": "s12",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AGENCY",
      "section": "12",
      "title": "Powers of Agency",
      "content": "12. The Agency has power to do anything for the purpose of discharging its functions and duties under this Act or any other written law, or which is incidental or conducive to the discharge of those functions and duties and, in particular, may — ( a ) provide, or secure the provision of, employment and related services for assisting job seekers — (i) to decide what jobs, having regard to their capabilities, are or will be suitable for and available to them; (ii) to decide what training or education is or will be required by, or available to, them in order to fit them for those jobs, and to obtain that training or education; (iii) to enhance their employability; and (iv) to otherwise find and keep a job with suitable employers; ( b ) provide, or secure the provision of, assistance to employers to source and recruit employees who meet their business needs; ( c ) develop and provide, or secure the provision of, and promote programmes for the purpose of cultivating progressive and productive workplaces, including enhancing job quality and job redesign; ( d ) publish or provide any information, or publish or sponsor the publication of works; ( e ) apply for, obtain and hold, whether on its own behalf or jointly with any other person, any intellectual property rights, and enter into agreements or arrangements for the commercial exploitation of those intellectual property rights, whether by assignment, licensing or otherwise; ( f ) collect, compile, analyse, publish or disseminate by any convenient means information of a statistical nature or otherwise concerning matters relating to the Agency’s functions; ( g ) specify, by notification in the Gazette , all the accreditation and certification marks of the Agency for use in relation to any function of the Agency, and control the use of such marks; ( h ) organise courses, seminars, workshops and conferences in furtherance of its functions and award certificates of proficiency to persons who attend those courses, seminars, workshops and conferences; ( i ) initiate and undertake or enter into contractual consultancy, research and development projects pursuant to its functions under this Act and conduct or commission research pursuant to its functions under this Act; ( j ) promote or undertake publicity in any form; ( k ) with the approval of the Minister, form or participate in the formation of any company, association or trust; ( l ) become a member of a company, association, trust or partnership; ( m ) provide technical, consultancy or advisory services to any Government agency or to any other person or body in Singapore or elsewhere on any matter related to or connected with the functions, objects or duties of the Agency; ( n ) become a member or affiliate of any international body, the functions, objects or duties of which are similar to those of the Agency; ( o ) enter into such contracts, agreements or arrangements as may be necessary or expedient for the purpose of discharging its functions or duties; ( p ) receive grants, donations or contributions from any source, or raise funds by all lawful means and apply those funds for any of its functions or duties; ( q ) charge fees or commissions for services rendered by the Agency including advisory, training, consultancy, certification and accreditation services or for the use of any facility of the Agency and recover any costs and expenses incurred; ( r ) grant loans to any officer or employee of the Agency for any purposes specifically approved by the Agency as are likely to increase the efficiency of that officer or employee; ( s ) provide recreational facilities and promote recreational activities for, and activities conducive to, the welfare of officers and employees of the Agency and members of their families; ( t ) provide for gratuities, pensions, allowances or other benefits for officers or employees, or former officers or employees, of the Agency; ( u ) provide financial support, grant, aid or assistance to any person or organisation for all or any of the purposes of this Act or any other written law; ( v ) provide training, whether by itself or with the cooperation of other persons or bodies as the Agency thinks fit, for officers or employees of the Agency and award scholarships or otherwise pay for that training; and ( w ) do anything incidental or necessary to any of its functions, duties or powers under this Act or any other written law. [20/2016]"
    },
    {
      "provision_ref": "s13",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AGENCY",
      "section": "13",
      "title": "Directions by Minister",
      "content": "13. The Minister may give to the Agency any direction under section 5 of the Public Sector (Governance) Act 2018. [5/2018]"
    },
    {
      "provision_ref": "s14",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AGENCY",
      "section": "14",
      "title": "Committees",
      "content": "14. —(1) The Agency may appoint, alter or discharge committees, consisting of one or more persons (whether members or not), and define or vary the terms of reference of those committees. (2) Subject to this Act and the Public Sector (Governance) Act 2018 and to the control of the Agency, each committee appointed under this section may regulate its procedure in any manner that the committee thinks fit. [5/2018]"
    },
    {
      "provision_ref": "s15",
      "chapter": "PART 3 - FUNCTIONS, DUTIES AND POWERS OF AGENCY",
      "section": "15",
      "title": "Delegation of powers",
      "content": "15. —(1) The Agency may in respect of a specified matter or class of matters, by writing, delegate to any member, officer or committee of the Agency or any of its agents (including the Government) any of its powers under this Act or under any other written law. [5/2018] (2) Every member, officer or committee purporting to act pursuant to a delegation under this section is, in the absence of proof to the contrary, presumed to be acting in accordance with the terms of the delegation."
    },
    {
      "provision_ref": "s16",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "16",
      "title": "Chief executive, officers and employees, etc.",
      "content": "16. —(1) There must be a chief executive of the Agency, whose appointment, removal, discipline and promotion must be in accordance with the Public Sector (Governance) Act 2018. [5/2018] (2) The Agency may, subject to the Public Sector (Governance) Act 2018, appoint an individual to act temporarily as the chief executive during any period, or during all periods, when the chief executive — ( a ) is absent from duty or Singapore; or ( b ) is, for any reason, unable to perform the duties of the office. [5/2018] (3) The Agency may, subject to the Public Sector (Governance) Act 2018, appoint and employ, on such terms and conditions as it may determine, such other officers, employees, consultants and agents as may be necessary for the effective performance of its functions. [5/2018]"
    },
    {
      "provision_ref": "s17",
      "chapter": "PART 4 - PROVISIONS RELATING TO STAFF",
      "section": "17",
      "title": "Protection from personal liability",
      "content": "17. —(1) No suit or other legal proceedings shall lie personally against any member, officer or employee of the Agency or any other person acting under the direction of the Agency for anything which is in good faith done or intended to be done in the execution or purported execution of this Act or any other written law. (2) Where the Agency provides a service to the public whereby information is supplied to the public, neither the Agency nor any of its members, officers or employees involved in the supply of such information shall be liable for any loss or damage suffered by any member of the public by reason of any error or omission of whatever nature appearing therein or however caused if made in good faith and in the ordinary course of the discharge of the duties of those members, officers or employees. 18. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s19",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "19",
      "title": "Financial year",
      "content": "19. The financial year of the Agency begins on 1 April of each year and ends on 31 March of the succeeding year."
    },
    {
      "provision_ref": "s20",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "20",
      "title": "Annual estimates",
      "content": "20. —(1) A copy of all annual estimates of revenue and expenditure and supplementary estimates must, upon their adoption by the Agency, be sent without delay to the Minister. [5/2018] (2) The Minister may approve or disallow any item or portion of any item shown in the annual estimates or supplementary estimates. [5/2018] (3) The Minister must return the annual estimates or supplementary estimates as amended under subsection (2) to the Agency, and the Agency is bound by the Minister’s decision. [5/2018] (4) Despite any provision of this section, the Agency may transfer all or any part of moneys assigned to one item of expenditure to any item under the same head of expenditure in any estimates approved by the Minister."
    },
    {
      "provision_ref": "s21",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "21",
      "title": "All moneys recovered to be paid to Agency",
      "content": "21. All moneys recovered or charges collected (except composition sums under section 48) under this Act must be paid into and form part of the moneys of the Agency. [20/2016]"
    },
    {
      "provision_ref": "s22",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "22",
      "title": "Grants",
      "content": "22. For the purpose of enabling the Agency to carry out its functions under this Act, the Minister may make grants to the Agency of such sums of money as the Minister may determine, out of moneys to be provided by Parliament."
    },
    {
      "provision_ref": "s23",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "23",
      "title": "Power to borrow",
      "content": "23. For the discharge of its functions or duties under this Act or any other written law, the Agency may raise loans from the Government or, with the approval of the Minister, raise loans from banks or other financial institutions (whether in Singapore or elsewhere) by — ( a ) mortgage, overdraft or otherwise; ( b ) charge, whether legal or equitable, on any property vested in the Agency or on any other revenue receivable by the Agency under this Act or any other written law; or ( c ) the creation and issue of debentures or bonds or any other instrument as the Minister may approve. [20/2016]"
    },
    {
      "provision_ref": "s24",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "24",
      "title": "Issue of shares, etc.",
      "content": "24. As a consequence of — ( a ) the vesting of any property, rights or liabilities of the Government in the Agency under this Act; or ( b ) any capital injection or other investment by the Government in the Agency in accordance with any written law, the Agency must issue such shares or other securities to the Minister for Finance as that Minister may direct."
    },
    {
      "provision_ref": "s25",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "25",
      "title": "Bank accounts",
      "content": "25. —(1) The Agency must open and maintain one or more accounts with such bank or banks as the Agency thinks fit. (2) Every such account must be operated by such person authorised to do so by the Agency."
    },
    {
      "provision_ref": "s26",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "26",
      "title": "Application of moneys",
      "content": "26. The moneys of the Agency must be applied only in payment or discharge of the expenses, obligations and liabilities of the Agency and in making any payment that the Agency is authorised or required to make."
    },
    {
      "provision_ref": "s27",
      "chapter": "PART 5 - FINANCIAL PROVISIONS",
      "section": "27",
      "title": "Power of investment",
      "content": "27. The Agency may invest its moneys in accordance with the standard investment power of statutory bodies as defined in section 33A of the Interpretation Act 1965. 28. [ Repealed by Act 5 of 2018 ] 29. [ Repealed by Act 5 of 2018 ] 30. [ Repealed by Act 5 of 2018 ] 31. [ Repealed by Act 5 of 2018 ]"
    },
    {
      "provision_ref": "s32",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "32",
      "title": "Transfer to Agency of property, assets and liabilities",
      "content": "32. —(1) As from 1 September 2003 — ( a ) such movable and immovable property vested in the Government as may be determined by the Minister for Finance and used or managed by the transferred agencies specified in the second column of item 1 in the Schedule; ( b ) such movable and immovable property vested in the Standards, Productivity and Innovation Board established under section 3 of the Standards, Productivity and Innovation Board Act (Cap. 303A, 2002 Revised Edition) and used or managed by the transferred agencies specified in the second column of item 2 in the Schedule; and ( c ) all assets, interests, rights, privileges, liabilities and obligations of the transferring bodies relating to the transferred agencies, are transferred to and vest in the Agency without further assurance, act or deed. (2) If any question arises as to whether any particular property, or whether any particular asset, interest, right, privilege, liability or obligation has been transferred to or vested in the Agency under subsection (1), a certificate under the hand of the Minister for Finance is conclusive evidence that the property, asset, interest, right, privilege, liability or obligation was or was not so transferred or vested. (3) Any immovable property to be transferred to and vested in the Agency under subsection (1) must be held by the Agency upon such tenure and subject to such terms and conditions as the President may determine. (4) All proceedings in respect of the transferred properties by or against a transferring body which are pending on 1 September 2003 may be continued, completed and enforced by or against the Agency. (5) Every agreement relating to any of the transferred properties to which a transferring body was a party immediately before 1 September 2003, whether or not of such nature that the rights and liabilities under that agreement could be assigned, has effect as from that date as if — ( a ) the Agency had been a party to such an agreement; and ( b ) for any reference to the transferring body there was substituted in respect of anything to be done on or after 1 September 2003 a reference to the Agency."
    },
    {
      "provision_ref": "s33",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "33",
      "title": "Transfer of employees",
      "content": "33. —(1) As from 1 September 2003, such persons or categories of persons who, immediately before that date, were employed by the transferring bodies and posted to the transferred agencies must be transferred to the service of the Agency on terms no less favourable than those enjoyed by them immediately prior to their transfer. (2) If any question arises as to whether any person or category of persons has been transferred to the service of the Agency under subsection (1), a certificate under the hand of the Minister is conclusive evidence that the person or category of persons was or was not so transferred. (3) Until such time as terms and conditions of service are drawn up by the Agency, the scheme and terms and conditions of service in the transferring body from which the person was transferred under subsection (1) continue to apply to every person so transferred as if he or she were still in the employment of the transferring body."
    },
    {
      "provision_ref": "s34",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "34",
      "title": "Pension rights, etc., of Government employees to be preserved",
      "content": "34. —(1) The terms and conditions to be drawn up by the Agency must take into account the terms and conditions of service (including salaries and accrued rights to leave) enjoyed by the persons transferred to the service of the Agency under section 33 while in the employment of the transferring body. (2) Any term or condition relating to the length of service with the Agency must recognise the length of service of the persons so transferred while in the employment of the transferring body to be service with the Agency. (3) The terms and conditions of service to be drawn up by the Agency must not adversely affect the conditions that would have been applicable to persons transferred to the service of the Agency as regards any pension, gratuity or allowance payable under the Pensions Act 1956. (4) Where a person has been transferred to the service of the Agency under section 33, the Government is liable to pay to the Agency such portion of any pension, gratuity or allowance payable to the person on his or her retirement as the same bears to the proportion which the aggregate amount of his or her pensionable emoluments during his or her service with the Government bears to the aggregate amount of his or her pensionable emoluments during his or her service under both the Government and the Agency. (5) Where any person in the service of the Agency, whose case does not fall within the scope of any pension or other schemes established under this section, retires or dies in the service of the Agency or is discharged from such service, the Agency may grant to him or her or to such other person wholly or partly dependent on him or her, as the Agency thinks fit, such allowance or gratuity as the Agency may determine."
    },
    {
      "provision_ref": "s35",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "35",
      "title": "No benefits in respect of abolition or reorganisation of office",
      "content": "35. Despite the provisions of the Pensions Act 1956, a person who is transferred to the service of the Agency under section 33 while in the employment of the Government is not entitled to claim any benefit under that Act on the ground that he or she has been retired from the service of the Government on account of abolition or reorganisation of office in consequence of the establishment and incorporation of the Agency."
    },
    {
      "provision_ref": "s36",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "36",
      "title": "Existing contracts",
      "content": "36. All deeds, contracts, schemes, bonds, agreements, instruments and arrangements subsisting immediately before 1 September 2003 to which any transferring body is a party and relating to any transferred agency or to any person transferred to the service of the Agency under section 33 continue in force on and after that date and are enforceable by or against the Agency as if the Agency had been named therein or had been a party thereto instead of the transferring body."
    },
    {
      "provision_ref": "s37",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "37",
      "title": "Continuation and completion of disciplinary proceedings and other legal proceedings",
      "content": "37. —(1) Where, on 1 September 2003, any disciplinary proceedings were pending against any employee of the transferring body transferred to the service of the Agency, the proceedings are to be carried on and completed by the Agency. (2) Where, on 1 September 2003, any matter was in the course of being heard or investigated or had been heard or investigated by a committee acting under due authority but no order, ruling or direction had been made on the matter, the committee must complete the hearing or investigation and make such order, ruling or direction as it could have made under the authority vested in it before that date. (3) Any order, ruling or direction made by a committee under this section is to be treated as an order, a ruling or a direction of the Agency and has the same force or effect as if it had been made by the Agency pursuant to the authority vested in the Agency under this Act. (4) All proceedings or causes of action pending or existing immediately before 1 September 2003 by or against a transferring body in respect of its transferred agency may be continued, completed and enforced by or against the Agency."
    },
    {
      "provision_ref": "s38",
      "chapter": "PART 6 - TRANSFER OF PROPERTY, ASSETS, LIABILITIES",
      "section": "38",
      "title": "Misconduct or neglect of duty by employee before transfer",
      "content": "38. The Agency may reprimand, reduce in rank, retire, dismiss or punish in some other manner a person who had, while he or she was in the employment of the transferring body, been guilty of any misconduct or neglect of duty which would have rendered him or her liable to be reprimanded, reduced in rank, retired, dismissed or punished in some other manner if he or she had continued to be in the employment of the transferring body, and if this Act had not been enacted."
    },
    {
      "provision_ref": "s40",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "40",
      "title": "Symbol or representation of Agency",
      "content": "40. —(1) The Agency has the exclusive right to the use of such symbol or representation as the Agency may select or devise and thereafter display or exhibit that symbol or representation in connection with its activities or affairs. (2) Any person who uses a symbol or representation identical with that of the Agency, or which so resembles the Agency’s symbol or representation as to deceive or cause confusion, or to be likely to deceive or to cause confusion, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s41",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "41",
      "title": "Powers to verify information collected or for grants, etc.",
      "content": "41. —(1) The powers under this section may be exercised only for the purpose of inquiring into or ascertaining — ( a ) the truth or correctness of any statement made, or of any information given, by a person who applies or has applied for an incentive, a grant or a loan from the Agency; or ( b ) whether any incentive, grant or loan from the Agency has been properly applied by the person to whom the incentive, grant or loan is given. [20/2016] (2) The Agency, or an officer, employee or agent of the Agency duly authorised by the Agency for the purposes of this section, may, at any reasonable time, do any of the following, without involving any search of any property or person: ( a ) enter any premises; ( b ) photograph or film, or make audio recordings or make sketches of, any part of the premises or anything at the premises; ( c ) require any person in the premises to furnish or grant access to, without charge, any document or information reasonably required for any purpose in subsection (1); ( d ) inspect and make copies of or take extracts from any such document; ( e ) take possession of such a document if, in the opinion of the Agency or the Agency’s officer, employee or agent — (i) the inspection or copying of or extraction from the document cannot reasonably be performed without taking possession; (ii) the document may be interfered with or destroyed unless possession is taken; or (iii) the document may be required as evidence in any proceedings instituted or commenced for any of the purposes of, or in connection with, this Act. [20/2016] (3) The power to require a person to furnish any document or information under subsection (2)( c ) includes the power — ( a ) to require the person, or any person who is or was an officer or employee of that person, to provide an explanation of the document or information; ( b ) if the document or information is not furnished, to require the person to state, to the best of the person’s knowledge and belief, where it is; and ( c ) if the information is recorded otherwise than in legible form, to require the information to be made available to the Agency in legible form. [20/2016]"
    },
    {
      "provision_ref": "s42",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "42",
      "title": "Penalty for obstructing Agency in carrying out its duties",
      "content": "42. Any person who at any time hinders or obstructs the Agency or any officer, employee or agent of the Agency acting in the discharge of its or his or her duties under this Act shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both."
    },
    {
      "provision_ref": "s43",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "43",
      "title": "False or misleading information, statement or document",
      "content": "43. —(1) Any person who — ( a ) provides information to the Agency or any officer or employee in connection with any function or duty of the Agency under this Act which is false or misleading in a material particular; ( b ) obtains payment from the Agency of any incentive, grant or loan under this Act or any other written law by means of any false or misleading statement or any document that is false or misleading in any particular; or ( c ) intentionally alters, suppresses or destroys any document or information which the person is required by the Agency under section 41 to furnish, shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 12 months or to both. [20/2016] (2) To avoid doubt, it is not a defence in any proceeding for an offence under subsection (1)( a ) that the accused did not obtain any incentive, grant or loan from the Agency. [20/2016]"
    },
    {
      "provision_ref": "s44",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "44",
      "title": "Preservation of secrecy",
      "content": "44. —(1) Except for the purpose of the performance of his or her duties or the exercise of his or her functions or when lawfully required to do so by any court or where required or allowed by the provisions of any written law, a person who is or has been — ( a ) a member, an officer, an employee or an agent of the Agency; or ( b ) a member of a committee of the Agency, must not disclose any information relating to the affairs of the Agency or of any other person which has been obtained by him or her in the performance of his or her duties or the exercise of his or her functions. [5/2018] (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000 or to imprisonment for a term not exceeding 12 months or to both."
    },
    {
      "provision_ref": "s45",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "45",
      "title": "Offences by corporations",
      "content": "45. —(1) Where, in a proceeding for an offence under this Act, it is necessary to prove the state of mind of a corporation in relation to a particular conduct, evidence that — ( a ) an officer, employee or agent of the corporation engaged in that conduct within the scope of his or her actual or apparent authority; and ( b ) the officer, employee or agent had that state of mind, is evidence that the corporation had that state of mind. [20/2016] (2) Where a corporation commits an offence under this Act, a person — ( a ) who is — (i) an officer of the corporation, or a member of a corporation whose affairs are managed by its members; or (ii) an individual who is involved in the management of the corporation and is in a position to influence the conduct of the corporation in relation to the commission of the offence; and ( b ) who — (i) consented or connived, or conspired with others, to effect the commission of the offence; (ii) is in any other way, whether by act or omission, knowingly concerned in, or is party to, the commission of the offence by the corporation; or (iii) knew or ought reasonably to have known that the offence by the corporation (or an offence of the same type) would be or is being committed, and failed to take all reasonable steps to prevent or stop the commission of that offence, shall be guilty of the same offence as is the corporation, and shall be liable on conviction to be punished accordingly. [20/2016] (3) A person mentioned in subsection (2) may rely on a defence that would be available to the corporation if it were charged with the offence with which the person is charged and, in doing so, the person bears the same burden of proof that the corporation would bear. [20/2016] (4) To avoid doubt, this section does not affect the application of — ( a ) Chapters 5 and 5A of the Penal Code 1871; or ( b ) the Evidence Act 1893 or any other law or practice regarding the admissibility of evidence. [20/2016] (5) To avoid doubt, subsection (2) also does not affect the liability of the corporation for an offence under this Act, and applies whether or not the corporation is convicted of the offence. [20/2016] (6) In this section — “corporation” includes a limited liability partnership within the meaning of section 2(1) of the Limited Liability Partnerships Act 2005; “officer”, in relation to a corporation, means any director, partner, chief executive, manager, secretary or other similar officer of the corporation, and includes any person purporting to act in any such capacity; “state of mind” of a person includes — ( a ) the knowledge, intention, opinion, belief or purpose of the person; and ( b ) the person’s reasons for the intention, opinion, belief or purpose. [20/2016]"
    },
    {
      "provision_ref": "s45A",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "45A",
      "title": "Offences by unincorporated associations or partnerships",
      "content": "45A. —(1) Where, in a proceeding for an offence under this Act, it is necessary to prove the state of mind of an unincorporated association or a partnership in relation to a particular conduct, evidence that — ( a ) an employee or agent of the unincorporated association or the partnership engaged in that conduct within the scope of his or her actual or apparent authority; and ( b ) the employee or agent had that state of mind, is evidence that the unincorporated association or partnership had that state of mind. [20/2016] (2) Where an unincorporated association or a partnership commits an offence under this Act, a person — ( a ) who is — (i) an officer of the unincorporated association or a member of its governing body; (ii) a partner in the partnership; or (iii) an individual who is involved in the management of the unincorporated association or partnership and who is in a position to influence the conduct of the unincorporated association or partnership (as the case may be) in relation to the commission of the offence; and ( b ) who — (i) consented or connived, or conspired with others, to effect the commission of the offence; (ii) is in any other way, whether by act or omission, knowingly concerned in, or is party to, the commission of the offence by the unincorporated association or partnership; or (iii) knew or ought reasonably to have known that the offence by the unincorporated association or partnership (or an offence of the same type) would be or is being committed, and failed to take all reasonable steps to prevent or stop the commission of that offence, shall be guilty of the same offence as is the unincorporated association or partnership (as the case may be), and shall be liable on conviction to be punished accordingly. [20/2016] (3) A person mentioned in subsection (2) may rely on a defence that would be available to the unincorporated association or partnership if it were charged with the offence with which the person is charged and, in doing so, the person bears the same burden of proof that the unincorporated association or partnership would bear. [20/2016] (4) To avoid doubt, this section does not affect the application of — ( a ) Chapters 5 and 5A of the Penal Code 1871; or ( b ) the Evidence Act 1893 or any other law or practice regarding the admissibility of evidence. [20/2016] (5) To avoid doubt, subsection (2) also does not affect the liability of an unincorporated association or a partnership for an offence under this Act, and applies whether or not the unincorporated association or partnership is convicted of the offence. [20/2016] (6) In this section — “officer”, in relation to an unincorporated association (other than a partnership), means the president, the secretary, or any member of the committee of the unincorporated association, and includes — ( a ) any person holding a position analogous to that of president, secretary or member of a committee of the unincorporated association; and ( b ) any person purporting to act in any such capacity; “partner” includes a person purporting to act as a partner; “state of mind” of a person includes — ( a ) the knowledge, intention, opinion, belief or purpose of the person; and ( b ) the person’s reasons for the intention, opinion, belief or purpose. [20/2016]"
    },
    {
      "provision_ref": "s46",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "46",
      "title": "Jurisdiction of courts",
      "content": "46. Despite any provision to the contrary in the Criminal Procedure Code 2010, a District Court and a Magistrate’s Court have jurisdiction to try any offence under this Act and have power to impose the full penalty or punishment in respect of the offence."
    },
    {
      "provision_ref": "s47",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "47",
      "title": "Evidence",
      "content": "47. —(1) Subject to subsection (3), a document or certificate purporting to be a report under the hand of the chief executive or any officer authorised by the chief executive upon any matter or thing in connection with the administration or enforcement of this Act, or with an investigation carried out under this Act, is admissible as evidence in any proceedings under this Act and is prima facie evidence of the facts stated in the document or certificate. (2) For the purposes of this section, a document purporting to be a certificate mentioned in subsection (1) on its production by the prosecution is, until the contrary is proved, deemed to be such a certificate. (3) A certificate mentioned in subsection (1) shall not be received in evidence under that subsection unless the person charged has been given — ( a ) a copy of the certificate; and ( b ) notice of the intention of the prosecution to produce the certificate as evidence in the proceedings, at least 10 clear days before the commencement of the proceedings. (4) Where a certificate of the chief executive or any officer authorised by the chief executive is admitted in evidence under subsection (1), the person charged may require the chief executive or such officer to be called as a witness for the prosecution and be cross‑examined as if he or she had given evidence of the matters stated in the certificate."
    },
    {
      "provision_ref": "s48",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "48",
      "title": "Composition of offences",
      "content": "48. —(1) The chief executive, or an employee of the Agency authorised in writing by the Agency, may compound any offence under this Act that is prescribed under subsection (4) as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum not exceeding the lower of the following: ( a ) one half of the amount of the maximum fine that is prescribed for the offence; ( b ) $2,000. [20/2016] (2) On payment of the sum of money, no further proceedings are to be taken against that person in respect of the offence. (3) All sums collected under this section must be paid into the Consolidated Fund. [20/2016] (4) The Agency may, with the approval of the Minister, make regulations to prescribe the offences that may be compounded and the method and procedure by which those offences may be compounded."
    },
    {
      "provision_ref": "s49",
      "chapter": "PART 7 - MISCELLANEOUS",
      "section": "49",
      "title": "Regulations",
      "content": "49. —(1) The Agency may, with the approval of the Minister, make regulations for all or any of the following purposes: ( a ) regulating the proceedings of the Agency or of the committees of the Agency, to the extent not inconsistent with the Public Sector (Governance) Act 2018; ( b ) prescribing the fees and charges for the purposes of this Act; ( c ) prescribing the form and duration of certificates and accreditation, certification marks for use in relation to any function of the Agency, the terms and conditions upon which and the circumstances in which — (i) the certificates may be granted, suspended or cancelled; or (ii) the accreditation, certification and inspection marks may be affixed, used or removed, and the fees payable in respect thereof; ( d ) prescribing any matter which is required or permitted to be prescribed by this Act, or which may be necessary or convenient to be prescribed to give effect to the provisions of this Act. [5/2018] (2) Regulations made under subsection (1) may provide that a contravention of those regulations shall be an offence and shall be punishable with a fine not exceeding $10,000 or with imprisonment for a term not exceeding 12 months or with both and, in the case of a continuing offence, with a further fine not exceeding $1,000 for every day or part of a day during which the offence continues after conviction."
    }
  ],
  "definitions": [
    {
      "term": "Agency",
      "definition": "“Agency” means the Workforce Singapore Agency established by section 3;",
      "source_provision": "s2"
    },
    {
      "term": "Chairperson",
      "definition": "“Chairperson” means the member of the Agency who is appointed under section 7A as the Chairperson of the Agency and includes any temporary Chairperson of the Agency;",
      "source_provision": "s2"
    },
    {
      "term": "chief executive",
      "definition": "“chief executive” means the chief executive of the Agency, and includes any individual acting in that capacity;",
      "source_provision": "s2"
    },
    {
      "term": "Deputy Chairperson",
      "definition": "“Deputy Chairperson” means the member of the Agency who is appointed under section 7A as the Deputy Chairperson of the Agency and includes any temporary Deputy Chairperson of the Agency;",
      "source_provision": "s2"
    },
    {
      "term": "member",
      "definition": "“member” means any member of the Agency and includes any temporary member of the Agency;",
      "source_provision": "s2"
    },
    {
      "term": "permanent resident of Singapore",
      "definition": "“permanent resident of Singapore” has the meaning given by section 2 of the Immigration Act 1959; [Act 31 of 2023 wef 01/12/2025]",
      "source_provision": "s2"
    },
    {
      "term": "transferred agency",
      "definition": "“transferred agency” means any transferred agency specified in the second column of the Schedule;",
      "source_provision": "s2"
    },
    {
      "term": "transferring body",
      "definition": "“transferring body” means any transferring body specified in the first column of the Schedule. [20/2016; 5/2018]",
      "source_provision": "s2"
    },
    {
      "term": "corporation",
      "definition": "“corporation” includes a limited liability partnership within the meaning of section 2(1) of the Limited Liability Partnerships Act 2005;",
      "source_provision": "s45"
    },
    {
      "term": "officer",
      "definition": "“officer” , in relation to a corporation, means any director, partner, chief executive, manager, secretary or other similar officer of the corporation, and includes any person purporting to act in any such capacity;",
      "source_provision": "s45"
    },
    {
      "term": "state of mind",
      "definition": "“state of mind” of a person includes — ( a )",
      "source_provision": "s45"
    },
    {
      "term": "partner",
      "definition": "“partner” includes a person purporting to act as a partner;",
      "source_provision": "s45A"
    }
  ]
}